
. 
. import delimited using ./output/input_flowchart.csv, clear
(30 vars, 10,000 obs)

. * has_follow_up AND
. * (age >=18 AND age <=110) AND
. * (NOT died) AND
. * (sex = 'M' OR sex = 'F') AND
. * (stp != 'missing') AND
. * (imd != 0) AND
. * has_ra
. 
. 
. describe

Contains data
  obs:        10,000                          
 vars:            30                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
dereg_date      str10   %10s                  
died_fu         str10   %10s                  
first_ra_code   str10   %10s                  
has_follow_up   byte    %8.0g                 
died            byte    %8.0g                 
stp             str4    %9s                   
age             int     %8.0g                 
sex             str1    %9s                   
has_msoa        byte    %8.0g                 
imd             byte    %8.0g                 
has_ra_code     byte    %8.0g                 
number_ra_codes byte    %8.0g                 
number_strong~s byte    %8.0g                 
psoriatic_art~r byte    %8.0g                 
spondy_after    byte    %8.0g                 
alt_diag        byte    %8.0g                 
metho_count     byte    %8.0g                 
sulfa_count     byte    %8.0g                 
hydrox_count    byte    %8.0g                 
leflu_count     byte    %8.0g                 
azathioprine_~t byte    %8.0g                 
has_ibd         byte    %8.0g                 
has_psoriasis   byte    %8.0g                 
has_psoriatic~s byte    %8.0g                 
has_sle         byte    %8.0g                 
has_cancer      byte    %8.0g                 
has_alt_dmard~g byte    %8.0g                 
has_dmards      byte    %8.0g                 
has_ra          byte    %8.0g                 
patient_id      long    %12.0g                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. safecount
  10,000

. safetab has_ra_code, m
12

has_ra_code |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,000       50.00       50.00
          1 |      5,000       50.00      100.00
------------+-----------------------------------
      Total |     10,000      100.00

. keep if has_ra_code
(5,000 observations deleted)

. safecount
  5,000

. safetab has_follow_up, m
14

has_follow_ |
         up |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,511       50.22       50.22
          1 |      2,489       49.78      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. keep if has_follow_up
(2,511 observations deleted)

. safecount
  2,489

. safetab died, m
5

       died |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,235       49.62       49.62
          1 |      1,254       50.38      100.00
------------+-----------------------------------
      Total |      2,489      100.00

. keep if died==0
(1,254 observations deleted)

. safecount 
  1,235

. sum age

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |      1,235    39.00405     22.9014          0         99

. keep if (age>=18 & age<=110)
(260 observations deleted)

. safecount
  975

. safetab sex, m
4

        sex |      Freq.     Percent        Cum.
------------+-----------------------------------
          F |        492       50.46       50.46
          M |        474       48.62       99.08
          U |          9        0.92      100.00
------------+-----------------------------------
      Total |        975      100.00

. keep if (sex=="F" | sex=="M")
(9 observations deleted)

. safecount
  966

. count if stp!=""
  486

. drop if stp==""
(480 observations deleted)

. safecount
  486

. safetab imd 
0

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         24        4.94        4.94
          1 |        108       22.22       27.16
          2 |         92       18.93       46.09
          3 |         97       19.96       66.05
          4 |         93       19.14       85.19
          5 |         72       14.81      100.00
------------+-----------------------------------
      Total |        486      100.00

. drop if imd==0
(24 observations deleted)

. safecount
  462

. safetab has_ra, m
7

     has_ra |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        231       50.00       50.00
          1 |        231       50.00      100.00
------------+-----------------------------------
      Total |        462      100.00

. drop if has_ra==0
(231 observations deleted)

. 
. 
. 
end of do-file

. . file open output using "/tmp/tmp.d2NwXwjgeg", write text replace

. . file write output "success" 

. . file close output

. 
end of do-file


