
. cap mkdir ./output/flowchart

. 
. import delimited using ./output/input_flowchart.csv, clear
(30 vars, 10,000 obs)

. * has_follow_up AND
. * (age >=18 AND age <=110) AND
. * (NOT died) AND
. * (sex = 'M' OR sex = 'F') AND
. * (stp != 'missing') AND
. * (imd != 0) AND
. * has_ra
. 
. * Open file to write values to 
. file open table using ./output/flowchart/values.txt, write text replace  
(note: file ./output/flowchart/values.txt not found)

. file write table ("Total start") _tab 

. 
. describe

Contains data
  obs:        10,000                          
 vars:            30                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
dereg_date      str10   %10s                  
died_fu         str10   %10s                  
first_ra_code   str10   %10s                  
has_follow_up   byte    %8.0g                 
died            byte    %8.0g                 
stp             str4    %9s                   
age             int     %8.0g                 
sex             str1    %9s                   
has_msoa        byte    %8.0g                 
imd             byte    %8.0g                 
has_ra_code     byte    %8.0g                 
number_ra_codes byte    %8.0g                 
number_strong~s byte    %8.0g                 
psoriatic_art~r byte    %8.0g                 
spondy_after    byte    %8.0g                 
alt_diag        byte    %8.0g                 
metho_count     byte    %8.0g                 
sulfa_count     byte    %8.0g                 
hydrox_count    byte    %8.0g                 
leflu_count     byte    %8.0g                 
azathioprine_~t byte    %8.0g                 
has_ibd         byte    %8.0g                 
has_psoriasis   byte    %8.0g                 
has_psoriatic~s byte    %8.0g                 
has_sle         byte    %8.0g                 
has_cancer      byte    %8.0g                 
has_alt_dmard~g byte    %8.0g                 
has_dmards      byte    %8.0g                 
has_ra          byte    %8.0g                 
patient_id      long    %12.0g                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. safecount
  10,000

. file write table ("`r(N)'") _n ("Has RA") _tab

. safetab has_ra, m
7

     has_ra |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,000       50.00       50.00
          1 |      5,000       50.00      100.00
------------+-----------------------------------
      Total |     10,000      100.00

. keep if has_ra
(5,000 observations deleted)

. safecount
  5,000

. file write table ("`r(N)'") _n ("Has follow-up") _tab 

. safetab has_follow_up, m
14

has_follow_ |
         up |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,505       50.10       50.10
          1 |      2,495       49.90      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. keep if has_follow_up
(2,505 observations deleted)

. safecount
  2,495

. file write table ("`r(N)'") _n ("Died") _tab 

. safetab died, m
5

       died |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,248       50.02       50.02
          1 |      1,247       49.98      100.00
------------+-----------------------------------
      Total |      2,495      100.00

. keep if died!=1
(1,247 observations deleted)

. safecount
  1,248

. file write table ("`r(N)'") _n ("Age ineligible") _tab  

. sum age

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |      1,248    40.32612    24.42963          0         99

. keep if (age>=18 & age<=110)
(275 observations deleted)

. safecount
  973

. file write table ("`r(N)'") _n ("Missing sex, stp or IMD") _tab 

. safetab sex, m
4

        sex |      Freq.     Percent        Cum.
------------+-----------------------------------
          F |        503       51.70       51.70
          M |        462       47.48       99.18
          U |          8        0.82      100.00
------------+-----------------------------------
      Total |        973      100.00

. keep if (sex=="F" | sex=="M")
(8 observations deleted)

. safecount
  965

. count if stp!=""
  508

. drop if stp==""
(457 observations deleted)

. safecount
  508

. safetab imd 
0

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         24        4.72        4.72
          1 |         99       19.49       24.21
          2 |        108       21.26       45.47
          3 |        108       21.26       66.73
          4 |        101       19.88       86.61
          5 |         68       13.39      100.00
------------+-----------------------------------
      Total |        508      100.00

. drop if imd==0
(24 observations deleted)

. safecount
  484

. file write table ("`r(N)'") _n  

. 
. 
. 
. 
end of do-file

. . file open output using "/tmp/flowchart.do.Giag.out", write text replace

. . file write output "success" 

. . file close output

. 
end of do-file


