
. 
. cap mkdir ./output/tables

. * Import data
. import delimited using ./output/input.csv
(43 vars, 10,000 obs)

. * Check data
. count if age==. 
  0

. count if age<18 
  2,156

. count if age>110 & age!=.
  0

. sum age, d

                             age
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            4              0
10%            8              0       Obs              10,000
25%           20              0       Sum of Wgt.      10,000

50%           39                      Mean            40.2578
                        Largest       Std. Dev.      23.83879
75%           59             99
90%           73             99       Variance       568.2878
95%           80            107       Skewness       .1425017
99%           90            109       Kurtosis        2.04379

. count if sex==""
  0

. tab sex

        sex |      Freq.     Percent        Cum.
------------+-----------------------------------
          F |      5,040       50.40       50.40
          M |      4,876       48.76       99.16
          U |         84        0.84      100.00
------------+-----------------------------------
      Total |     10,000      100.00

. sum household, d

                          household
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs              10,000
25%            2              0       Sum of Wgt.      10,000

50%            3                      Mean             2.5125
                        Largest       Std. Dev.      1.043721
75%            3              6
90%            4              6       Variance       1.089353
95%            4              6       Skewness       .0578605
99%            5              6       Kurtosis       2.916165

. tab care_home_type

care_home_t |
        ype |      Freq.     Percent        Cum.
------------+-----------------------------------
         PC |        498        5.03        5.03
         PN |        492        4.96        9.99
         PR |      8,442       85.19       95.18
         PS |        478        4.82      100.00
------------+-----------------------------------
      Total |      9,910      100.00

. * Checking RA algorithm variables
. * Checking type of DMARD that meets inclusion
. foreach dmard in metho leflu sulfa hydrox {
  2.     gen `dmard'_multi = (`dmard'_count>=2)
  3.     tab `dmard'_multi if has_dmards==1, m
  4. }

metho_multi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        840       16.80       16.80
          1 |      4,160       83.20      100.00
------------+-----------------------------------
      Total |      5,000      100.00

leflu_multi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        824       16.48       16.48
          1 |      4,176       83.52      100.00
------------+-----------------------------------
      Total |      5,000      100.00

sulfa_multi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        750       15.00       15.00
          1 |      4,250       85.00      100.00
------------+-----------------------------------
      Total |      5,000      100.00

hydrox_mult |
          i |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        769       15.38       15.38
          1 |      4,231       84.62      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. gen dmard_multi = (metho_multi==1 | leflu_multi==1 | sulfa_multi==1 | hydrox_
> multi==1)

. tab dmard_multi has_alt_dmard_diag

dmard_mult |  has_alt_dmard_diag
         i |         0          1 |     Total
-----------+----------------------+----------
         0 |         3          3 |         6 
         1 |     4,997      4,997 |     9,994 
-----------+----------------------+----------
     Total |     5,000      5,000 |    10,000 

. sum number_ra_codes

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
number_ra_~s |     10,000       2.492    1.039925          0          7

. di "Number where no DMARDs but does have multiple RA codes and no alt diag"
Number where no DMARDs but does have multiple RA codes and no alt diag

. count if has_dmards==0 & number_ra_codes>=2 & alt_diag!=1
  2,139

. tab has_ra, m

     has_ra |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,000       50.00       50.00
          1 |      5,000       50.00      100.00
------------+-----------------------------------
      Total |     10,000      100.00

. * Time since first RA code
. gen first_ra_codeA = date(first_ra_code, "YMD")
(5,504 missing values generated)

. format first_ra_codeA %dD/N/CY

. gen time_ra = (date("01Mar2018", "DMY") - first_ra_codeA)/365.25
(5,504 missing values generated)

. sum time_ra, d

                           time_ra
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.1478439      -1.073238
 5%     4.750171      -1.062286
10%     10.46133      -.9856263       Obs               4,496
25%      26.6475      -.9609856       Sum of Wgt.       4,496

50%     53.48802                      Mean           54.09122
                        Largest       Std. Dev.      31.74975
75%     81.51677       108.8405
90%     97.88638       108.9418       Variance       1008.046
95%     103.7317       108.9528       Skewness       .0061574
99%     107.8987       108.9692       Kurtosis       1.796513

. sum number_ra_codes, d

                       number_ra_codes
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs              10,000
25%            2              0       Sum of Wgt.      10,000

50%            2                      Mean              2.492
                        Largest       Std. Dev.      1.039925
75%            3              6
90%            4              6       Variance       1.081444
95%            4              6       Skewness       .0349082
99%            5              7       Kurtosis       2.915485

. sum metho_count, d

                         metho_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs              10,000
25%            2              0       Sum of Wgt.      10,000

50%            2                      Mean              2.479
                        Largest       Std. Dev.      1.038589
75%            3              6
90%            4              6       Variance       1.078667
95%            4              6       Skewness       .0621436
99%            5              6       Kurtosis       2.906579

. sum sulfa_count, d 

                         sulfa_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs              10,000
25%            2              0       Sum of Wgt.      10,000

50%            3                      Mean             2.5078
                        Largest       Std. Dev.      1.022274
75%            3              6
90%            4              6       Variance       1.045044
95%            4              6       Skewness        .047182
99%            5              6       Kurtosis       2.959293

. sum leflu_count, d 

                         leflu_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs              10,000
25%            2              0       Sum of Wgt.      10,000

50%            2                      Mean             2.4996
                        Largest       Std. Dev.      1.045232
75%            3              6
90%            4              6       Variance       1.092509
95%            4              6       Skewness       .0341675
99%            5              6       Kurtosis       2.856997

. sum hydrox_count, d 

                        hydrox_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs              10,000
25%            2              0       Sum of Wgt.      10,000

50%            2                      Mean             2.4972
                        Largest       Std. Dev.      1.038123
75%            3              6
90%            4              6       Variance         1.0777
95%            4              6       Skewness       .0096117
99%            5              6       Kurtosis       2.881464

. 
. sum outpatient*, d

                    outpatient_appt_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              10,000
25%            6              0       Sum of Wgt.      10,000

50%            7                      Mean             6.7787
                        Largest       Std. Dev.      2.967222
75%            9             14
90%           10             15       Variance       8.804407
95%           11             15       Skewness      -.8707497
99%           12             16       Kurtosis       3.464415

                    outpatient_appt_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              10,000
25%            6              0       Sum of Wgt.      10,000

50%            7                      Mean             6.7565
                        Largest       Std. Dev.      2.940148
75%            9             15
90%           10             15       Variance       8.644472
95%           11             15       Skewness      -.8822412
99%           12             16       Kurtosis        3.52335

                    outpatient_appt_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              10,000
25%            6              0       Sum of Wgt.      10,000

50%            7                      Mean             6.7714
                        Largest       Std. Dev.      2.961118
75%            9             15
90%           10             16       Variance       8.768219
95%           11             16       Skewness      -.8561846
99%           12             17       Kurtosis       3.507349

                   outpatient_medium_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               5,000
25%            2              1       Sum of Wgt.       5,000

50%            5                      Mean            13.4328
                        Largest       Std. Dev.      28.15986
75%            7             98
90%            8             98       Variance       792.9777
95%           98             98       Skewness       2.648465
99%           98             98       Kurtosis       8.086917

                   outpatient_medium_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               5,000
25%            2              1       Sum of Wgt.       5,000

50%            4                      Mean            13.1352
                        Largest       Std. Dev.      27.78636
75%            7             98
90%            8             98       Variance       772.0817
95%           98             98       Skewness       2.703814
99%           98             98       Kurtosis       8.388445

                   outpatient_medium_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               5,000
25%            2              1       Sum of Wgt.       5,000

50%            5                      Mean            12.9926
                        Largest       Std. Dev.      27.51559
75%            7             98
90%            8             98       Variance        757.108
95%           98             98       Skewness       2.741619
99%           98             98       Kurtosis       8.599016

. 
. keep if has_ra
(5,000 observations deleted)

. 
. * How many people are not on DMARDs and have no RA appointments?
. 
. 
. * Format variables
. *re-order ethnicity
.  gen eth5=1 if ethnicity==1
(3,951 missing values generated)

.  replace eth5=2 if ethnicity==3
(983 real changes made)

.  replace eth5=3 if ethnicity==4
(996 real changes made)

.  replace eth5=4 if ethnicity==2
(995 real changes made)

.  replace eth5=5 if ethnicity==5
(977 real changes made)

.  replace eth5=. if ethnicity==.
(0 real changes made)

. 
.  label define eth5                      1 "White"                            
>            ///
>                                                         2 "South Asian"      
>                    ///                                             
>                                                         3 "Black"            
>                            ///
>                                                         4 "Mixed"            
>                            ///
>                                                         5 "Other"            
>                            

.                                         
. 
. label values eth5 eth5

. safetab eth5, m
5

       eth5 |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |      1,049       20.98       20.98
South Asian |        983       19.66       40.64
      Black |        996       19.92       60.56
      Mixed |        995       19.90       80.46
      Other |        977       19.54      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. 
. * formatting gender
. gen male=(sex=="M")

. replace male = 0 if sex == "F"
(0 real changes made)

. label define male 0"Female" 1"Male"

. label values male male

. safetab male, miss
5

       male |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |      2,540       50.80       50.80
       Male |      2,460       49.20      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. 
. *create a 4 category rural urban variable 
. generate urban_rural_5=.
(5,000 missing values generated)

. la var urban_rural_5 "Rural Urban in five categories"

. replace urban_rural_5=1 if urban_rural==1
(635 real changes made)

. replace urban_rural_5=2 if urban_rural==2
(628 real changes made)

. replace urban_rural_5=3 if urban_rural==3|urban_rural==4
(1,321 real changes made)

. replace urban_rural_5=4 if urban_rural==5|urban_rural==6
(1,191 real changes made)

. replace urban_rural_5=5 if urban_rural==7|urban_rural==8
(1,225 real changes made)

. label define urban_rural_5 1 "Urban major conurbation" 2 "Urban minor conurba
> tion" 3 "Urban city and town" 4 "Rural town and fringe" 5 "Rural village and 
> dispersed"

. label values urban_rural_5 urban_rural_5

. safetab urban_rural_5, miss
14

        Rural Urban in five |
                 categories |      Freq.     Percent        Cum.
----------------------------+-----------------------------------
    Urban major conurbation |        635       12.70       12.70
    Urban minor conurbation |        628       12.56       25.26
        Urban city and town |      1,321       26.42       51.68
      Rural town and fringe |      1,191       23.82       75.50
Rural village and dispersed |      1,225       24.50      100.00
----------------------------+-----------------------------------
                      Total |      5,000      100.00

. 
. *generate a binary rural urban (with missing assigned to urban)
. generate urban_rural_bin=.
(5,000 missing values generated)

. replace urban_rural_bin=1 if urban_rural<=4|urban_rural==.
(2,584 real changes made)

. replace urban_rural_bin=0 if urban_rural>4 & urban_rural!=.
(2,416 real changes made)

. label define urban_rural_bin 0 "Rural" 1 "Urban"

. label values urban_rural_bin urban_rural_bin

. safetab urban_rural_bin urban_rural, miss
28

urban_rura |                      urban_rural
     l_bin |         1          2          3          4          5 |     Total
-----------+-------------------------------------------------------+----------
     Rural |         0          0          0          0        586 |     2,416 
     Urban |       635        628        635        686          0 |     2,584 
-----------+-------------------------------------------------------+----------
     Total |       635        628        635        686        586 |     5,000 


urban_rura |           urban_rural
     l_bin |         6          7          8 |     Total
-----------+---------------------------------+----------
     Rural |       605        598        627 |     2,416 
     Urban |         0          0          0 |     2,584 
-----------+---------------------------------+----------
     Total |       605        598        627 |     5,000 

. label var urban_rural_bin "Rural-Urban"

. 
. * Define age categories
. * Create age categories
. egen age_cat = cut(age), at(18, 40, 60, 80, 120) icodes
(1072 missing values generated)

. label define age 0 "18 - 40 years" 1 "41 - 60 years" 2 "61 - 80 years" 3 ">80
>  years"

. label values age_cat age

. safetab age_cat, miss
8

      age_cat |      Freq.     Percent        Cum.
--------------+-----------------------------------
18 - 40 years |      1,426       28.52       28.52
41 - 60 years |      1,270       25.40       53.92
61 - 80 years |        984       19.68       73.60
    >80 years |        248        4.96       78.56
            . |      1,072       21.44      100.00
--------------+-----------------------------------
        Total |      5,000      100.00

. 
. * Flag if in a care-home
.     gen care_home=care_home_type!="PR"

. 
. * Smoking status
. gen smoking = 0 if smoking_status=="N"
(4,490 missing values generated)

. replace smoking = 1 if smoking_status=="S"
(996 real changes made)

. replace smoking = 2 if smoking_status=="E"
(782 real changes made)

. replace smoking = 3 if smoking==.
(2,712 real changes made)

. 
. label define smok 1 "Current smoker" 2 "Ex-smoker" 0 "Never smoked" 3 "Unknow
> n"

. label values smoking smok

. 
. * BMI categories
. egen bmi_cat = cut(bmi), at(0, 1, 18.5, 24.9, 29.9, 39.9, 100) icodes
(2 missing values generated)

. bys bmi_cat: sum bmi

-------------------------------------------------------------------------------
-> bmi_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        976    .0009617    .0300444          0   .9386167

-------------------------------------------------------------------------------
-> bmi_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        462    14.94215     3.10827   2.854736   18.49753

-------------------------------------------------------------------------------
-> bmi_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        909    21.99608    1.848631   18.50254   24.88455

-------------------------------------------------------------------------------
-> bmi_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        994     27.4253     1.43227   24.90183   29.89418

-------------------------------------------------------------------------------
-> bmi_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |      1,373     33.9499    2.738497   29.90522   39.89222

-------------------------------------------------------------------------------
-> bmi_cat = 5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        284    43.16601    2.901799    39.9117   57.53377

-------------------------------------------------------------------------------
-> bmi_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |          2   -.8586592    .5958296  -1.279974   -.437344


. label define bmi 0 "Missing" 1 "Underweight" 2 "Healthy range" 3 "Overweight"
>  4 "Obese" 5 "Morbidly obese"

. label values bmi_cat bmi

. 
. * Categorise number of outpatient appointments
. label define appt 0 "No appointments" 1 "1-2 per year" 2 "3 or more per year"
>  

. forvalues i=2019/2021 {
  2.     egen op_appt_`i'_cat = cut(outpatient_appt_`i'), at(0, 1, 3, 1000) ico
> des
  3.     label values op_appt_`i'_cat appt
  4.     }

. 
. * Calculate difference compared to 2019
. gen diff_op_2020 = outpatient_appt_2020 - outpatient_appt_2019

. gen diff_op_2021 = outpatient_appt_2021 - outpatient_appt_2019

. sum diff_op_2020 diff_op_2021, d

                        diff_op_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%          -10            -15
 5%           -8            -13
10%           -5            -13       Obs               5,000
25%           -2            -12       Sum of Wgt.       5,000

50%            0                      Mean             -.0098
                        Largest       Std. Dev.      4.207808
75%            2             12
90%            6             12       Variance       17.70565
95%            7             12       Skewness      -.0143309
99%           10             14       Kurtosis       3.259753

                        diff_op_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%          -10            -16
 5%           -7            -15
10%           -6            -13       Obs               5,000
25%           -2            -13       Sum of Wgt.       5,000

50%            0                      Mean             -.0464
                        Largest       Std. Dev.      4.217891
75%            2             12
90%            5             13       Variance       17.79061
95%            8             13       Skewness      -.0415635
99%           10             14       Kurtosis       3.243676

. 
. egen diff_op_cat_2020 = cut(diff_op_2020), at(-100, 0, 1, 100) icodes

. egen diff_op_cat_2021 = cut(diff_op_2021), at(-100, 0, 1, 100) icodes

. label define op_cat 0 "Fewer appointments" 1 "Same number of appointments" 2 
> "More appointments"

. label values diff_op_cat_2020 op_cat

. label values diff_op_cat_2021 op_cat

. tab diff_op_cat_2020 op_appt_2020_cat

                      |         op_appt_2020_cat
     diff_op_cat_2020 | No appoin  1-2 per y  3 or more |     Total
----------------------+---------------------------------+----------
   Fewer appointments |       465         21      1,734 |     2,220 
Same number of appoin |        61          0        523 |       584 
    More appointments |         0          1      2,195 |     2,196 
----------------------+---------------------------------+----------
                Total |       526         22      4,452 |     5,000 

. tab diff_op_cat_2021 op_appt_2021_cat

                      |         op_appt_2021_cat
     diff_op_cat_2021 | No appoin  1-2 per y  3 or more |     Total
----------------------+---------------------------------+----------
   Fewer appointments |       453         18      1,748 |     2,219 
Same number of appoin |        52          0        542 |       594 
    More appointments |         0          6      2,181 |     2,187 
----------------------+---------------------------------+----------
                Total |       505         24      4,471 |     5,000 

. bys diff_op_cat_2020: sum diff_op_2020

-------------------------------------------------------------------------------
-> diff_op_cat_2020 = Fewer appointments

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
diff_op_2020 |      2,220   -3.604505    2.655761        -15         -1

-------------------------------------------------------------------------------
-> diff_op_cat_2020 = Same number of appointments

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
diff_op_2020 |        584           0           0          0          0

-------------------------------------------------------------------------------
-> diff_op_cat_2020 = More appointments

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
diff_op_2020 |      2,196    3.621585    2.632765          1         14


. 
. preserve

. * Tabulate number of appointments per year
. table1_mc, vars(op_appt_2019_cat cate \ op_appt_2020_cat cate \ op_appt_2021_
> cat cate \ diff_op_2020 conts \ diff_op_2021 conts \ diff_op_cat_2020 cate \ 
> diff_op_cat_2021 cate) clear

  +--------------------------------+
  | factor               N_1   m_1 |
  |--------------------------------|
  | op_appt_2019_cat   5,000     0 |
  |--------------------------------|
  | op_appt_2020_cat   5,000     0 |
  |--------------------------------|
  | op_appt_2021_cat   5,000     0 |
  |--------------------------------|
  | diff_op_2020       5,000     0 |
  |--------------------------------|
  | diff_op_2021       5,000     0 |
  |--------------------------------|
  | diff_op_cat_2020   5,000     0 |
  |--------------------------------|
  | diff_op_cat_2021   5,000     0 |
  +--------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------+
  |                                                  Total         |
  |----------------------------------------------------------------|
  |                                                  N=5,000       |
  |----------------------------------------------------------------|
  | op_appt_2019_cat   No appointments               526 (10.5%)   |
  |                    1-2 per year                  24 ( 0.5%)    |
  |                    3 or more per year            4,450 (89.0%) |
  |----------------------------------------------------------------|
  | op_appt_2020_cat   No appointments               526 (10.5%)   |
  |                    1-2 per year                  22 ( 0.4%)    |
  |                    3 or more per year            4,452 (89.0%) |
  |----------------------------------------------------------------|
  | op_appt_2021_cat   No appointments               505 (10.1%)   |
  |                    1-2 per year                  24 ( 0.5%)    |
  |                    3 or more per year            4,471 (89.4%) |
  |----------------------------------------------------------------|
  | diff_op_2020                                     0 (-2-2)      |
  |----------------------------------------------------------------|
  | diff_op_2021                                     0 (-2-2)      |
  |----------------------------------------------------------------|
  | diff_op_cat_2020   Fewer appointments            2,220 (44.4%) |
  |                    Same number of appointments   584 (11.7%)   |
  |                    More appointments             2,196 (43.9%) |
  |----------------------------------------------------------------|
  | diff_op_cat_2021   Fewer appointments            2,219 (44.4%) |
  |                    Same number of appointments   594 (11.9%)   |
  |                    More appointments             2,187 (43.7%) |
  +----------------------------------------------------------------+
Data are presented as median (IQR) for continuous measures, and n (%) for categ
> orical measures.
 

. export delimited using ./output/tables/op_appt_yrs.csv
file ./output/tables/op_appt_yrs.csv saved

. restore 

. * Tabulate overall characteristics 
. preserve

. table1_mc, vars(age_cat cate \ male cate \ urban_rural_5 cate \ prescribed_bi
> ologics cate \ imd cate \  smoking cate \ time_ra contn \ bmi_cat cate) clear

  +------------------------------------------------+
  | factor                             N_1     m_1 |
  |------------------------------------------------|
  | age_cat                          3,928   1,072 |
  |------------------------------------------------|
  | male                             5,000       0 |
  |------------------------------------------------|
  | Rural Urban in five categories   5,000       0 |
  |------------------------------------------------|
  | prescribed_biologics             5,000       0 |
  |------------------------------------------------|
  | imd                              5,000       0 |
  |------------------------------------------------|
  | smoking                          5,000       0 |
  |------------------------------------------------|
  | time_ra                          2,177   2,823 |
  |------------------------------------------------|
  | bmi_cat                          4,998       2 |
  +------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=5,000     
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 1,426 (36.3%
> )       |
  |                                  41 - 60 years                 1,270 (32.3%
> )       |
  |                                  61 - 80 years                 984 (25.1%) 
>         |
  |                                  >80 years                     248 ( 6.3%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        2,540 (50.8%
> )       |
  |                                  Male                          2,460 (49.2%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       635 (12.7%) 
>         |
  |                                  Urban minor conurbation       628 (12.6%) 
>         |
  |                                  Urban city and town           1,321 (26.4%
> )       |
  |                                  Rural town and fringe         1,191 (23.8%
> )       |
  |                                  Rural village and dispersed   1,225 (24.5%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             2,503 (50.1%
> )       |
  |                                  1                             2,497 (49.9%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             245 ( 4.9%) 
>         |
  |                                  1                             954 (19.1%) 
>         |
  |                                  2                             917 (18.3%) 
>         |
  |                                  3                             942 (18.8%) 
>         |
  |                                  4                             958 (19.2%) 
>         |
  |                                  5                             984 (19.7%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  510 (10.2%) 
>         |
  |                                  Current smoker                996 (19.9%) 
>         |
  |                                  Ex-smoker                     782 (15.6%) 
>         |
  |                                  Unknown                       2,712 (54.2%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        54.92634 (31
> .73815) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       976 (19.5%) 
>         |
  |                                  Underweight                   462 ( 9.2%) 
>         |
  |                                  Healthy range                 909 (18.2%) 
>         |
  |                                  Overweight                    994 (19.9%) 
>         |
  |                                  Obese                         1,373 (27.5%
> )       |
  |                                  Morbidly obese                284 ( 5.7%) 
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 

. export delimited using ./output/tables/op_chars.csv
file ./output/tables/op_chars.csv saved

. restore

. * Tabulate characteristics by category of outpatient appointments for each ye
> ar
. tempfile tempfile

. forvalues i=2020/2021 {
  2.     preserve
  3.     keep if diff_op_cat_`i'==0
  4.     table1_mc, vars(age_cat cate \ male cate \ urban_rural_5 cate \ prescr
> ibed_biologics cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat cate)
>  clear
  5.     save `tempfile', replace
  6.     restore
  7.     forvalues j=1/2 {
  8.         preserve
  9.         keep if diff_op_cat_`i'==`j'
 10.         table1_mc, vars(age_cat cate \ male cate \ urban_rural_5 cate \ pr
> escribed_biologics cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat c
> ate) clear
 11.         append using `tempfile'
 12.         save `tempfile', replace
 13.         if `j'==2 {
 14.             export delimited using ./output/tables/characteristics_strata`
> i'.csv
 15.         }
 16.         restore
 17.         }
 18.     }
(2,780 observations deleted)

  +------------------------------------------------+
  | factor                             N_1     m_1 |
  |------------------------------------------------|
  | age_cat                          1,740     480 |
  |------------------------------------------------|
  | male                             2,220       0 |
  |------------------------------------------------|
  | Rural Urban in five categories   2,220       0 |
  |------------------------------------------------|
  | prescribed_biologics             2,220       0 |
  |------------------------------------------------|
  | imd                              2,220       0 |
  |------------------------------------------------|
  | smoking                          2,220       0 |
  |------------------------------------------------|
  | time_ra                            959   1,261 |
  |------------------------------------------------|
  | bmi_cat                          2,218       2 |
  +------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=2,220     
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 629 (36.1%) 
>         |
  |                                  41 - 60 years                 552 (31.7%) 
>         |
  |                                  61 - 80 years                 428 (24.6%) 
>         |
  |                                  >80 years                     131 ( 7.5%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        1,168 (52.6%
> )       |
  |                                  Male                          1,052 (47.4%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       263 (11.8%) 
>         |
  |                                  Urban minor conurbation       268 (12.1%) 
>         |
  |                                  Urban city and town           601 (27.1%) 
>         |
  |                                  Rural town and fringe         563 (25.4%) 
>         |
  |                                  Rural village and dispersed   525 (23.6%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             1,140 (51.4%
> )       |
  |                                  1                             1,080 (48.6%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             123 ( 5.5%) 
>         |
  |                                  1                             393 (17.7%) 
>         |
  |                                  2                             407 (18.3%) 
>         |
  |                                  3                             436 (19.6%) 
>         |
  |                                  4                             429 (19.3%) 
>         |
  |                                  5                             432 (19.5%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  229 (10.3%) 
>         |
  |                                  Current smoker                445 (20.0%) 
>         |
  |                                  Ex-smoker                     357 (16.1%) 
>         |
  |                                  Unknown                       1,189 (53.6%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        54.74105 (31
> .42148) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       440 (19.8%) 
>         |
  |                                  Underweight                   197 ( 8.9%) 
>         |
  |                                  Healthy range                 413 (18.6%) 
>         |
  |                                  Overweight                    426 (19.2%) 
>         |
  |                                  Obese                         633 (28.5%) 
>         |
  |                                  Morbidly obese                109 ( 4.9%) 
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
(note: file /tmp/St00011.000003 not found)
file /tmp/St00011.000003 saved
(4,416 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                          453   131 |
  |--------------------------------------------|
  | male                             584     0 |
  |--------------------------------------------|
  | Rural Urban in five categories   584     0 |
  |--------------------------------------------|
  | prescribed_biologics             584     0 |
  |--------------------------------------------|
  | imd                              584     0 |
  |--------------------------------------------|
  | smoking                          584     0 |
  |--------------------------------------------|
  | time_ra                          256   328 |
  |--------------------------------------------|
  | bmi_cat                          584     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=584       
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 159 (35.1%) 
>         |
  |                                  41 - 60 years                 135 (29.8%) 
>         |
  |                                  61 - 80 years                 133 (29.4%) 
>         |
  |                                  >80 years                     26 ( 5.7%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        282 (48.3%) 
>         |
  |                                  Male                          302 (51.7%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       90 (15.4%)  
>         |
  |                                  Urban minor conurbation       81 (13.9%)  
>         |
  |                                  Urban city and town           173 (29.6%) 
>         |
  |                                  Rural town and fringe         120 (20.5%) 
>         |
  |                                  Rural village and dispersed   120 (20.5%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             289 (49.5%) 
>         |
  |                                  1                             295 (50.5%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             21 ( 3.6%)  
>         |
  |                                  1                             113 (19.3%) 
>         |
  |                                  2                             115 (19.7%) 
>         |
  |                                  3                             111 (19.0%) 
>         |
  |                                  4                             96 (16.4%)  
>         |
  |                                  5                             128 (21.9%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  69 (11.8%)  
>         |
  |                                  Current smoker                136 (23.3%) 
>         |
  |                                  Ex-smoker                     74 (12.7%)  
>         |
  |                                  Unknown                       305 (52.2%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        54.56407 (31
> .65238) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       100 (17.1%) 
>         |
  |                                  Underweight                   51 ( 8.7%)  
>         |
  |                                  Healthy range                 106 (18.2%) 
>         |
  |                                  Overweight                    128 (21.9%) 
>         |
  |                                  Obese                         163 (27.9%) 
>         |
  |                                  Morbidly obese                36 ( 6.2%)  
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000003 saved
(2,804 observations deleted)

  +------------------------------------------------+
  | factor                             N_1     m_1 |
  |------------------------------------------------|
  | age_cat                          1,735     461 |
  |------------------------------------------------|
  | male                             2,196       0 |
  |------------------------------------------------|
  | Rural Urban in five categories   2,196       0 |
  |------------------------------------------------|
  | prescribed_biologics             2,196       0 |
  |------------------------------------------------|
  | imd                              2,196       0 |
  |------------------------------------------------|
  | smoking                          2,196       0 |
  |------------------------------------------------|
  | time_ra                            962   1,234 |
  |------------------------------------------------|
  | bmi_cat                          2,196       0 |
  +------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=2,196     
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 638 (36.8%) 
>         |
  |                                  41 - 60 years                 583 (33.6%) 
>         |
  |                                  61 - 80 years                 423 (24.4%) 
>         |
  |                                  >80 years                     91 ( 5.2%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        1,090 (49.6%
> )       |
  |                                  Male                          1,106 (50.4%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       282 (12.8%) 
>         |
  |                                  Urban minor conurbation       279 (12.7%) 
>         |
  |                                  Urban city and town           547 (24.9%) 
>         |
  |                                  Rural town and fringe         508 (23.1%) 
>         |
  |                                  Rural village and dispersed   580 (26.4%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             1,074 (48.9%
> )       |
  |                                  1                             1,122 (51.1%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             101 ( 4.6%) 
>         |
  |                                  1                             448 (20.4%) 
>         |
  |                                  2                             395 (18.0%) 
>         |
  |                                  3                             395 (18.0%) 
>         |
  |                                  4                             433 (19.7%) 
>         |
  |                                  5                             424 (19.3%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  212 ( 9.7%) 
>         |
  |                                  Current smoker                415 (18.9%) 
>         |
  |                                  Ex-smoker                     351 (16.0%) 
>         |
  |                                  Unknown                       1,218 (55.5%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        55.20745 (32
> .10357) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       436 (19.9%) 
>         |
  |                                  Underweight                   214 ( 9.7%) 
>         |
  |                                  Healthy range                 390 (17.8%) 
>         |
  |                                  Overweight                    440 (20.0%) 
>         |
  |                                  Obese                         577 (26.3%) 
>         |
  |                                  Morbidly obese                139 ( 6.3%) 
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000003 saved
file ./output/tables/characteristics_strata2020.csv saved
(2,781 observations deleted)

  +------------------------------------------------+
  | factor                             N_1     m_1 |
  |------------------------------------------------|
  | age_cat                          1,730     489 |
  |------------------------------------------------|
  | male                             2,219       0 |
  |------------------------------------------------|
  | Rural Urban in five categories   2,219       0 |
  |------------------------------------------------|
  | prescribed_biologics             2,219       0 |
  |------------------------------------------------|
  | imd                              2,219       0 |
  |------------------------------------------------|
  | smoking                          2,219       0 |
  |------------------------------------------------|
  | time_ra                            915   1,304 |
  |------------------------------------------------|
  | bmi_cat                          2,218       1 |
  +------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=2,219     
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 614 (35.5%) 
>         |
  |                                  41 - 60 years                 559 (32.3%) 
>         |
  |                                  61 - 80 years                 434 (25.1%) 
>         |
  |                                  >80 years                     123 ( 7.1%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        1,108 (49.9%
> )       |
  |                                  Male                          1,111 (50.1%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       281 (12.7%) 
>         |
  |                                  Urban minor conurbation       247 (11.1%) 
>         |
  |                                  Urban city and town           625 (28.2%) 
>         |
  |                                  Rural town and fringe         529 (23.8%) 
>         |
  |                                  Rural village and dispersed   537 (24.2%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             1,116 (50.3%
> )       |
  |                                  1                             1,103 (49.7%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             117 ( 5.3%) 
>         |
  |                                  1                             409 (18.4%) 
>         |
  |                                  2                             395 (17.8%) 
>         |
  |                                  3                             431 (19.4%) 
>         |
  |                                  4                             428 (19.3%) 
>         |
  |                                  5                             439 (19.8%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  243 (11.0%) 
>         |
  |                                  Current smoker                432 (19.5%) 
>         |
  |                                  Ex-smoker                     343 (15.5%) 
>         |
  |                                  Unknown                       1,201 (54.1%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        54.60015 (31
> .40607) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       413 (18.6%) 
>         |
  |                                  Underweight                   189 ( 8.5%) 
>         |
  |                                  Healthy range                 425 (19.2%) 
>         |
  |                                  Overweight                    451 (20.3%) 
>         |
  |                                  Obese                         632 (28.5%) 
>         |
  |                                  Morbidly obese                108 ( 4.9%) 
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000003 saved
(4,406 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                          467   127 |
  |--------------------------------------------|
  | male                             594     0 |
  |--------------------------------------------|
  | Rural Urban in five categories   594     0 |
  |--------------------------------------------|
  | prescribed_biologics             594     0 |
  |--------------------------------------------|
  | imd                              594     0 |
  |--------------------------------------------|
  | smoking                          594     0 |
  |--------------------------------------------|
  | time_ra                          273   321 |
  |--------------------------------------------|
  | bmi_cat                          594     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=594       
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 173 (37.0%) 
>         |
  |                                  41 - 60 years                 142 (30.4%) 
>         |
  |                                  61 - 80 years                 120 (25.7%) 
>         |
  |                                  >80 years                     32 ( 6.9%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        320 (53.9%) 
>         |
  |                                  Male                          274 (46.1%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       82 (13.8%)  
>         |
  |                                  Urban minor conurbation       85 (14.3%)  
>         |
  |                                  Urban city and town           147 (24.7%) 
>         |
  |                                  Rural town and fringe         146 (24.6%) 
>         |
  |                                  Rural village and dispersed   134 (22.6%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             314 (52.9%) 
>         |
  |                                  1                             280 (47.1%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             24 ( 4.0%)  
>         |
  |                                  1                             134 (22.6%) 
>         |
  |                                  2                             99 (16.7%)  
>         |
  |                                  3                             101 (17.0%) 
>         |
  |                                  4                             109 (18.4%) 
>         |
  |                                  5                             127 (21.4%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  57 ( 9.6%)  
>         |
  |                                  Current smoker                124 (20.9%) 
>         |
  |                                  Ex-smoker                     97 (16.3%)  
>         |
  |                                  Unknown                       316 (53.2%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        54.16465 (32
> .29188) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       128 (21.5%) 
>         |
  |                                  Underweight                   68 (11.4%)  
>         |
  |                                  Healthy range                 82 (13.8%)  
>         |
  |                                  Overweight                    115 (19.4%) 
>         |
  |                                  Obese                         158 (26.6%) 
>         |
  |                                  Morbidly obese                43 ( 7.2%)  
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000003 saved
(2,813 observations deleted)

  +------------------------------------------------+
  | factor                             N_1     m_1 |
  |------------------------------------------------|
  | age_cat                          1,731     456 |
  |------------------------------------------------|
  | male                             2,187       0 |
  |------------------------------------------------|
  | Rural Urban in five categories   2,187       0 |
  |------------------------------------------------|
  | prescribed_biologics             2,187       0 |
  |------------------------------------------------|
  | imd                              2,187       0 |
  |------------------------------------------------|
  | smoking                          2,187       0 |
  |------------------------------------------------|
  | time_ra                            989   1,198 |
  |------------------------------------------------|
  | bmi_cat                          2,186       1 |
  +------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> -------+
  |                                                                Total       
>        |
  |----------------------------------------------------------------------------
> -------|
  |                                                                N=2,187     
>        |
  |----------------------------------------------------------------------------
> -------|
  | age_cat                          18 - 40 years                 639 (36.9%) 
>        |
  |                                  41 - 60 years                 569 (32.9%) 
>        |
  |                                  61 - 80 years                 430 (24.8%) 
>        |
  |                                  >80 years                     93 ( 5.4%)  
>        |
  |----------------------------------------------------------------------------
> -------|
  | male                             Female                        1,112 (50.8%
> )      |
  |                                  Male                          1,075 (49.2%
> )      |
  |----------------------------------------------------------------------------
> -------|
  | Rural Urban in five categories   Urban major conurbation       272 (12.4%) 
>        |
  |                                  Urban minor conurbation       296 (13.5%) 
>        |
  |                                  Urban city and town           549 (25.1%) 
>        |
  |                                  Rural town and fringe         516 (23.6%) 
>        |
  |                                  Rural village and dispersed   554 (25.3%) 
>        |
  |----------------------------------------------------------------------------
> -------|
  | prescribed_biologics             0                             1,073 (49.1%
> )      |
  |                                  1                             1,114 (50.9%
> )      |
  |----------------------------------------------------------------------------
> -------|
  | imd                              0                             104 ( 4.8%) 
>        |
  |                                  1                             411 (18.8%) 
>        |
  |                                  2                             423 (19.3%) 
>        |
  |                                  3                             410 (18.7%) 
>        |
  |                                  4                             421 (19.3%) 
>        |
  |                                  5                             418 (19.1%) 
>        |
  |----------------------------------------------------------------------------
> -------|
  | smoking                          Never smoked                  210 ( 9.6%) 
>        |
  |                                  Current smoker                440 (20.1%) 
>        |
  |                                  Ex-smoker                     342 (15.6%) 
>        |
  |                                  Unknown                       1,195 (54.6%
> )      |
  |----------------------------------------------------------------------------
> -------|
  | time_ra                                                        55.43837 (31
> .9134) |
  |----------------------------------------------------------------------------
> -------|
  | bmi_cat                          Missing                       435 (19.9%) 
>        |
  |                                  Underweight                   205 ( 9.4%) 
>        |
  |                                  Healthy range                 402 (18.4%) 
>        |
  |                                  Overweight                    428 (19.6%) 
>        |
  |                                  Obese                         583 (26.7%) 
>        |
  |                                  Morbidly obese                133 ( 6.1%) 
>        |
  +----------------------------------------------------------------------------
> -------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
(note: variable Total was str18, now str19 to accommodate using data's
       values)
file /tmp/St00011.000003 saved
file ./output/tables/characteristics_strata2021.csv saved

.     /* Tabulate characteristics by whether hospitalised with RA for each year
>     preserve
>     keep if ra_hosp_`i'==1
>     table1_mc, vars(age_cat cate \ male cate \ urban_rural_5 cate \ prescribe
> d_biologics cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat cate) cl
> ear
>     export delimited using ./output/tables/characteristics_ra_hosp_`i'.csv
>     restore
>     }
> preserve
>     keep if ra_hosp_2018==1
>     table1_mc, vars(age_cat cate \ male cate \ urban_rural_5 cate \ prescribe
> d_biologics cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat cate) cl
> ear
>     export delimited using ./output/tables/characteristics_ra_hosp_2018.csv
>     restore
>     */
. log close
      name:  <unnamed>
       log:  /workspace/logs/outpatients.log
  log type:  text
 closed on:  11 Nov 2022, 15:57:31
-------------------------------------------------------------------------------
