
. 
. cap mkdir ./output/tables

. * Import data
. import delimited using ./output/input.csv
(43 vars, 10,000 obs)

. * Check data
. count if age==. 
  0

. count if age<18 
  2,158

. count if age>110 & age!=.
  0

. sum age, d

                             age
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            4              0
10%            7              0       Obs              10,000
25%           21              0       Sum of Wgt.      10,000

50%           40                      Mean            40.1344
                        Largest       Std. Dev.      23.68212
75%           58             99
90%           72             99       Variance       560.8428
95%           79             99       Skewness        .124259
99%           89            103       Kurtosis       2.059968

. count if sex==""
  0

. tab sex

        sex |      Freq.     Percent        Cum.
------------+-----------------------------------
          F |      5,020       50.20       50.20
          M |      4,904       49.04       99.24
          U |         76        0.76      100.00
------------+-----------------------------------
      Total |     10,000      100.00

. * Checking RA algorithm variables
. * Checking type of DMARD that meets inclusion
. foreach dmard in metho leflu sulfa hydrox {
  2.     gen `dmard'_multi = (`dmard'_count>=2)
  3.     tab `dmard'_multi if has_dmards==1, m
  4. }

metho_multi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        811       16.22       16.22
          1 |      4,189       83.78      100.00
------------+-----------------------------------
      Total |      5,000      100.00

leflu_multi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        779       15.58       15.58
          1 |      4,221       84.42      100.00
------------+-----------------------------------
      Total |      5,000      100.00

sulfa_multi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        757       15.14       15.14
          1 |      4,243       84.86      100.00
------------+-----------------------------------
      Total |      5,000      100.00

hydrox_mult |
          i |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        823       16.46       16.46
          1 |      4,177       83.54      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. gen dmard_multi = (metho_multi==1 | leflu_multi==1 | sulfa_multi==1 | hydrox_
> multi==1)

. tab dmard_multi has_alt_dmard_diag

dmard_mult |  has_alt_dmard_diag
         i |         0          1 |     Total
-----------+----------------------+----------
         0 |         7          2 |         9 
         1 |     4,993      4,998 |     9,991 
-----------+----------------------+----------
     Total |     5,000      5,000 |    10,000 

. sum number_ra_codes

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
number_ra_~s |     10,000      2.5127    1.033705         -1          6

. di "Number where no DMARDs but does have multiple RA codes and no alt diag"
Number where no DMARDs but does have multiple RA codes and no alt diag

. count if has_dmards==0 & number_ra_codes>=2 & alt_diag!=1
  2,106

. tab has_ra, m

     has_ra |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,000       50.00       50.00
          1 |      5,000       50.00      100.00
------------+-----------------------------------
      Total |     10,000      100.00

. keep if has_ra
(5,000 observations deleted)

. * Time since first RA code
. gen first_ra_codeA = date(first_ra_code, "YMD")
(2,786 missing values generated)

. format first_ra_codeA %dD/N/CY

. gen time_ra = (date("01Mar2018", "DMY") - first_ra_codeA)/365.25
(2,786 missing values generated)

. sum time_ra, d

                           time_ra
-------------------------------------------------------------
      Percentiles      Smallest
 1%      .109514      -1.051335
 5%     4.651608      -.9226557
10%     10.55441      -.9062286       Obs               2,214
25%     28.00274      -.8898015       Sum of Wgt.       2,214

50%     55.95893                      Mean           55.39823
                        Largest       Std. Dev.      31.89087
75%     83.26078       108.8241
90%     98.54073       108.9062       Variance       1017.028
95%     104.0411       108.9418       Skewness      -.0560029
99%      107.896       108.9884       Kurtosis        1.79448

. sum number_ra_codes, d

                       number_ra_codes
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -1
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            3                      Mean              2.519
                        Largest       Std. Dev.      1.038583
75%            3              6
90%            4              6       Variance       1.078655
95%            4              6       Skewness      -.0281515
99%            5              6       Kurtosis       2.871257

. sum metho_count, d

                         metho_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            2                      Mean             2.4968
                        Largest       Std. Dev.      1.037017
75%            3              6
90%            4              6       Variance       1.075405
95%            4              6       Skewness       .0596673
99%            5              6       Kurtosis       2.906392

. sum sulfa_count, d 

                         sulfa_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            3                      Mean             2.5156
                        Largest       Std. Dev.      1.036326
75%            3              6
90%            4              6       Variance       1.073971
95%            4              6       Skewness       .0219695
99%            5              6       Kurtosis        2.88321

. sum leflu_count, d 

                         leflu_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            2                      Mean             2.4948
                        Largest       Std. Dev.      1.031982
75%            3              6
90%            4              6       Variance       1.064986
95%            4              6       Skewness       .0155733
99%            5              6       Kurtosis       2.791892

. sum hydrox_count, d 

                        hydrox_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            2                      Mean              2.494
                        Largest       Std. Dev.      1.043159
75%            3              5
90%            4              6       Variance       1.088182
95%            4              6       Skewness       .0481876
99%            5              6       Kurtosis       2.825272

. 
. sum outpatient*, d

                    outpatient_appt_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               5,000
25%            6              0       Sum of Wgt.       5,000

50%            7                      Mean             6.7798
                        Largest       Std. Dev.      2.957002
75%            9             14
90%           10             14       Variance       8.743861
95%           11             14       Skewness      -.8649105
99%           12             15       Kurtosis       3.516359

                    outpatient_appt_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               5,000
25%            6              0       Sum of Wgt.       5,000

50%            7                      Mean             6.6858
                        Largest       Std. Dev.      2.964462
75%            9             14
90%           10             14       Variance       8.788036
95%           11             14       Skewness      -.8345895
99%           12             14       Kurtosis       3.444124

                    outpatient_appt_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            3              0       Obs               5,000
25%            6              0       Sum of Wgt.       5,000

50%            7                      Mean             6.7926
                        Largest       Std. Dev.      2.917411
75%            9             14
90%           10             14       Variance       8.511287
95%           11             14       Skewness      -.8627565
99%           12             14       Kurtosis       3.536668

                   outpatient_medium_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               2,493
25%            2              1       Sum of Wgt.       2,493

50%            5                      Mean           13.66025
                        Largest       Std. Dev.      28.44655
75%            7             98
90%           98             98       Variance        809.206
95%           98             98       Skewness       2.606009
99%           98             98       Kurtosis       7.863802

                   outpatient_medium_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               2,561
25%            2              1       Sum of Wgt.       2,561

50%            5                      Mean           13.06482
                        Largest       Std. Dev.      27.60182
75%            7             98
90%            8             98       Variance       761.8606
95%           98             98       Skewness       2.729233
99%           98             98       Kurtosis       8.528192

                   outpatient_medium_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               2,503
25%            2              1       Sum of Wgt.       2,503

50%            5                      Mean           14.97283
                        Largest       Std. Dev.      30.09096
75%            7             98
90%           98             98       Variance       905.4661
95%           98             98       Skewness       2.379306
99%           98             98       Kurtosis       6.717022

. 
. sum ra_hosp_beddays*, d 

                    ra_hosp_beddays_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            3                      Mean             2.4998
                        Largest       Std. Dev.      1.026358
75%            3              6
90%            4              6       Variance       1.053411
95%            4              6       Skewness      -.0594143
99%            5              6       Kurtosis        2.93974

                    ra_hosp_beddays_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            3                      Mean             2.5244
                        Largest       Std. Dev.      1.028405
75%            3              5
90%            4              5       Variance       1.057616
95%            4              6       Skewness       .0105611
99%            5              6       Kurtosis       2.892754

                    ra_hosp_beddays_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -1
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            2                      Mean             2.5076
                        Largest       Std. Dev.      1.041614
75%            3              6
90%            4              6       Variance       1.084959
95%            4              6       Skewness       .0695429
99%            5              6       Kurtosis       2.901364

. 
. * How many people are not on DMARDs and have no RA appointments?
. 
. * Format variables
. *re-order ethnicity
.  gen eth5=1 if ethnicity==1
(3,971 missing values generated)

.  replace eth5=2 if ethnicity==3
(1,039 real changes made)

.  replace eth5=3 if ethnicity==4
(967 real changes made)

.  replace eth5=4 if ethnicity==2
(1,020 real changes made)

.  replace eth5=5 if ethnicity==5
(945 real changes made)

.  replace eth5=. if ethnicity==.
(0 real changes made)

. 
.  label define eth5                      1 "White"                            
>            ///
>                                                         2 "South Asian"      
>                    ///                                             
>                                                         3 "Black"            
>                            ///
>                                                         4 "Mixed"            
>                            ///
>                                                         5 "Other"            
>                            

.                                         
. 
. label values eth5 eth5

. safetab eth5, m
5

       eth5 |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |      1,029       20.58       20.58
South Asian |      1,039       20.78       41.36
      Black |        967       19.34       60.70
      Mixed |      1,020       20.40       81.10
      Other |        945       18.90      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. 
. * formatting gender
. gen male=(sex=="M")

. replace male = 0 if sex == "F"
(0 real changes made)

. label define male 0"Female" 1"Male"

. label values male male

. safetab male, miss
5

       male |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |      2,581       51.62       51.62
       Male |      2,419       48.38      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. 
. *create a 4 category rural urban variable 
. generate urban_rural_5=.
(5,000 missing values generated)

. la var urban_rural_5 "Rural Urban in five categories"

. replace urban_rural_5=1 if urban_rural==1
(625 real changes made)

. replace urban_rural_5=2 if urban_rural==2
(593 real changes made)

. replace urban_rural_5=3 if urban_rural==3|urban_rural==4
(1,254 real changes made)

. replace urban_rural_5=4 if urban_rural==5|urban_rural==6
(1,264 real changes made)

. replace urban_rural_5=5 if urban_rural==7|urban_rural==8
(1,264 real changes made)

. label define urban_rural_5 1 "Urban major conurbation" 2 "Urban minor conurba
> tion" 3 "Urban city and town" 4 "Rural town and fringe" 5 "Rural village and 
> dispersed"

. label values urban_rural_5 urban_rural_5

. safetab urban_rural_5, miss
14

        Rural Urban in five |
                 categories |      Freq.     Percent        Cum.
----------------------------+-----------------------------------
    Urban major conurbation |        625       12.50       12.50
    Urban minor conurbation |        593       11.86       24.36
        Urban city and town |      1,254       25.08       49.44
      Rural town and fringe |      1,264       25.28       74.72
Rural village and dispersed |      1,264       25.28      100.00
----------------------------+-----------------------------------
                      Total |      5,000      100.00

. 
. *generate a binary rural urban (with missing assigned to urban)
. generate urban_rural_bin=.
(5,000 missing values generated)

. replace urban_rural_bin=1 if urban_rural<=4|urban_rural==.
(2,472 real changes made)

. replace urban_rural_bin=0 if urban_rural>4 & urban_rural!=.
(2,528 real changes made)

. label define urban_rural_bin 0 "Rural" 1 "Urban"

. label values urban_rural_bin urban_rural_bin

. safetab urban_rural_bin urban_rural, miss
28

urban_rura |                      urban_rural
     l_bin |         1          2          3          4          5 |     Total
-----------+-------------------------------------------------------+----------
     Rural |         0          0          0          0        627 |     2,528 
     Urban |       625        593        619        635          0 |     2,472 
-----------+-------------------------------------------------------+----------
     Total |       625        593        619        635        627 |     5,000 


urban_rura |           urban_rural
     l_bin |         6          7          8 |     Total
-----------+---------------------------------+----------
     Rural |       637        669        595 |     2,528 
     Urban |         0          0          0 |     2,472 
-----------+---------------------------------+----------
     Total |       637        669        595 |     5,000 

. label var urban_rural_bin "Rural-Urban"

. 
. * Define age categories
. * Create age categories
. egen age_cat = cut(age), at(18, 40, 60, 80, 120) icodes
(1068 missing values generated)

. label define age 0 "18 - 40 years" 1 "41 - 60 years" 2 "61 - 80 years" 3 ">80
>  years"

. label values age_cat age

. safetab age_cat, miss
8

      age_cat |      Freq.     Percent        Cum.
--------------+-----------------------------------
18 - 40 years |      1,431       28.62       28.62
41 - 60 years |      1,356       27.12       55.74
61 - 80 years |        930       18.60       74.34
    >80 years |        215        4.30       78.64
            . |      1,068       21.36      100.00
--------------+-----------------------------------
        Total |      5,000      100.00

. 
. * Smoking status
. gen smoking = 0 if smoking_status=="N"
(4,466 missing values generated)

. replace smoking = 1 if smoking_status=="S"
(1,023 real changes made)

. replace smoking = 2 if smoking_status=="E"
(730 real changes made)

. replace smoking = 3 if smoking==.
(2,713 real changes made)

. 
. label define smok 1 "Current smoker" 2 "Ex-smoker" 0 "Never smoked" 3 "Unknow
> n"

. label values smoking smok

. 
. * BMI categories
. egen bmi_cat = cut(bmi), at(0, 1, 18.5, 24.9, 29.9, 39.9, 100) icodes

. bys bmi_cat: sum bmi

-------------------------------------------------------------------------------
-> bmi_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        984     .000634    .0198892          0   .6239003

-------------------------------------------------------------------------------
-> bmi_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        462    14.57922    3.258733   3.187252   18.49557

-------------------------------------------------------------------------------
-> bmi_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        955    22.01144    1.819396   18.50114   24.89976

-------------------------------------------------------------------------------
-> bmi_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        978    27.40332    1.415403   24.91711   29.89513

-------------------------------------------------------------------------------
-> bmi_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |      1,332    34.15404    2.830018    29.9006   39.88868

-------------------------------------------------------------------------------
-> bmi_cat = 5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        289    43.36856    3.084279   39.91893   63.49039


. label define bmi 0 "Missing" 1 "Underweight" 2 "Healthy range" 3 "Overweight"
>  4 "Obese" 5 "Morbidly obese"

. label values bmi_cat bmi

. 
. * Determine if still in follow-up for each year
. * Format dates
. gen died_fuA = date(died_fu, "YMD")
(2,485 missing values generated)

. gen dereg_dateA = date(dereg_date, "YMD")
(2,504 missing values generated)

. gen end_fu = date("`j'-03-31", "YMD")
(5,000 missing values generated)

. gen end_date = min(died_fuA, dereg_dateA, end_fu)
(1,255 missing values generated)

. drop end_fu

. sum end_date

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    end_date |      3,745    22431.56    286.6749      21976      22994

. di "Number where end date prior to follow-up start"
Number where end date prior to follow-up start

. count if end_date<date("2019-04-01", "YMD")
  0

. * determine range of dates for outpatient appointments to determine which sho
> uld be dropped
. gen end_2020 = end_date<date("2020-03-31", "YMD")

. gen end_2021 = end_date<date("2021-03-31", "YMD")

. gen end_2022 = end_date<date("2022-03-31", "YMD")

. tab end_2020

   end_2020 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,858       97.16       97.16
          1 |        142        2.84      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. tab end_2021

   end_2021 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,274       65.48       65.48
          1 |      1,726       34.52      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. tab end_2022

   end_2022 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,969       39.38       39.38
          1 |      3,031       60.62      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. * Set outpatient appointment count to missing if end prior to the end of the 
> year 
. forvalues i=2019/2021 {
  2.     local j=`i'+1
  3.     di `j'
  4.     replace outpatient_appt_`i'=. if end_`j'
  5.     replace outpatient_medium_`i'=. if end_`j'
  6. }
2020
(142 real changes made, 142 to missing)
(71 real changes made, 71 to missing)
2021
(1,726 real changes made, 1,726 to missing)
(898 real changes made, 898 to missing)
2022
(3,031 real changes made, 3,031 to missing)
(1,522 real changes made, 1,522 to missing)

. 
. * Categorise number of outpatient appointments
. label define appt 0 "No appointments" 1 "1-2 per year" 2 "3 or more per year"
>  

. forvalues i=2019/2021 {
  2.     egen op_appt_`i'_cat = cut(outpatient_appt_`i'), at(0, 1, 3, 1000) ico
> des
  3.     label values op_appt_`i'_cat appt
  4.     }
(142 missing values generated)
(1726 missing values generated)
(3031 missing values generated)

. 
. * Calculate difference compared to 2019
. gen diff_op_2020 = outpatient_appt_2020 - outpatient_appt_2019
(1,726 missing values generated)

. gen diff_op_2021 = outpatient_appt_2021 - outpatient_appt_2020
(3,031 missing values generated)

. sum diff_op_2020 diff_op_2021, d

                        diff_op_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%          -10            -13
 5%           -7            -13
10%           -6            -12       Obs               3,274
25%           -2            -12       Sum of Wgt.       3,274

50%            0                      Mean          -.0351252
                        Largest       Std. Dev.      4.177653
75%            2             13
90%            5             13       Variance       17.45278
95%            7             13       Skewness      -.0231576
99%           10             14       Kurtosis       3.290787

                        diff_op_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%          -10            -13
 5%           -7            -12
10%           -5            -12       Obs               1,969
25%           -2            -12       Sum of Wgt.       1,969

50%            0                      Mean           .0284408
                        Largest       Std. Dev.      4.137525
75%            3             12
90%            5             12       Variance       17.11911
95%            7             13       Skewness       .0072001
99%           10             14       Kurtosis       3.164147

. 
. egen diff_op_cat_2020 = cut(diff_op_2020), at(-100, 0, 1, 100) icodes
(1726 missing values generated)

. egen diff_op_cat_2021 = cut(diff_op_2021), at(-100, 0, 1, 100) icodes
(3031 missing values generated)

. label define op_cat 0 "Fewer appointments" 1 "Same number of appointments" 2 
> "More appointments"

. label values diff_op_cat_2020 op_cat

. label values diff_op_cat_2021 op_cat

. tab diff_op_cat_2020 op_appt_2020_cat

                      |         op_appt_2020_cat
     diff_op_cat_2020 | No appoin  1-2 per y  3 or more |     Total
----------------------+---------------------------------+----------
   Fewer appointments |       288         20      1,104 |     1,412 
Same number of appoin |        36          0        392 |       428 
    More appointments |         0          3      1,431 |     1,434 
----------------------+---------------------------------+----------
                Total |       324         23      2,927 |     3,274 

. tab diff_op_cat_2021 op_appt_2021_cat

                      |         op_appt_2021_cat
     diff_op_cat_2021 | No appoin  1-2 per y  3 or more |     Total
----------------------+---------------------------------+----------
   Fewer appointments |       180          9        670 |       859 
Same number of appoin |        16          1        238 |       255 
    More appointments |         0          1        854 |       855 
----------------------+---------------------------------+----------
                Total |       196         11      1,762 |     1,969 

. bys diff_op_cat_2020: sum diff_op_2020

-------------------------------------------------------------------------------
-> diff_op_cat_2020 = Fewer appointments

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
diff_op_2020 |      1,412   -3.700425    2.650472        -13         -1

-------------------------------------------------------------------------------
-> diff_op_cat_2020 = Same number of appointments

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
diff_op_2020 |        428           0           0          0          0

-------------------------------------------------------------------------------
-> diff_op_cat_2020 = More appointments

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
diff_op_2020 |      1,434    3.563459    2.597804          1         14

-------------------------------------------------------------------------------
-> diff_op_cat_2020 = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
diff_op_2020 |          0


. sum ra_hosp*

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
ra_hosp_2019 |      5,000      2.5268    1.045132          0          6
ra_hosp_2020 |      5,000      2.4906    1.027873         -1          7
ra_hosp_2021 |      5,000      2.4968    1.034313          0          6
ra_hosp_be~9 |      5,000      2.4998    1.026358          0          6
ra_hosp_be~0 |      5,000      2.5244    1.028405          0          6
-------------+---------------------------------------------------------
ra_hosp_be~1 |      5,000      2.5076    1.041614         -1          6

. 
. preserve

. * Tabulate number of appointments per year
. table1_mc, vars(op_appt_2019_cat cate \ op_appt_2020_cat cate \ op_appt_2021_
> cat cate \ diff_op_2020 conts \ diff_op_2021 conts \ diff_op_cat_2020 cate \ 
> diff_op_cat_2021 cate) clear

  +----------------------------------+
  | factor               N_1     m_1 |
  |----------------------------------|
  | op_appt_2019_cat   4,858     142 |
  |----------------------------------|
  | op_appt_2020_cat   3,274   1,726 |
  |----------------------------------|
  | op_appt_2021_cat   1,969   3,031 |
  |----------------------------------|
  | diff_op_2020       3,274   1,726 |
  |----------------------------------|
  | diff_op_2021       1,969   3,031 |
  |----------------------------------|
  | diff_op_cat_2020   3,274   1,726 |
  |----------------------------------|
  | diff_op_cat_2021   1,969   3,031 |
  +----------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------+
  |                                                  Total         |
  |----------------------------------------------------------------|
  |                                                  N=5,000       |
  |----------------------------------------------------------------|
  | op_appt_2019_cat   No appointments               481 ( 9.9%)   |
  |                    1-2 per year                  22 ( 0.5%)    |
  |                    3 or more per year            4,355 (89.6%) |
  |----------------------------------------------------------------|
  | op_appt_2020_cat   No appointments               324 ( 9.9%)   |
  |                    1-2 per year                  23 ( 0.7%)    |
  |                    3 or more per year            2,927 (89.4%) |
  |----------------------------------------------------------------|
  | op_appt_2021_cat   No appointments               196 (10.0%)   |
  |                    1-2 per year                  11 ( 0.6%)    |
  |                    3 or more per year            1,762 (89.5%) |
  |----------------------------------------------------------------|
  | diff_op_2020                                     0 (-2-2)      |
  |----------------------------------------------------------------|
  | diff_op_2021                                     0 (-2-3)      |
  |----------------------------------------------------------------|
  | diff_op_cat_2020   Fewer appointments            1,412 (43.1%) |
  |                    Same number of appointments   428 (13.1%)   |
  |                    More appointments             1,434 (43.8%) |
  |----------------------------------------------------------------|
  | diff_op_cat_2021   Fewer appointments            859 (43.6%)   |
  |                    Same number of appointments   255 (13.0%)   |
  |                    More appointments             855 (43.4%)   |
  +----------------------------------------------------------------+
Data are presented as median (IQR) for continuous measures, and n (%) for categ
> orical measures.
 

. export delimited using ./output/tables/op_appt_yrs.csv
file ./output/tables/op_appt_yrs.csv saved

. restore 

. /*preserve
> *Tabulate number of appointments per year
> table1_mc, vars(ra_hosp_2019 cate \ ra_hosp_2020 cate \ ra_hosp_2021 cate) cl
> ear
> export delimited using ./output/tables/ra_hosp.csv
> restore */
. * Tabulate overall characteristics 
. preserve

. table1_mc, vars(age_cat cate \ male cate \ urban_rural_5 cate \ prescribed_bi
> ologics cate \ imd cate \  smoking cate \ time_ra contn \ bmi_cat cate) clear

  +------------------------------------------------+
  | factor                             N_1     m_1 |
  |------------------------------------------------|
  | age_cat                          3,932   1,068 |
  |------------------------------------------------|
  | male                             5,000       0 |
  |------------------------------------------------|
  | Rural Urban in five categories   5,000       0 |
  |------------------------------------------------|
  | prescribed_biologics             5,000       0 |
  |------------------------------------------------|
  | imd                              5,000       0 |
  |------------------------------------------------|
  | smoking                          5,000       0 |
  |------------------------------------------------|
  | time_ra                          2,214   2,786 |
  |------------------------------------------------|
  | bmi_cat                          5,000       0 |
  +------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=5,000     
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 1,431 (36.4%
> )       |
  |                                  41 - 60 years                 1,356 (34.5%
> )       |
  |                                  61 - 80 years                 930 (23.7%) 
>         |
  |                                  >80 years                     215 ( 5.5%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        2,581 (51.6%
> )       |
  |                                  Male                          2,419 (48.4%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       625 (12.5%) 
>         |
  |                                  Urban minor conurbation       593 (11.9%) 
>         |
  |                                  Urban city and town           1,254 (25.1%
> )       |
  |                                  Rural town and fringe         1,264 (25.3%
> )       |
  |                                  Rural village and dispersed   1,264 (25.3%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             2,521 (50.4%
> )       |
  |                                  1                             2,479 (49.6%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             232 ( 4.6%) 
>         |
  |                                  1                             955 (19.1%) 
>         |
  |                                  2                             946 (18.9%) 
>         |
  |                                  3                             962 (19.2%) 
>         |
  |                                  4                             967 (19.3%) 
>         |
  |                                  5                             938 (18.8%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  534 (10.7%) 
>         |
  |                                  Current smoker                1,023 (20.5%
> )       |
  |                                  Ex-smoker                     730 (14.6%) 
>         |
  |                                  Unknown                       2,713 (54.3%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        55.39822 (31
> .89087) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       984 (19.7%) 
>         |
  |                                  Underweight                   462 ( 9.2%) 
>         |
  |                                  Healthy range                 955 (19.1%) 
>         |
  |                                  Overweight                    978 (19.6%) 
>         |
  |                                  Obese                         1,332 (26.6%
> )       |
  |                                  Morbidly obese                289 ( 5.8%) 
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 

. export delimited using ./output/tables/op_chars.csv
file ./output/tables/op_chars.csv saved

. restore

. * Tabulate characteristics by category of outpatient appointments for each ye
> ar
. tempfile tempfile

. forvalues i=2019/2021 {
  2.     preserve
  3.     keep if op_appt_`i'_cat==0
  4.     table1_mc, vars(age_cat cate \ male cate \ urban_rural_5 cate \ prescr
> ibed_biologics cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat cate)
>  clear
  5.     save `tempfile', replace
  6.     restore
  7.     forvalues j=1/2 {
  8.         preserve
  9.         keep if op_appt_`i'_cat==`j'
 10.         table1_mc, vars(age_cat cate \ male cate \ urban_rural_5 cate \ pr
> escribed_biologics cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat c
> ate) clear
 11.         append using `tempfile'
 12.         save `tempfile', replace
 13.         if `j'==2 {
 14.             export delimited using ./output/tables/characteristics_strata`
> i'.csv
 15.         }
 16.         restore
 17.     }
 18.     * Tabulate characteristics by whether hospitalised with RA for each ye
> ar
.     preserve
 19.     keep if ra_hosp_`i'==0
 20.     table1_mc, vars(age_cat cate \ male cate \ urban_rural_5 cate \ prescr
> ibed_biologics cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat cate)
>  clear
 21.     save `tempfile', replace
 22.     restore
 23.     preserve
 24.     keep if ra_hosp_`i'==1
 25.     table1_mc, vars(age_cat cate \ male cate \ urban_rural_5 cate \ prescr
> ibed_biologics cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat cate)
>  clear
 26.     append using `tempfile'
 27.     save `tempfile', replace
 28.     export delimited using ./output/tables/characteristics_ra_hosp_`i'.csv
 29.     restore
 30. }
(4,519 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                          361   120 |
  |--------------------------------------------|
  | male                             481     0 |
  |--------------------------------------------|
  | Rural Urban in five categories   481     0 |
  |--------------------------------------------|
  | prescribed_biologics             481     0 |
  |--------------------------------------------|
  | imd                              481     0 |
  |--------------------------------------------|
  | smoking                          481     0 |
  |--------------------------------------------|
  | time_ra                          212   269 |
  |--------------------------------------------|
  | bmi_cat                          481     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> -------+
  |                                                                Total       
>        |
  |----------------------------------------------------------------------------
> -------|
  |                                                                N=481       
>        |
  |----------------------------------------------------------------------------
> -------|
  | age_cat                          18 - 40 years                 154 (42.7%) 
>        |
  |                                  41 - 60 years                 116 (32.1%) 
>        |
  |                                  61 - 80 years                 73 (20.2%)  
>        |
  |                                  >80 years                     18 ( 5.0%)  
>        |
  |----------------------------------------------------------------------------
> -------|
  | male                             Female                        245 (50.9%) 
>        |
  |                                  Male                          236 (49.1%) 
>        |
  |----------------------------------------------------------------------------
> -------|
  | Rural Urban in five categories   Urban major conurbation       63 (13.1%)  
>        |
  |                                  Urban minor conurbation       62 (12.9%)  
>        |
  |                                  Urban city and town           117 (24.3%) 
>        |
  |                                  Rural town and fringe         115 (23.9%) 
>        |
  |                                  Rural village and dispersed   124 (25.8%) 
>        |
  |----------------------------------------------------------------------------
> -------|
  | prescribed_biologics             0                             248 (51.6%) 
>        |
  |                                  1                             233 (48.4%) 
>        |
  |----------------------------------------------------------------------------
> -------|
  | imd                              0                             15 ( 3.1%)  
>        |
  |                                  1                             80 (16.6%)  
>        |
  |                                  2                             103 (21.4%) 
>        |
  |                                  3                             107 (22.2%) 
>        |
  |                                  4                             91 (18.9%)  
>        |
  |                                  5                             85 (17.7%)  
>        |
  |----------------------------------------------------------------------------
> -------|
  | smoking                          Never smoked                  48 (10.0%)  
>        |
  |                                  Current smoker                89 (18.5%)  
>        |
  |                                  Ex-smoker                     79 (16.4%)  
>        |
  |                                  Unknown                       265 (55.1%) 
>        |
  |----------------------------------------------------------------------------
> -------|
  | time_ra                                                        54.0798 (33.
> 73057) |
  |----------------------------------------------------------------------------
> -------|
  | bmi_cat                          Missing                       88 (18.3%)  
>        |
  |                                  Underweight                   38 ( 7.9%)  
>        |
  |                                  Healthy range                 92 (19.1%)  
>        |
  |                                  Overweight                    87 (18.1%)  
>        |
  |                                  Obese                         142 (29.5%) 
>        |
  |                                  Morbidly obese                34 ( 7.1%)  
>        |
  +----------------------------------------------------------------------------
> -------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
(note: file /tmp/St00011.000003 not found)
file /tmp/St00011.000003 saved
(4,978 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                           17     5 |
  |--------------------------------------------|
  | male                              22     0 |
  |--------------------------------------------|
  | Rural Urban in five categories    22     0 |
  |--------------------------------------------|
  | prescribed_biologics              22     0 |
  |--------------------------------------------|
  | imd                               22     0 |
  |--------------------------------------------|
  | smoking                           22     0 |
  |--------------------------------------------|
  | time_ra                           10    12 |
  |--------------------------------------------|
  | bmi_cat                           22     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> -------+
  |                                                                Total       
>        |
  |----------------------------------------------------------------------------
> -------|
  |                                                                N=22        
>        |
  |----------------------------------------------------------------------------
> -------|
  | age_cat                          18 - 40 years                 10 (59%)    
>        |
  |                                  41 - 60 years                 5 (29%)     
>        |
  |                                  61 - 80 years                 2 (12%)     
>        |
  |----------------------------------------------------------------------------
> -------|
  | male                             Female                        15 (68%)    
>        |
  |                                  Male                          7 (32%)     
>        |
  |----------------------------------------------------------------------------
> -------|
  | Rural Urban in five categories   Urban major conurbation       4 (18%)     
>        |
  |                                  Urban minor conurbation       4 (18%)     
>        |
  |                                  Urban city and town           4 (18%)     
>        |
  |                                  Rural town and fringe         6 (27%)     
>        |
  |                                  Rural village and dispersed   4 (18%)     
>        |
  |----------------------------------------------------------------------------
> -------|
  | prescribed_biologics             0                             9 (41%)     
>        |
  |                                  1                             13 (59%)    
>        |
  |----------------------------------------------------------------------------
> -------|
  | imd                              1                             5 (23%)     
>        |
  |                                  2                             1 ( 5%)     
>        |
  |                                  3                             5 (23%)     
>        |
  |                                  4                             7 (32%)     
>        |
  |                                  5                             4 (18%)     
>        |
  |----------------------------------------------------------------------------
> -------|
  | smoking                          Never smoked                  2 ( 9%)     
>        |
  |                                  Current smoker                7 (32%)     
>        |
  |                                  Ex-smoker                     2 ( 9%)     
>        |
  |                                  Unknown                       11 (50%)    
>        |
  |----------------------------------------------------------------------------
> -------|
  | time_ra                                                        69.15565 (31
> .5721) |
  |----------------------------------------------------------------------------
> -------|
  | bmi_cat                          Missing                       4 (18%)     
>        |
  |                                  Underweight                   3 (14%)     
>        |
  |                                  Healthy range                 4 (18%)     
>        |
  |                                  Overweight                    3 (14%)     
>        |
  |                                  Obese                         7 (32%)     
>        |
  |                                  Morbidly obese                1 ( 5%)     
>        |
  +----------------------------------------------------------------------------
> -------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000003 saved
(645 observations deleted)

  +------------------------------------------------+
  | factor                             N_1     m_1 |
  |------------------------------------------------|
  | age_cat                          3,441     914 |
  |------------------------------------------------|
  | male                             4,355       0 |
  |------------------------------------------------|
  | Rural Urban in five categories   4,355       0 |
  |------------------------------------------------|
  | prescribed_biologics             4,355       0 |
  |------------------------------------------------|
  | imd                              4,355       0 |
  |------------------------------------------------|
  | smoking                          4,355       0 |
  |------------------------------------------------|
  | time_ra                          1,934   2,421 |
  |------------------------------------------------|
  | bmi_cat                          4,355       0 |
  +------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=4,355     
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 1,225 (35.6%
> )       |
  |                                  41 - 60 years                 1,204 (35.0%
> )       |
  |                                  61 - 80 years                 824 (23.9%) 
>         |
  |                                  >80 years                     188 ( 5.5%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        2,250 (51.7%
> )       |
  |                                  Male                          2,105 (48.3%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       542 (12.4%) 
>         |
  |                                  Urban minor conurbation       514 (11.8%) 
>         |
  |                                  Urban city and town           1,099 (25.2%
> )       |
  |                                  Rural town and fringe         1,109 (25.5%
> )       |
  |                                  Rural village and dispersed   1,091 (25.1%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             2,201 (50.5%
> )       |
  |                                  1                             2,154 (49.5%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             208 ( 4.8%) 
>         |
  |                                  1                             846 (19.4%) 
>         |
  |                                  2                             809 (18.6%) 
>         |
  |                                  3                             822 (18.9%) 
>         |
  |                                  4                             845 (19.4%) 
>         |
  |                                  5                             825 (18.9%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  470 (10.8%) 
>         |
  |                                  Current smoker                892 (20.5%) 
>         |
  |                                  Ex-smoker                     632 (14.5%) 
>         |
  |                                  Unknown                       2,361 (54.2%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        55.52711 (31
> .66927) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       855 (19.6%) 
>         |
  |                                  Underweight                   409 ( 9.4%) 
>         |
  |                                  Healthy range                 831 (19.1%) 
>         |
  |                                  Overweight                    861 (19.8%) 
>         |
  |                                  Obese                         1,153 (26.5%
> )       |
  |                                  Morbidly obese                246 ( 5.6%) 
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000003 saved
file ./output/tables/characteristics_strata2019.csv saved
(4,901 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                           73    26 |
  |--------------------------------------------|
  | male                              99     0 |
  |--------------------------------------------|
  | Rural Urban in five categories    99     0 |
  |--------------------------------------------|
  | prescribed_biologics              99     0 |
  |--------------------------------------------|
  | imd                               99     0 |
  |--------------------------------------------|
  | smoking                           99     0 |
  |--------------------------------------------|
  | time_ra                           37    62 |
  |--------------------------------------------|
  | bmi_cat                           99     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=99        
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 27 (37%)    
>         |
  |                                  41 - 60 years                 29 (40%)    
>         |
  |                                  61 - 80 years                 14 (19%)    
>         |
  |                                  >80 years                     3 ( 4%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        56 (57%)    
>         |
  |                                  Male                          43 (43%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       15 (15%)    
>         |
  |                                  Urban minor conurbation       5 ( 5%)     
>         |
  |                                  Urban city and town           29 (29%)    
>         |
  |                                  Rural town and fringe         25 (25%)    
>         |
  |                                  Rural village and dispersed   25 (25%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             54 (55%)    
>         |
  |                                  1                             45 (45%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             5 ( 5%)     
>         |
  |                                  1                             16 (16%)    
>         |
  |                                  2                             14 (14%)    
>         |
  |                                  3                             22 (22%)    
>         |
  |                                  4                             22 (22%)    
>         |
  |                                  5                             20 (20%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  10 (10%)    
>         |
  |                                  Current smoker                17 (17%)    
>         |
  |                                  Ex-smoker                     17 (17%)    
>         |
  |                                  Unknown                       55 (56%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        62.09172 (26
> .58338) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       19 (19%)    
>         |
  |                                  Underweight                   7 ( 7%)     
>         |
  |                                  Healthy range                 21 (21%)    
>         |
  |                                  Overweight                    18 (18%)    
>         |
  |                                  Obese                         28 (28%)    
>         |
  |                                  Morbidly obese                6 ( 6%)     
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000003 saved
(4,303 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                          572   125 |
  |--------------------------------------------|
  | male                             697     0 |
  |--------------------------------------------|
  | Rural Urban in five categories   697     0 |
  |--------------------------------------------|
  | prescribed_biologics             697     0 |
  |--------------------------------------------|
  | imd                              697     0 |
  |--------------------------------------------|
  | smoking                          697     0 |
  |--------------------------------------------|
  | time_ra                          295   402 |
  |--------------------------------------------|
  | bmi_cat                          697     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=697       
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 207 (36.2%) 
>         |
  |                                  41 - 60 years                 206 (36.0%) 
>         |
  |                                  61 - 80 years                 137 (24.0%) 
>         |
  |                                  >80 years                     22 ( 3.8%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        360 (51.6%) 
>         |
  |                                  Male                          337 (48.4%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       85 (12.2%)  
>         |
  |                                  Urban minor conurbation       82 (11.8%)  
>         |
  |                                  Urban city and town           151 (21.7%) 
>         |
  |                                  Rural town and fringe         201 (28.8%) 
>         |
  |                                  Rural village and dispersed   178 (25.5%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             351 (50.4%) 
>         |
  |                                  1                             346 (49.6%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             23 ( 3.3%)  
>         |
  |                                  1                             137 (19.7%) 
>         |
  |                                  2                             141 (20.2%) 
>         |
  |                                  3                             134 (19.2%) 
>         |
  |                                  4                             128 (18.4%) 
>         |
  |                                  5                             134 (19.2%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  79 (11.3%)  
>         |
  |                                  Current smoker                132 (18.9%) 
>         |
  |                                  Ex-smoker                     89 (12.8%)  
>         |
  |                                  Unknown                       397 (57.0%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        51.67876 (31
> .79217) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       154 (22.1%) 
>         |
  |                                  Underweight                   61 ( 8.8%)  
>         |
  |                                  Healthy range                 115 (16.5%) 
>         |
  |                                  Overweight                    124 (17.8%) 
>         |
  |                                  Obese                         201 (28.8%) 
>         |
  |                                  Morbidly obese                42 ( 6.0%)  
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000003 saved
file ./output/tables/characteristics_ra_hosp_2019.csv saved
(4,676 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                          254    70 |
  |--------------------------------------------|
  | male                             324     0 |
  |--------------------------------------------|
  | Rural Urban in five categories   324     0 |
  |--------------------------------------------|
  | prescribed_biologics             324     0 |
  |--------------------------------------------|
  | imd                              324     0 |
  |--------------------------------------------|
  | smoking                          324     0 |
  |--------------------------------------------|
  | time_ra                          142   182 |
  |--------------------------------------------|
  | bmi_cat                          324     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=324       
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 83 (32.7%)  
>         |
  |                                  41 - 60 years                 102 (40.2%) 
>         |
  |                                  61 - 80 years                 49 (19.3%)  
>         |
  |                                  >80 years                     20 ( 7.9%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        163 (50.3%) 
>         |
  |                                  Male                          161 (49.7%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       49 (15.1%)  
>         |
  |                                  Urban minor conurbation       48 (14.8%)  
>         |
  |                                  Urban city and town           73 (22.5%)  
>         |
  |                                  Rural town and fringe         70 (21.6%)  
>         |
  |                                  Rural village and dispersed   84 (25.9%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             172 (53.1%) 
>         |
  |                                  1                             152 (46.9%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             16 ( 4.9%)  
>         |
  |                                  1                             70 (21.6%)  
>         |
  |                                  2                             61 (18.8%)  
>         |
  |                                  3                             61 (18.8%)  
>         |
  |                                  4                             66 (20.4%)  
>         |
  |                                  5                             50 (15.4%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  41 (12.7%)  
>         |
  |                                  Current smoker                59 (18.2%)  
>         |
  |                                  Ex-smoker                     45 (13.9%)  
>         |
  |                                  Unknown                       179 (55.2%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        57.01532 (33
> .41471) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       56 (17.3%)  
>         |
  |                                  Underweight                   32 ( 9.9%)  
>         |
  |                                  Healthy range                 58 (17.9%)  
>         |
  |                                  Overweight                    65 (20.1%)  
>         |
  |                                  Obese                         96 (29.6%)  
>         |
  |                                  Morbidly obese                17 ( 5.2%)  
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000003 saved
(4,977 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                           16     7 |
  |--------------------------------------------|
  | male                              23     0 |
  |--------------------------------------------|
  | Rural Urban in five categories    23     0 |
  |--------------------------------------------|
  | prescribed_biologics              23     0 |
  |--------------------------------------------|
  | imd                               23     0 |
  |--------------------------------------------|
  | smoking                           23     0 |
  |--------------------------------------------|
  | time_ra                           12    11 |
  |--------------------------------------------|
  | bmi_cat                           23     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=23        
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 5 (31%)     
>         |
  |                                  41 - 60 years                 10 (62%)    
>         |
  |                                  61 - 80 years                 1 ( 6%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        11 (48%)    
>         |
  |                                  Male                          12 (52%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       7 (30%)     
>         |
  |                                  Urban minor conurbation       1 ( 4%)     
>         |
  |                                  Urban city and town           8 (35%)     
>         |
  |                                  Rural town and fringe         1 ( 4%)     
>         |
  |                                  Rural village and dispersed   6 (26%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             12 (52%)    
>         |
  |                                  1                             11 (48%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             1 ( 4%)     
>         |
  |                                  1                             6 (26%)     
>         |
  |                                  2                             5 (22%)     
>         |
  |                                  3                             4 (17%)     
>         |
  |                                  4                             4 (17%)     
>         |
  |                                  5                             3 (13%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  2 ( 9%)     
>         |
  |                                  Current smoker                2 ( 9%)     
>         |
  |                                  Ex-smoker                     4 (17%)     
>         |
  |                                  Unknown                       15 (65%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        58.45608 (37
> .27805) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       3 (13%)     
>         |
  |                                  Underweight                   2 ( 9%)     
>         |
  |                                  Healthy range                 6 (26%)     
>         |
  |                                  Overweight                    3 (13%)     
>         |
  |                                  Obese                         6 (26%)     
>         |
  |                                  Morbidly obese                3 (13%)     
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000003 saved
(2,073 observations deleted)

  +------------------------------------------------+
  | factor                             N_1     m_1 |
  |------------------------------------------------|
  | age_cat                          2,295     632 |
  |------------------------------------------------|
  | male                             2,927       0 |
  |------------------------------------------------|
  | Rural Urban in five categories   2,927       0 |
  |------------------------------------------------|
  | prescribed_biologics             2,927       0 |
  |------------------------------------------------|
  | imd                              2,927       0 |
  |------------------------------------------------|
  | smoking                          2,927       0 |
  |------------------------------------------------|
  | time_ra                          1,303   1,624 |
  |------------------------------------------------|
  | bmi_cat                          2,927       0 |
  +------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=2,927     
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 853 (37.2%) 
>         |
  |                                  41 - 60 years                 774 (33.7%) 
>         |
  |                                  61 - 80 years                 547 (23.8%) 
>         |
  |                                  >80 years                     121 ( 5.3%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        1,529 (52.2%
> )       |
  |                                  Male                          1,398 (47.8%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       364 (12.4%) 
>         |
  |                                  Urban minor conurbation       341 (11.7%) 
>         |
  |                                  Urban city and town           739 (25.2%) 
>         |
  |                                  Rural town and fringe         741 (25.3%) 
>         |
  |                                  Rural village and dispersed   742 (25.4%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             1,472 (50.3%
> )       |
  |                                  1                             1,455 (49.7%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             125 ( 4.3%) 
>         |
  |                                  1                             573 (19.6%) 
>         |
  |                                  2                             551 (18.8%) 
>         |
  |                                  3                             570 (19.5%) 
>         |
  |                                  4                             553 (18.9%) 
>         |
  |                                  5                             555 (19.0%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  299 (10.2%) 
>         |
  |                                  Current smoker                606 (20.7%) 
>         |
  |                                  Ex-smoker                     427 (14.6%) 
>         |
  |                                  Unknown                       1,595 (54.5%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        55.27816 (31
> .77625) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       592 (20.2%) 
>         |
  |                                  Underweight                   281 ( 9.6%) 
>         |
  |                                  Healthy range                 554 (18.9%) 
>         |
  |                                  Overweight                    573 (19.6%) 
>         |
  |                                  Obese                         764 (26.1%) 
>         |
  |                                  Morbidly obese                163 ( 5.6%) 
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000003 saved
file ./output/tables/characteristics_strata2020.csv saved
(4,903 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                           76    21 |
  |--------------------------------------------|
  | male                              97     0 |
  |--------------------------------------------|
  | Rural Urban in five categories    97     0 |
  |--------------------------------------------|
  | prescribed_biologics              97     0 |
  |--------------------------------------------|
  | imd                               97     0 |
  |--------------------------------------------|
  | smoking                           97     0 |
  |--------------------------------------------|
  | time_ra                           47    50 |
  |--------------------------------------------|
  | bmi_cat                           97     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=97        
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 23 (30%)    
>         |
  |                                  41 - 60 years                 30 (39%)    
>         |
  |                                  61 - 80 years                 16 (21%)    
>         |
  |                                  >80 years                     7 ( 9%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        49 (51%)    
>         |
  |                                  Male                          48 (49%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       16 (16%)    
>         |
  |                                  Urban minor conurbation       13 (13%)    
>         |
  |                                  Urban city and town           24 (25%)    
>         |
  |                                  Rural town and fringe         24 (25%)    
>         |
  |                                  Rural village and dispersed   20 (21%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             49 (51%)    
>         |
  |                                  1                             48 (49%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             3 ( 3%)     
>         |
  |                                  1                             21 (22%)    
>         |
  |                                  2                             13 (13%)    
>         |
  |                                  3                             12 (12%)    
>         |
  |                                  4                             29 (30%)    
>         |
  |                                  5                             19 (20%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  7 ( 7%)     
>         |
  |                                  Current smoker                14 (14%)    
>         |
  |                                  Ex-smoker                     20 (21%)    
>         |
  |                                  Unknown                       56 (58%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        62.53444 (31
> .05111) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       20 (21%)    
>         |
  |                                  Underweight                   11 (11%)    
>         |
  |                                  Healthy range                 21 (22%)    
>         |
  |                                  Overweight                    14 (14%)    
>         |
  |                                  Obese                         27 (28%)    
>         |
  |                                  Morbidly obese                4 ( 4%)     
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000003 saved
(4,296 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                          551   153 |
  |--------------------------------------------|
  | male                             704     0 |
  |--------------------------------------------|
  | Rural Urban in five categories   704     0 |
  |--------------------------------------------|
  | prescribed_biologics             704     0 |
  |--------------------------------------------|
  | imd                              704     0 |
  |--------------------------------------------|
  | smoking                          704     0 |
  |--------------------------------------------|
  | time_ra                          314   390 |
  |--------------------------------------------|
  | bmi_cat                          704     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=704       
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 202 (36.7%) 
>         |
  |                                  41 - 60 years                 181 (32.8%) 
>         |
  |                                  61 - 80 years                 134 (24.3%) 
>         |
  |                                  >80 years                     34 ( 6.2%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        357 (50.7%) 
>         |
  |                                  Male                          347 (49.3%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       88 (12.5%)  
>         |
  |                                  Urban minor conurbation       83 (11.8%)  
>         |
  |                                  Urban city and town           175 (24.9%) 
>         |
  |                                  Rural town and fringe         193 (27.4%) 
>         |
  |                                  Rural village and dispersed   165 (23.4%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             333 (47.3%) 
>         |
  |                                  1                             371 (52.7%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             33 ( 4.7%)  
>         |
  |                                  1                             129 (18.3%) 
>         |
  |                                  2                             140 (19.9%) 
>         |
  |                                  3                             134 (19.0%) 
>         |
  |                                  4                             140 (19.9%) 
>         |
  |                                  5                             128 (18.2%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  76 (10.8%)  
>         |
  |                                  Current smoker                155 (22.0%) 
>         |
  |                                  Ex-smoker                     98 (13.9%)  
>         |
  |                                  Unknown                       375 (53.3%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        55.41713 (30
> .75805) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       147 (20.9%) 
>         |
  |                                  Underweight                   59 ( 8.4%)  
>         |
  |                                  Healthy range                 129 (18.3%) 
>         |
  |                                  Overweight                    140 (19.9%) 
>         |
  |                                  Obese                         192 (27.3%) 
>         |
  |                                  Morbidly obese                37 ( 5.3%)  
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000003 saved
file ./output/tables/characteristics_ra_hosp_2020.csv saved
(4,804 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                          158    38 |
  |--------------------------------------------|
  | male                             196     0 |
  |--------------------------------------------|
  | Rural Urban in five categories   196     0 |
  |--------------------------------------------|
  | prescribed_biologics             196     0 |
  |--------------------------------------------|
  | imd                              196     0 |
  |--------------------------------------------|
  | smoking                          196     0 |
  |--------------------------------------------|
  | time_ra                           96   100 |
  |--------------------------------------------|
  | bmi_cat                          196     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=196       
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 62 (39.2%)  
>         |
  |                                  41 - 60 years                 60 (38.0%)  
>         |
  |                                  61 - 80 years                 29 (18.4%)  
>         |
  |                                  >80 years                     7 ( 4.4%)   
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        105 (53.6%) 
>         |
  |                                  Male                          91 (46.4%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       21 (10.7%)  
>         |
  |                                  Urban minor conurbation       21 (10.7%)  
>         |
  |                                  Urban city and town           57 (29.1%)  
>         |
  |                                  Rural town and fringe         48 (24.5%)  
>         |
  |                                  Rural village and dispersed   49 (25.0%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             98 (50.0%)  
>         |
  |                                  1                             98 (50.0%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             12 ( 6.1%)  
>         |
  |                                  1                             32 (16.3%)  
>         |
  |                                  2                             35 (17.9%)  
>         |
  |                                  3                             43 (21.9%)  
>         |
  |                                  4                             36 (18.4%)  
>         |
  |                                  5                             38 (19.4%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  21 (10.7%)  
>         |
  |                                  Current smoker                44 (22.4%)  
>         |
  |                                  Ex-smoker                     32 (16.3%)  
>         |
  |                                  Unknown                       99 (50.5%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        55.31973 (32
> .30601) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       42 (21.4%)  
>         |
  |                                  Underweight                   18 ( 9.2%)  
>         |
  |                                  Healthy range                 40 (20.4%)  
>         |
  |                                  Overweight                    31 (15.8%)  
>         |
  |                                  Obese                         57 (29.1%)  
>         |
  |                                  Morbidly obese                8 ( 4.1%)   
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000003 saved
(4,989 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                            8     3 |
  |--------------------------------------------|
  | male                              11     0 |
  |--------------------------------------------|
  | Rural Urban in five categories    11     0 |
  |--------------------------------------------|
  | prescribed_biologics              11     0 |
  |--------------------------------------------|
  | imd                               11     0 |
  |--------------------------------------------|
  | smoking                           11     0 |
  |--------------------------------------------|
  | time_ra                            3     8 |
  |--------------------------------------------|
  | bmi_cat                           11     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=11        
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 2 (25%)     
>         |
  |                                  41 - 60 years                 3 (38%)     
>         |
  |                                  61 - 80 years                 3 (38%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        5 (45%)     
>         |
  |                                  Male                          6 (55%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       1 ( 9%)     
>         |
  |                                  Urban minor conurbation       3 (27%)     
>         |
  |                                  Urban city and town           1 ( 9%)     
>         |
  |                                  Rural town and fringe         2 (18%)     
>         |
  |                                  Rural village and dispersed   4 (36%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             8 (73%)     
>         |
  |                                  1                             3 (27%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             2 (18%)     
>         |
  |                                  1                             3 (27%)     
>         |
  |                                  2                             1 ( 9%)     
>         |
  |                                  3                             3 (27%)     
>         |
  |                                  4                             2 (18%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Current smoker                3 (27%)     
>         |
  |                                  Ex-smoker                     4 (36%)     
>         |
  |                                  Unknown                       4 (36%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        27.33288 (14
> .16489) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       1 ( 9%)     
>         |
  |                                  Underweight                   1 ( 9%)     
>         |
  |                                  Healthy range                 5 (45%)     
>         |
  |                                  Overweight                    3 (27%)     
>         |
  |                                  Obese                         1 ( 9%)     
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000003 saved
(3,238 observations deleted)

  +----------------------------------------------+
  | factor                             N_1   m_1 |
  |----------------------------------------------|
  | age_cat                          1,358   404 |
  |----------------------------------------------|
  | male                             1,762     0 |
  |----------------------------------------------|
  | Rural Urban in five categories   1,762     0 |
  |----------------------------------------------|
  | prescribed_biologics             1,762     0 |
  |----------------------------------------------|
  | imd                              1,762     0 |
  |----------------------------------------------|
  | smoking                          1,762     0 |
  |----------------------------------------------|
  | time_ra                            786   976 |
  |----------------------------------------------|
  | bmi_cat                          1,762     0 |
  +----------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=1,762     
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 480 (35.3%) 
>         |
  |                                  41 - 60 years                 478 (35.2%) 
>         |
  |                                  61 - 80 years                 325 (23.9%) 
>         |
  |                                  >80 years                     75 ( 5.5%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        926 (52.6%) 
>         |
  |                                  Male                          836 (47.4%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       215 (12.2%) 
>         |
  |                                  Urban minor conurbation       214 (12.1%) 
>         |
  |                                  Urban city and town           430 (24.4%) 
>         |
  |                                  Rural town and fringe         441 (25.0%) 
>         |
  |                                  Rural village and dispersed   462 (26.2%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             885 (50.2%) 
>         |
  |                                  1                             877 (49.8%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             65 ( 3.7%)  
>         |
  |                                  1                             360 (20.4%) 
>         |
  |                                  2                             340 (19.3%) 
>         |
  |                                  3                             335 (19.0%) 
>         |
  |                                  4                             339 (19.2%) 
>         |
  |                                  5                             323 (18.3%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  175 ( 9.9%) 
>         |
  |                                  Current smoker                335 (19.0%) 
>         |
  |                                  Ex-smoker                     265 (15.0%) 
>         |
  |                                  Unknown                       987 (56.0%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        55.58903 (31
> .12247) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       351 (19.9%) 
>         |
  |                                  Underweight                   167 ( 9.5%) 
>         |
  |                                  Healthy range                 314 (17.8%) 
>         |
  |                                  Overweight                    352 (20.0%) 
>         |
  |                                  Obese                         476 (27.0%) 
>         |
  |                                  Morbidly obese                102 ( 5.8%) 
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000003 saved
file ./output/tables/characteristics_strata2021.csv saved
(4,896 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                           83    21 |
  |--------------------------------------------|
  | male                             104     0 |
  |--------------------------------------------|
  | Rural Urban in five categories   104     0 |
  |--------------------------------------------|
  | prescribed_biologics             104     0 |
  |--------------------------------------------|
  | imd                              104     0 |
  |--------------------------------------------|
  | smoking                          104     0 |
  |--------------------------------------------|
  | time_ra                           42    62 |
  |--------------------------------------------|
  | bmi_cat                          104     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> -------+
  |                                                                Total       
>        |
  |----------------------------------------------------------------------------
> -------|
  |                                                                N=104       
>        |
  |----------------------------------------------------------------------------
> -------|
  | age_cat                          18 - 40 years                 35 (42%)    
>        |
  |                                  41 - 60 years                 22 (27%)    
>        |
  |                                  61 - 80 years                 23 (28%)    
>        |
  |                                  >80 years                     3 ( 4%)     
>        |
  |----------------------------------------------------------------------------
> -------|
  | male                             Female                        59 (56.7%)  
>        |
  |                                  Male                          45 (43.3%)  
>        |
  |----------------------------------------------------------------------------
> -------|
  | Rural Urban in five categories   Urban major conurbation       14 (13.5%)  
>        |
  |                                  Urban minor conurbation       14 (13.5%)  
>        |
  |                                  Urban city and town           27 (26.0%)  
>        |
  |                                  Rural town and fringe         22 (21.2%)  
>        |
  |                                  Rural village and dispersed   27 (26.0%)  
>        |
  |----------------------------------------------------------------------------
> -------|
  | prescribed_biologics             0                             53 (51.0%)  
>        |
  |                                  1                             51 (49.0%)  
>        |
  |----------------------------------------------------------------------------
> -------|
  | imd                              0                             4 ( 3.8%)   
>        |
  |                                  1                             27 (26.0%)  
>        |
  |                                  2                             20 (19.2%)  
>        |
  |                                  3                             14 (13.5%)  
>        |
  |                                  4                             21 (20.2%)  
>        |
  |                                  5                             18 (17.3%)  
>        |
  |----------------------------------------------------------------------------
> -------|
  | smoking                          Never smoked                  7 ( 6.7%)   
>        |
  |                                  Current smoker                25 (24.0%)  
>        |
  |                                  Ex-smoker                     16 (15.4%)  
>        |
  |                                  Unknown                       56 (53.8%)  
>        |
  |----------------------------------------------------------------------------
> -------|
  | time_ra                                                        61.36495 (29
> .7199) |
  |----------------------------------------------------------------------------
> -------|
  | bmi_cat                          Missing                       27 (26.0%)  
>        |
  |                                  Underweight                   9 ( 8.7%)   
>        |
  |                                  Healthy range                 18 (17.3%)  
>        |
  |                                  Overweight                    21 (20.2%)  
>        |
  |                                  Obese                         23 (22.1%)  
>        |
  |                                  Morbidly obese                6 ( 5.8%)   
>        |
  +----------------------------------------------------------------------------
> -------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000003 saved
(4,304 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                          554   142 |
  |--------------------------------------------|
  | male                             696     0 |
  |--------------------------------------------|
  | Rural Urban in five categories   696     0 |
  |--------------------------------------------|
  | prescribed_biologics             696     0 |
  |--------------------------------------------|
  | imd                              696     0 |
  |--------------------------------------------|
  | smoking                          696     0 |
  |--------------------------------------------|
  | time_ra                          294   402 |
  |--------------------------------------------|
  | bmi_cat                          696     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> -------+
  |                                                                Total       
>        |
  |----------------------------------------------------------------------------
> -------|
  |                                                                N=696       
>        |
  |----------------------------------------------------------------------------
> -------|
  | age_cat                          18 - 40 years                 213 (38.4%) 
>        |
  |                                  41 - 60 years                 184 (33.2%) 
>        |
  |                                  61 - 80 years                 131 (23.6%) 
>        |
  |                                  >80 years                     26 ( 4.7%)  
>        |
  |----------------------------------------------------------------------------
> -------|
  | male                             Female                        379 (54.5%) 
>        |
  |                                  Male                          317 (45.5%) 
>        |
  |----------------------------------------------------------------------------
> -------|
  | Rural Urban in five categories   Urban major conurbation       97 (13.9%)  
>        |
  |                                  Urban minor conurbation       78 (11.2%)  
>        |
  |                                  Urban city and town           172 (24.7%) 
>        |
  |                                  Rural town and fringe         181 (26.0%) 
>        |
  |                                  Rural village and dispersed   168 (24.1%) 
>        |
  |----------------------------------------------------------------------------
> -------|
  | prescribed_biologics             0                             352 (50.6%) 
>        |
  |                                  1                             344 (49.4%) 
>        |
  |----------------------------------------------------------------------------
> -------|
  | imd                              0                             38 ( 5.5%)  
>        |
  |                                  1                             146 (21.0%) 
>        |
  |                                  2                             141 (20.3%) 
>        |
  |                                  3                             133 (19.1%) 
>        |
  |                                  4                             111 (15.9%) 
>        |
  |                                  5                             127 (18.2%) 
>        |
  |----------------------------------------------------------------------------
> -------|
  | smoking                          Never smoked                  84 (12.1%)  
>        |
  |                                  Current smoker                130 (18.7%) 
>        |
  |                                  Ex-smoker                     97 (13.9%)  
>        |
  |                                  Unknown                       385 (55.3%) 
>        |
  |----------------------------------------------------------------------------
> -------|
  | time_ra                                                        54.90746 (33
> .9524) |
  |----------------------------------------------------------------------------
> -------|
  | bmi_cat                          Missing                       146 (21.0%) 
>        |
  |                                  Underweight                   58 ( 8.3%)  
>        |
  |                                  Healthy range                 138 (19.8%) 
>        |
  |                                  Overweight                    122 (17.5%) 
>        |
  |                                  Obese                         194 (27.9%) 
>        |
  |                                  Morbidly obese                38 ( 5.5%)  
>        |
  +----------------------------------------------------------------------------
> -------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000003 saved
file ./output/tables/characteristics_ra_hosp_2021.csv saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/outpatients.log
  log type:  text
 closed on:  15 Dec 2022, 15:04:34
-------------------------------------------------------------------------------
