
. 
. cap mkdir ./output/tables/

. cap mkdir ./output/tempdata

. 
. * Import data
. import delimited using ./output/input.csv
(59 vars, 10,000 obs)

. * Check data
. count if age==. 
  0

. count if age<18 
  2,117

. count if age>110 & age!=.
  0

. sum age, d

                             age
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            4              0
10%            8              0       Obs              10,000
25%           21              0       Sum of Wgt.      10,000

50%           40                      Mean            40.6264
                        Largest       Std. Dev.      23.79358
75%           59            101
90%           73            101       Variance       566.1346
95%           79            103       Skewness        .117835
99%           90            104       Kurtosis        2.03677

. count if sex==""
  0

. tab sex

        sex |      Freq.     Percent        Cum.
------------+-----------------------------------
          F |      5,022       50.22       50.22
          M |      4,896       48.96       99.18
          U |         82        0.82      100.00
------------+-----------------------------------
      Total |     10,000      100.00

. * Checking RA algorithm variables
. * Checking type of DMARD that meets inclusion
. foreach dmard in metho leflu sulfa hydrox {
  2.     gen `dmard'_multi = (`dmard'_count>=2)
  3.     tab `dmard'_multi if has_dmards==1, m
  4. }

metho_multi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        817       16.34       16.34
          1 |      4,183       83.66      100.00
------------+-----------------------------------
      Total |      5,000      100.00

leflu_multi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        815       16.30       16.30
          1 |      4,185       83.70      100.00
------------+-----------------------------------
      Total |      5,000      100.00

sulfa_multi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        807       16.14       16.14
          1 |      4,193       83.86      100.00
------------+-----------------------------------
      Total |      5,000      100.00

hydrox_mult |
          i |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        809       16.18       16.18
          1 |      4,191       83.82      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. gen dmard_multi = (metho_multi==1 | leflu_multi==1 | sulfa_multi==1 | hydrox_
> multi==1)

. tab dmard_multi has_alt_dmard_diag

dmard_mult |  has_alt_dmard_diag
         i |         0          1 |     Total
-----------+----------------------+----------
         0 |         4          3 |         7 
         1 |     4,996      4,997 |     9,993 
-----------+----------------------+----------
     Total |     5,000      5,000 |    10,000 

. sum number_ra_codes

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
number_ra_~s |     10,000      2.5003    1.030779          0          7

. di "Number where no DMARDs but does have multiple RA codes and no alt diag"
Number where no DMARDs but does have multiple RA codes and no alt diag

. count if has_dmards==0 & number_ra_codes>=2 & alt_diag!=1
  2,083

. tab has_ra, m

     has_ra |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,000       50.00       50.00
          1 |      5,000       50.00      100.00
------------+-----------------------------------
      Total |     10,000      100.00

. keep if has_ra
(5,000 observations deleted)

. * Time since first RA code
. gen first_ra_codeA = date(first_ra_code, "YMD")
(2,779 missing values generated)

. format first_ra_codeA %dD/N/CY

. gen time_ra = (date("01Mar2019", "DMY") - first_ra_codeA)/365.25
(2,779 missing values generated)

. sum time_ra, d

                           time_ra
-------------------------------------------------------------
      Percentiles      Smallest
 1%     1.483915      -.0766598
 5%     6.078029       .0273785
10%     11.55099       .1013005       Obs               2,221
25%     27.34292       .1505818       Sum of Wgt.       2,221

50%     54.14648                      Mean           54.57402
                        Largest       Std. Dev.      31.48369
75%     81.31417       109.7522
90%     98.95414        109.755       Variance       991.2228
95%     103.4114       109.8919       Skewness       .0345982
99%     108.5804        109.963       Kurtosis        1.79589

. sum number_ra_codes, d

                       number_ra_codes
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            3                      Mean              2.504
                        Largest       Std. Dev.      1.024595
75%            3              6
90%            4              6       Variance       1.049794
95%            4              6       Skewness       .0466896
99%            5              6       Kurtosis       2.942373

. sum metho_count, d

                         metho_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            2                      Mean             2.4812
                        Largest       Std. Dev.      1.025991
75%            3              6
90%            4              6       Variance       1.052657
95%            4              6       Skewness      -.0188344
99%            5              6       Kurtosis       2.935365

. sum sulfa_count, d 

                         sulfa_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            3                      Mean             2.5108
                        Largest       Std. Dev.      1.064758
75%            3              6
90%            4              6       Variance        1.13371
95%            4              6       Skewness       .0140656
99%            5              6       Kurtosis       2.868943

. sum leflu_count, d 

                         leflu_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            3                      Mean              2.505
                        Largest       Std. Dev.      1.042589
75%            3              6
90%            4              6       Variance       1.086992
95%            4              6       Skewness       .0513248
99%            5              6       Kurtosis       2.879715

. sum hydrox_count, d 

                        hydrox_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            3                      Mean             2.5038
                        Largest       Std. Dev.      1.032181
75%            3              5
90%            4              5       Variance       1.065399
95%            4              6       Skewness       .0149241
99%            5              6       Kurtosis       2.862066

. 
. sum outpatient*, d

                    outpatient_appt_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            2              0       Obs               5,000
25%            6              0       Sum of Wgt.       5,000

50%            7                      Mean             6.7918
                        Largest       Std. Dev.      2.914336
75%            9             14
90%           10             14       Variance       8.493351
95%           11             14       Skewness      -.8949705
99%           12             15       Kurtosis       3.549586

                    outpatient_appt_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            3              0       Obs               5,000
25%            6              0       Sum of Wgt.       5,000

50%            7                      Mean             6.8418
                        Largest       Std. Dev.      2.929657
75%            9             14
90%           10             16       Variance       8.582889
95%           11             16       Skewness      -.8514817
99%           12             17       Kurtosis       3.632672

                    outpatient_appt_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            2              0       Obs               5,000
25%            6              0       Sum of Wgt.       5,000

50%            7                      Mean             6.7586
                        Largest       Std. Dev.      2.935788
75%            9             13
90%           10             14       Variance        8.61885
95%           11             14       Skewness      -.8806147
99%           12             15       Kurtosis        3.50373

                    outpatient_appt_2022
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            2              0       Obs               5,000
25%            6              0       Sum of Wgt.       5,000

50%            7                      Mean             6.7854
                        Largest       Std. Dev.       2.93603
75%            9             13
90%           10             14       Variance       8.620271
95%           11             14       Skewness      -.8526395
99%           12             16       Kurtosis        3.53315

                   outpatient_medium_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               2,462
25%            2              1       Sum of Wgt.       2,462

50%            5                      Mean            13.3554
                        Largest       Std. Dev.      28.04902
75%            7             98
90%            8             98       Variance       786.7477
95%           98             98       Skewness       2.664124
99%           98             98       Kurtosis       8.173425

                   outpatient_medium_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               2,507
25%            2              1       Sum of Wgt.       2,507

50%            4                      Mean           14.34025
                        Largest       Std. Dev.      29.45731
75%            7             98
90%           98             98       Variance       867.7329
95%           98             98       Skewness       2.470052
99%           98             98       Kurtosis        7.15957

                   outpatient_medium_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               2,467
25%            2              1       Sum of Wgt.       2,467

50%            4                      Mean            13.7726
                        Largest       Std. Dev.      28.69504
75%            7             98
90%           98             98       Variance       823.4053
95%           98             98       Skewness       2.574492
99%           98             98       Kurtosis       7.695171

                   outpatient_medium_2022
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               2,519
25%            2              1       Sum of Wgt.       2,519

50%            5                      Mean           12.31798
                        Largest       Std. Dev.      26.54599
75%            7             98
90%            8             98       Variance       704.6896
95%           98             98       Skewness       2.891663
99%           98             98       Kurtosis       9.455787

                  outpatient_appt_all_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            2              0       Obs               5,000
25%            6              0       Sum of Wgt.       5,000

50%            7                      Mean              6.758
                        Largest       Std. Dev.      2.945636
75%            9             13
90%           10             14       Variance       8.676771
95%           11             14       Skewness      -.8469414
99%           12             14       Kurtosis        3.44574

                  outpatient_appt_all_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            2              0       Obs               5,000
25%            6              0       Sum of Wgt.       5,000

50%            7                      Mean             6.7268
                        Largest       Std. Dev.      2.928528
75%            9             14
90%           10             14       Variance       8.576277
95%           11             14       Skewness      -.8627214
99%           12             14       Kurtosis       3.505031

                  outpatient_appt_all_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%           .5              0       Obs               5,000
25%            6              0       Sum of Wgt.       5,000

50%            7                      Mean             6.7332
                        Largest       Std. Dev.      2.933827
75%            9             14
90%           10             14       Variance       8.607339
95%           11             14       Skewness      -.8674822
99%           12             15       Kurtosis       3.511198

                  outpatient_appt_all_2022
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            2              0       Obs               5,000
25%            6              0       Sum of Wgt.       5,000

50%            7                      Mean             6.7616
                        Largest       Std. Dev.      2.916379
75%            9             13
90%           10             14       Variance       8.505266
95%           11             14       Skewness      -.8741775
99%           12             14       Kurtosis       3.534525

. 
. forvalues i=2019/2021 {
  2.     sum ra_hosp_beddays_`i' if ra_hosp_`i'>0, d 
  3. }

                    ra_hosp_beddays_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               4,889
25%            2              0       Sum of Wgt.       4,889

50%            2                      Mean           2.491921
                        Largest       Std. Dev.      1.053784
75%            3              5
90%            4              6       Variance        1.11046
95%            4              6       Skewness       .0543233
99%            5              6       Kurtosis       2.860223

                    ra_hosp_beddays_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               4,879
25%            2              0       Sum of Wgt.       4,879

50%            2                      Mean             2.4876
                        Largest       Std. Dev.      1.041079
75%            3              6
90%            4              6       Variance       1.083846
95%            4              6       Skewness       .1191147
99%            5              6       Kurtosis       2.784124

                    ra_hosp_beddays_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               4,880
25%            2              0       Sum of Wgt.       4,880

50%            2                      Mean           2.491803
                        Largest       Std. Dev.      1.019755
75%            3              6
90%            4              6       Variance         1.0399
95%            4              6       Skewness       .0529181
99%            5              6       Kurtosis       2.909354

. 
. 
. * How many people are not on DMARDs and have no RA appointments?
. 
. * Format variables
. *re-order ethnicity
.  gen eth5=1 if ethnicity==1
(4,070 missing values generated)

.  replace eth5=2 if ethnicity==3
(971 real changes made)

.  replace eth5=3 if ethnicity==4
(1,043 real changes made)

.  replace eth5=4 if ethnicity==2
(1,041 real changes made)

.  replace eth5=5 if ethnicity==5
(1,015 real changes made)

.  replace eth5=6 if ethnicity==0
(0 real changes made)

. 
.  label define eth5                      1 "White"                            
>            ///
>                                                         2 "South Asian"      
>                    ///                                             
>                                                         3 "Black"            
>                            ///
>                                                         4 "Mixed"            
>                            ///
>                                                         5 "Other"            
>        ///
>                             6 "Missing"                                 

.                                         
. 
. label values eth5 eth5

. safetab eth5, m
5

       eth5 |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |        930       18.60       18.60
South Asian |        971       19.42       38.02
      Black |      1,043       20.86       58.88
      Mixed |      1,041       20.82       79.70
      Other |      1,015       20.30      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. 
. * formatting gender
. gen male=(sex=="M")

. replace male = 0 if sex == "F"
(0 real changes made)

. label define male 0"Female" 1"Male"

. label values male male

. safetab male, miss
5

       male |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |      2,643       52.86       52.86
       Male |      2,357       47.14      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. 
. *create a 4 category rural urban variable 
. generate urban_rural_5=.
(5,000 missing values generated)

. la var urban_rural_5 "Rural Urban in five categories"

. replace urban_rural_5=1 if urban_rural==1
(607 real changes made)

. replace urban_rural_5=2 if urban_rural==2
(631 real changes made)

. replace urban_rural_5=3 if urban_rural==3|urban_rural==4
(1,250 real changes made)

. replace urban_rural_5=4 if urban_rural==5|urban_rural==6
(1,238 real changes made)

. replace urban_rural_5=5 if urban_rural==7|urban_rural==8
(1,274 real changes made)

. label define urban_rural_5 1 "Urban major conurbation" 2 "Urban minor conurba
> tion" 3 "Urban city and town" 4 "Rural town and fringe" 5 "Rural village and 
> dispersed"

. label values urban_rural_5 urban_rural_5

. safetab urban_rural_5, miss
14

        Rural Urban in five |
                 categories |      Freq.     Percent        Cum.
----------------------------+-----------------------------------
    Urban major conurbation |        607       12.14       12.14
    Urban minor conurbation |        631       12.62       24.76
        Urban city and town |      1,250       25.00       49.76
      Rural town and fringe |      1,238       24.76       74.52
Rural village and dispersed |      1,274       25.48      100.00
----------------------------+-----------------------------------
                      Total |      5,000      100.00

. 
. *generate a binary rural urban (with missing assigned to urban)
. generate urban_rural_bin=.
(5,000 missing values generated)

. replace urban_rural_bin=1 if urban_rural<=4|urban_rural==.
(2,488 real changes made)

. replace urban_rural_bin=0 if urban_rural>4 & urban_rural!=.
(2,512 real changes made)

. label define urban_rural_bin 0 "Rural" 1 "Urban"

. label values urban_rural_bin urban_rural_bin

. safetab urban_rural_bin urban_rural, miss
28

urban_rura |                      urban_rural
     l_bin |         1          2          3          4          5 |     Total
-----------+-------------------------------------------------------+----------
     Rural |         0          0          0          0        605 |     2,512 
     Urban |       607        631        615        635          0 |     2,488 
-----------+-------------------------------------------------------+----------
     Total |       607        631        615        635        605 |     5,000 


urban_rura |           urban_rural
     l_bin |         6          7          8 |     Total
-----------+---------------------------------+----------
     Rural |       633        648        626 |     2,512 
     Urban |         0          0          0 |     2,488 
-----------+---------------------------------+----------
     Total |       633        648        626 |     5,000 

. label var urban_rural_bin "Rural-Urban"

. 
. * Make missing category for region
. replace region = "missing" if region==""
(0 real changes made)

. * Make numeric region variable 
. gen region_n = 1 if region=="East Midlands"
(4,500 missing values generated)

. replace region_n = 2 if region=="East"
(0 real changes made)

. replace region_n = 3 if region=="London"
(997 real changes made)

. replace region_n = 4 if region=="North East"
(479 real changes made)

. replace region_n = 5 if region=="North West"
(520 real changes made)

. replace region_n = 6 if region=="South East"
(1,001 real changes made)

. replace region_n = 7 if region=="South West"
(0 real changes made)

. replace region_n = 8 if region=="West Midlands"
(481 real changes made)

. replace region_n = 9 if region=="Yorkshire and The Humber"
(0 real changes made)

. tab region*, m 

                      |                  region_n
               region |         1          3          4          5 |     Total
----------------------+--------------------------------------------+----------
        East Midlands |       500          0          0          0 |       500 
      East of England |         0          0          0          0 |       504 
               London |         0        997          0          0 |       997 
           North East |         0          0        479          0 |       479 
           North West |         0          0          0        520 |       520 
           South East |         0          0          0          0 |     1,001 
        West Midlands |         0          0          0          0 |       481 
Yorkshire and the H.. |         0          0          0          0 |       518 
----------------------+--------------------------------------------+----------
                Total |       500        997        479        520 |     5,000 


                      |             region_n
               region |         6          8          . |     Total
----------------------+---------------------------------+----------
        East Midlands |         0          0          0 |       500 
      East of England |         0          0        504 |       504 
               London |         0          0          0 |       997 
           North East |         0          0          0 |       479 
           North West |         0          0          0 |       520 
           South East |     1,001          0          0 |     1,001 
        West Midlands |         0        481          0 |       481 
Yorkshire and the H.. |         0          0        518 |       518 
----------------------+---------------------------------+----------
                Total |     1,001        481      1,022 |     5,000 

. 
. * Define age categories
. * Create age categories
. egen age_cat = cut(age), at(18, 40, 60, 80, 120) icodes
(1052 missing values generated)

. label define age 0 "18 - 40 years" 1 "41 - 60 years" 2 "61 - 80 years" 3 ">80
>  years"

. label values age_cat age

. safetab age_cat, miss
8

      age_cat |      Freq.     Percent        Cum.
--------------+-----------------------------------
18 - 40 years |      1,350       27.00       27.00
41 - 60 years |      1,379       27.58       54.58
61 - 80 years |        992       19.84       74.42
    >80 years |        227        4.54       78.96
            . |      1,052       21.04      100.00
--------------+-----------------------------------
        Total |      5,000      100.00

. 
. * Smoking status
. gen smoking = 0 if smoking_status=="N"
(4,482 missing values generated)

. replace smoking = 1 if smoking_status=="S"
(1,006 real changes made)

. replace smoking = 2 if smoking_status=="E"
(703 real changes made)

. replace smoking = 3 if smoking==.
(2,773 real changes made)

. 
. label define smok 1 "Current smoker" 2 "Ex-smoker" 0 "Never smoked" 3 "Unknow
> n"

. label values smoking smok

. 
. * BMI categories
. egen bmi_cat = cut(bmi), at(0, 1, 18.5, 24.9, 29.9, 39.9, 100) icodes
(3 missing values generated)

. bys bmi_cat: sum bmi

-------------------------------------------------------------------------------
-> bmi_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |      1,013    .0003145    .0100107          0   .3186179

-------------------------------------------------------------------------------
-> bmi_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        478    14.31061    3.641102    1.14713   18.48494

-------------------------------------------------------------------------------
-> bmi_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        920    22.07708    1.778393   18.50047   24.89973

-------------------------------------------------------------------------------
-> bmi_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        956    27.33867    1.458545   24.90396   29.89468

-------------------------------------------------------------------------------
-> bmi_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |      1,351    34.09377      2.7436   29.90174   39.89446

-------------------------------------------------------------------------------
-> bmi_cat = 5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        279    43.45357     3.00785    39.9354   59.54821

-------------------------------------------------------------------------------
-> bmi_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |          3   -1.942769    1.894358   -4.06536  -.4237104


. * add missing . to zero category
. replace bmi_cat = 0 if bmi_cat==. 
(3 real changes made)

. label define bmi 0 "Missing" 1 "Underweight" 2 "Healthy range" 3 "Overweight"
>  4 "Obese" 5 "Morbidly obese"

. label values bmi_cat bmi

. 
. * Determine if still in follow-up for each year
. * Format dates
. gen died_fuA = date(died_fu, "YMD")
(2,503 missing values generated)

. gen dereg_dateA = date(dereg_date, "YMD")
(2,470 missing values generated)

. gen end_fu = date("`j'-03-31", "YMD")
(5,000 missing values generated)

. gen end_date = min(died_fuA, dereg_dateA, end_fu)
(1,257 missing values generated)

. drop end_fu

. sum end_date

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    end_date |      3,743    22585.33    389.4357      21976      23356

. di "Number where end date prior to follow-up start"
Number where end date prior to follow-up start

. count if end_date<date("2019-04-01", "YMD")
  0

. * determine range of dates for outpatient appointments to determine which sho
> uld be dropped
. gen end_2020 = end_date<date("2020-03-31", "YMD")

. gen end_2021 = end_date<date("2021-03-31", "YMD") 

. gen end_2022 = end_date<date("2022-03-31", "YMD") 

. gen end_2023 = end_date<date("2023-03-31", "YMD") 

. tab end_2020

   end_2020 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,903       98.06       98.06
          1 |         97        1.94      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. tab end_2021

   end_2021 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,648       72.96       72.96
          1 |      1,352       27.04      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. tab end_2022

   end_2022 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,614       52.28       52.28
          1 |      2,386       47.72      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. tab end_2023

   end_2023 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,746       34.92       34.92
          1 |      3,254       65.08      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. 
. * Set outpatient appointment count to missing if end prior to the end of the 
> year 
. forvalues i=2019/2022 {
  2.     local j=`i'+1
  3.     di `j'
  4.     gen op_appt_`i'_orig = outpatient_appt_`i'
  5.     replace outpatient_appt_`i'=. if end_`j'
  6.     *gen op_medium_`i'_orig = outpatient_medium_`i'
.     *replace outpatient_medium_`i'=. if end_`j'
.     gen op_appt_all_`i'_orig = outpatient_appt_all_`i'
  7.     replace outpatient_appt_all_`i'=. if end_`j'
  8. }
2020
(97 real changes made, 97 to missing)
(97 real changes made, 97 to missing)
2021
(1,352 real changes made, 1,352 to missing)
(1,352 real changes made, 1,352 to missing)
2022
(2,386 real changes made, 2,386 to missing)
(2,386 real changes made, 2,386 to missing)
2023
(3,254 real changes made, 3,254 to missing)
(3,254 real changes made, 3,254 to missing)

. 
. 
. * Categorise number of outpatient appointments
. label define appt 0 "No appointments" 1 "1-2 per year" 2 "3 or more per year"
>  

. forvalues i=2019/2022 {
  2.     * Rheumatology outpatient appointments
.     egen op_appt_`i'_cat = cut(outpatient_appt_`i'), at(0, 1, 3, 1000) icodes
  3.     * Check all categorised
.     bys op_appt_`i'_cat: sum outpatient_appt_`i'
  4.     label values op_appt_`i'_cat appt
  5.     * Same for orginal variables
.     egen op_appt_`i'_orig_cat = cut(op_appt_`i'_orig), at(0, 1, 3, 1000) icod
> es
  6.     * Check all categorised
.     bys op_appt_`i'_orig_cat: sum op_appt_`i'_orig
  7.     label values op_appt_`i'_orig_cat appt
  8.     }
(97 missing values generated)

-------------------------------------------------------------------------------
-> op_appt_2019_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2019 |        458           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_2019_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2019 |         30         1.8    .4068381          1          2

-------------------------------------------------------------------------------
-> op_appt_2019_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2019 |      4,415    7.540204    1.955127          3         15

-------------------------------------------------------------------------------
-> op_appt_2019_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2019 |          0


-------------------------------------------------------------------------------
-> op_appt_2019_orig_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2019_orig |        475           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_2019_orig_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2019_orig |         30         1.8    .4068381          1          2

-------------------------------------------------------------------------------
-> op_appt_2019_orig_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2019_orig |      4,495    7.542825    1.959736          3         15

(1352 missing values generated)

-------------------------------------------------------------------------------
-> op_appt_2020_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2020 |        340           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_2020_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2020 |         16      1.8125    .4031129          1          2

-------------------------------------------------------------------------------
-> op_appt_2020_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2020 |      3,292    7.569563    1.965447          3         17

-------------------------------------------------------------------------------
-> op_appt_2020_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2020 |          0


-------------------------------------------------------------------------------
-> op_appt_2020_orig_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2020_orig |        472           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_2020_orig_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2020_orig |         21    1.809524    .4023739          1          2

-------------------------------------------------------------------------------
-> op_appt_2020_orig_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2020_orig |      4,507    7.581762    1.988015          3         17

(2386 missing values generated)

-------------------------------------------------------------------------------
-> op_appt_2021_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2021 |        239           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_2021_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2021 |         13    1.769231     .438529          1          2

-------------------------------------------------------------------------------
-> op_appt_2021_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2021 |      2,362    7.582134    1.940732          3         15

-------------------------------------------------------------------------------
-> op_appt_2021_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2021 |          0


-------------------------------------------------------------------------------
-> op_appt_2021_orig_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2021_orig |        494           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_2021_orig_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2021_orig |         26    1.846154    .3679465          1          2

-------------------------------------------------------------------------------
-> op_appt_2021_orig_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2021_orig |      4,480    7.532366    1.960044          3         15

(3254 missing values generated)

-------------------------------------------------------------------------------
-> op_appt_2022_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2022 |        167           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_2022_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2022 |          9    1.666667          .5          1          2

-------------------------------------------------------------------------------
-> op_appt_2022_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2022 |      1,570    7.524841    1.969417          3         13

-------------------------------------------------------------------------------
-> op_appt_2022_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2022 |          0


-------------------------------------------------------------------------------
-> op_appt_2022_orig_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2022_orig |        484           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_2022_orig_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2022_orig |         24    1.791667    .4148511          1          2

-------------------------------------------------------------------------------
-> op_appt_2022_orig_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2022_orig |      4,492    7.543188     1.98113          3         16


. 
. * Calculate difference in rheumatology appointments compared to 2019
. gen diff_op_2020 = outpatient_appt_2020 - outpatient_appt_2019
(1,352 missing values generated)

. gen diff_op_2021 = outpatient_appt_2021 - outpatient_appt_2019
(2,386 missing values generated)

. gen diff_op_2022 = outpatient_appt_2022 - outpatient_appt_2019
(3,254 missing values generated)

. sum diff_op_2020 diff_op_2021 diff_op_2022, d

                        diff_op_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%          -10            -14
 5%           -7            -13
10%           -5            -13       Obs               3,648
25%           -2            -12       Sum of Wgt.       3,648

50%            0                      Mean           .0345395
                        Largest       Std. Dev.      4.160729
75%            2             12
90%            5             12       Variance       17.31167
95%            7             12       Skewness      -.0150166
99%           10             13       Kurtosis       3.345394

                        diff_op_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%          -10            -12
 5%           -7            -12
10%           -5            -12       Obs               2,614
25%           -2            -12       Sum of Wgt.       2,614

50%            0                      Mean           .0768936
                        Largest       Std. Dev.      4.078898
75%            2             11
90%            5             11       Variance       16.63741
95%            7             12       Skewness      -.0508697
99%           10             12       Kurtosis       3.287085

                        diff_op_2022
-------------------------------------------------------------
      Percentiles      Smallest
 1%          -10            -12
 5%           -7            -12
10%           -5            -11       Obs               1,746
25%           -2            -11       Sum of Wgt.       1,746

50%            0                      Mean           .0572738
                        Largest       Std. Dev.      4.198941
75%            3             11
90%            6             12       Variance        17.6311
95%            7             12       Skewness        .031153
99%           10             12       Kurtosis       3.179755

. 
. * Identify people with no appointments in either year flag them and set diffe
> rence to missing
. forvalues i=2020/2022 {
  2.     gen no_appts_`i' = diff_op_`i'==0 & op_appt_`i'_cat==0
  3.     tab no_appts_`i' op_appt_`i'_cat
  4.     replace diff_op_`i'=. if no_appts_`i'==1
  5. }

no_appts_2 |         op_appt_2020_cat
       020 | No appoin  1-2 per y  3 or more |     Total
-----------+---------------------------------+----------
         0 |       307         16      3,292 |     3,615 
         1 |        33          0          0 |        33 
-----------+---------------------------------+----------
     Total |       340         16      3,292 |     3,648 
(33 real changes made, 33 to missing)

no_appts_2 |         op_appt_2021_cat
       021 | No appoin  1-2 per y  3 or more |     Total
-----------+---------------------------------+----------
         0 |       214         13      2,362 |     2,589 
         1 |        25          0          0 |        25 
-----------+---------------------------------+----------
     Total |       239         13      2,362 |     2,614 
(25 real changes made, 25 to missing)

no_appts_2 |         op_appt_2022_cat
       022 | No appoin  1-2 per y  3 or more |     Total
-----------+---------------------------------+----------
         0 |       150          9      1,570 |     1,729 
         1 |        17          0          0 |        17 
-----------+---------------------------------+----------
     Total |       167          9      1,570 |     1,746 
(17 real changes made, 17 to missing)

. 
. * Identify of people with appointments whether they had fewer appointments 
. forvalues i=2020/2022 {
  2.     gen fewer_appts_`i' = (diff_op_`i' < 0) if diff_op_`i'!=.
  3.     tab fewer_appts_`i' no_appts_`i'
  4. }
(1,385 missing values generated)

           | no_appts_2
fewer_appt |    020
    s_2020 |         0 |     Total
-----------+-----------+----------
         0 |     2,032 |     2,032 
         1 |     1,583 |     1,583 
-----------+-----------+----------
     Total |     3,615 |     3,615 
(2,411 missing values generated)

           | no_appts_2
fewer_appt |    021
    s_2021 |         0 |     Total
-----------+-----------+----------
         0 |     1,488 |     1,488 
         1 |     1,101 |     1,101 
-----------+-----------+----------
     Total |     2,589 |     2,589 
(3,271 missing values generated)

           | no_appts_2
fewer_appt |    022
    s_2022 |         0 |     Total
-----------+-----------+----------
         0 |       946 |       946 
         1 |       783 |       783 
-----------+-----------+----------
     Total |     1,729 |     1,729 

. 
. * Categorise number of outpatient appointments (all specialties)
. label define appt_all 0 "No appointments" 1 "1-2 per year" 2 "3-5 per year" 3
>  "6 or more per year"

. forvalues i=2019/2022 {
  2.     sum outpatient_appt_all_`i', d
  3.     egen op_appt_all_`i'_cat = cut(outpatient_appt_all_`i'), at(0, 1, 3, 6
> , 1000) icodes
  4.     * Check all categorised
.     bys op_appt_all_`i'_cat: sum outpatient_appt_all_`i'
  5.     label values op_appt_all_`i'_cat appt_all
  6.     * Same for orginal variables
.     egen op_appt_all_`i'_orig_cat = cut(op_appt_all_`i'_orig), at(0, 1, 3, 6,
>  1000) icodes
  7.     * Check all categorised
.     bys op_appt_all_`i'_orig_cat: sum op_appt_all_`i'_orig
  8.     label values op_appt_all_`i'_orig_cat appt_all
  9.     }

                  outpatient_appt_all_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            2              0       Obs               4,903
25%            6              0       Sum of Wgt.       4,903

50%            7                      Mean           6.762798
                        Largest       Std. Dev.       2.93723
75%            9             13
90%           10             14       Variance       8.627322
95%           11             14       Skewness      -.8494345
99%           12             14       Kurtosis       3.464395
(97 missing values generated)

-------------------------------------------------------------------------------
-> op_appt_all_2019_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2019 |        474           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_all_2019_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2019 |         28    1.857143    .3563483          1          2

-------------------------------------------------------------------------------
-> op_appt_all_2019_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2019 |        689    4.490566    .6927665          3          5

-------------------------------------------------------------------------------
-> op_appt_all_2019_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2019 |      3,712    8.085129    1.604788          6         14

-------------------------------------------------------------------------------
-> op_appt_all_2019_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2019 |          0


-------------------------------------------------------------------------------
-> op_appt_all_2019_orig_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2019_orig |        488           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_all_2019_orig_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2019_orig |         28    1.857143    .3563483          1          2

-------------------------------------------------------------------------------
-> op_appt_all_2019_orig_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2019_orig |        703    4.489331    .6935498          3          5

-------------------------------------------------------------------------------
-> op_appt_all_2019_orig_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2019_orig |      3,781    8.088336    1.607234          6         14


                  outpatient_appt_all_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               3,648
25%            6              0       Sum of Wgt.       3,648

50%            7                      Mean           6.722039
                        Largest       Std. Dev.      2.941536
75%            9             14
90%           10             14       Variance       8.652632
95%           11             14       Skewness      -.8690751
99%           12             14       Kurtosis       3.503868
(1352 missing values generated)

-------------------------------------------------------------------------------
-> op_appt_all_2020_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2020 |        370           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_all_2020_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2020 |         16      1.9375         .25          1          2

-------------------------------------------------------------------------------
-> op_appt_all_2020_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2020 |        500        4.49     .706327          3          5

-------------------------------------------------------------------------------
-> op_appt_all_2020_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2020 |      2,762    8.054308    1.572566          6         14

-------------------------------------------------------------------------------
-> op_appt_all_2020_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2020 |          0


-------------------------------------------------------------------------------
-> op_appt_all_2020_orig_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2020_orig |        495           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_all_2020_orig_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2020_orig |         26    1.884615    .3258126          1          2

-------------------------------------------------------------------------------
-> op_appt_all_2020_orig_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2020_orig |        709    4.509168    .6921579          3          5

-------------------------------------------------------------------------------
-> op_appt_all_2020_orig_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2020_orig |      3,770    8.060477    1.573377          6         14


                  outpatient_appt_all_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            2              0       Obs               2,614
25%            6              0       Sum of Wgt.       2,614

50%            7                      Mean           6.701607
                        Largest       Std. Dev.      2.919985
75%            9             13
90%           10             14       Variance       8.526312
95%           11             14       Skewness      -.8605219
99%           12             14       Kurtosis       3.482404
(2386 missing values generated)

-------------------------------------------------------------------------------
-> op_appt_all_2021_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2021 |        259           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_all_2021_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2021 |         13    1.846154    .3755338          1          2

-------------------------------------------------------------------------------
-> op_appt_all_2021_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2021 |        376    4.507979    .6612636          3          5

-------------------------------------------------------------------------------
-> op_appt_all_2021_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2021 |      1,966    8.036114    1.573385          6         14

-------------------------------------------------------------------------------
-> op_appt_all_2021_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2021 |          0


-------------------------------------------------------------------------------
-> op_appt_all_2021_orig_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2021_orig |        500           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_all_2021_orig_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2021_orig |         22    1.863636    .3512501          1          2

-------------------------------------------------------------------------------
-> op_appt_all_2021_orig_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2021_orig |        687    4.505095    .6805633          3          5

-------------------------------------------------------------------------------
-> op_appt_all_2021_orig_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2021_orig |      3,791    8.053284    1.583326          6         15


                  outpatient_appt_all_2022
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            3              0       Obs               1,746
25%            6              0       Sum of Wgt.       1,746

50%            7                      Mean           6.793242
                        Largest       Std. Dev.      2.887614
75%            9             13
90%           10             13       Variance       8.338315
95%           11             13       Skewness      -.8735484
99%           12             14       Kurtosis        3.60731
(3254 missing values generated)

-------------------------------------------------------------------------------
-> op_appt_all_2022_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2022 |        163           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_all_2022_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2022 |          8           2           0          2          2

-------------------------------------------------------------------------------
-> op_appt_all_2022_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2022 |        240    4.533333    .6262505          3          5

-------------------------------------------------------------------------------
-> op_appt_all_2022_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2022 |      1,335    8.057678    1.594255          6         14

-------------------------------------------------------------------------------
-> op_appt_all_2022_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2022 |          0


-------------------------------------------------------------------------------
-> op_appt_all_2022_orig_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2022_orig |        486           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_all_2022_orig_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2022_orig |         23    1.956522    .2085144          1          2

-------------------------------------------------------------------------------
-> op_appt_all_2022_orig_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2022_orig |        688    4.511628    .6473628          3          5

-------------------------------------------------------------------------------
-> op_appt_all_2022_orig_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2022_orig |      3,803    8.061793    1.586244          6         14


. 
. * Calculate difference in all outpatient appointments compared to 2019
. gen diff_op_all_2020 = outpatient_appt_all_2020 - outpatient_appt_all_2019
(1,352 missing values generated)

. gen diff_op_all_2021 = outpatient_appt_all_2021 - outpatient_appt_all_2019
(2,386 missing values generated)

. gen diff_op_all_2022 = outpatient_appt_all_2022 - outpatient_appt_all_2019
(3,254 missing values generated)

. sum diff_op_all_2020 diff_op_all_2021 diff_op_2022, d

                      diff_op_all_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%          -10            -13
 5%           -7            -12
10%           -5            -12       Obs               3,648
25%           -3            -12       Sum of Wgt.       3,648

50%            0                      Mean          -.0583882
                        Largest       Std. Dev.      4.102958
75%            2             12
90%            5             13       Variance       16.83426
95%            7             13       Skewness       .0439993
99%           10             14       Kurtosis       3.304562

                      diff_op_all_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%          -10            -13
 5%           -8            -13
10%           -6            -13       Obs               2,614
25%           -3            -12       Sum of Wgt.       2,614

50%            0                      Mean          -.0788064
                        Largest       Std. Dev.      4.213666
75%            2             12
90%            5             12       Variance       17.75498
95%            7             13       Skewness       .0091464
99%           10             13       Kurtosis        3.21725

                        diff_op_2022
-------------------------------------------------------------
      Percentiles      Smallest
 1%          -10            -12
 5%           -7            -12
10%           -5            -11       Obs               1,729
25%           -2            -11       Sum of Wgt.       1,729

50%            0                      Mean           .0578369
                        Largest       Std. Dev.      4.219541
75%            3             11
90%            6             12       Variance       17.80452
95%            7             12       Skewness       .0306006
99%           10             12       Kurtosis        3.14879

. 
. * Identify people with no appointments in either year flag them and set diffe
> rence to missing
. forvalues i=2020/2022 {
  2.     gen no_appts_all_`i' = diff_op_all_`i'==0 & op_appt_all_`i'_cat==0
  3.     tab no_appts_all_`i' op_appt_all_`i'_cat
  4.     replace diff_op_all_`i'=. if no_appts_all_`i'==1
  5.     }

no_appts_a |            op_appt_all_2020_cat
   ll_2020 | No appoin  1-2 per y  3-5 per y  6 or more |     Total
-----------+--------------------------------------------+----------
         0 |       333         16        500      2,762 |     3,611 
         1 |        37          0          0          0 |        37 
-----------+--------------------------------------------+----------
     Total |       370         16        500      2,762 |     3,648 
(37 real changes made, 37 to missing)

no_appts_a |            op_appt_all_2021_cat
   ll_2021 | No appoin  1-2 per y  3-5 per y  6 or more |     Total
-----------+--------------------------------------------+----------
         0 |       238         13        376      1,966 |     2,593 
         1 |        21          0          0          0 |        21 
-----------+--------------------------------------------+----------
     Total |       259         13        376      1,966 |     2,614 
(21 real changes made, 21 to missing)

no_appts_a |            op_appt_all_2022_cat
   ll_2022 | No appoin  1-2 per y  3-5 per y  6 or more |     Total
-----------+--------------------------------------------+----------
         0 |       153          8        240      1,335 |     1,736 
         1 |        10          0          0          0 |        10 
-----------+--------------------------------------------+----------
     Total |       163          8        240      1,335 |     1,746 
(10 real changes made, 10 to missing)

. 
. * Identify of people with appointments whether they had fewer appointments 
. forvalues i=2020/2022 {
  2.     gen fewer_appts_all_`i' = (diff_op_all_`i' < 0) if diff_op_all_`i'!=.
  3. }
(1,389 missing values generated)
(2,407 missing values generated)
(3,264 missing values generated)

. 
. preserve

. * Tabulate number of rheumatology appointments per year of those with whole y
> ear available
. table1_mc, vars(op_appt_2019_cat cat \ op_appt_2020_cat cat \ op_appt_2021_ca
> t cat \ op_appt_2022_cat cat \ no_appts_2020 cat \ no_appts_2021 cat \ no_app
> ts_2022 cat \ fewer_appts_2020 cat \ fewer_appts_2021 cat \ fewer_appts_2022 
> cat) clear

  +----------------------------------+
  | factor               N_1     m_1 |
  |----------------------------------|
  | op_appt_2019_cat   4,903      97 |
  |----------------------------------|
  | op_appt_2020_cat   3,648   1,352 |
  |----------------------------------|
  | op_appt_2021_cat   2,614   2,386 |
  |----------------------------------|
  | op_appt_2022_cat   1,746   3,254 |
  |----------------------------------|
  | no_appts_2020      5,000       0 |
  |----------------------------------|
  | no_appts_2021      5,000       0 |
  |----------------------------------|
  | no_appts_2022      5,000       0 |
  |----------------------------------|
  | fewer_appts_2020   3,615   1,385 |
  |----------------------------------|
  | fewer_appts_2021   2,589   2,411 |
  |----------------------------------|
  | fewer_appts_2022   1,729   3,271 |
  +----------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +-------------------------------------------------------+
  |                                         Total         |
  |-------------------------------------------------------|
  |                                         N=5,000       |
  |-------------------------------------------------------|
  | op_appt_2019_cat   No appointments      458 ( 9.3%)   |
  |                    1-2 per year         30 ( 0.6%)    |
  |                    3 or more per year   4,415 (90.0%) |
  |-------------------------------------------------------|
  | op_appt_2020_cat   No appointments      340 ( 9.3%)   |
  |                    1-2 per year         16 ( 0.4%)    |
  |                    3 or more per year   3,292 (90.2%) |
  |-------------------------------------------------------|
  | op_appt_2021_cat   No appointments      239 ( 9.1%)   |
  |                    1-2 per year         13 ( 0.5%)    |
  |                    3 or more per year   2,362 (90.4%) |
  |-------------------------------------------------------|
  | op_appt_2022_cat   No appointments      167 ( 9.6%)   |
  |                    1-2 per year         9 ( 0.5%)     |
  |                    3 or more per year   1,570 (89.9%) |
  |-------------------------------------------------------|
  | no_appts_2020      0                    4,967 (99.3%) |
  |                    1                    33 ( 0.7%)    |
  |-------------------------------------------------------|
  | no_appts_2021      0                    4,975 (99.5%) |
  |                    1                    25 ( 0.5%)    |
  |-------------------------------------------------------|
  | no_appts_2022      0                    4,983 (99.7%) |
  |                    1                    17 ( 0.3%)    |
  |-------------------------------------------------------|
  | fewer_appts_2020   0                    2,032 (56.2%) |
  |                    1                    1,583 (43.8%) |
  |-------------------------------------------------------|
  | fewer_appts_2021   0                    1,488 (57.5%) |
  |                    1                    1,101 (42.5%) |
  |-------------------------------------------------------|
  | fewer_appts_2022   0                    946 (54.7%)   |
  |                    1                    783 (45.3%)   |
  +-------------------------------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/op_appt_yrs.csv
file ./output/tables/op_appt_yrs.csv saved

. * Rounding numbers in table to nearest 5
. describe

Contains data from /tmp/St00015.000002
  obs:            26                          
 vars:             7                          15 Dec 2023 16:09
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
factor          str16   %-16s                 Factor
level           str18   %-18s                 Level
Total           str13   %-13s                 Total
N_1             str5    %9s                   
m_1             str5    %9s                   
_columna_1      str11   %6s                   1 _columna_
_columnb_1      str11   %-11s                 1 _columnb_
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. destring _columna_1, gen(n) ignore(",") force
_columna_1: contains nonnumeric characters not specified in ignore()
_columna_1: character , removed; n generated as int
(2 missing values generated)

. destring _columnb_1, gen(percent) ignore("-" "%" "(" ")") force
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent generated as double
(2 missing values generated)

. gen rounded_n = round(n, 5)
(2 missing values generated)

. keep factor level rounded_n percent

. export delimited using ./output/tables/op_appt_yrs_rounded.csv
file ./output/tables/op_appt_yrs_rounded.csv saved

. restore 

. preserve

. * Tabulate number of rheumatology appointments per year (includes people who 
> end follow-up during year)
. table1_mc, vars(op_appt_2019_orig_cat cat \ op_appt_2020_orig_cat cat \ op_ap
> pt_2021_orig_cat cat \ op_appt_2022_orig_cat cat) clear

  +-------------------------------------+
  | factor                    N_1   m_1 |
  |-------------------------------------|
  | op_appt_2019_orig_cat   5,000     0 |
  |-------------------------------------|
  | op_appt_2020_orig_cat   5,000     0 |
  |-------------------------------------|
  | op_appt_2021_orig_cat   5,000     0 |
  |-------------------------------------|
  | op_appt_2022_orig_cat   5,000     0 |
  +-------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +------------------------------------------------------------+
  |                                              Total         |
  |------------------------------------------------------------|
  |                                              N=5,000       |
  |------------------------------------------------------------|
  | op_appt_2019_orig_cat   No appointments      475 ( 9.5%)   |
  |                         1-2 per year         30 ( 0.6%)    |
  |                         3 or more per year   4,495 (89.9%) |
  |------------------------------------------------------------|
  | op_appt_2020_orig_cat   No appointments      472 ( 9.4%)   |
  |                         1-2 per year         21 ( 0.4%)    |
  |                         3 or more per year   4,507 (90.1%) |
  |------------------------------------------------------------|
  | op_appt_2021_orig_cat   No appointments      494 ( 9.9%)   |
  |                         1-2 per year         26 ( 0.5%)    |
  |                         3 or more per year   4,480 (89.6%) |
  |------------------------------------------------------------|
  | op_appt_2022_orig_cat   No appointments      484 ( 9.7%)   |
  |                         1-2 per year         24 ( 0.5%)    |
  |                         3 or more per year   4,492 (89.8%) |
  +------------------------------------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/op_appt_orig_yrs.csv
file ./output/tables/op_appt_orig_yrs.csv saved

. restore 

. preserve

. * Tabulate number of all outpatient appointments per year of those with whole
>  year available
. table1_mc, vars(op_appt_all_2019_cat cat \ op_appt_all_2020_cat cat \ op_appt
> _all_2021_cat cat \ op_appt_all_2022_cat cat \ no_appts_all_2020 cat \ no_app
> ts_all_2021 cat \ no_appts_all_2022 cat \ fewer_appts_all_2020 cat \ fewer_ap
> pts_all_2021 cat \ fewer_appts_all_2022 cat) clear

  +--------------------------------------+
  | factor                   N_1     m_1 |
  |--------------------------------------|
  | op_appt_all_2019_cat   4,903      97 |
  |--------------------------------------|
  | op_appt_all_2020_cat   3,648   1,352 |
  |--------------------------------------|
  | op_appt_all_2021_cat   2,614   2,386 |
  |--------------------------------------|
  | op_appt_all_2022_cat   1,746   3,254 |
  |--------------------------------------|
  | no_appts_all_2020      5,000       0 |
  |--------------------------------------|
  | no_appts_all_2021      5,000       0 |
  |--------------------------------------|
  | no_appts_all_2022      5,000       0 |
  |--------------------------------------|
  | fewer_appts_all_2020   3,611   1,389 |
  |--------------------------------------|
  | fewer_appts_all_2021   2,593   2,407 |
  |--------------------------------------|
  | fewer_appts_all_2022   1,736   3,264 |
  +--------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +-----------------------------------------------------------+
  |                                             Total         |
  |-----------------------------------------------------------|
  |                                             N=5,000       |
  |-----------------------------------------------------------|
  | op_appt_all_2019_cat   No appointments      474 ( 9.7%)   |
  |                        1-2 per year         28 ( 0.6%)    |
  |                        3-5 per year         689 (14.1%)   |
  |                        6 or more per year   3,712 (75.7%) |
  |-----------------------------------------------------------|
  | op_appt_all_2020_cat   No appointments      370 (10.1%)   |
  |                        1-2 per year         16 ( 0.4%)    |
  |                        3-5 per year         500 (13.7%)   |
  |                        6 or more per year   2,762 (75.7%) |
  |-----------------------------------------------------------|
  | op_appt_all_2021_cat   No appointments      259 ( 9.9%)   |
  |                        1-2 per year         13 ( 0.5%)    |
  |                        3-5 per year         376 (14.4%)   |
  |                        6 or more per year   1,966 (75.2%) |
  |-----------------------------------------------------------|
  | op_appt_all_2022_cat   No appointments      163 ( 9.3%)   |
  |                        1-2 per year         8 ( 0.5%)     |
  |                        3-5 per year         240 (13.7%)   |
  |                        6 or more per year   1,335 (76.5%) |
  |-----------------------------------------------------------|
  | no_appts_all_2020      0                    4,963 (99.3%) |
  |                        1                    37 ( 0.7%)    |
  |-----------------------------------------------------------|
  | no_appts_all_2021      0                    4,979 (99.6%) |
  |                        1                    21 ( 0.4%)    |
  |-----------------------------------------------------------|
  | no_appts_all_2022      0                    4,990 (99.8%) |
  |                        1                    10 ( 0.2%)    |
  |-----------------------------------------------------------|
  | fewer_appts_all_2020   0                    2,013 (55.7%) |
  |                        1                    1,598 (44.3%) |
  |-----------------------------------------------------------|
  | fewer_appts_all_2021   0                    1,418 (54.7%) |
  |                        1                    1,175 (45.3%) |
  |-----------------------------------------------------------|
  | fewer_appts_all_2022   0                    969 (55.8%)   |
  |                        1                    767 (44.2%)   |
  +-----------------------------------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/op_appt_all_yrs.csv
file ./output/tables/op_appt_all_yrs.csv saved

. * Rounding numbers in table to nearest 5
. describe

Contains data from /tmp/St00015.000004
  obs:            30                          
 vars:             7                          15 Dec 2023 16:09
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
factor          str20   %-20s                 Factor
level           str18   %-18s                 Level
Total           str13   %-13s                 Total
N_1             str5    %9s                   
m_1             str5    %9s                   
_columna_1      str11   %6s                   1 _columna_
_columnb_1      str11   %-11s                 1 _columnb_
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. destring _columna_1, gen(n) ignore(",") force
_columna_1: contains nonnumeric characters not specified in ignore()
_columna_1: character , removed; n generated as int
(2 missing values generated)

. destring _columnb_1, gen(percent) ignore("-" "%" "(" ")") force
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent generated as double
(2 missing values generated)

. gen rounded_n = round(n, 5)
(2 missing values generated)

. keep factor level rounded_n percent

. export delimited using ./output/tables/op_appt_all_yrs_rounded.csv
file ./output/tables/op_appt_all_yrs_rounded.csv saved

. restore 

. * Tabulate overall characteristics 
. preserve

. table1_mc, vars(age_cat cat \ male cat \ urban_rural_bin cat \ region cat \ i
> md cat \  smoking cat \ time_ra contn \ bmi_cat cat \ eth5 cat) clear

  +-----------------------------+
  | factor          N_1     m_1 |
  |-----------------------------|
  | age_cat       3,948   1,052 |
  |-----------------------------|
  | male          5,000       0 |
  |-----------------------------|
  | Rural-Urban   5,000       0 |
  |-----------------------------|
  | region        5,000       0 |
  |-----------------------------|
  | imd           5,000       0 |
  |-----------------------------|
  | smoking       5,000       0 |
  |-----------------------------|
  | time_ra       2,221   2,779 |
  |-----------------------------|
  | bmi_cat       5,000       0 |
  |-----------------------------|
  | eth5          5,000       0 |
  +-----------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------------------+
  |                                          Total               |
  |--------------------------------------------------------------|
  |                                          N=5,000             |
  |--------------------------------------------------------------|
  | age_cat       18 - 40 years              1,350 (34.2%)       |
  |               41 - 60 years              1,379 (34.9%)       |
  |               61 - 80 years              992 (25.1%)         |
  |               >80 years                  227 ( 5.7%)         |
  |--------------------------------------------------------------|
  | male          Female                     2,643 (52.9%)       |
  |               Male                       2,357 (47.1%)       |
  |--------------------------------------------------------------|
  | Rural-Urban   Rural                      2,512 (50.2%)       |
  |               Urban                      2,488 (49.8%)       |
  |--------------------------------------------------------------|
  | region        East Midlands              500 (10.0%)         |
  |               East of England            504 (10.1%)         |
  |               London                     997 (19.9%)         |
  |               North East                 479 ( 9.6%)         |
  |               North West                 520 (10.4%)         |
  |               South East                 1,001 (20.0%)       |
  |               West Midlands              481 ( 9.6%)         |
  |               Yorkshire and the Humber   518 (10.4%)         |
  |--------------------------------------------------------------|
  | imd           0                          276 ( 5.5%)         |
  |               1                          950 (19.0%)         |
  |               2                          924 (18.5%)         |
  |               3                          926 (18.5%)         |
  |               4                          946 (18.9%)         |
  |               5                          978 (19.6%)         |
  |--------------------------------------------------------------|
  | smoking       Never smoked               518 (10.4%)         |
  |               Current smoker             1,006 (20.1%)       |
  |               Ex-smoker                  703 (14.1%)         |
  |               Unknown                    2,773 (55.5%)       |
  |--------------------------------------------------------------|
  | time_ra                                  54.57402 (31.48369) |
  |--------------------------------------------------------------|
  | bmi_cat       Missing                    1,016 (20.3%)       |
  |               Underweight                478 ( 9.6%)         |
  |               Healthy range              920 (18.4%)         |
  |               Overweight                 956 (19.1%)         |
  |               Obese                      1,351 (27.0%)       |
  |               Morbidly obese             279 ( 5.6%)         |
  |--------------------------------------------------------------|
  | eth5          White                      930 (18.6%)         |
  |               South Asian                971 (19.4%)         |
  |               Black                      1,043 (20.9%)       |
  |               Mixed                      1,041 (20.8%)       |
  |               Other                      1,015 (20.3%)       |
  +--------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 

. export delimited using ./output/tables/op_chars.csv
file ./output/tables/op_chars.csv saved

. * Rounding numbers in table to nearest 5
. describe

Contains data from /tmp/St00015.000005
  obs:            40                          
 vars:             7                          15 Dec 2023 16:09
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
factor          str18   %-18s                 Factor
level           str24   %-24s                 Level
Total           str19   %-19s                 Total
N_1             str5    %9s                   
m_1             str5    %9s                   
_columna_1      str11   %6s                   1 _columna_
_columnb_1      str11   %-11s                 1 _columnb_
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. destring _columna_1, gen(n) ignore(",") force
_columna_1: contains nonnumeric characters not specified in ignore()
_columna_1: character , removed; n generated as double
(2 missing values generated)

. destring _columnb_1, gen(percent) ignore("-" "%" "(" ")") force
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent generated as double
(2 missing values generated)

. gen rounded_n = round(n, 5)
(2 missing values generated)

. keep factor level rounded_n percent

. export delimited using ./output/tables/op_chars_rounded.csv
file ./output/tables/op_chars_rounded.csv saved

. restore

. * Tabulate characteristics by category of outpatient appointments for each ye
> ar
. forvalues i=2019/2022 {
  2.     preserve
  3.     table1_mc, vars(age_cat cat \ male cat \ urban_rural_bin cat \ region 
> cat \ imd cat \ smoking cat \ time_ra contn \ bmi_cat cat \ eth5 cat) by(op_a
> ppt_`i'_cat) clear
  4.     export delimited using ./output/tables/characteristics_strata`i'.csv
  5.     destring _columna_0, gen(n0) ignore(",") force
  6.     destring _columnb_0, gen(percent0) ignore("-" "%" "(" ")") force
  7.     destring _columna_1, gen(n1) ignore(",") force
  8.     destring _columnb_1, gen(percent1) ignore("-" "%" "(" ")") force
  9.     destring _columna_2, gen(n2) ignore(",") force
 10.     destring _columnb_2, gen(percent2) ignore("-" "%" "(" ")") force
 11.     gen rounded_n0 = round(n0, 5)
 12.     gen rounded_n1 = round(n1, 5)
 13.     gen rounded_n2 = round(n2, 5)
 14.     keep factor level rounded_n0 percent0 rounded_n1 percent1 rounded_n2 p
> ercent2
 15.     export delimited using ./output/tables/characteristics_strata`i'_round
> ed.csv
 16.     restore
 17. 
.     /* Tabulate characteristics by whether hospitalised with RA for each year
>     preserve
>     keep if ra_hosp_`i'==0
>     table1_mc, vars(age_cat cate \ male cate \ urban_rural_5 cate \ prescribe
> d_biologics cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat cate) cl
> ear
>     save `tempfile', replace
>     restore
>     preserve
>     keep if ra_hosp_`i'==1
>     table1_mc, vars(age_cat cate \ male cate \ urban_rural_5 cate \ prescribe
> d_biologics cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat cate) cl
> ear
>     append using `tempfile'
>     save `tempfile', replace
>     export delimited using ./output/tables/characteristics_ra_hosp_`i'.csv
>     restore*/
. }

  +-----------------------------------------------------+
  | factor        N_0   N_1     N_2   m_0   m_1     m_2 |
  |-----------------------------------------------------|
  | age_cat       365    25   3,480    93     5     935 |
  |-----------------------------------------------------|
  | male          458    30   4,415     0     0       0 |
  |-----------------------------------------------------|
  | Rural-Urban   458    30   4,415     0     0       0 |
  |-----------------------------------------------------|
  | region        458    30   4,415     0     0       0 |
  |-----------------------------------------------------|
  | imd           458    30   4,415     0     0       0 |
  |-----------------------------------------------------|
  | smoking       458    30   4,415     0     0       0 |
  |-----------------------------------------------------|
  | time_ra       213     8   1,963   245    22   2,452 |
  |-----------------------------------------------------|
  | bmi_cat       458    30   4,415     0     0       0 |
  |-----------------------------------------------------|
  | eth5          458    30   4,415     0     0       0 |
  +-----------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> ---------------------------------------+
  |                                          No appointments       1-2 per year
>          3 or more per year    p-value |
  |----------------------------------------------------------------------------
> ---------------------------------------|
  |                                          N=458                 N=30        
>          N=4,415                       |
  |----------------------------------------------------------------------------
> ---------------------------------------|
  | age_cat       18 - 40 years              124 (34.0%)           7 (28.0%)   
>          1,195 (34.3%)          0.30   |
  |               41 - 60 years              122 (33.4%)           12 (48.0%)  
>          1,218 (35.0%)                 |
  |               61 - 80 years              104 (28.5%)           6 (24.0%)   
>          858 (24.7%)                   |
  |               >80 years                  15 ( 4.1%)            0 ( 0.0%)   
>          209 ( 6.0%)                   |
  |----------------------------------------------------------------------------
> ---------------------------------------|
  | male          Female                     242 (52.8%)           16 (53.3%)  
>          2,333 (52.8%)          1.00   |
  |               Male                       216 (47.2%)           14 (46.7%)  
>          2,082 (47.2%)                 |
  |----------------------------------------------------------------------------
> ---------------------------------------|
  | Rural-Urban   Rural                      236 (51.5%)           12 (40.0%)  
>          2,228 (50.5%)          0.47   |
  |               Urban                      222 (48.5%)           18 (60.0%)  
>          2,187 (49.5%)                 |
  |----------------------------------------------------------------------------
> ---------------------------------------|
  | region        East Midlands              44 ( 9.6%)            2 ( 6.7%)   
>          442 (10.0%)            0.86   |
  |               East of England            44 ( 9.6%)            2 ( 6.7%)   
>          448 (10.1%)                   |
  |               London                     89 (19.4%)            9 (30.0%)   
>          878 (19.9%)                   |
  |               North East                 49 (10.7%)            4 (13.3%)   
>          417 ( 9.4%)                   |
  |               North West                 41 ( 9.0%)            3 (10.0%)   
>          463 (10.5%)                   |
  |               South East                 104 (22.7%)           7 (23.3%)   
>          874 (19.8%)                   |
  |               West Midlands              43 ( 9.4%)            2 ( 6.7%)   
>          426 ( 9.6%)                   |
  |               Yorkshire and the Humber   44 ( 9.6%)            1 ( 3.3%)   
>          467 (10.6%)                   |
  |----------------------------------------------------------------------------
> ---------------------------------------|
  | imd           0                          22 ( 4.8%)            0 ( 0.0%)   
>          251 ( 5.7%)            0.85   |
  |               1                          82 (17.9%)            7 (23.3%)   
>          845 (19.1%)                   |
  |               2                          86 (18.8%)            6 (20.0%)   
>          810 (18.3%)                   |
  |               3                          81 (17.7%)            8 (26.7%)   
>          816 (18.5%)                   |
  |               4                          93 (20.3%)            5 (16.7%)   
>          826 (18.7%)                   |
  |               5                          94 (20.5%)            4 (13.3%)   
>          867 (19.6%)                   |
  |----------------------------------------------------------------------------
> ---------------------------------------|
  | smoking       Never smoked               39 ( 8.5%)            3 (10.0%)   
>          467 (10.6%)            0.41   |
  |               Current smoker             82 (17.9%)            5 (16.7%)   
>          898 (20.3%)                   |
  |               Ex-smoker                  75 (16.4%)            6 (20.0%)   
>          610 (13.8%)                   |
  |               Unknown                    262 (57.2%)           16 (53.3%)  
>          2,440 (55.3%)                 |
  |----------------------------------------------------------------------------
> ---------------------------------------|
  | time_ra                                  55.22169 (31.84926)   54.18925 (29
> .0624)   54.46189 (31.53566)    0.95   |
  |----------------------------------------------------------------------------
> ---------------------------------------|
  | bmi_cat       Missing                    108 (23.6%)           9 (30.0%)   
>          885 (20.0%)            0.11   |
  |               Underweight                30 ( 6.6%)            4 (13.3%)   
>          433 ( 9.8%)                   |
  |               Healthy range              76 (16.6%)            4 (13.3%)   
>          818 (18.5%)                   |
  |               Overweight                 105 (22.9%)           5 (16.7%)   
>          826 (18.7%)                   |
  |               Obese                      115 (25.1%)           6 (20.0%)   
>          1,209 (27.4%)                 |
  |               Morbidly obese             24 ( 5.2%)            2 ( 6.7%)   
>          244 ( 5.5%)                   |
  |----------------------------------------------------------------------------
> ---------------------------------------|
  | eth5          White                      81 (17.7%)            4 (13.3%)   
>          827 (18.7%)            0.25   |
  |               South Asian                79 (17.2%)            9 (30.0%)   
>          859 (19.5%)                   |
  |               Black                      83 (18.1%)            5 (16.7%)   
>          937 (21.2%)                   |
  |               Mixed                      111 (24.2%)           7 (23.3%)   
>          905 (20.5%)                   |
  |               Other                      104 (22.7%)           5 (16.7%)   
>          887 (20.1%)                   |
  +----------------------------------------------------------------------------
> ---------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file ./output/tables/characteristics_strata2019.csv saved
_columna_0: contains nonnumeric characters not specified in ignore(); n0 genera
> ted as double
(2 missing values generated)
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)
_columna_1: contains nonnumeric characters not specified in ignore(); n1 genera
> ted as double
(2 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters - space % ( ) removed; percent1 generated as double
(2 missing values generated)
_columna_2: contains nonnumeric characters not specified in ignore()
_columna_2: character , removed; n2 generated as double
(2 missing values generated)
_columnb_2: contains nonnumeric characters not specified in ignore()
_columnb_2: characters space % ( ) removed; percent2 generated as double
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
file ./output/tables/characteristics_strata2019_rounded.csv saved

  +-----------------------------------------------------+
  | factor        N_0   N_1     N_2   m_0   m_1     m_2 |
  |-----------------------------------------------------|
  | age_cat       269    14   2,599    71     2     693 |
  |-----------------------------------------------------|
  | male          340    16   3,292     0     0       0 |
  |-----------------------------------------------------|
  | Rural-Urban   340    16   3,292     0     0       0 |
  |-----------------------------------------------------|
  | region        340    16   3,292     0     0       0 |
  |-----------------------------------------------------|
  | imd           340    16   3,292     0     0       0 |
  |-----------------------------------------------------|
  | smoking       340    16   3,292     0     0       0 |
  |-----------------------------------------------------|
  | time_ra       150     8   1,452   190     8   1,840 |
  |-----------------------------------------------------|
  | bmi_cat       340    16   3,292     0     0       0 |
  |-----------------------------------------------------|
  | eth5          340    16   3,292     0     0       0 |
  +-----------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> ----------------------------------------+
  |                                          No appointments       1-2 per year
>           3 or more per year    p-value |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  |                                          N=340                 N=16        
>           N=3,292                       |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | age_cat       18 - 40 years              99 (36.8%)            3 (21.4%)   
>           879 (33.8%)            0.67   |
  |               41 - 60 years              96 (35.7%)            5 (35.7%)   
>           915 (35.2%)                   |
  |               61 - 80 years              63 (23.4%)            5 (35.7%)   
>           643 (24.7%)                   |
  |               >80 years                  11 ( 4.1%)            1 ( 7.1%)   
>           162 ( 6.2%)                   |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | male          Female                     194 (57.1%)           9 (56.2%)   
>           1,728 (52.5%)          0.27   |
  |               Male                       146 (42.9%)           7 (43.8%)   
>           1,564 (47.5%)                 |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | Rural-Urban   Rural                      180 (52.9%)           8 (50.0%)   
>           1,655 (50.3%)          0.64   |
  |               Urban                      160 (47.1%)           8 (50.0%)   
>           1,637 (49.7%)                 |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | region        East Midlands              27 ( 7.9%)            3 (18.8%)   
>           327 ( 9.9%)            0.053  |
  |               East of England            38 (11.2%)            0 ( 0.0%)   
>           317 ( 9.6%)                   |
  |               London                     80 (23.5%)            1 ( 6.2%)   
>           661 (20.1%)                   |
  |               North East                 22 ( 6.5%)            4 (25.0%)   
>           343 (10.4%)                   |
  |               North West                 30 ( 8.8%)            0 ( 0.0%)   
>           342 (10.4%)                   |
  |               South East                 74 (21.8%)            3 (18.8%)   
>           627 (19.0%)                   |
  |               West Midlands              38 (11.2%)            3 (18.8%)   
>           312 ( 9.5%)                   |
  |               Yorkshire and the Humber   31 ( 9.1%)            2 (12.5%)   
>           363 (11.0%)                   |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | imd           0                          19 ( 5.6%)            0 ( 0.0%)   
>           170 ( 5.2%)            0.026  |
  |               1                          73 (21.5%)            7 (43.8%)   
>           591 (18.0%)                   |
  |               2                          63 (18.5%)            0 ( 0.0%)   
>           619 (18.8%)                   |
  |               3                          74 (21.8%)            3 (18.8%)   
>           629 (19.1%)                   |
  |               4                          62 (18.2%)            1 ( 6.2%)   
>           620 (18.8%)                   |
  |               5                          49 (14.4%)            5 (31.2%)   
>           663 (20.1%)                   |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | smoking       Never smoked               48 (14.1%)            5 (31.2%)   
>           325 ( 9.9%)            0.010  |
  |               Current smoker             68 (20.0%)            2 (12.5%)   
>           646 (19.6%)                   |
  |               Ex-smoker                  46 (13.5%)            4 (25.0%)   
>           452 (13.7%)                   |
  |               Unknown                    178 (52.4%)           5 (31.2%)   
>           1,869 (56.8%)                 |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | time_ra                                  55.03456 (31.88613)   53.12081 (41
> .65204)   54.31671 (31.65442)    0.96   |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | bmi_cat       Missing                    66 (19.4%)            3 (18.8%)   
>           666 (20.2%)            0.62   |
  |               Underweight                30 ( 8.8%)            2 (12.5%)   
>           306 ( 9.3%)                   |
  |               Healthy range              62 (18.2%)            3 (18.8%)   
>           592 (18.0%)                   |
  |               Overweight                 79 (23.2%)            5 (31.2%)   
>           619 (18.8%)                   |
  |               Obese                      81 (23.8%)            3 (18.8%)   
>           916 (27.8%)                   |
  |               Morbidly obese             22 ( 6.5%)            0 ( 0.0%)   
>           193 ( 5.9%)                   |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | eth5          White                      67 (19.7%)            2 (12.5%)   
>           610 (18.5%)            0.78   |
  |               South Asian                72 (21.2%)            5 (31.2%)   
>           624 (19.0%)                   |
  |               Black                      71 (20.9%)            5 (31.2%)   
>           721 (21.9%)                   |
  |               Mixed                      65 (19.1%)            2 (12.5%)   
>           686 (20.8%)                   |
  |               Other                      65 (19.1%)            2 (12.5%)   
>           651 (19.8%)                   |
  +----------------------------------------------------------------------------
> ----------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file ./output/tables/characteristics_strata2020.csv saved
_columna_0: contains nonnumeric characters not specified in ignore(); n0 genera
> ted as double
(2 missing values generated)
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)
_columna_1: contains nonnumeric characters not specified in ignore(); n1 genera
> ted as double
(2 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters - space % ( ) removed; percent1 generated as double
(2 missing values generated)
_columna_2: contains nonnumeric characters not specified in ignore()
_columna_2: character , removed; n2 generated as double
(2 missing values generated)
_columnb_2: contains nonnumeric characters not specified in ignore()
_columnb_2: characters space % ( ) removed; percent2 generated as double
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
file ./output/tables/characteristics_strata2020_rounded.csv saved

  +-----------------------------------------------------+
  | factor        N_0   N_1     N_2   m_0   m_1     m_2 |
  |-----------------------------------------------------|
  | age_cat       189     9   1,870    50     4     492 |
  |-----------------------------------------------------|
  | male          239    13   2,362     0     0       0 |
  |-----------------------------------------------------|
  | Rural-Urban   239    13   2,362     0     0       0 |
  |-----------------------------------------------------|
  | region        239    13   2,362     0     0       0 |
  |-----------------------------------------------------|
  | imd           239    13   2,362     0     0       0 |
  |-----------------------------------------------------|
  | smoking       239    13   2,362     0     0       0 |
  |-----------------------------------------------------|
  | time_ra       115     6   1,038   124     7   1,324 |
  |-----------------------------------------------------|
  | bmi_cat       239    13   2,362     0     0       0 |
  |-----------------------------------------------------|
  | eth5          239    13   2,362     0     0       0 |
  +-----------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> ----------------------------------------+
  |                                          No appointments       1-2 per year
>           3 or more per year    p-value |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  |                                          N=239                 N=13        
>           N=2,362                       |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | age_cat       18 - 40 years              73 (38.6%)            3 (33.3%)   
>           624 (33.4%)            0.61   |
  |               41 - 60 years              59 (31.2%)            4 (44.4%)   
>           671 (35.9%)                   |
  |               61 - 80 years              48 (25.4%)            1 (11.1%)   
>           455 (24.3%)                   |
  |               >80 years                  9 ( 4.8%)             1 (11.1%)   
>           120 ( 6.4%)                   |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | male          Female                     121 (50.6%)           9 (69.2%)   
>           1,251 (53.0%)          0.39   |
  |               Male                       118 (49.4%)           4 (30.8%)   
>           1,111 (47.0%)                 |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | Rural-Urban   Rural                      131 (54.8%)           6 (46.2%)   
>           1,211 (51.3%)          0.54   |
  |               Urban                      108 (45.2%)           7 (53.8%)   
>           1,151 (48.7%)                 |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | region        East Midlands              16 ( 6.7%)            4 (30.8%)   
>           226 ( 9.6%)            0.12   |
  |               East of England            27 (11.3%)            1 ( 7.7%)   
>           225 ( 9.5%)                   |
  |               London                     45 (18.8%)            1 ( 7.7%)   
>           480 (20.3%)                   |
  |               North East                 26 (10.9%)            1 ( 7.7%)   
>           249 (10.5%)                   |
  |               North West                 18 ( 7.5%)            1 ( 7.7%)   
>           254 (10.8%)                   |
  |               South East                 59 (24.7%)            4 (30.8%)   
>           428 (18.1%)                   |
  |               West Midlands              23 ( 9.6%)            0 ( 0.0%)   
>           242 (10.2%)                   |
  |               Yorkshire and the Humber   25 (10.5%)            1 ( 7.7%)   
>           258 (10.9%)                   |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | imd           0                          12 ( 5.0%)            0 ( 0.0%)   
>           118 ( 5.0%)            0.59   |
  |               1                          38 (15.9%)            2 (15.4%)   
>           429 (18.2%)                   |
  |               2                          39 (16.3%)            3 (23.1%)   
>           460 (19.5%)                   |
  |               3                          51 (21.3%)            4 (30.8%)   
>           442 (18.7%)                   |
  |               4                          46 (19.2%)            0 ( 0.0%)   
>           453 (19.2%)                   |
  |               5                          53 (22.2%)            4 (30.8%)   
>           460 (19.5%)                   |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | smoking       Never smoked               23 ( 9.6%)            1 ( 7.7%)   
>           255 (10.8%)            0.071  |
  |               Current smoker             35 (14.6%)            1 ( 7.7%)   
>           490 (20.7%)                   |
  |               Ex-smoker                  40 (16.7%)            0 ( 0.0%)   
>           314 (13.3%)                   |
  |               Unknown                    141 (59.0%)           11 (84.6%)  
>           1,303 (55.2%)                 |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | time_ra                                  58.62274 (32.04988)   54.36733 (32
> .81739)   54.03541 (31.48014)    0.33   |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | bmi_cat       Missing                    46 (19.2%)            3 (23.1%)   
>           468 (19.8%)            0.079  |
  |               Underweight                24 (10.0%)            4 (30.8%)   
>           222 ( 9.4%)                   |
  |               Healthy range              50 (20.9%)            0 ( 0.0%)   
>           418 (17.7%)                   |
  |               Overweight                 41 (17.2%)            2 (15.4%)   
>           472 (20.0%)                   |
  |               Obese                      58 (24.3%)            3 (23.1%)   
>           663 (28.1%)                   |
  |               Morbidly obese             20 ( 8.4%)            1 ( 7.7%)   
>           119 ( 5.0%)                   |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | eth5          White                      45 (18.8%)            3 (23.1%)   
>           436 (18.5%)            0.16   |
  |               South Asian                43 (18.0%)            0 ( 0.0%)   
>           436 (18.5%)                   |
  |               Black                      70 (29.3%)            4 (30.8%)   
>           512 (21.7%)                   |
  |               Mixed                      41 (17.2%)            3 (23.1%)   
>           519 (22.0%)                   |
  |               Other                      40 (16.7%)            3 (23.1%)   
>           459 (19.4%)                   |
  +----------------------------------------------------------------------------
> ----------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file ./output/tables/characteristics_strata2021.csv saved
_columna_0: contains nonnumeric characters not specified in ignore(); n0 genera
> ted as double
(2 missing values generated)
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)
_columna_1: contains nonnumeric characters not specified in ignore(); n1 genera
> ted as double
(2 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters - space % ( ) removed; percent1 generated as double
(2 missing values generated)
_columna_2: contains nonnumeric characters not specified in ignore()
_columna_2: character , removed; n2 generated as double
(2 missing values generated)
_columnb_2: contains nonnumeric characters not specified in ignore()
_columnb_2: characters space % ( ) removed; percent2 generated as double
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
file ./output/tables/characteristics_strata2021_rounded.csv saved

  +---------------------------------------------------+
  | factor        N_0   N_1     N_2   m_0   m_1   m_2 |
  |---------------------------------------------------|
  | age_cat       133     6   1,225    34     3   345 |
  |---------------------------------------------------|
  | male          167     9   1,570     0     0     0 |
  |---------------------------------------------------|
  | Rural-Urban   167     9   1,570     0     0     0 |
  |---------------------------------------------------|
  | region        167     9   1,570     0     0     0 |
  |---------------------------------------------------|
  | imd           167     9   1,570     0     0     0 |
  |---------------------------------------------------|
  | smoking       167     9   1,570     0     0     0 |
  |---------------------------------------------------|
  | time_ra        69     5     700    98     4   870 |
  |---------------------------------------------------|
  | bmi_cat       167     9   1,570     0     0     0 |
  |---------------------------------------------------|
  | eth5          167     9   1,570     0     0     0 |
  +---------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> ----------------------------------------+
  |                                          No appointments       1-2 per year
>           3 or more per year    p-value |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  |                                          N=167                 N=9         
>           N=1,570                       |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | age_cat       18 - 40 years              51 (38.3%)            2 (33.3%)   
>           393 (32.1%)            0.38   |
  |               41 - 60 years              44 (33.1%)            4 (66.7%)   
>           443 (36.2%)                   |
  |               61 - 80 years              32 (24.1%)            0 ( 0.0%)   
>           302 (24.7%)                   |
  |               >80 years                  6 ( 4.5%)             0 ( 0.0%)   
>           87 ( 7.1%)                    |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | male          Female                     92 (55.1%)            7 (77.8%)   
>           827 (52.7%)            0.28   |
  |               Male                       75 (44.9%)            2 (22.2%)   
>           743 (47.3%)                   |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | Rural-Urban   Rural                      88 (52.7%)            3 (33.3%)   
>           807 (51.4%)            0.53   |
  |               Urban                      79 (47.3%)            6 (66.7%)   
>           763 (48.6%)                   |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | region        East Midlands              17 (10.2%)            2 (22.2%)   
>           145 ( 9.2%)            0.21   |
  |               East of England            7 ( 4.2%)             1 (11.1%)   
>           160 (10.2%)                   |
  |               London                     34 (20.4%)            2 (22.2%)   
>           324 (20.6%)                   |
  |               North East                 19 (11.4%)            2 (22.2%)   
>           165 (10.5%)                   |
  |               North West                 27 (16.2%)            0 ( 0.0%)   
>           158 (10.1%)                   |
  |               South East                 31 (18.6%)            2 (22.2%)   
>           294 (18.7%)                   |
  |               West Midlands              19 (11.4%)            0 ( 0.0%)   
>           163 (10.4%)                   |
  |               Yorkshire and the Humber   13 ( 7.8%)            0 ( 0.0%)   
>           161 (10.3%)                   |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | imd           0                          5 ( 3.0%)             1 (11.1%)   
>           81 ( 5.2%)             0.20   |
  |               1                          23 (13.8%)            0 ( 0.0%)   
>           274 (17.5%)                   |
  |               2                          45 (26.9%)            1 (11.1%)   
>           286 (18.2%)                   |
  |               3                          32 (19.2%)            2 (22.2%)   
>           313 (19.9%)                   |
  |               4                          36 (21.6%)            3 (33.3%)   
>           312 (19.9%)                   |
  |               5                          26 (15.6%)            2 (22.2%)   
>           304 (19.4%)                   |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | smoking       Never smoked               18 (10.8%)            4 (44.4%)   
>           170 (10.8%)            0.050  |
  |               Current smoker             35 (21.0%)            0 ( 0.0%)   
>           312 (19.9%)                   |
  |               Ex-smoker                  20 (12.0%)            0 ( 0.0%)   
>           212 (13.5%)                   |
  |               Unknown                    94 (56.3%)            5 (55.6%)   
>           876 (55.8%)                   |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | time_ra                                  51.28518 (33.21655)   39.01492 (28
> .88923)   54.68836 (31.49433)    0.39   |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | bmi_cat       Missing                    38 (22.8%)            0 ( 0.0%)   
>           323 (20.6%)            0.36   |
  |               Underweight                14 ( 8.4%)            0 ( 0.0%)   
>           146 ( 9.3%)                   |
  |               Healthy range              25 (15.0%)            4 (44.4%)   
>           274 (17.5%)                   |
  |               Overweight                 36 (21.6%)            3 (33.3%)   
>           306 (19.5%)                   |
  |               Obese                      43 (25.7%)            1 (11.1%)   
>           439 (28.0%)                   |
  |               Morbidly obese             11 ( 6.6%)            1 (11.1%)   
>           82 ( 5.2%)                    |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | eth5          White                      25 (15.0%)            1 (11.1%)   
>           308 (19.6%)            0.55   |
  |               South Asian                32 (19.2%)            2 (22.2%)   
>           292 (18.6%)                   |
  |               Black                      43 (25.7%)            3 (33.3%)   
>           345 (22.0%)                   |
  |               Mixed                      38 (22.8%)            0 ( 0.0%)   
>           354 (22.5%)                   |
  |               Other                      29 (17.4%)            3 (33.3%)   
>           271 (17.3%)                   |
  +----------------------------------------------------------------------------
> ----------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file ./output/tables/characteristics_strata2022.csv saved
_columna_0: contains nonnumeric characters not specified in ignore(); n0 genera
> ted as double
(2 missing values generated)
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)
_columna_1: contains nonnumeric characters not specified in ignore(); n1 genera
> ted as double
(2 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters - space % ( ) removed; percent1 generated as double
(2 missing values generated)
_columna_2: contains nonnumeric characters not specified in ignore(); n2 genera
> ted as double
(2 missing values generated)
_columnb_2: contains nonnumeric characters not specified in ignore()
_columnb_2: characters space % ( ) removed; percent2 generated as double
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
file ./output/tables/characteristics_strata2022_rounded.csv saved

. * Characteristics by whether prescribed specific drugs 
. * Weak opioids 
. preserve

. table1_mc, vars(age_cat cat \ male cat \ urban_rural_bin cat \ region cat \ i
> md cat) by(prescribed_weak_opioids) clear

  +-----------------------------------------+
  | factor          N_0     N_1   m_0   m_1 |
  |-----------------------------------------|
  | age_cat       1,955   1,993   529   523 |
  |-----------------------------------------|
  | male          2,484   2,516     0     0 |
  |-----------------------------------------|
  | Rural-Urban   2,484   2,516     0     0 |
  |-----------------------------------------|
  | region        2,484   2,516     0     0 |
  |-----------------------------------------|
  | imd           2,484   2,516     0     0 |
  +-----------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> ----------------------------------+
  |                                          prescribed_weak_opioids = 0   pres
> cribed_weak_opioids = 1   p-value |
  |----------------------------------------------------------------------------
> ----------------------------------|
  |                                          N=2,484                       N=2,
> 516                               |
  |----------------------------------------------------------------------------
> ----------------------------------|
  | age_cat       18 - 40 years              684 (35.0%)                   666 
> (33.4%)                    0.67   |
  |               41 - 60 years              673 (34.4%)                   706 
> (35.4%)                           |
  |               61 - 80 years              482 (24.7%)                   510 
> (25.6%)                           |
  |               >80 years                  116 ( 5.9%)                   111 
> ( 5.6%)                           |
  |----------------------------------------------------------------------------
> ----------------------------------|
  | male          Female                     1,302 (52.4%)                 1,34
> 1 (53.3%)                  0.53   |
  |               Male                       1,182 (47.6%)                 1,17
> 5 (46.7%)                         |
  |----------------------------------------------------------------------------
> ----------------------------------|
  | Rural-Urban   Rural                      1,240 (49.9%)                 1,27
> 2 (50.6%)                  0.65   |
  |               Urban                      1,244 (50.1%)                 1,24
> 4 (49.4%)                         |
  |----------------------------------------------------------------------------
> ----------------------------------|
  | region        East Midlands              238 ( 9.6%)                   262 
> (10.4%)                    0.27   |
  |               East of England            264 (10.6%)                   240 
> ( 9.5%)                           |
  |               London                     486 (19.6%)                   511 
> (20.3%)                           |
  |               North East                 244 ( 9.8%)                   235 
> ( 9.3%)                           |
  |               North West                 261 (10.5%)                   259 
> (10.3%)                           |
  |               South East                 500 (20.1%)                   501 
> (19.9%)                           |
  |               West Midlands              255 (10.3%)                   226 
> ( 9.0%)                           |
  |               Yorkshire and the Humber   236 ( 9.5%)                   282 
> (11.2%)                           |
  |----------------------------------------------------------------------------
> ----------------------------------|
  | imd           0                          127 ( 5.1%)                   149 
> ( 5.9%)                    0.83   |
  |               1                          478 (19.2%)                   472 
> (18.8%)                           |
  |               2                          452 (18.2%)                   472 
> (18.8%)                           |
  |               3                          465 (18.7%)                   461 
> (18.3%)                           |
  |               4                          477 (19.2%)                   469 
> (18.6%)                           |
  |               5                          485 (19.5%)                   493 
> (19.6%)                           |
  +----------------------------------------------------------------------------
> ----------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/drug_weak_op_chars.csv
file ./output/tables/drug_weak_op_chars.csv saved

. * Rounding numbers in table to nearest 5
. destring _columna_1, gen(n1) ignore(",") force
_columna_1: contains nonnumeric characters not specified in ignore()
_columna_1: character , removed; n1 generated as int
(2 missing values generated)

. destring _columna_0, gen(n0) ignore(",") force
_columna_0: contains nonnumeric characters not specified in ignore()
_columna_0: character , removed; n0 generated as int
(2 missing values generated)

. destring _columnb_1, gen(percent1) ignore("-" "%" "(" ")")  force
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent1 generated as double
(2 missing values generated)

. destring _columnb_0, gen(percent0) ignore("-" "%" "(" ")")  force
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)

. gen rounded_n1 = round(n1, 5)
(2 missing values generated)

. gen rounded_n0 = round(n0, 5)
(2 missing values generated)

. keep factor level rounded_n0 percent0 rounded_n1 percent1

. export delimited using ./output/tables/drug_weak_op_chars_rounded.csv
file ./output/tables/drug_weak_op_chars_rounded.csv saved

. restore

. 
. *Strong opioids 
. preserve

. table1_mc, vars(age_cat cat \ male cat \ urban_rural_bin cat \ region cat \ i
> md cat) by(prescribed_strong_opioids) clear

  +-----------------------------------------+
  | factor          N_0     N_1   m_0   m_1 |
  |-----------------------------------------|
  | age_cat       1,953   1,995   514   538 |
  |-----------------------------------------|
  | male          2,467   2,533     0     0 |
  |-----------------------------------------|
  | Rural-Urban   2,467   2,533     0     0 |
  |-----------------------------------------|
  | region        2,467   2,533     0     0 |
  |-----------------------------------------|
  | imd           2,467   2,533     0     0 |
  +-----------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------------------------------------+
  |                                          prescribed_strong_opioids = 0   pr
> escribed_strong_opioids = 1   p-value |
  |----------------------------------------------------------------------------
> --------------------------------------|
  |                                          N=2,467                         N=
> 2,533                                 |
  |----------------------------------------------------------------------------
> --------------------------------------|
  | age_cat       18 - 40 years              653 (33.4%)                     69
> 7 (34.9%)                      0.027  |
  |               41 - 60 years              690 (35.3%)                     68
> 9 (34.5%)                             |
  |               61 - 80 years              477 (24.4%)                     51
> 5 (25.8%)                             |
  |               >80 years                  133 ( 6.8%)                     94
>  ( 4.7%)                              |
  |----------------------------------------------------------------------------
> --------------------------------------|
  | male          Female                     1,320 (53.5%)                   1,
> 323 (52.2%)                    0.37   |
  |               Male                       1,147 (46.5%)                   1,
> 210 (47.8%)                           |
  |----------------------------------------------------------------------------
> --------------------------------------|
  | Rural-Urban   Rural                      1,227 (49.7%)                   1,
> 285 (50.7%)                    0.48   |
  |               Urban                      1,240 (50.3%)                   1,
> 248 (49.3%)                           |
  |----------------------------------------------------------------------------
> --------------------------------------|
  | region        East Midlands              230 ( 9.3%)                     27
> 0 (10.7%)                      0.33   |
  |               East of England            266 (10.8%)                     23
> 8 ( 9.4%)                             |
  |               London                     475 (19.3%)                     52
> 2 (20.6%)                             |
  |               North East                 232 ( 9.4%)                     24
> 7 ( 9.8%)                             |
  |               North West                 263 (10.7%)                     25
> 7 (10.1%)                             |
  |               South East                 514 (20.8%)                     48
> 7 (19.2%)                             |
  |               West Midlands              233 ( 9.4%)                     24
> 8 ( 9.8%)                             |
  |               Yorkshire and the Humber   254 (10.3%)                     26
> 4 (10.4%)                             |
  |----------------------------------------------------------------------------
> --------------------------------------|
  | imd           0                          138 ( 5.6%)                     13
> 8 ( 5.4%)                      0.51   |
  |               1                          466 (18.9%)                     48
> 4 (19.1%)                             |
  |               2                          451 (18.3%)                     47
> 3 (18.7%)                             |
  |               3                          439 (17.8%)                     48
> 7 (19.2%)                             |
  |               4                          492 (19.9%)                     45
> 4 (17.9%)                             |
  |               5                          481 (19.5%)                     49
> 7 (19.6%)                             |
  +----------------------------------------------------------------------------
> --------------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/drug_strong_op_chars.csv
file ./output/tables/drug_strong_op_chars.csv saved

. * Rounding numbers in table to nearest 5
. destring _columna_1, gen(n1) ignore(",") force
_columna_1: contains nonnumeric characters not specified in ignore()
_columna_1: character , removed; n1 generated as int
(2 missing values generated)

. destring _columna_0, gen(n0) ignore(",") force
_columna_0: contains nonnumeric characters not specified in ignore()
_columna_0: character , removed; n0 generated as int
(2 missing values generated)

. destring _columnb_1, gen(percent1) ignore("-" "%" "(" ")")  force
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent1 generated as double
(2 missing values generated)

. destring _columnb_0, gen(percent0) ignore("-" "%" "(" ")")  force
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)

. gen rounded_n1 = round(n1, 5)
(2 missing values generated)

. gen rounded_n0 = round(n0, 5)
(2 missing values generated)

. keep factor level rounded_n0 percent0 rounded_n1 percent1

. export delimited using ./output/tables/drug_strong_op_chars_rounded.csv
file ./output/tables/drug_strong_op_chars_rounded.csv saved

. restore

. 
. *GCs 
. preserve

. table1_mc, vars(age_cat cat \ male cat \ urban_rural_bin cat \ region cat \ i
> md cat) by(prescribed_gcs) clear

  +-----------------------------------------+
  | factor          N_0     N_1   m_0   m_1 |
  |-----------------------------------------|
  | age_cat       1,980   1,968   532   520 |
  |-----------------------------------------|
  | male          2,512   2,488     0     0 |
  |-----------------------------------------|
  | Rural-Urban   2,512   2,488     0     0 |
  |-----------------------------------------|
  | region        2,512   2,488     0     0 |
  |-----------------------------------------|
  | imd           2,512   2,488     0     0 |
  +-----------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> ----------------+
  |                                          prescribed_gcs = 0   prescribed_gc
> s = 1   p-value |
  |----------------------------------------------------------------------------
> ----------------|
  |                                          N=2,512              N=2,488      
>                 |
  |----------------------------------------------------------------------------
> ----------------|
  | age_cat       18 - 40 years              690 (34.8%)          660 (33.5%)  
>          0.76   |
  |               41 - 60 years              677 (34.2%)          702 (35.7%)  
>                 |
  |               61 - 80 years              500 (25.3%)          492 (25.0%)  
>                 |
  |               >80 years                  113 ( 5.7%)          114 ( 5.8%)  
>                 |
  |----------------------------------------------------------------------------
> ----------------|
  | male          Female                     1,331 (53.0%)        1,312 (52.7%)
>          0.86   |
  |               Male                       1,181 (47.0%)        1,176 (47.3%)
>                 |
  |----------------------------------------------------------------------------
> ----------------|
  | Rural-Urban   Rural                      1,233 (49.1%)        1,279 (51.4%)
>          0.10   |
  |               Urban                      1,279 (50.9%)        1,209 (48.6%)
>                 |
  |----------------------------------------------------------------------------
> ----------------|
  | region        East Midlands              247 ( 9.8%)          253 (10.2%)  
>          0.80   |
  |               East of England            264 (10.5%)          240 ( 9.6%)  
>                 |
  |               London                     511 (20.3%)          486 (19.5%)  
>                 |
  |               North East                 244 ( 9.7%)          235 ( 9.4%)  
>                 |
  |               North West                 251 (10.0%)          269 (10.8%)  
>                 |
  |               South East                 499 (19.9%)          502 (20.2%)  
>                 |
  |               West Midlands              230 ( 9.2%)          251 (10.1%)  
>                 |
  |               Yorkshire and the Humber   266 (10.6%)          252 (10.1%)  
>                 |
  |----------------------------------------------------------------------------
> ----------------|
  | imd           0                          132 ( 5.3%)          144 ( 5.8%)  
>          0.51   |
  |               1                          475 (18.9%)          475 (19.1%)  
>                 |
  |               2                          476 (18.9%)          448 (18.0%)  
>                 |
  |               3                          445 (17.7%)          481 (19.3%)  
>                 |
  |               4                          475 (18.9%)          471 (18.9%)  
>                 |
  |               5                          509 (20.3%)          469 (18.9%)  
>                 |
  +----------------------------------------------------------------------------
> ----------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/drug_gc_chars.csv
file ./output/tables/drug_gc_chars.csv saved

. * Rounding numbers in table to nearest 5
. destring _columna_1, gen(n1) ignore(",") force
_columna_1: contains nonnumeric characters not specified in ignore()
_columna_1: character , removed; n1 generated as int
(2 missing values generated)

. destring _columna_0, gen(n0) ignore(",") force
_columna_0: contains nonnumeric characters not specified in ignore()
_columna_0: character , removed; n0 generated as int
(2 missing values generated)

. destring _columnb_1, gen(percent1) ignore("-" "%" "(" ")")  force
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent1 generated as double
(2 missing values generated)

. destring _columnb_0, gen(percent0) ignore("-" "%" "(" ")")  force
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)

. gen rounded_n1 = round(n1, 5)
(2 missing values generated)

. gen rounded_n0 = round(n0, 5)
(2 missing values generated)

. keep factor level rounded_n0 percent0 rounded_n1 percent1

. export delimited using ./output/tables/drug_gc_chars_rounded.csv
file ./output/tables/drug_gc_chars_rounded.csv saved

. restore

. 
. * Tabulate characteristics by categories of differences in rheumatology outpa
> tient appointments for each year
. drop if region=="missing"
(0 observations deleted)

. tempfile tempfile

. forvalues i=2020/2022 {
  2.     * Same number or more appointments 
.     preserve
  3.     table1_mc, vars(age_cat cat \ male cat \ urban_rural_bin cat \ region 
> cat \ imd cat \ smoking cat \ time_ra contn \ bmi_cat cat \ eth5 cat) by(fewe
> r_appts_`i') clear
  4.     export delimited using ./output/tables/characteristics_fewer_appts_`i'
> .csv    
  5.     destring _columna_1, gen(n1) ignore(",") force
  6.     destring _columna_0, gen(n0) ignore(",") force
  7.     destring _columnb_1, gen(percent1) ignore("-" "%" "(" ")")  force
  8.     destring _columnb_0, gen(percent0) ignore("-" "%" "(" ")")  force
  9.     gen rounded_n1 = round(n1, 5)
 10.     gen rounded_n0 = round(n0, 5)
 11.     keep factor level rounded_n0 percent0 rounded_n1 percent1
 12.     export delimited using ./output/tables/characteristics_fewer_appts_`i'
> _rounded.csv
 13.     restore 
 14.     * No appointments
.     preserve 
 15.     table1_mc, vars(age_cat cat \ male cat \ urban_rural_bin cat \ region 
> cat \ imd cat \ smoking cat \ time_ra contn \ bmi_cat cat \ eth5 cat) by(no_a
> ppts_`i') clear
 16.     export delimited using ./output/tables/characteristics_no_appts_`i'.cs
> v    
 17.     destring _columna_1, gen(n1) ignore(",") force
 18.     destring _columna_0, gen(n0) ignore(",") force
 19.     destring _columnb_1, gen(percent1) ignore("-" "%" "(" ")")  force
 20.     destring _columnb_0, gen(percent0) ignore("-" "%" "(" ")")  force
 21.     gen rounded_n1 = round(n1, 5)
 22.     gen rounded_n0 = round(n0, 5)
 23.     keep factor level rounded_n0 percent0 rounded_n1 percent1
 24.     export delimited using ./output/tables/characteristics_no_appts_`i'_ro
> unded.csv
 25.     restore
 26.     * Logistic regression 
.     foreach var in ib1.age_cat male urban_rural_bin i.imd ib3.region_n i.eth5
>  {
 27.         logit fewer_appts_`i' `var', or 
 28.         est sto m1 
 29.         parmest, label eform format(estimate p min95 max95) saving("./outp
> ut/tempdata/`var'_diff_rheum_`i'", replace) idstr("`var'_rheum_`i'")
 30.         }
 31.     logit fewer_appts_`i' ib1.age_cat male urban_rural_bin i.imd ib3.regio
> n_n i.eth5, or 
 32.     est sto m1
 33.     parmest, label eform format(estimate p min95 max95) saving("./output/t
> empdata/multi_diff_rheum_`i'", replace) idstr("multi_rheum_`i'")
 34.     }

  +-------------------------------------------+
  | factor          N_0     N_1     m_0   m_1 |
  |-------------------------------------------|
  | age_cat       1,595   1,259     437   324 |
  |-------------------------------------------|
  | male          2,032   1,583       0     0 |
  |-------------------------------------------|
  | Rural-Urban   2,032   1,583       0     0 |
  |-------------------------------------------|
  | region        2,032   1,583       0     0 |
  |-------------------------------------------|
  | imd           2,032   1,583       0     0 |
  |-------------------------------------------|
  | smoking       2,032   1,583       0     0 |
  |-------------------------------------------|
  | time_ra         878     715   1,154   868 |
  |-------------------------------------------|
  | bmi_cat       2,032   1,583       0     0 |
  |-------------------------------------------|
  | eth5          2,032   1,583       0     0 |
  +-------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------------------+
  |                                          fewer_appts_2020 = 0   fewer_appts
> _2020 = 1   p-value |
  |----------------------------------------------------------------------------
> --------------------|
  |                                          N=2,032                N=1,583    
>                     |
  |----------------------------------------------------------------------------
> --------------------|
  | age_cat       18 - 40 years              549 (34.4%)            422 (33.5%)
>              0.97   |
  |               41 - 60 years              558 (35.0%)            449 (35.7%)
>                     |
  |               61 - 80 years              391 (24.5%)            311 (24.7%)
>                     |
  |               >80 years                  97 ( 6.1%)             77 ( 6.1%) 
>                     |
  |----------------------------------------------------------------------------
> --------------------|
  | male          Female                     1,037 (51.0%)          878 (55.5%)
>              0.008  |
  |               Male                       995 (49.0%)            705 (44.5%)
>                     |
  |----------------------------------------------------------------------------
> --------------------|
  | Rural-Urban   Rural                      1,018 (50.1%)          806 (50.9%)
>              0.63   |
  |               Urban                      1,014 (49.9%)          777 (49.1%)
>                     |
  |----------------------------------------------------------------------------
> --------------------|
  | region        East Midlands              189 ( 9.3%)            166 (10.5%)
>              0.60   |
  |               East of England            196 ( 9.6%)            159 (10.0%)
>                     |
  |               London                     403 (19.8%)            327 (20.7%)
>                     |
  |               North East                 222 (10.9%)            145 ( 9.2%)
>                     |
  |               North West                 203 (10.0%)            167 (10.5%)
>                     |
  |               South East                 403 (19.8%)            294 (18.6%)
>                     |
  |               West Midlands              194 ( 9.5%)            154 ( 9.7%)
>                     |
  |               Yorkshire and the Humber   222 (10.9%)            171 (10.8%)
>                     |
  |----------------------------------------------------------------------------
> --------------------|
  | imd           0                          102 ( 5.0%)            87 ( 5.5%) 
>              0.13   |
  |               1                          344 (16.9%)            317 (20.0%)
>                     |
  |               2                          372 (18.3%)            303 (19.1%)
>                     |
  |               3                          407 (20.0%)            293 (18.5%)
>                     |
  |               4                          388 (19.1%)            287 (18.1%)
>                     |
  |               5                          419 (20.6%)            296 (18.7%)
>                     |
  |----------------------------------------------------------------------------
> --------------------|
  | smoking       Never smoked               204 (10.0%)            171 (10.8%)
>              0.74   |
  |               Current smoker             401 (19.7%)            307 (19.4%)
>                     |
  |               Ex-smoker                  272 (13.4%)            225 (14.2%)
>                     |
  |               Unknown                    1,155 (56.8%)          880 (55.6%)
>                     |
  |----------------------------------------------------------------------------
> --------------------|
  | time_ra                                  55.05981 (31.80283)    53.67223 (3
> 1.63583)     0.39   |
  |----------------------------------------------------------------------------
> --------------------|
  | bmi_cat       Missing                    426 (21.0%)            303 (19.1%)
>              0.55   |
  |               Underweight                183 ( 9.0%)            153 ( 9.7%)
>                     |
  |               Healthy range              349 (17.2%)            298 (18.8%)
>                     |
  |               Overweight                 383 (18.8%)            311 (19.6%)
>                     |
  |               Obese                      569 (28.0%)            427 (27.0%)
>                     |
  |               Morbidly obese             122 ( 6.0%)            91 ( 5.7%) 
>                     |
  |----------------------------------------------------------------------------
> --------------------|
  | eth5          White                      375 (18.5%)            299 (18.9%)
>              0.88   |
  |               South Asian                379 (18.7%)            314 (19.8%)
>                     |
  |               Black                      450 (22.1%)            340 (21.5%)
>                     |
  |               Mixed                      427 (21.0%)            320 (20.2%)
>                     |
  |               Other                      401 (19.7%)            310 (19.6%)
>                     |
  +----------------------------------------------------------------------------
> --------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file ./output/tables/characteristics_fewer_appts_2020.csv saved
_columna_1: contains nonnumeric characters not specified in ignore(); n1 genera
> ted as double
(2 missing values generated)
_columna_0: contains nonnumeric characters not specified in ignore()
_columna_0: character , removed; n0 generated as double
(2 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent1 generated as double
(2 missing values generated)
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
file ./output/tables/characteristics_fewer_appts_2020_rounded.csv saved

  +-----------------------------------------+
  | factor          N_0   N_1     m_0   m_1 |
  |-----------------------------------------|
  | age_cat       3,920    28   1,047     5 |
  |-----------------------------------------|
  | male          4,967    33       0     0 |
  |-----------------------------------------|
  | Rural-Urban   4,967    33       0     0 |
  |-----------------------------------------|
  | region        4,967    33       0     0 |
  |-----------------------------------------|
  | imd           4,967    33       0     0 |
  |-----------------------------------------|
  | smoking       4,967    33       0     0 |
  |-----------------------------------------|
  | time_ra       2,204    17   2,763    16 |
  |-----------------------------------------|
  | bmi_cat       4,967    33       0     0 |
  |-----------------------------------------|
  | eth5          4,967    33       0     0 |
  +-----------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> ------------------+
  |                                          no_appts_2020 = 0     no_appts_202
> 0 = 1     p-value |
  |----------------------------------------------------------------------------
> ------------------|
  |                                          N=4,967               N=33        
>                   |
  |----------------------------------------------------------------------------
> ------------------|
  | age_cat       18 - 40 years              1,340 (34.2%)         10 (35.7%)  
>            0.52   |
  |               41 - 60 years              1,370 (34.9%)         9 (32.1%)   
>                   |
  |               61 - 80 years              983 (25.1%)           9 (32.1%)   
>                   |
  |               >80 years                  227 ( 5.8%)           0 ( 0.0%)   
>                   |
  |----------------------------------------------------------------------------
> ------------------|
  | male          Female                     2,627 (52.9%)         16 (48.5%)  
>            0.61   |
  |               Male                       2,340 (47.1%)         17 (51.5%)  
>                   |
  |----------------------------------------------------------------------------
> ------------------|
  | Rural-Urban   Rural                      2,493 (50.2%)         19 (57.6%)  
>            0.40   |
  |               Urban                      2,474 (49.8%)         14 (42.4%)  
>                   |
  |----------------------------------------------------------------------------
> ------------------|
  | region        East Midlands              498 (10.0%)           2 ( 6.1%)   
>            0.16   |
  |               East of England            504 (10.1%)           0 ( 0.0%)   
>                   |
  |               London                     985 (19.8%)           12 (36.4%)  
>                   |
  |               North East                 477 ( 9.6%)           2 ( 6.1%)   
>                   |
  |               North West                 518 (10.4%)           2 ( 6.1%)   
>                   |
  |               South East                 994 (20.0%)           7 (21.2%)   
>                   |
  |               West Midlands              476 ( 9.6%)           5 (15.2%)   
>                   |
  |               Yorkshire and the Humber   515 (10.4%)           3 ( 9.1%)   
>                   |
  |----------------------------------------------------------------------------
> ------------------|
  | imd           0                          276 ( 5.6%)           0 ( 0.0%)   
>            0.17   |
  |               1                          940 (18.9%)           10 (30.3%)  
>                   |
  |               2                          917 (18.5%)           7 (21.2%)   
>                   |
  |               3                          920 (18.5%)           6 (18.2%)   
>                   |
  |               4                          938 (18.9%)           8 (24.2%)   
>                   |
  |               5                          976 (19.6%)           2 ( 6.1%)   
>                   |
  |----------------------------------------------------------------------------
> ------------------|
  | smoking       Never smoked               515 (10.4%)           3 ( 9.1%)   
>            0.93   |
  |               Current smoker             998 (20.1%)           8 (24.2%)   
>                   |
  |               Ex-smoker                  698 (14.1%)           5 (15.2%)   
>                   |
  |               Unknown                    2,756 (55.5%)         17 (51.5%)  
>                   |
  |----------------------------------------------------------------------------
> ------------------|
  | time_ra                                  54.61844 (31.49488)   48.81491 (30
> .34152)    0.45   |
  |----------------------------------------------------------------------------
> ------------------|
  | bmi_cat       Missing                    1,010 (20.3%)         6 (18.2%)   
>            0.22   |
  |               Underweight                476 ( 9.6%)           2 ( 6.1%)   
>                   |
  |               Healthy range              910 (18.3%)           10 (30.3%)  
>                   |
  |               Overweight                 947 (19.1%)           9 (27.3%)   
>                   |
  |               Obese                      1,347 (27.1%)         4 (12.1%)   
>                   |
  |               Morbidly obese             277 ( 5.6%)           2 ( 6.1%)   
>                   |
  |----------------------------------------------------------------------------
> ------------------|
  | eth5          White                      925 (18.6%)           5 (15.2%)   
>            0.95   |
  |               South Asian                963 (19.4%)           8 (24.2%)   
>                   |
  |               Black                      1,036 (20.9%)         7 (21.2%)   
>                   |
  |               Mixed                      1,035 (20.8%)         6 (18.2%)   
>                   |
  |               Other                      1,008 (20.3%)         7 (21.2%)   
>                   |
  +----------------------------------------------------------------------------
> ------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file ./output/tables/characteristics_no_appts_2020.csv saved
_columna_1: contains nonnumeric characters not specified in ignore(); n1 genera
> ted as double
(2 missing values generated)
_columna_0: contains nonnumeric characters not specified in ignore()
_columna_0: character , removed; n0 generated as double
(2 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent1 generated as double
(2 missing values generated)
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
file ./output/tables/characteristics_no_appts_2020_rounded.csv saved

Iteration 0:   log likelihood = -1958.4176  
Iteration 1:   log likelihood = -1958.2818  
Iteration 2:   log likelihood = -1958.2818  

Logistic regression                             Number of obs     =      2,854
                                                LR chi2(3)        =       0.27
                                                Prob > chi2       =     0.9653
Log likelihood = -1958.2818                     Pseudo R2         =     0.0001

------------------------------------------------------------------------------
fewer~s_2020 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     age_cat |
18 - 40 y..  |    .955274   .0865588    -0.50   0.614      .799833    1.140924
61 - 80 y..  |   .9884882   .0978167    -0.12   0.907     .8142169     1.20006
  >80 years  |   .9865222   .1630467    -0.08   0.935     .7135512    1.363919
             |
       _cons |   .8046595   .0510137    -3.43   0.001      .710637    .9111219
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/ib1.age_cat_diff_rheum_2020 not found)
file ./output/tempdata/ib1.age_cat_diff_rheum_2020 saved

Iteration 0:   log likelihood =  -2477.771  
Iteration 1:   log likelihood = -2474.2621  
Iteration 2:   log likelihood =  -2474.262  

Logistic regression                             Number of obs     =      3,615
                                                LR chi2(1)        =       7.02
                                                Prob > chi2       =     0.0081
Log likelihood =  -2474.262                     Pseudo R2         =     0.0014

------------------------------------------------------------------------------
fewer~s_2020 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   .8368551   .0563045    -2.65   0.008      .733467    .9548167
       _cons |   .8466731   .0388297    -3.63   0.000     .7738886    .9263031
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/male_diff_rheum_2020.dta not found)
file ./output/tempdata/male_diff_rheum_2020.dta saved

Iteration 0:   log likelihood =  -2477.771  
Iteration 1:   log likelihood =  -2477.652  
Iteration 2:   log likelihood =  -2477.652  

Logistic regression                             Number of obs     =      3,615
                                                LR chi2(1)        =       0.24
                                                Prob > chi2       =     0.6257
Log likelihood =  -2477.652                     Pseudo R2         =     0.0000

------------------------------------------------------------------------------
fewer~s_2020 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
urban_rura~n |   .9678227   .0648962    -0.49   0.626     .8486322    1.103753
       _cons |   .7917485     .03733    -4.95   0.000     .7218619    .8684012
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/urban_rural_bin_diff_rheum_2020.dta not found)
file ./output/tempdata/urban_rural_bin_diff_rheum_2020.dta saved

Iteration 0:   log likelihood =  -2477.771  
Iteration 1:   log likelihood = -2473.5054  
Iteration 2:   log likelihood = -2473.5052  

Logistic regression                             Number of obs     =      3,615
                                                LR chi2(5)        =       8.53
                                                Prob > chi2       =     0.1293
Log likelihood = -2473.5052                     Pseudo R2         =     0.0017

------------------------------------------------------------------------------
fewer~s_2020 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         imd |
          1  |   1.080393   .1787054     0.47   0.640     .7812435    1.494091
          2  |   .9549499   .1577451    -0.28   0.780     .6908334    1.320042
          3  |   .8440227   .1391183    -1.03   0.304      .611016    1.165885
          4  |   .8672236   .1434457    -0.86   0.389     .6270982    1.199297
          5  |   .8282446   .1362536    -1.15   0.252     .5999684    1.143375
             |
       _cons |   .8529412   .1244773    -1.09   0.276     .6407604    1.135383
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/i.imd_diff_rheum_2020 not found)
file ./output/tempdata/i.imd_diff_rheum_2020 saved

Iteration 0:   log likelihood = -1964.4648  
Iteration 1:   log likelihood = -1961.7902  
Iteration 2:   log likelihood = -1961.7899  
Iteration 3:   log likelihood = -1961.7899  

Logistic regression                             Number of obs     =      2,867
                                                LR chi2(5)        =       5.35
                                                Prob > chi2       =     0.3747
Log likelihood = -1961.7899                     Pseudo R2         =     0.0014

------------------------------------------------------------------------------
fewer~s_2020 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    region_n |
          1  |   1.082439    .140528     0.61   0.542     .8392592    1.396082
          4  |   .8049563   .1047698    -1.67   0.096     .6237111     1.03887
          5  |   1.013859   .1300495     0.11   0.915     .7884836    1.303655
          6  |   .8990826   .0960894    -1.00   0.320     .7291678    1.108592
          8  |   .9783095    .128258    -0.17   0.867     .7566279    1.264941
             |
       _cons |   .8114144   .0603918    -2.81   0.005     .7012771     .938849
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/ib3.region_n_diff_rheum_2020 not found)
file ./output/tempdata/ib3.region_n_diff_rheum_2020 saved

Iteration 0:   log likelihood =  -2477.771  
Iteration 1:   log likelihood = -2477.1678  
Iteration 2:   log likelihood = -2477.1678  

Logistic regression                             Number of obs     =      3,615
                                                LR chi2(4)        =       1.21
                                                Prob > chi2       =     0.8771
Log likelihood = -2477.1678                     Pseudo R2         =     0.0002

------------------------------------------------------------------------------
fewer~s_2020 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.039084   .1130377     0.35   0.725       .83956    1.286025
      Black  |   .9476031   .1001709    -0.51   0.611     .7702757    1.165754
      Mixed  |   .9399012    .100697    -0.58   0.563     .7618826    1.159515
      Other  |   .9695661   .1050122    -0.29   0.775     .7841246    1.198863
             |
       _cons |   .7973333   .0618185    -2.92   0.003      .684928    .9281858
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/i.eth5_diff_rheum_2020 not found)
file ./output/tempdata/i.eth5_diff_rheum_2020 saved

Iteration 0:   log likelihood = -1540.8766  
Iteration 1:   log likelihood = -1530.7793  
Iteration 2:   log likelihood = -1530.7775  
Iteration 3:   log likelihood = -1530.7775  

Logistic regression                             Number of obs     =      2,247
                                                LR chi2(19)       =      20.20
                                                Prob > chi2       =     0.3827
Log likelihood = -1530.7775                     Pseudo R2         =     0.0066

------------------------------------------------------------------------------
fewer~s_2020 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     age_cat |
18 - 40 y..  |   .9848724   .1009094    -0.15   0.882      .805687    1.203909
61 - 80 y..  |   .9746019   .1102157    -0.23   0.820     .7808482    1.216432
  >80 years  |   .9347781   .1812619    -0.35   0.728     .6392237    1.366986
             |
        male |   .8278142   .0711678    -2.20   0.028     .6994464    .9797409
urban_rura~n |   1.038615   .0890424     0.44   0.659     .8779692    1.228654
             |
         imd |
          1  |   .8293082   .1774326    -0.87   0.382     .5452544    1.261342
          2  |   .7964428   .1698183    -1.07   0.286     .5243975    1.209619
          3  |   .6462415   .1375448    -2.05   0.040     .4258206    .9807605
          4  |   .6979018   .1485308    -1.69   0.091     .4598727    1.059134
          5  |   .6466826   .1378948    -2.04   0.041     .4257807     .982192
             |
    region_n |
          1  |   .8781561   .1300732    -0.88   0.380     .6568875    1.173958
          4  |   .7681428    .113039    -1.79   0.073     .5756787    1.024953
          5  |   1.046306   .1543273     0.31   0.759     .7836257    1.397039
          6  |   .8263181   .1000869    -1.58   0.115     .6516979    1.047727
          8  |   .8926769   .1330648    -0.76   0.446      .666518    1.195575
             |
        eth5 |
South Asian  |   1.039122   .1436768     0.28   0.781     .7924524    1.362574
      Black  |   .9550392   .1286723    -0.34   0.733     .7333967    1.243665
      Mixed  |   .8783877    .120383    -0.95   0.344     .6714739    1.149062
      Other  |   .9782457   .1369352    -0.16   0.875     .7435265    1.287062
             |
       _cons |   1.342845   .3226226     1.23   0.220     .8385368    2.150452
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/multi_diff_rheum_2020.dta not found)
file ./output/tempdata/multi_diff_rheum_2020.dta saved

  +-----------------------------------------+
  | factor          N_0     N_1   m_0   m_1 |
  |-----------------------------------------|
  | age_cat       1,177     872   311   229 |
  |-----------------------------------------|
  | male          1,488   1,101     0     0 |
  |-----------------------------------------|
  | Rural-Urban   1,488   1,101     0     0 |
  |-----------------------------------------|
  | region        1,488   1,101     0     0 |
  |-----------------------------------------|
  | imd           1,488   1,101     0     0 |
  |-----------------------------------------|
  | smoking       1,488   1,101     0     0 |
  |-----------------------------------------|
  | time_ra         654     490   834   611 |
  |-----------------------------------------|
  | bmi_cat       1,488   1,101     0     0 |
  |-----------------------------------------|
  | eth5          1,488   1,101     0     0 |
  +-----------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------------------+
  |                                          fewer_appts_2021 = 0   fewer_appts
> _2021 = 1   p-value |
  |----------------------------------------------------------------------------
> --------------------|
  |                                          N=1,488                N=1,101    
>                     |
  |----------------------------------------------------------------------------
> --------------------|
  | age_cat       18 - 40 years              404 (34.3%)            284 (32.6%)
>              0.57   |
  |               41 - 60 years              421 (35.8%)            309 (35.4%)
>                     |
  |               61 - 80 years              284 (24.1%)            217 (24.9%)
>                     |
  |               >80 years                  68 ( 5.8%)             62 ( 7.1%) 
>                     |
  |----------------------------------------------------------------------------
> --------------------|
  | male          Female                     771 (51.8%)            599 (54.4%)
>              0.19   |
  |               Male                       717 (48.2%)            502 (45.6%)
>                     |
  |----------------------------------------------------------------------------
> --------------------|
  | Rural-Urban   Rural                      764 (51.3%)            574 (52.1%)
>              0.69   |
  |               Urban                      724 (48.7%)            527 (47.9%)
>                     |
  |----------------------------------------------------------------------------
> --------------------|
  | region        East Midlands              137 ( 9.2%)            107 ( 9.7%)
>              0.94   |
  |               East of England            146 ( 9.8%)            106 ( 9.6%)
>                     |
  |               London                     295 (19.8%)            227 (20.6%)
>                     |
  |               North East                 168 (11.3%)            106 ( 9.6%)
>                     |
  |               North West                 156 (10.5%)            116 (10.5%)
>                     |
  |               South East                 276 (18.5%)            203 (18.4%)
>                     |
  |               West Midlands              152 (10.2%)            111 (10.1%)
>                     |
  |               Yorkshire and the Humber   158 (10.6%)            125 (11.4%)
>                     |
  |----------------------------------------------------------------------------
> --------------------|
  | imd           0                          70 ( 4.7%)             60 ( 5.4%) 
>              0.32   |
  |               1                          259 (17.4%)            206 (18.7%)
>                     |
  |               2                          309 (20.8%)            190 (17.3%)
>                     |
  |               3                          278 (18.7%)            211 (19.2%)
>                     |
  |               4                          277 (18.6%)            217 (19.7%)
>                     |
  |               5                          295 (19.8%)            217 (19.7%)
>                     |
  |----------------------------------------------------------------------------
> --------------------|
  | smoking       Never smoked               171 (11.5%)            106 ( 9.6%)
>              0.10   |
  |               Current smoker             318 (21.4%)            206 (18.7%)
>                     |
  |               Ex-smoker                  194 (13.0%)            157 (14.3%)
>                     |
  |               Unknown                    805 (54.1%)            632 (57.4%)
>                     |
  |----------------------------------------------------------------------------
> --------------------|
  | time_ra                                  53.50505 (31.24025)    55.74088 (3
> 1.85453)     0.24   |
  |----------------------------------------------------------------------------
> --------------------|
  | bmi_cat       Missing                    313 (21.0%)            200 (18.2%)
>              0.020  |
  |               Underweight                131 ( 8.8%)            115 (10.4%)
>                     |
  |               Healthy range              260 (17.5%)            203 (18.4%)
>                     |
  |               Overweight                 298 (20.0%)            214 (19.4%)
>                     |
  |               Obese                      424 (28.5%)            295 (26.8%)
>                     |
  |               Morbidly obese             62 ( 4.2%)             74 ( 6.7%) 
>                     |
  |----------------------------------------------------------------------------
> --------------------|
  | eth5          White                      279 (18.8%)            201 (18.3%)
>              0.68   |
  |               South Asian                278 (18.7%)            194 (17.6%)
>                     |
  |               Black                      318 (21.4%)            262 (23.8%)
>                     |
  |               Mixed                      325 (21.8%)            233 (21.2%)
>                     |
  |               Other                      288 (19.4%)            211 (19.2%)
>                     |
  +----------------------------------------------------------------------------
> --------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file ./output/tables/characteristics_fewer_appts_2021.csv saved
_columna_1: contains nonnumeric characters not specified in ignore(); n1 genera
> ted as double
(2 missing values generated)
_columna_0: contains nonnumeric characters not specified in ignore(); n0 genera
> ted as double
(2 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent1 generated as double
(2 missing values generated)
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
file ./output/tables/characteristics_fewer_appts_2021_rounded.csv saved

  +-----------------------------------------+
  | factor          N_0   N_1     m_0   m_1 |
  |-----------------------------------------|
  | age_cat       3,929    19   1,046     6 |
  |-----------------------------------------|
  | male          4,975    25       0     0 |
  |-----------------------------------------|
  | Rural-Urban   4,975    25       0     0 |
  |-----------------------------------------|
  | region        4,975    25       0     0 |
  |-----------------------------------------|
  | imd           4,975    25       0     0 |
  |-----------------------------------------|
  | smoking       4,975    25       0     0 |
  |-----------------------------------------|
  | time_ra       2,206    15   2,769    10 |
  |-----------------------------------------|
  | bmi_cat       4,975    25       0     0 |
  |-----------------------------------------|
  | eth5          4,975    25       0     0 |
  +-----------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> ------------------+
  |                                          no_appts_2021 = 0     no_appts_202
> 1 = 1     p-value |
  |----------------------------------------------------------------------------
> ------------------|
  |                                          N=4,975               N=25        
>                   |
  |----------------------------------------------------------------------------
> ------------------|
  | age_cat       18 - 40 years              1,338 (34.1%)         12 (63.2%)  
>            0.058  |
  |               41 - 60 years              1,375 (35.0%)         4 (21.1%)   
>                   |
  |               61 - 80 years              989 (25.2%)           3 (15.8%)   
>                   |
  |               >80 years                  227 ( 5.8%)           0 ( 0.0%)   
>                   |
  |----------------------------------------------------------------------------
> ------------------|
  | male          Female                     2,632 (52.9%)         11 (44.0%)  
>            0.37   |
  |               Male                       2,343 (47.1%)         14 (56.0%)  
>                   |
  |----------------------------------------------------------------------------
> ------------------|
  | Rural-Urban   Rural                      2,502 (50.3%)         10 (40.0%)  
>            0.30   |
  |               Urban                      2,473 (49.7%)         15 (60.0%)  
>                   |
  |----------------------------------------------------------------------------
> ------------------|
  | region        East Midlands              498 (10.0%)           2 ( 8.0%)   
>            0.069  |
  |               East of England            503 (10.1%)           1 ( 4.0%)   
>                   |
  |               London                     993 (20.0%)           4 (16.0%)   
>                   |
  |               North East                 477 ( 9.6%)           2 ( 8.0%)   
>                   |
  |               North West                 519 (10.4%)           1 ( 4.0%)   
>                   |
  |               South East                 989 (19.9%)           12 (48.0%)  
>                   |
  |               West Midlands              479 ( 9.6%)           2 ( 8.0%)   
>                   |
  |               Yorkshire and the Humber   517 (10.4%)           1 ( 4.0%)   
>                   |
  |----------------------------------------------------------------------------
> ------------------|
  | imd           0                          276 ( 5.5%)           0 ( 0.0%)   
>            0.47   |
  |               1                          946 (19.0%)           4 (16.0%)   
>                   |
  |               2                          921 (18.5%)           3 (12.0%)   
>                   |
  |               3                          918 (18.5%)           8 (32.0%)   
>                   |
  |               4                          941 (18.9%)           5 (20.0%)   
>                   |
  |               5                          973 (19.6%)           5 (20.0%)   
>                   |
  |----------------------------------------------------------------------------
> ------------------|
  | smoking       Never smoked               516 (10.4%)           2 ( 8.0%)   
>            0.35   |
  |               Current smoker             1,004 (20.2%)         2 ( 8.0%)   
>                   |
  |               Ex-smoker                  700 (14.1%)           3 (12.0%)   
>                   |
  |               Unknown                    2,755 (55.4%)         18 (72.0%)  
>                   |
  |----------------------------------------------------------------------------
> ------------------|
  | time_ra                                  54.55923 (31.46522)   56.74889 (35
> .21469)    0.79   |
  |----------------------------------------------------------------------------
> ------------------|
  | bmi_cat       Missing                    1,012 (20.3%)         4 (16.0%)   
>            0.19   |
  |               Underweight                474 ( 9.5%)           4 (16.0%)   
>                   |
  |               Healthy range              915 (18.4%)           5 (20.0%)   
>                   |
  |               Overweight                 953 (19.2%)           3 (12.0%)   
>                   |
  |               Obese                      1,346 (27.1%)         5 (20.0%)   
>                   |
  |               Morbidly obese             275 ( 5.5%)           4 (16.0%)   
>                   |
  |----------------------------------------------------------------------------
> ------------------|
  | eth5          White                      926 (18.6%)           4 (16.0%)   
>            0.73   |
  |               South Asian                964 (19.4%)           7 (28.0%)   
>                   |
  |               Black                      1,037 (20.8%)         6 (24.0%)   
>                   |
  |               Mixed                      1,036 (20.8%)         5 (20.0%)   
>                   |
  |               Other                      1,012 (20.3%)         3 (12.0%)   
>                   |
  +----------------------------------------------------------------------------
> ------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file ./output/tables/characteristics_no_appts_2021.csv saved
_columna_1: contains nonnumeric characters not specified in ignore(); n1 genera
> ted as double
(2 missing values generated)
_columna_0: contains nonnumeric characters not specified in ignore()
_columna_0: character , removed; n0 generated as double
(2 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent1 generated as double
(2 missing values generated)
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
file ./output/tables/characteristics_no_appts_2021_rounded.csv saved

Iteration 0:   log likelihood = -1397.4739  
Iteration 1:   log likelihood =  -1396.482  
Iteration 2:   log likelihood = -1396.4819  

Logistic regression                             Number of obs     =      2,049
                                                LR chi2(3)        =       1.98
                                                Prob > chi2       =     0.5757
Log likelihood = -1396.4819                     Pseudo R2         =     0.0007

------------------------------------------------------------------------------
fewer~s_2021 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     age_cat |
18 - 40 y..  |   .9577686     .10319    -0.40   0.689      .775447    1.182957
61 - 80 y..  |   1.041034    .122032     0.34   0.732      .827343    1.309919
  >80 years  |   1.242243    .237156     1.14   0.256      .854484    1.805963
             |
       _cons |   .7339667   .0549816    -4.13   0.000     .6337423    .8500414
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/ib1.age_cat_diff_rheum_2021 not found)
file ./output/tempdata/ib1.age_cat_diff_rheum_2021 saved

Iteration 0:   log likelihood = -1765.5253  
Iteration 1:   log likelihood = -1764.6727  
Iteration 2:   log likelihood = -1764.6727  

Logistic regression                             Number of obs     =      2,589
                                                LR chi2(1)        =       1.71
                                                Prob > chi2       =     0.1916
Log likelihood = -1764.6727                     Pseudo R2         =     0.0005

------------------------------------------------------------------------------
fewer~s_2021 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   .9011812   .0718304    -1.31   0.192     .7708421    1.053559
       _cons |   .7769131   .0423148    -4.63   0.000     .6982509     .864437
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/male_diff_rheum_2021.dta not found)
file ./output/tempdata/male_diff_rheum_2021.dta saved

Iteration 0:   log likelihood = -1765.5253  
Iteration 1:   log likelihood = -1765.4461  
Iteration 2:   log likelihood = -1765.4461  

Logistic regression                             Number of obs     =      2,589
                                                LR chi2(1)        =       0.16
                                                Prob > chi2       =     0.6907
Log likelihood = -1765.4461                     Pseudo R2         =     0.0000

------------------------------------------------------------------------------
fewer~s_2021 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
urban_rura~n |   .9688432   .0770813    -0.40   0.691     .8289567    1.132336
       _cons |   .7513089   .0414996    -5.18   0.000     .6742194    .8372128
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/urban_rural_bin_diff_rheum_2021.dta not found)
file ./output/tempdata/urban_rural_bin_diff_rheum_2021.dta saved

Iteration 0:   log likelihood = -1765.5253  
Iteration 1:   log likelihood = -1762.5978  
Iteration 2:   log likelihood = -1762.5972  
Iteration 3:   log likelihood = -1762.5972  

Logistic regression                             Number of obs     =      2,589
                                                LR chi2(5)        =       5.86
                                                Prob > chi2       =     0.3205
Log likelihood = -1762.5972                     Pseudo R2         =     0.0017

------------------------------------------------------------------------------
fewer~s_2021 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         imd |
          1  |   .9279279   .1848132    -0.38   0.707      .628033    1.371027
          2  |   .7173679    .142487    -1.67   0.094     .4860402    1.058794
          3  |   .8854916   .1755169    -0.61   0.540     .6004326    1.305884
          4  |   .9139591   .1808872    -0.45   0.649     .6200979     1.34708
          5  |   .8581921   .1693718    -0.77   0.438     .5828977    1.263504
             |
       _cons |   .8571429   .1507996    -0.88   0.381      .607154    1.210062
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/i.imd_diff_rheum_2021 not found)
file ./output/tempdata/i.imd_diff_rheum_2021 saved

Iteration 0:   log likelihood =  -1399.629  
Iteration 1:   log likelihood = -1398.6129  
Iteration 2:   log likelihood = -1398.6128  

Logistic regression                             Number of obs     =      2,054
                                                LR chi2(5)        =       2.03
                                                Prob > chi2       =     0.8447
Log likelihood = -1398.6128                     Pseudo R2         =     0.0007

------------------------------------------------------------------------------
fewer~s_2021 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    region_n |
          1  |   1.014984   .1586761     0.10   0.924     .7471159    1.378894
          4  |   .8199605   .1248427    -1.30   0.192     .6084062    1.105076
          5  |   .9663391   .1459974    -0.23   0.821     .7186667    1.299366
          6  |   .9558354    .122199    -0.35   0.724     .7439796    1.228019
          8  |   .9490204   .1451197    -0.34   0.732     .7032567     1.28067
             |
       _cons |   .7694915   .0679384    -2.97   0.003     .6472191    .9148637
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/ib3.region_n_diff_rheum_2021 not found)
file ./output/tempdata/ib3.region_n_diff_rheum_2021 saved

Iteration 0:   log likelihood = -1765.5253  
Iteration 1:   log likelihood = -1764.3865  
Iteration 2:   log likelihood = -1764.3865  

Logistic regression                             Number of obs     =      2,589
                                                LR chi2(4)        =       2.28
                                                Prob > chi2       =     0.6849
Log likelihood = -1764.3865                     Pseudo R2         =     0.0006

------------------------------------------------------------------------------
fewer~s_2021 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |    .968646   .1274464    -0.24   0.809     .7484642      1.2536
      Black  |   1.143622   .1424752     1.08   0.281     .8958546    1.459914
      Mixed  |    .995132   .1255923    -0.04   0.969     .7770579    1.274407
      Other  |   1.016947   .1316972     0.13   0.897     .7889788    1.310783
             |
       _cons |   .7204301   .0666519    -3.54   0.000     .6009543    .8636589
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/i.eth5_diff_rheum_2021 not found)
file ./output/tempdata/i.eth5_diff_rheum_2021 saved

Iteration 0:   log likelihood =   -1096.24  
Iteration 1:   log likelihood = -1086.5692  
Iteration 2:   log likelihood =  -1086.564  
Iteration 3:   log likelihood =  -1086.564  

Logistic regression                             Number of obs     =      1,609
                                                LR chi2(19)       =      19.35
                                                Prob > chi2       =     0.4345
Log likelihood =  -1086.564                     Pseudo R2         =     0.0088

------------------------------------------------------------------------------
fewer~s_2021 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     age_cat |
18 - 40 y..  |   .9063525    .111259    -0.80   0.423     .7125383    1.152885
61 - 80 y..  |   .9935956   .1328679    -0.05   0.962     .7645103    1.291326
  >80 years  |   1.101681   .2470161     0.43   0.666     .7099069    1.709661
             |
        male |   .8638427   .0885404    -1.43   0.153     .7066266    1.056038
urban_rura~n |   1.081237   .1102806     0.77   0.444     .8853255    1.320502
             |
         imd |
          1  |   .6576401   .1713507    -1.61   0.108     .3946431    1.095903
          2  |   .5677472   .1470662    -2.19   0.029     .3417153     .943291
          3  |   .6659189    .172402    -1.57   0.116     .4009136    1.106094
          4  |   .7514409   .1936201    -1.11   0.267     .4534923    1.245144
          5  |   .7457232   .1925871    -1.14   0.256     .4495212    1.237101
             |
    region_n |
          1  |   .9840145   .1749534    -0.09   0.928     .6944831    1.394252
          4  |   .8033052   .1387351    -1.27   0.205     .5726293    1.126906
          5  |   1.066612   .1853098     0.37   0.711     .7587897     1.49931
          6  |   .9810138   .1427052    -0.13   0.895     .7376551    1.304659
          8  |    .864818   .1526532    -0.82   0.411     .6118924     1.22229
             |
        eth5 |
South Asian  |   .8918257   .1507073    -0.68   0.498     .6403799    1.242002
      Black  |   1.281391   .2040934     1.56   0.120     .9377923    1.750882
      Mixed  |   1.129775   .1813997     0.76   0.447     .8247471    1.547616
      Other  |   1.158839   .1939202     0.88   0.378     .8348007    1.608656
             |
       _cons |   1.086388   .3135547     0.29   0.774     .6170352    1.912757
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/multi_diff_rheum_2021.dta not found)
file ./output/tempdata/multi_diff_rheum_2021.dta saved

  +-------------------------------------+
  | factor        N_0   N_1   m_0   m_1 |
  |-------------------------------------|
  | age_cat       736   615   210   168 |
  |-------------------------------------|
  | male          946   783     0     0 |
  |-------------------------------------|
  | Rural-Urban   946   783     0     0 |
  |-------------------------------------|
  | region        946   783     0     0 |
  |-------------------------------------|
  | imd           946   783     0     0 |
  |-------------------------------------|
  | smoking       946   783     0     0 |
  |-------------------------------------|
  | time_ra       409   358   537   425 |
  |-------------------------------------|
  | bmi_cat       946   783     0     0 |
  |-------------------------------------|
  | eth5          946   783     0     0 |
  +-------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------------------+
  |                                          fewer_appts_2022 = 0   fewer_appts
> _2022 = 1   p-value |
  |----------------------------------------------------------------------------
> --------------------|
  |                                          N=946                  N=783      
>                     |
  |----------------------------------------------------------------------------
> --------------------|
  | age_cat       18 - 40 years              239 (32.5%)            202 (32.8%)
>              0.65   |
  |               41 - 60 years              264 (35.9%)            224 (36.4%)
>                     |
  |               61 - 80 years              177 (24.0%)            153 (24.9%)
>                     |
  |               >80 years                  56 ( 7.6%)             36 ( 5.9%) 
>                     |
  |----------------------------------------------------------------------------
> --------------------|
  | male          Female                     508 (53.7%)            410 (52.4%)
>              0.58   |
  |               Male                       438 (46.3%)            373 (47.6%)
>                     |
  |----------------------------------------------------------------------------
> --------------------|
  | Rural-Urban   Rural                      493 (52.1%)            394 (50.3%)
>              0.46   |
  |               Urban                      453 (47.9%)            389 (49.7%)
>                     |
  |----------------------------------------------------------------------------
> --------------------|
  | region        East Midlands              77 ( 8.1%)             85 (10.9%) 
>              0.014  |
  |               East of England            109 (11.5%)            59 ( 7.5%) 
>                     |
  |               London                     202 (21.4%)            156 (19.9%)
>                     |
  |               North East                 94 ( 9.9%)             89 (11.4%) 
>                     |
  |               North West                 88 ( 9.3%)             94 (12.0%) 
>                     |
  |               South East                 185 (19.6%)            138 (17.6%)
>                     |
  |               West Midlands              90 ( 9.5%)             89 (11.4%) 
>                     |
  |               Yorkshire and the Humber   101 (10.7%)            73 ( 9.3%) 
>                     |
  |----------------------------------------------------------------------------
> --------------------|
  | imd           0                          45 ( 4.8%)             41 ( 5.2%) 
>              0.14   |
  |               1                          158 (16.7%)            136 (17.4%)
>                     |
  |               2                          160 (16.9%)            165 (21.1%)
>                     |
  |               3                          205 (21.7%)            139 (17.8%)
>                     |
  |               4                          189 (20.0%)            159 (20.3%)
>                     |
  |               5                          189 (20.0%)            143 (18.3%)
>                     |
  |----------------------------------------------------------------------------
> --------------------|
  | smoking       Never smoked               97 (10.3%)             93 (11.9%) 
>              0.69   |
  |               Current smoker             191 (20.2%)            153 (19.5%)
>                     |
  |               Ex-smoker                  123 (13.0%)            107 (13.7%)
>                     |
  |               Unknown                    535 (56.6%)            430 (54.9%)
>                     |
  |----------------------------------------------------------------------------
> --------------------|
  | time_ra                                  55.46136 (31.27068)    53.45018 (3
> 2.05679)     0.38   |
  |----------------------------------------------------------------------------
> --------------------|
  | bmi_cat       Missing                    197 (20.8%)            157 (20.1%)
>              0.93   |
  |               Underweight                82 ( 8.7%)             77 ( 9.8%) 
>                     |
  |               Healthy range              168 (17.8%)            134 (17.1%)
>                     |
  |               Overweight                 183 (19.3%)            157 (20.1%)
>                     |
  |               Obese                      267 (28.2%)            213 (27.2%)
>                     |
  |               Morbidly obese             49 ( 5.2%)             45 ( 5.7%) 
>                     |
  |----------------------------------------------------------------------------
> --------------------|
  | eth5          White                      187 (19.8%)            143 (18.3%)
>              0.83   |
  |               South Asian                174 (18.4%)            149 (19.0%)
>                     |
  |               Black                      206 (21.8%)            180 (23.0%)
>                     |
  |               Mixed                      218 (23.0%)            170 (21.7%)
>                     |
  |               Other                      161 (17.0%)            141 (18.0%)
>                     |
  +----------------------------------------------------------------------------
> --------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file ./output/tables/characteristics_fewer_appts_2022.csv saved
_columna_1: contains nonnumeric characters not specified in ignore(); n1 genera
> ted as double
(2 missing values generated)
_columna_0: contains nonnumeric characters not specified in ignore(); n0 genera
> ted as double
(2 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent1 generated as double
(2 missing values generated)
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
file ./output/tables/characteristics_fewer_appts_2022_rounded.csv saved

  +-----------------------------------------+
  | factor          N_0   N_1     m_0   m_1 |
  |-----------------------------------------|
  | age_cat       3,935    13   1,048     4 |
  |-----------------------------------------|
  | male          4,983    17       0     0 |
  |-----------------------------------------|
  | Rural-Urban   4,983    17       0     0 |
  |-----------------------------------------|
  | region        4,983    17       0     0 |
  |-----------------------------------------|
  | imd           4,983    17       0     0 |
  |-----------------------------------------|
  | smoking       4,983    17       0     0 |
  |-----------------------------------------|
  | time_ra       2,214     7   2,769    10 |
  |-----------------------------------------|
  | bmi_cat       4,983    17       0     0 |
  |-----------------------------------------|
  | eth5          4,983    17       0     0 |
  +-----------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> ---------------+
  |                                          no_appts_2022 = 0    no_appts_2022
>  = 1   p-value |
  |----------------------------------------------------------------------------
> ---------------|
  |                                          N=4,983              N=17         
>                |
  |----------------------------------------------------------------------------
> ---------------|
  | age_cat       18 - 40 years              1,345 (34.2%)        5 (38.5%)    
>         0.84   |
  |               41 - 60 years              1,376 (35.0%)        3 (23.1%)    
>                |
  |               61 - 80 years              988 (25.1%)          4 (30.8%)    
>                |
  |               >80 years                  226 ( 5.7%)          1 ( 7.7%)    
>                |
  |----------------------------------------------------------------------------
> ---------------|
  | male          Female                     2,635 (52.9%)        8 (47.1%)    
>         0.63   |
  |               Male                       2,348 (47.1%)        9 (52.9%)    
>                |
  |----------------------------------------------------------------------------
> ---------------|
  | Rural-Urban   Rural                      2,501 (50.2%)        11 (64.7%)   
>         0.23   |
  |               Urban                      2,482 (49.8%)        6 (35.3%)    
>                |
  |----------------------------------------------------------------------------
> ---------------|
  | region        East Midlands              498 (10.0%)          2 (11.8%)    
>         0.39   |
  |               East of England            504 (10.1%)          0 ( 0.0%)    
>                |
  |               London                     995 (20.0%)          2 (11.8%)    
>                |
  |               North East                 476 ( 9.6%)          3 (17.6%)    
>                |
  |               North West                 517 (10.4%)          3 (17.6%)    
>                |
  |               South East                 997 (20.0%)          4 (23.5%)    
>                |
  |               West Midlands              478 ( 9.6%)          3 (17.6%)    
>                |
  |               Yorkshire and the Humber   518 (10.4%)          0 ( 0.0%)    
>                |
  |----------------------------------------------------------------------------
> ---------------|
  | imd           0                          275 ( 5.5%)          1 ( 5.9%)    
>         0.15   |
  |               1                          947 (19.0%)          3 (17.6%)    
>                |
  |               2                          917 (18.4%)          7 (41.2%)    
>                |
  |               3                          923 (18.5%)          3 (17.6%)    
>                |
  |               4                          943 (18.9%)          3 (17.6%)    
>                |
  |               5                          978 (19.6%)          0 ( 0.0%)    
>                |
  |----------------------------------------------------------------------------
> ---------------|
  | smoking       Never smoked               516 (10.4%)          2 (11.8%)    
>         0.98   |
  |               Current smoker             1,003 (20.1%)        3 (17.6%)    
>                |
  |               Ex-smoker                  701 (14.1%)          2 (11.8%)    
>                |
  |               Unknown                    2,763 (55.4%)        10 (58.8%)   
>                |
  |----------------------------------------------------------------------------
> ---------------|
  | time_ra                                  54.6577 (31.48272)   28.106 (18.95
> 059)    0.026  |
  |----------------------------------------------------------------------------
> ---------------|
  | bmi_cat       Missing                    1,009 (20.2%)        7 (41.2%)    
>         0.17   |
  |               Underweight                477 ( 9.6%)          1 ( 5.9%)    
>                |
  |               Healthy range              919 (18.4%)          1 ( 5.9%)    
>                |
  |               Overweight                 951 (19.1%)          5 (29.4%)    
>                |
  |               Obese                      1,348 (27.1%)        3 (17.6%)    
>                |
  |               Morbidly obese             279 ( 5.6%)          0 ( 0.0%)    
>                |
  |----------------------------------------------------------------------------
> ---------------|
  | eth5          White                      926 (18.6%)          4 (23.5%)    
>         0.62   |
  |               South Asian                968 (19.4%)          3 (17.6%)    
>                |
  |               Black                      1,038 (20.8%)        5 (29.4%)    
>                |
  |               Mixed                      1,037 (20.8%)        4 (23.5%)    
>                |
  |               Other                      1,014 (20.3%)        1 ( 5.9%)    
>                |
  +----------------------------------------------------------------------------
> ---------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file ./output/tables/characteristics_no_appts_2022.csv saved
_columna_1: contains nonnumeric characters not specified in ignore(); n1 genera
> ted as double
(2 missing values generated)
_columna_0: contains nonnumeric characters not specified in ignore()
_columna_0: character , removed; n0 generated as double
(2 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent1 generated as double
(2 missing values generated)
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
file ./output/tables/characteristics_no_appts_2022_rounded.csv saved

Iteration 0:   log likelihood = -931.01599  
Iteration 1:   log likelihood = -930.18203  
Iteration 2:   log likelihood = -930.18181  
Iteration 3:   log likelihood = -930.18181  

Logistic regression                             Number of obs     =      1,351
                                                LR chi2(3)        =       1.67
                                                Prob > chi2       =     0.6440
Log likelihood = -930.18181                     Pseudo R2         =     0.0009

------------------------------------------------------------------------------
fewer~s_2022 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     age_cat |
18 - 40 y..  |   .9961148   .1313466    -0.03   0.976      .769256    1.289876
61 - 80 y..  |   1.018765   .1456436     0.13   0.897     .7698135    1.348226
  >80 years  |   .7576531   .1758785    -1.20   0.232      .480702    1.194166
             |
       _cons |   .8484848   .0770776    -1.81   0.071     .7101004    1.013838
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/ib1.age_cat_diff_rheum_2022 not found)
file ./output/tempdata/ib1.age_cat_diff_rheum_2022 saved

Iteration 0:   log likelihood = -1190.7567  
Iteration 1:   log likelihood =  -1190.603  
Iteration 2:   log likelihood =  -1190.603  

Logistic regression                             Number of obs     =      1,729
                                                LR chi2(1)        =       0.31
                                                Prob > chi2       =     0.5792
Log likelihood =  -1190.603                     Pseudo R2         =     0.0001

------------------------------------------------------------------------------
fewer~s_2022 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   1.055151    .102146     0.55   0.579     .8727951    1.275607
       _cons |   .8070866   .0535818    -3.23   0.001     .7086137    .9192439
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/male_diff_rheum_2022.dta not found)
file ./output/tempdata/male_diff_rheum_2022.dta saved

Iteration 0:   log likelihood = -1190.7567  
Iteration 1:   log likelihood = -1190.4805  
Iteration 2:   log likelihood = -1190.4805  

Logistic regression                             Number of obs     =      1,729
                                                LR chi2(1)        =       0.55
                                                Prob > chi2       =     0.4573
Log likelihood = -1190.4805                     Pseudo R2         =     0.0002

------------------------------------------------------------------------------
fewer~s_2022 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
urban_rura~n |   1.074489   .1038685     0.74   0.457     .8890338    1.298631
       _cons |   .7991886   .0540057    -3.32   0.001     .7000496    .9123675
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/urban_rural_bin_diff_rheum_2022.dta not found)
file ./output/tempdata/urban_rural_bin_diff_rheum_2022.dta saved

Iteration 0:   log likelihood = -1190.7567  
Iteration 1:   log likelihood = -1186.6339  
Iteration 2:   log likelihood = -1186.6335  
Iteration 3:   log likelihood = -1186.6335  

Logistic regression                             Number of obs     =      1,729
                                                LR chi2(5)        =       8.25
                                                Prob > chi2       =     0.1432
Log likelihood = -1186.6335                     Pseudo R2         =     0.0035

------------------------------------------------------------------------------
fewer~s_2022 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         imd |
          1  |    .944736   .2319794    -0.23   0.817     .5838462    1.528701
          2  |    1.13186   .2747485     0.51   0.610     .7033497    1.821436
          3  |   .7441999    .180282    -1.22   0.223     .4628993    1.196445
          4  |   .9233449   .2227402    -0.33   0.741     .5754758    1.481497
          5  |   .8304297   .2015336    -0.77   0.444     .5160933    1.336219
             |
       _cons |   .9111111   .1967082    -0.43   0.666     .5967571    1.391057
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/i.imd_diff_rheum_2022 not found)
file ./output/tempdata/i.imd_diff_rheum_2022 saved

Iteration 0:   log likelihood = -958.78896  
Iteration 1:   log likelihood = -954.63244  
Iteration 2:   log likelihood = -954.63233  
Iteration 3:   log likelihood = -954.63233  

Logistic regression                             Number of obs     =      1,387
                                                LR chi2(5)        =       8.31
                                                Prob > chi2       =     0.1398
Log likelihood = -954.63233                     Pseudo R2         =     0.0043

------------------------------------------------------------------------------
fewer~s_2022 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    region_n |
          1  |   1.429404   .2716337     1.88   0.060      .984915    2.074489
          4  |   1.225996   .2235048     1.12   0.264     .8576516    1.752536
          5  |   1.383159   .2526402     1.78   0.076     .9669324    1.978553
          6  |   .9659044   .1496763    -0.22   0.823     .7129058    1.308688
          8  |   1.280484   .2350929     1.35   0.178     .8935036    1.835068
             |
       _cons |   .7722772   .0823146    -2.42   0.015     .6266808    .9517001
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/ib3.region_n_diff_rheum_2022 not found)
file ./output/tempdata/ib3.region_n_diff_rheum_2022 saved

Iteration 0:   log likelihood = -1190.7567  
Iteration 1:   log likelihood = -1190.0252  
Iteration 2:   log likelihood = -1190.0252  

Logistic regression                             Number of obs     =      1,729
                                                LR chi2(4)        =       1.46
                                                Prob > chi2       =     0.8332
Log likelihood = -1190.0252                     Pseudo R2         =     0.0006

------------------------------------------------------------------------------
fewer~s_2022 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.119805   .1763441     0.72   0.472     .8224274    1.524711
      Black  |   1.142644   .1723481     0.88   0.377     .8502013    1.535677
      Mixed  |    1.01976   .1540145     0.13   0.897     .7584743    1.371056
      Other  |   1.145246   .1833967     0.85   0.397     .8367382    1.567502
             |
       _cons |   .7647059   .0849498    -2.41   0.016     .6150861    .9507207
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/i.eth5_diff_rheum_2022 not found)
file ./output/tempdata/i.eth5_diff_rheum_2022 saved

Iteration 0:   log likelihood = -740.49883  
Iteration 1:   log likelihood = -729.75374  
Iteration 2:   log likelihood = -729.75039  
Iteration 3:   log likelihood = -729.75039  

Logistic regression                             Number of obs     =      1,070
                                                LR chi2(19)       =      21.50
                                                Prob > chi2       =     0.3100
Log likelihood = -729.75039                     Pseudo R2         =     0.0145

------------------------------------------------------------------------------
fewer~s_2022 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     age_cat |
18 - 40 y..  |   .9910575   .1489483    -0.06   0.952     .7381929     1.33054
61 - 80 y..  |   1.045409   .1704875     0.27   0.785        .7594    1.439137
  >80 years  |   .7064796   .1873085    -1.31   0.190     .4201662    1.187895
             |
        male |   .8153676   .1023398    -1.63   0.104     .6375526    1.042776
urban_rura~n |   1.166608   .1458809     1.23   0.218     .9130292    1.490614
             |
         imd |
          1  |   .8317484    .266507    -0.57   0.565     .4438659    1.558591
          2  |    1.06617   .3370566     0.20   0.839     .5737595    1.981178
          3  |   .7517797   .2364741    -0.91   0.364     .4058291    1.392637
          4  |   .9622374   .3003282    -0.12   0.902     .5219272    1.774004
          5  |   .7914851   .2506299    -0.74   0.460     .4255036    1.472253
             |
    region_n |
          1  |   1.386195    .301957     1.50   0.134     .9044942    2.124432
          4  |   1.189879   .2503159     0.83   0.409     .7878342    1.797094
          5  |   1.684328   .3635287     2.42   0.016     1.103346    2.571234
          6  |   1.037848   .1839866     0.21   0.834     .7332221    1.469036
          8  |   1.541293   .3292113     2.03   0.043     1.014083    2.342594
             |
        eth5 |
South Asian  |    .962578   .1916765    -0.19   0.848     .6515348    1.422113
      Black  |   1.166218   .2258779     0.79   0.427     .7978398    1.704685
      Mixed  |    .885553   .1708494    -0.63   0.529      .606726    1.292518
      Other  |   1.156908   .2399095     0.70   0.482     .7705205    1.737055
             |
       _cons |   .8678295   .3005037    -0.41   0.682      .440239    1.710725
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/multi_diff_rheum_2022.dta not found)
file ./output/tempdata/multi_diff_rheum_2022.dta saved

. * Put together 2020 and 2021 logistic regression results
. preserve 

. use "./output/tempdata/ib1.age_cat_diff_rheum_2020", clear 

. append using "./output/tempdata/male_diff_rheum_2020"

. append using "./output/tempdata/urban_rural_bin_diff_rheum_2020"
(note: variable idstr was str22, now str26 to accommodate using data's
       values)
(note: variable parm was str10, now str15 to accommodate using data's values)
(note: variable label was str8, now str11 to accommodate using data's values)

. append using "./output/tempdata/i.imd_diff_rheum_2020"

. append using "./output/tempdata/ib3.region_n_diff_rheum_2020"

. append using "./output/tempdata/i.eth5_diff_rheum_2020"

. append using "./output/tempdata/multi_diff_rheum_2020"

. append using "./output/tempdata/ib1.age_cat_diff_rheum_2021"

. append using "./output/tempdata/male_diff_rheum_2021"

. append using "./output/tempdata/urban_rural_bin_diff_rheum_2021"

. append using "./output/tempdata/i.imd_diff_rheum_2021"

. append using "./output/tempdata/ib3.region_n_diff_rheum_2021"

. append using "./output/tempdata/i.eth5_diff_rheum_2021"

. append using "./output/tempdata/multi_diff_rheum_2021"

. append using "./output/tempdata/ib1.age_cat_diff_rheum_2022"

. append using "./output/tempdata/male_diff_rheum_2022"

. append using "./output/tempdata/urban_rural_bin_diff_rheum_2022"

. append using "./output/tempdata/i.imd_diff_rheum_2022"

. append using "./output/tempdata/ib3.region_n_diff_rheum_2022"

. append using "./output/tempdata/i.eth5_diff_rheum_2022"

. append using "./output/tempdata/multi_diff_rheum_2022"

. drop stderr z 

. export delimited using ./output/tables/logistic_diff_results.csv 
file ./output/tables/logistic_diff_results.csv saved

. restore

. 
. 
. * Tabulate characteristics by categories of differences in all outpatient app
> ointments for each year
. * When stratified there are small numbers with missing region therefore tabul
> ate only those without region missing
. drop if region=="missing"
(0 observations deleted)

. tempfile tempfile

. forvalues i=2020/2022 {
  2.     preserve
  3.     table1_mc, vars(age_cat cat \ male cat \ urban_rural_bin cat \ region 
> cat \ imd cat \ smoking cat \ time_ra contn \ bmi_cat cat \ eth5 cat) by(fewe
> r_appts_all_`i') clear
  4.     export delimited using ./output/tables/characteristics_fewer_appts_all
> _`i'.csv    
  5.     destring _columna_1, gen(n1) ignore(",") force
  6.     destring _columna_0, gen(n0) ignore(",") force
  7.     destring _columnb_1, gen(percent1) ignore("-" "%" "(" ")")  force
  8.     destring _columnb_0, gen(percent0) ignore("-" "%" "(" ")")  force
  9.     gen rounded_n1 = round(n1, 5)
 10.     gen rounded_n0 = round(n0, 5)
 11.     keep factor level rounded_n0 percent0 rounded_n1 percent1
 12.     export delimited using ./output/tables/characteristics_fewer_appts_all
> _`i'_rounded.csv
 13.     restore 
 14.     * No appointments 
.     preserve
 15.     table1_mc, vars(age_cat cat \ male cat \ urban_rural_bin cat \ region 
> cat \ imd cat \ smoking cat \ time_ra contn \ bmi_cat cat \ eth5 cat) by(no_a
> ppts_all_`i') clear
 16.     export delimited using ./output/tables/characteristics_no_appts_all_`i
> '.csv    
 17.     destring _columna_1, gen(n1) ignore(",") force
 18.     destring _columna_0, gen(n0) ignore(",") force
 19.     destring _columnb_1, gen(percent1) ignore("-" "%" "(" ")")  force
 20.     destring _columnb_0, gen(percent0) ignore("-" "%" "(" ")")  force
 21.     gen rounded_n1 = round(n1, 5)
 22.     gen rounded_n0 = round(n0, 5)
 23.     keep factor level rounded_n0 percent0 rounded_n1 percent1
 24.     export delimited using ./output/tables/characteristics_no_appts_all_`i
> '_rounded.csv
 25.     restore
 26.     * Logistic regression 
.     foreach var in urban_rural_bin i.imd i.region_n i.eth5 {
 27.         logit fewer_appts_all_`i' `var' ib1.age_cat male, or 
 28.         est sto m2
 29.         parmest, label eform format(estimate p min95 max95) saving("./outp
> ut/tempdata/`var'_diff_all_`i'", replace) idstr("`var'_all_`i'")
 30.         }
 31.     logit fewer_appts_all_`i' ib1.age_cat male urban_rural_bin i.imd ib3.r
> egion_n i.eth5, or 
 32.     est sto m2
 33.     parmest, label eform format(estimate p min95 max95) saving("./output/t
> empdata/multi_diff_all_`i'", replace) idstr("multi_all_`i'")
 34.     }

  +-------------------------------------------+
  | factor          N_0     N_1     m_0   m_1 |
  |-------------------------------------------|
  | age_cat       1,588   1,269     425   329 |
  |-------------------------------------------|
  | male          2,013   1,598       0     0 |
  |-------------------------------------------|
  | Rural-Urban   2,013   1,598       0     0 |
  |-------------------------------------------|
  | region        2,013   1,598       0     0 |
  |-------------------------------------------|
  | imd           2,013   1,598       0     0 |
  |-------------------------------------------|
  | smoking       2,013   1,598       0     0 |
  |-------------------------------------------|
  | time_ra         909     684   1,104   914 |
  |-------------------------------------------|
  | bmi_cat       2,013   1,598       0     0 |
  |-------------------------------------------|
  | eth5          2,013   1,598       0     0 |
  +-------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> ----------------------------+
  |                                          fewer_appts_all_2020 = 0   fewer_a
> ppts_all_2020 = 1   p-value |
  |----------------------------------------------------------------------------
> ----------------------------|
  |                                          N=2,013                    N=1,598
>                             |
  |----------------------------------------------------------------------------
> ----------------------------|
  | age_cat       18 - 40 years              565 (35.6%)                409 (32
> .2%)                 0.12   |
  |               41 - 60 years              533 (33.6%)                476 (37
> .5%)                        |
  |               61 - 80 years              397 (25.0%)                305 (24
> .0%)                        |
  |               >80 years                  93 ( 5.9%)                 79 ( 6.
> 2%)                         |
  |----------------------------------------------------------------------------
> ----------------------------|
  | male          Female                     1,087 (54.0%)              827 (51
> .8%)                 0.18   |
  |               Male                       926 (46.0%)                771 (48
> .2%)                        |
  |----------------------------------------------------------------------------
> ----------------------------|
  | Rural-Urban   Rural                      1,015 (50.4%)              804 (50
> .3%)                 0.95   |
  |               Urban                      998 (49.6%)                794 (49
> .7%)                        |
  |----------------------------------------------------------------------------
> ----------------------------|
  | region        East Midlands              187 ( 9.3%)                166 (10
> .4%)                 0.41   |
  |               East of England            184 ( 9.1%)                169 (10
> .6%)                        |
  |               London                     421 (20.9%)                317 (19
> .8%)                        |
  |               North East                 209 (10.4%)                155 ( 9
> .7%)                        |
  |               North West                 214 (10.6%)                152 ( 9
> .5%)                        |
  |               South East                 395 (19.6%)                301 (18
> .8%)                        |
  |               West Midlands              181 ( 9.0%)                166 (10
> .4%)                        |
  |               Yorkshire and the Humber   222 (11.0%)                172 (10
> .8%)                        |
  |----------------------------------------------------------------------------
> ----------------------------|
  | imd           0                          102 ( 5.1%)                85 ( 5.
> 3%)                  0.54   |
  |               1                          355 (17.6%)                307 (19
> .2%)                        |
  |               2                          375 (18.6%)                300 (18
> .8%)                        |
  |               3                          410 (20.4%)                291 (18
> .2%)                        |
  |               4                          382 (19.0%)                292 (18
> .3%)                        |
  |               5                          389 (19.3%)                323 (20
> .2%)                        |
  |----------------------------------------------------------------------------
> ----------------------------|
  | smoking       Never smoked               217 (10.8%)                157 ( 9
> .8%)                 0.81   |
  |               Current smoker             395 (19.6%)                314 (19
> .6%)                        |
  |               Ex-smoker                  279 (13.9%)                220 (13
> .8%)                        |
  |               Unknown                    1,122 (55.7%)              907 (56
> .8%)                        |
  |----------------------------------------------------------------------------
> ----------------------------|
  | time_ra                                  54.36751 (31.9464)         54.5620
> 6 (31.45366)         0.90   |
  |----------------------------------------------------------------------------
> ----------------------------|
  | bmi_cat       Missing                    410 (20.4%)                313 (19
> .6%)                 0.80   |
  |               Underweight                197 ( 9.8%)                137 ( 8
> .6%)                        |
  |               Healthy range              361 (17.9%)                291 (18
> .2%)                        |
  |               Overweight                 383 (19.0%)                316 (19
> .8%)                        |
  |               Obese                      546 (27.1%)                442 (27
> .7%)                        |
  |               Morbidly obese             116 ( 5.8%)                99 ( 6.
> 2%)                         |
  |----------------------------------------------------------------------------
> ----------------------------|
  | eth5          White                      359 (17.8%)                312 (19
> .5%)                 0.24   |
  |               South Asian                384 (19.1%)                311 (19
> .5%)                        |
  |               Black                      428 (21.3%)                358 (22
> .4%)                        |
  |               Mixed                      421 (20.9%)                327 (20
> .5%)                        |
  |               Other                      421 (20.9%)                290 (18
> .1%)                        |
  +----------------------------------------------------------------------------
> ----------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file ./output/tables/characteristics_fewer_appts_all_2020.csv saved
_columna_1: contains nonnumeric characters not specified in ignore(); n1 genera
> ted as double
(2 missing values generated)
_columna_0: contains nonnumeric characters not specified in ignore()
_columna_0: character , removed; n0 generated as double
(2 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent1 generated as double
(2 missing values generated)
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
file ./output/tables/characteristics_fewer_appts_all_2020_rounded.csv saved

  +-----------------------------------------+
  | factor          N_0   N_1     m_0   m_1 |
  |-----------------------------------------|
  | age_cat       3,923    25   1,040    12 |
  |-----------------------------------------|
  | male          4,963    37       0     0 |
  |-----------------------------------------|
  | Rural-Urban   4,963    37       0     0 |
  |-----------------------------------------|
  | region        4,963    37       0     0 |
  |-----------------------------------------|
  | imd           4,963    37       0     0 |
  |-----------------------------------------|
  | smoking       4,963    37       0     0 |
  |-----------------------------------------|
  | time_ra       2,204    17   2,759    20 |
  |-----------------------------------------|
  | bmi_cat       4,963    37       0     0 |
  |-----------------------------------------|
  | eth5          4,963    37       0     0 |
  +-----------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> ----------------------+
  |                                          no_appts_all_2020 = 0   no_appts_a
> ll_2020 = 1   p-value |
  |----------------------------------------------------------------------------
> ----------------------|
  |                                          N=4,963                 N=37      
>                       |
  |----------------------------------------------------------------------------
> ----------------------|
  | age_cat       18 - 40 years              1,343 (34.2%)           7 (28.0%) 
>                0.57   |
  |               41 - 60 years              1,372 (35.0%)           7 (28.0%) 
>                       |
  |               61 - 80 years              983 (25.1%)             9 (36.0%) 
>                       |
  |               >80 years                  225 ( 5.7%)             2 ( 8.0%) 
>                       |
  |----------------------------------------------------------------------------
> ----------------------|
  | male          Female                     2,626 (52.9%)           17 (45.9%)
>                0.40   |
  |               Male                       2,337 (47.1%)           20 (54.1%)
>                       |
  |----------------------------------------------------------------------------
> ----------------------|
  | Rural-Urban   Rural                      2,488 (50.1%)           24 (64.9%)
>                0.074  |
  |               Urban                      2,475 (49.9%)           13 (35.1%)
>                       |
  |----------------------------------------------------------------------------
> ----------------------|
  | region        East Midlands              496 (10.0%)             4 (10.8%) 
>                0.45   |
  |               East of England            502 (10.1%)             2 ( 5.4%) 
>                       |
  |               London                     993 (20.0%)             4 (10.8%) 
>                       |
  |               North East                 474 ( 9.6%)             5 (13.5%) 
>                       |
  |               North West                 514 (10.4%)             6 (16.2%) 
>                       |
  |               South East                 993 (20.0%)             8 (21.6%) 
>                       |
  |               West Midlands              475 ( 9.6%)             6 (16.2%) 
>                       |
  |               Yorkshire and the Humber   516 (10.4%)             2 ( 5.4%) 
>                       |
  |----------------------------------------------------------------------------
> ----------------------|
  | imd           0                          274 ( 5.5%)             2 ( 5.4%) 
>                0.80   |
  |               1                          941 (19.0%)             9 (24.3%) 
>                       |
  |               2                          917 (18.5%)             7 (18.9%) 
>                       |
  |               3                          921 (18.6%)             5 (13.5%) 
>                       |
  |               4                          937 (18.9%)             9 (24.3%) 
>                       |
  |               5                          973 (19.6%)             5 (13.5%) 
>                       |
  |----------------------------------------------------------------------------
> ----------------------|
  | smoking       Never smoked               514 (10.4%)             4 (10.8%) 
>                0.74   |
  |               Current smoker             999 (20.1%)             7 (18.9%) 
>                       |
  |               Ex-smoker                  700 (14.1%)             3 ( 8.1%) 
>                       |
  |               Unknown                    2,750 (55.4%)           23 (62.2%)
>                       |
  |----------------------------------------------------------------------------
> ----------------------|
  | time_ra                                  54.62859 (31.49515)     47.49962 (
> 30.00339)      0.35   |
  |----------------------------------------------------------------------------
> ----------------------|
  | bmi_cat       Missing                    1,004 (20.2%)           12 (32.4%)
>                0.22   |
  |               Underweight                474 ( 9.6%)             4 (10.8%) 
>                       |
  |               Healthy range              915 (18.4%)             5 (13.5%) 
>                       |
  |               Overweight                 952 (19.2%)             4 (10.8%) 
>                       |
  |               Obese                      1,339 (27.0%)           12 (32.4%)
>                       |
  |               Morbidly obese             279 ( 5.6%)             0 ( 0.0%) 
>                       |
  |----------------------------------------------------------------------------
> ----------------------|
  | eth5          White                      922 (18.6%)             8 (21.6%) 
>                0.60   |
  |               South Asian                965 (19.4%)             6 (16.2%) 
>                       |
  |               Black                      1,032 (20.8%)           11 (29.7%)
>                       |
  |               Mixed                      1,036 (20.9%)           5 (13.5%) 
>                       |
  |               Other                      1,008 (20.3%)           7 (18.9%) 
>                       |
  +----------------------------------------------------------------------------
> ----------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file ./output/tables/characteristics_no_appts_all_2020.csv saved
_columna_1: contains nonnumeric characters not specified in ignore(); n1 genera
> ted as double
(2 missing values generated)
_columna_0: contains nonnumeric characters not specified in ignore()
_columna_0: character , removed; n0 generated as double
(2 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent1 generated as double
(2 missing values generated)
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
file ./output/tables/characteristics_no_appts_all_2020_rounded.csv saved

Iteration 0:   log likelihood = -1962.4752  
Iteration 1:   log likelihood = -1958.2019  
Iteration 2:   log likelihood = -1958.2017  

Logistic regression                             Number of obs     =      2,857
                                                LR chi2(5)        =       8.55
                                                Prob > chi2       =     0.1286
Log likelihood = -1958.2017                     Pseudo R2         =     0.0022

------------------------------------------------------------------------------
fewer~l_2020 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
urban_rura~n |   1.000037   .0754402     0.00   1.000     .8625888    1.159388
             |
     age_cat |
18 - 40 y..  |   .8102972   .0733766    -2.32   0.020     .6785215     .967665
61 - 80 y..  |   .8584979   .0849262    -1.54   0.123     .7071878    1.042182
  >80 years  |   .9555679   .1582462    -0.27   0.784      .690715    1.321978
             |
        male |   1.132048   .0855957     1.64   0.101     .9761228    1.312881
       _cons |   .8432356   .0683147    -2.10   0.035     .7194306     .988346
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/urban_rural_bin_diff_all_2020.dta not found)
file ./output/tempdata/urban_rural_bin_diff_all_2020.dta saved

Iteration 0:   log likelihood = -1962.4752  
Iteration 1:   log likelihood = -1955.4607  
Iteration 2:   log likelihood =   -1955.46  
Iteration 3:   log likelihood =   -1955.46  

Logistic regression                             Number of obs     =      2,857
                                                LR chi2(9)        =      14.03
                                                Prob > chi2       =     0.1212
Log likelihood =   -1955.46                     Pseudo R2         =     0.0036

------------------------------------------------------------------------------
fewer~l_2020 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         imd |
          1  |   1.035398   .1944635     0.19   0.853     .7165375    1.496153
          2  |   .9361874   .1762779    -0.35   0.726     .6472724    1.354062
          3  |   .8009867   .1502163    -1.18   0.237     .5546151    1.156802
          4  |   .8997903   .1689801    -0.56   0.574     .6227104    1.300159
          5  |   .9941333   .1859688    -0.03   0.975     .6889909    1.434418
             |
     age_cat |
18 - 40 y..  |   .8065947   .0732042    -2.37   0.018     .6751539    .9636249
61 - 80 y..  |    .853678   .0846417    -1.60   0.111     .7029071    1.036789
  >80 years  |   .9507984   .1576895    -0.30   0.761     .6869372    1.316012
             |
        male |   1.131732   .0857198     1.63   0.102     .9755999    1.312851
       _cons |   .9071543   .1629589    -0.54   0.588     .6379307    1.289997
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/i.imd_diff_all_2020 not found)
file ./output/tempdata/i.imd_diff_all_2020 saved

Iteration 0:   log likelihood = -1543.2392  
Iteration 1:   log likelihood = -1537.6476  
Iteration 2:   log likelihood = -1537.6472  
Iteration 3:   log likelihood = -1537.6472  

Logistic regression                             Number of obs     =      2,249
                                                LR chi2(9)        =      11.18
                                                Prob > chi2       =     0.2633
Log likelihood = -1537.6472                     Pseudo R2         =     0.0036

------------------------------------------------------------------------------
fewer~l_2020 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    region_n |
          3  |   .7988816   .1168994    -1.53   0.125     .5996905    1.064236
          4  |   .8158676   .1378364    -1.20   0.228      .585887    1.136124
          5  |   .7556718   .1295317    -1.63   0.102     .5400407    1.057402
          6  |   .8041954   .1187501    -1.48   0.140     .6021025     1.07412
          8  |   .9552127   .1635095    -0.27   0.789     .6829592    1.335997
             |
     age_cat |
18 - 40 y..  |    .811632   .0827019    -2.05   0.041     .6646993    .9910443
61 - 80 y..  |   .8651297   .0970934    -1.29   0.197     .6943061    1.077982
  >80 years  |   .8178896   .1585553    -1.04   0.300     .5593473    1.195936
             |
        male |   1.129282   .0964578     1.42   0.155     .9552058    1.335082
       _cons |   1.001422   .1373383     0.01   0.992     .7653856    1.310248
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/i.region_n_diff_all_2020 not found)
file ./output/tempdata/i.region_n_diff_all_2020 saved

Iteration 0:   log likelihood = -1962.4752  
Iteration 1:   log likelihood = -1955.5433  
Iteration 2:   log likelihood = -1955.5427  
Iteration 3:   log likelihood = -1955.5427  

Logistic regression                             Number of obs     =      2,857
                                                LR chi2(8)        =      13.86
                                                Prob > chi2       =     0.0854
Log likelihood = -1955.5427                     Pseudo R2         =     0.0035

------------------------------------------------------------------------------
fewer~l_2020 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .9412048   .1154685    -0.49   0.621     .7400437    1.197046
      Black  |   .9663037   .1151399    -0.29   0.774     .7650481    1.220502
      Mixed  |   .8249563   .0998641    -1.59   0.112     .6507135    1.045856
      Other  |    .804251   .0986396    -1.78   0.076     .6324027    1.022797
             |
     age_cat |
18 - 40 y..  |   .8112312   .0735988    -2.31   0.021     .6790777    .9691026
61 - 80 y..  |   .8589759   .0851172    -1.53   0.125     .7073497    1.043105
  >80 years  |   .9536018   .1581166    -0.29   0.774     .6890162     1.31979
             |
        male |   1.132298   .0856919     1.64   0.101     .9762079    1.313347
       _cons |    .933128   .1001678    -0.64   0.519     .7560803    1.151634
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/i.eth5_diff_all_2020 not found)
file ./output/tempdata/i.eth5_diff_all_2020 saved

Iteration 0:   log likelihood = -1543.2392  
Iteration 1:   log likelihood = -1534.2054  
Iteration 2:   log likelihood = -1534.2041  
Iteration 3:   log likelihood = -1534.2041  

Logistic regression                             Number of obs     =      2,249
                                                LR chi2(19)       =      18.07
                                                Prob > chi2       =     0.5178
Log likelihood = -1534.2041                     Pseudo R2         =     0.0059

------------------------------------------------------------------------------
fewer~l_2020 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     age_cat |
18 - 40 y..  |   .8082929   .0826794    -2.08   0.037      .661455    .9877278
61 - 80 y..  |   .8636934   .0973325    -1.30   0.193     .6925241     1.07717
  >80 years  |   .8175628   .1589436    -1.04   0.300     .5585187    1.196753
             |
        male |   1.130458   .0969235     1.43   0.153     .9555953    1.337319
urban_rura~n |   .9586611   .0820897    -0.49   0.622      .810545    1.133844
             |
         imd |
          1  |   1.194091   .2583229     0.82   0.412     .7814359    1.824658
          2  |   1.057356   .2281098     0.26   0.796     .6927656    1.613824
          3  |   .9310389    .200348    -0.33   0.740     .6106606    1.419501
          4  |   1.061644     .22823     0.28   0.781       .69661    1.617963
          5  |   1.030707    .222172     0.14   0.888     .6755476    1.572585
             |
    region_n |
          1  |   1.248808   .1839935     1.51   0.132     .9355859    1.666893
          4  |   1.003652   .1467911     0.02   0.980     .7535097    1.336833
          5  |   .9377052   .1396471    -0.43   0.666     .7003284    1.255541
          6  |   .9977579    .120597    -0.02   0.985     .7873034    1.264469
          8  |   1.182021   .1756853     1.13   0.261     .8833035    1.581759
             |
        eth5 |
South Asian  |   .9394871   .1293967    -0.45   0.650     .7172224    1.230631
      Black  |    .967135   .1298133    -0.25   0.803     .7434211     1.25817
      Mixed  |    .819978   .1121556    -1.45   0.147     .6271565    1.072083
      Other  |   .8490185   .1189155    -1.17   0.243     .6452023    1.117219
             |
       _cons |   .8616182   .2082933    -0.62   0.538      .536463    1.383853
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/multi_diff_all_2020.dta not found)
file ./output/tempdata/multi_diff_all_2020.dta saved

  +-----------------------------------------+
  | factor          N_0     N_1   m_0   m_1 |
  |-----------------------------------------|
  | age_cat       1,118     937   300   238 |
  |-----------------------------------------|
  | male          1,418   1,175     0     0 |
  |-----------------------------------------|
  | Rural-Urban   1,418   1,175     0     0 |
  |-----------------------------------------|
  | region        1,418   1,175     0     0 |
  |-----------------------------------------|
  | imd           1,418   1,175     0     0 |
  |-----------------------------------------|
  | smoking       1,418   1,175     0     0 |
  |-----------------------------------------|
  | time_ra         639     508   779   667 |
  |-----------------------------------------|
  | bmi_cat       1,418   1,175     0     0 |
  |-----------------------------------------|
  | eth5          1,418   1,175     0     0 |
  +-----------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> ----------------------------+
  |                                          fewer_appts_all_2021 = 0   fewer_a
> ppts_all_2021 = 1   p-value |
  |----------------------------------------------------------------------------
> ----------------------------|
  |                                          N=1,418                    N=1,175
>                             |
  |----------------------------------------------------------------------------
> ----------------------------|
  | age_cat       18 - 40 years              396 (35.4%)                301 (32
> .1%)                 0.47   |
  |               41 - 60 years              386 (34.5%)                343 (36
> .6%)                        |
  |               61 - 80 years              267 (23.9%)                232 (24
> .8%)                        |
  |               >80 years                  69 ( 6.2%)                 61 ( 6.
> 5%)                         |
  |----------------------------------------------------------------------------
> ----------------------------|
  | male          Female                     747 (52.7%)                622 (52
> .9%)                 0.90   |
  |               Male                       671 (47.3%)                553 (47
> .1%)                        |
  |----------------------------------------------------------------------------
> ----------------------------|
  | Rural-Urban   Rural                      725 (51.1%)                613 (52
> .2%)                 0.60   |
  |               Urban                      693 (48.9%)                562 (47
> .8%)                        |
  |----------------------------------------------------------------------------
> ----------------------------|
  | region        East Midlands              122 ( 8.6%)                122 (10
> .4%)                 0.83   |
  |               East of England            142 (10.0%)                108 ( 9
> .2%)                        |
  |               London                     287 (20.2%)                234 (19
> .9%)                        |
  |               North East                 152 (10.7%)                122 (10
> .4%)                        |
  |               North West                 154 (10.9%)                118 (10
> .0%)                        |
  |               South East                 269 (19.0%)                217 (18
> .5%)                        |
  |               West Midlands              139 ( 9.8%)                123 (10
> .5%)                        |
  |               Yorkshire and the Humber   153 (10.8%)                131 (11
> .1%)                        |
  |----------------------------------------------------------------------------
> ----------------------------|
  | imd           0                          65 ( 4.6%)                 64 ( 5.
> 4%)                  0.85   |
  |               1                          256 (18.1%)                212 (18
> .0%)                        |
  |               2                          277 (19.5%)                219 (18
> .6%)                        |
  |               3                          276 (19.5%)                218 (18
> .6%)                        |
  |               4                          263 (18.5%)                232 (19
> .7%)                        |
  |               5                          281 (19.8%)                230 (19
> .6%)                        |
  |----------------------------------------------------------------------------
> ----------------------------|
  | smoking       Never smoked               146 (10.3%)                132 (11
> .2%)                 0.39   |
  |               Current smoker             279 (19.7%)                244 (20
> .8%)                        |
  |               Ex-smoker                  184 (13.0%)                168 (14
> .3%)                        |
  |               Unknown                    809 (57.1%)                631 (53
> .7%)                        |
  |----------------------------------------------------------------------------
> ----------------------------|
  | time_ra                                  53.38205 (32.03667)        55.5155
> 6 (30.95161)         0.26   |
  |----------------------------------------------------------------------------
> ----------------------------|
  | bmi_cat       Missing                    290 (20.5%)                222 (18
> .9%)                 0.90   |
  |               Underweight                130 ( 9.2%)                118 (10
> .0%)                        |
  |               Healthy range              252 (17.8%)                212 (18
> .0%)                        |
  |               Overweight                 278 (19.6%)                236 (20
> .1%)                        |
  |               Obese                      394 (27.8%)                321 (27
> .3%)                        |
  |               Morbidly obese             74 ( 5.2%)                 66 ( 5.
> 6%)                         |
  |----------------------------------------------------------------------------
> ----------------------------|
  | eth5          White                      228 (16.1%)                252 (21
> .4%)                 0.006  |
  |               South Asian                254 (17.9%)                220 (18
> .7%)                        |
  |               Black                      337 (23.8%)                246 (20
> .9%)                        |
  |               Mixed                      314 (22.1%)                243 (20
> .7%)                        |
  |               Other                      285 (20.1%)                214 (18
> .2%)                        |
  +----------------------------------------------------------------------------
> ----------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file ./output/tables/characteristics_fewer_appts_all_2021.csv saved
_columna_1: contains nonnumeric characters not specified in ignore(); n1 genera
> ted as double
(2 missing values generated)
_columna_0: contains nonnumeric characters not specified in ignore(); n0 genera
> ted as double
(2 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent1 generated as double
(2 missing values generated)
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
file ./output/tables/characteristics_fewer_appts_all_2021_rounded.csv saved

  +-----------------------------------------+
  | factor          N_0   N_1     m_0   m_1 |
  |-----------------------------------------|
  | age_cat       3,935    13   1,044     8 |
  |-----------------------------------------|
  | male          4,979    21       0     0 |
  |-----------------------------------------|
  | Rural-Urban   4,979    21       0     0 |
  |-----------------------------------------|
  | region        4,979    21       0     0 |
  |-----------------------------------------|
  | imd           4,979    21       0     0 |
  |-----------------------------------------|
  | smoking       4,979    21       0     0 |
  |-----------------------------------------|
  | time_ra       2,209    12   2,770     9 |
  |-----------------------------------------|
  | bmi_cat       4,979    21       0     0 |
  |-----------------------------------------|
  | eth5          4,979    21       0     0 |
  +-----------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> ----------------------+
  |                                          no_appts_all_2021 = 0   no_appts_a
> ll_2021 = 1   p-value |
  |----------------------------------------------------------------------------
> ----------------------|
  |                                          N=4,979                 N=21      
>                       |
  |----------------------------------------------------------------------------
> ----------------------|
  | age_cat       18 - 40 years              1,347 (34.2%)           3 (23.1%) 
>                0.53   |
  |               41 - 60 years              1,374 (34.9%)           5 (38.5%) 
>                       |
  |               61 - 80 years              987 (25.1%)             5 (38.5%) 
>                       |
  |               >80 years                  227 ( 5.8%)             0 ( 0.0%) 
>                       |
  |----------------------------------------------------------------------------
> ----------------------|
  | male          Female                     2,631 (52.8%)           12 (57.1%)
>                0.69   |
  |               Male                       2,348 (47.2%)           9 (42.9%) 
>                       |
  |----------------------------------------------------------------------------
> ----------------------|
  | Rural-Urban   Rural                      2,502 (50.3%)           10 (47.6%)
>                0.81   |
  |               Urban                      2,477 (49.7%)           11 (52.4%)
>                       |
  |----------------------------------------------------------------------------
> ----------------------|
  | region        East Midlands              498 (10.0%)             2 ( 9.5%) 
>                0.78   |
  |               East of England            501 (10.1%)             3 (14.3%) 
>                       |
  |               London                     992 (19.9%)             5 (23.8%) 
>                       |
  |               North East                 477 ( 9.6%)             2 ( 9.5%) 
>                       |
  |               North West                 519 (10.4%)             1 ( 4.8%) 
>                       |
  |               South East                 996 (20.0%)             5 (23.8%) 
>                       |
  |               West Midlands              478 ( 9.6%)             3 (14.3%) 
>                       |
  |               Yorkshire and the Humber   518 (10.4%)             0 ( 0.0%) 
>                       |
  |----------------------------------------------------------------------------
> ----------------------|
  | imd           0                          275 ( 5.5%)             1 ( 4.8%) 
>                0.48   |
  |               1                          949 (19.1%)             1 ( 4.8%) 
>                       |
  |               2                          918 (18.4%)             6 (28.6%) 
>                       |
  |               3                          923 (18.5%)             3 (14.3%) 
>                       |
  |               4                          942 (18.9%)             4 (19.0%) 
>                       |
  |               5                          972 (19.5%)             6 (28.6%) 
>                       |
  |----------------------------------------------------------------------------
> ----------------------|
  | smoking       Never smoked               517 (10.4%)             1 ( 4.8%) 
>                0.52   |
  |               Current smoker             1,003 (20.1%)           3 (14.3%) 
>                       |
  |               Ex-smoker                  701 (14.1%)             2 ( 9.5%) 
>                       |
  |               Unknown                    2,758 (55.4%)           15 (71.4%)
>                       |
  |----------------------------------------------------------------------------
> ----------------------|
  | time_ra                                  54.48862 (31.49388)     70.29523 (
> 26.10531)      0.083  |
  |----------------------------------------------------------------------------
> ----------------------|
  | bmi_cat       Missing                    1,011 (20.3%)           5 (23.8%) 
>                0.35   |
  |               Underweight                476 ( 9.6%)             2 ( 9.5%) 
>                       |
  |               Healthy range              916 (18.4%)             4 (19.0%) 
>                       |
  |               Overweight                 955 (19.2%)             1 ( 4.8%) 
>                       |
  |               Obese                      1,342 (27.0%)           9 (42.9%) 
>                       |
  |               Morbidly obese             279 ( 5.6%)             0 ( 0.0%) 
>                       |
  |----------------------------------------------------------------------------
> ----------------------|
  | eth5          White                      926 (18.6%)             4 (19.0%) 
>                0.80   |
  |               South Asian                966 (19.4%)             5 (23.8%) 
>                       |
  |               Black                      1,040 (20.9%)           3 (14.3%) 
>                       |
  |               Mixed                      1,035 (20.8%)           6 (28.6%) 
>                       |
  |               Other                      1,012 (20.3%)           3 (14.3%) 
>                       |
  +----------------------------------------------------------------------------
> ----------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file ./output/tables/characteristics_no_appts_all_2021.csv saved
_columna_1: contains nonnumeric characters not specified in ignore(); n1 genera
> ted as double
(2 missing values generated)
_columna_0: contains nonnumeric characters not specified in ignore()
_columna_0: character , removed; n0 generated as double
(2 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent1 generated as double
(2 missing values generated)
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
file ./output/tables/characteristics_no_appts_all_2021_rounded.csv saved

Iteration 0:   log likelihood = -1416.4361  
Iteration 1:   log likelihood = -1415.1137  
Iteration 2:   log likelihood = -1415.1136  

Logistic regression                             Number of obs     =      2,055
                                                LR chi2(5)        =       2.64
                                                Prob > chi2       =     0.7545
Log likelihood = -1415.1136                     Pseudo R2         =     0.0009

------------------------------------------------------------------------------
fewer~l_2021 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
urban_rura~n |   .9745471   .0864192    -0.29   0.771     .8190708    1.159536
             |
     age_cat |
18 - 40 y..  |   .8557236   .0911897    -1.46   0.144     .6944256    1.054487
61 - 80 y..  |   .9783296   .1139685    -0.19   0.851     .7786212    1.229261
  >80 years  |   .9934982    .189609    -0.03   0.973     .6834636    1.444172
             |
        male |   .9810812   .0872263    -0.21   0.830     .8241875    1.167841
       _cons |   .9077537   .0861742    -1.02   0.308     .7536373    1.093386
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/urban_rural_bin_diff_all_2021.dta not found)
file ./output/tempdata/urban_rural_bin_diff_all_2021.dta saved

Iteration 0:   log likelihood = -1416.4361  
Iteration 1:   log likelihood = -1414.4115  
Iteration 2:   log likelihood = -1414.4115  

Logistic regression                             Number of obs     =      2,055
                                                LR chi2(9)        =       4.05
                                                Prob > chi2       =     0.9081
Log likelihood = -1414.4115                     Pseudo R2         =     0.0014

------------------------------------------------------------------------------
fewer~l_2021 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         imd |
          1  |   .8341732   .1864265    -0.81   0.417     .5382997    1.292672
          2  |   .8223456   .1834668    -0.88   0.381     .5310675    1.273383
          3  |    .776322   .1729499    -1.14   0.256     .5016609    1.201361
          4  |   .8606082   .1917049    -0.67   0.500     .5561552    1.331726
          5  |   .8143255   .1811408    -0.92   0.356      .526568    1.259336
             |
     age_cat |
18 - 40 y..  |    .850327   .0908046    -1.52   0.129     .6897441    1.048296
61 - 80 y..  |   .9731012   .1135384    -0.23   0.815      .774181    1.223133
  >80 years  |   .9893354   .1890479    -0.06   0.955     .6802853    1.438786
             |
        male |   .9781247   .0870411    -0.25   0.804     .8215759    1.164503
       _cons |   1.086886   .2316036     0.39   0.696      .715817    1.650311
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/i.imd_diff_all_2021 not found)
file ./output/tempdata/i.imd_diff_all_2021 saved

Iteration 0:   log likelihood = -1113.6149  
Iteration 1:   log likelihood = -1108.9209  
Iteration 2:   log likelihood = -1108.9205  
Iteration 3:   log likelihood = -1108.9205  

Logistic regression                             Number of obs     =      1,615
                                                LR chi2(9)        =       9.39
                                                Prob > chi2       =     0.4022
Log likelihood = -1108.9205                     Pseudo R2         =     0.0042

------------------------------------------------------------------------------
fewer~l_2021 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    region_n |
          3  |   .8349252   .1458322    -1.03   0.302     .5928877    1.175771
          4  |   .8434302   .1668489    -0.86   0.389     .5723516    1.242898
          5  |   .7850339   .1585219    -1.20   0.231     .5284517    1.166196
          6  |   .9020382   .1589372    -0.59   0.558     .6386237    1.274104
          8  |   1.032972   .2082932     0.16   0.872     .6957419    1.533658
             |
     age_cat |
18 - 40 y..  |   .7651854   .0923486    -2.22   0.027         .604    .9693851
61 - 80 y..  |   .9671452   .1275506    -0.25   0.800     .7468478    1.252424
  >80 years  |   .9852714   .2184729    -0.07   0.947     .6379865    1.521599
             |
        male |   1.021658   .1029101     0.21   0.832     .8386201    1.244646
       _cons |   1.041672   .1692276     0.25   0.802     .7576122    1.432238
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/i.region_n_diff_all_2021 not found)
file ./output/tempdata/i.region_n_diff_all_2021 saved

Iteration 0:   log likelihood = -1416.4361  
Iteration 1:   log likelihood = -1408.1881  
Iteration 2:   log likelihood = -1408.1877  
Iteration 3:   log likelihood = -1408.1877  

Logistic regression                             Number of obs     =      2,055
                                                LR chi2(8)        =      16.50
                                                Prob > chi2       =     0.0358
Log likelihood = -1408.1877                     Pseudo R2         =     0.0058

------------------------------------------------------------------------------
fewer~l_2021 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .7431517    .108856    -2.03   0.043      .557692    .9902858
      Black  |   .6356251   .0890326    -3.24   0.001     .4830281    .8364301
      Mixed  |   .6370365   .0901024    -3.19   0.001     .4828035    .8405398
      Other  |   .6763427   .0980949    -2.70   0.007     .5089918    .8987167
             |
     age_cat |
18 - 40 y..  |   .8587371   .0919138    -1.42   0.155     .6962304    1.059174
61 - 80 y..  |   .9655344   .1129767    -0.30   0.764     .7676602    1.214413
  >80 years  |    .981337   .1880683    -0.10   0.922     .6740463    1.428718
             |
        male |   .9821418    .087707    -0.20   0.840     .8244425    1.170006
       _cons |   1.248025   .1578639     1.75   0.080     .9739885    1.599162
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/i.eth5_diff_all_2021 not found)
file ./output/tempdata/i.eth5_diff_all_2021 saved

Iteration 0:   log likelihood = -1113.6149  
Iteration 1:   log likelihood = -1103.2766  
Iteration 2:   log likelihood =  -1103.275  
Iteration 3:   log likelihood =  -1103.275  

Logistic regression                             Number of obs     =      1,615
                                                LR chi2(19)       =      20.68
                                                Prob > chi2       =     0.3548
Log likelihood =  -1103.275                     Pseudo R2         =     0.0093

------------------------------------------------------------------------------
fewer~l_2021 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     age_cat |
18 - 40 y..  |    .765464   .0928656    -2.20   0.028     .6034726    .9709391
61 - 80 y..  |   .9561998   .1267671    -0.34   0.735     .7373974    1.239926
  >80 years  |   .9767408   .2179359    -0.11   0.916      .630746    1.512531
             |
        male |   1.022339   .1037203     0.22   0.828     .8379867    1.247247
urban_rura~n |   .9474186   .0957677    -0.53   0.593     .7771414    1.155005
             |
         imd |
          1  |   .9372275   .2440722    -0.25   0.803     .5625688    1.561401
          2  |    .995038   .2572292    -0.02   0.985     .5995065    1.651526
          3  |   .9193405   .2379692    -0.32   0.745     .5535347    1.526891
          4  |   .8879135   .2292695    -0.46   0.645     .5352795    1.472858
          5  |   .8402969   .2177664    -0.67   0.502     .5056388    1.396449
             |
    region_n |
          1  |   1.158584   .2043724     0.83   0.404     .8199298    1.637111
          4  |   .9989548   .1700637    -0.01   0.995     .7155432     1.39462
          5  |   .9404312   .1639063    -0.35   0.725     .6683014    1.323371
          6  |   1.061632   .1530951     0.41   0.678     .8002478    1.408392
          8  |    1.21113   .2108943     1.10   0.271     .8609357    1.703769
             |
        eth5 |
South Asian  |   .7608537   .1249142    -1.66   0.096     .5515107    1.049659
      Black  |   .6501243   .1026327    -2.73   0.006      .477112    .8858748
      Mixed  |   .6634547   .1055267    -2.58   0.010     .4857605    .9061505
      Other  |   .7093046   .1175618    -2.07   0.038     .5125694    .9815511
             |
       _cons |   1.331113    .383455     0.99   0.321     .7568478    2.341108
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/multi_diff_all_2021.dta not found)
file ./output/tempdata/multi_diff_all_2021.dta saved

  +-------------------------------------+
  | factor        N_0   N_1   m_0   m_1 |
  |-------------------------------------|
  | age_cat       745   611   224   156 |
  |-------------------------------------|
  | male          969   767     0     0 |
  |-------------------------------------|
  | Rural-Urban   969   767     0     0 |
  |-------------------------------------|
  | region        969   767     0     0 |
  |-------------------------------------|
  | imd           969   767     0     0 |
  |-------------------------------------|
  | smoking       969   767     0     0 |
  |-------------------------------------|
  | time_ra       434   335   535   432 |
  |-------------------------------------|
  | bmi_cat       969   767     0     0 |
  |-------------------------------------|
  | eth5          969   767     0     0 |
  +-------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> ----------------------------+
  |                                          fewer_appts_all_2022 = 0   fewer_a
> ppts_all_2022 = 1   p-value |
  |----------------------------------------------------------------------------
> ----------------------------|
  |                                          N=969                      N=767  
>                             |
  |----------------------------------------------------------------------------
> ----------------------------|
  | age_cat       18 - 40 years              256 (34.4%)                188 (30
> .8%)                 0.12   |
  |               41 - 60 years              254 (34.1%)                234 (38
> .3%)                        |
  |               61 - 80 years              191 (25.6%)                141 (23
> .1%)                        |
  |               >80 years                  44 ( 5.9%)                 48 ( 7.
> 9%)                         |
  |----------------------------------------------------------------------------
> ----------------------------|
  | male          Female                     497 (51.3%)                423 (55
> .1%)                 0.11   |
  |               Male                       472 (48.7%)                344 (44
> .9%)                        |
  |----------------------------------------------------------------------------
> ----------------------------|
  | Rural-Urban   Rural                      480 (49.5%)                412 (53
> .7%)                 0.084  |
  |               Urban                      489 (50.5%)                355 (46
> .3%)                        |
  |----------------------------------------------------------------------------
> ----------------------------|
  | region        East Midlands              86 ( 8.9%)                 77 (10.
> 0%)                  0.78   |
  |               East of England            87 ( 9.0%)                 80 (10.
> 4%)                         |
  |               London                     209 (21.6%)                149 (19
> .4%)                        |
  |               North East                 105 (10.8%)                80 (10.
> 4%)                         |
  |               North West                 105 (10.8%)                80 (10.
> 4%)                         |
  |               South East                 186 (19.2%)                139 (18
> .1%)                        |
  |               West Midlands              93 ( 9.6%)                 86 (11.
> 2%)                         |
  |               Yorkshire and the Humber   98 (10.1%)                 76 ( 9.
> 9%)                         |
  |----------------------------------------------------------------------------
> ----------------------------|
  | imd           0                          54 ( 5.6%)                 33 ( 4.
> 3%)                  0.66   |
  |               1                          158 (16.3%)                137 (17
> .9%)                        |
  |               2                          185 (19.1%)                143 (18
> .6%)                        |
  |               3                          199 (20.5%)                148 (19
> .3%)                        |
  |               4                          197 (20.3%)                152 (19
> .8%)                        |
  |               5                          176 (18.2%)                154 (20
> .1%)                        |
  |----------------------------------------------------------------------------
> ----------------------------|
  | smoking       Never smoked               96 ( 9.9%)                 96 (12.
> 5%)                  0.37   |
  |               Current smoker             193 (19.9%)                151 (19
> .7%)                        |
  |               Ex-smoker                  133 (13.7%)                97 (12.
> 6%)                         |
  |               Unknown                    547 (56.4%)                423 (55
> .1%)                        |
  |----------------------------------------------------------------------------
> ----------------------------|
  | time_ra                                  53.1895 (32.16841)         55.7085
>  (31.06973)          0.27   |
  |----------------------------------------------------------------------------
> ----------------------------|
  | bmi_cat       Missing                    203 (20.9%)                156 (20
> .3%)                 0.95   |
  |               Underweight                90 ( 9.3%)                 70 ( 9.
> 1%)                         |
  |               Healthy range              169 (17.4%)                133 (17
> .3%)                        |
  |               Overweight                 194 (20.0%)                149 (19
> .4%)                        |
  |               Obese                      258 (26.6%)                220 (28
> .7%)                        |
  |               Morbidly obese             55 ( 5.7%)                 39 ( 5.
> 1%)                         |
  |----------------------------------------------------------------------------
> ----------------------------|
  | eth5          White                      183 (18.9%)                151 (19
> .7%)                 0.80   |
  |               South Asian                175 (18.1%)                150 (19
> .6%)                        |
  |               Black                      224 (23.1%)                165 (21
> .5%)                        |
  |               Mixed                      214 (22.1%)                174 (22
> .7%)                        |
  |               Other                      173 (17.9%)                127 (16
> .6%)                        |
  +----------------------------------------------------------------------------
> ----------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file ./output/tables/characteristics_fewer_appts_all_2022.csv saved
_columna_1: contains nonnumeric characters not specified in ignore(); n1 genera
> ted as double
(2 missing values generated)
_columna_0: contains nonnumeric characters not specified in ignore(); n0 genera
> ted as double
(2 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent1 generated as double
(2 missing values generated)
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
file ./output/tables/characteristics_fewer_appts_all_2022_rounded.csv saved

  +-----------------------------------------+
  | factor          N_0   N_1     m_0   m_1 |
  |-----------------------------------------|
  | age_cat       3,940     8   1,050     2 |
  |-----------------------------------------|
  | male          4,990    10       0     0 |
  |-----------------------------------------|
  | Rural-Urban   4,990    10       0     0 |
  |-----------------------------------------|
  | region        4,990    10       0     0 |
  |-----------------------------------------|
  | imd           4,990    10       0     0 |
  |-----------------------------------------|
  | smoking       4,990    10       0     0 |
  |-----------------------------------------|
  | time_ra       2,216     5   2,774     5 |
  |-----------------------------------------|
  | bmi_cat       4,990    10       0     0 |
  |-----------------------------------------|
  | eth5          4,990    10       0     0 |
  +-----------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> ----------------------+
  |                                          no_appts_all_2022 = 0   no_appts_a
> ll_2022 = 1   p-value |
  |----------------------------------------------------------------------------
> ----------------------|
  |                                          N=4,990                 N=10      
>                       |
  |----------------------------------------------------------------------------
> ----------------------|
  | age_cat       18 - 40 years              1,348 (34.2%)           2 (25.0%) 
>                0.84   |
  |               41 - 60 years              1,376 (34.9%)           3 (37.5%) 
>                       |
  |               61 - 80 years              990 (25.1%)             2 (25.0%) 
>                       |
  |               >80 years                  226 ( 5.7%)             1 (12.5%) 
>                       |
  |----------------------------------------------------------------------------
> ----------------------|
  | male          Female                     2,637 (52.8%)           6 (60.0%) 
>                0.65   |
  |               Male                       2,353 (47.2%)           4 (40.0%) 
>                       |
  |----------------------------------------------------------------------------
> ----------------------|
  | Rural-Urban   Rural                      2,506 (50.2%)           6 (60.0%) 
>                0.54   |
  |               Urban                      2,484 (49.8%)           4 (40.0%) 
>                       |
  |----------------------------------------------------------------------------
> ----------------------|
  | region        East Midlands              499 (10.0%)             1 (10.0%) 
>                0.49   |
  |               East of England            503 (10.1%)             1 (10.0%) 
>                       |
  |               London                     995 (19.9%)             2 (20.0%) 
>                       |
  |               North East                 478 ( 9.6%)             1 (10.0%) 
>                       |
  |               North West                 520 (10.4%)             0 ( 0.0%) 
>                       |
  |               South East                 999 (20.0%)             2 (20.0%) 
>                       |
  |               West Midlands              478 ( 9.6%)             3 (30.0%) 
>                       |
  |               Yorkshire and the Humber   518 (10.4%)             0 ( 0.0%) 
>                       |
  |----------------------------------------------------------------------------
> ----------------------|
  | imd           0                          276 ( 5.5%)             0 ( 0.0%) 
>                0.42   |
  |               1                          948 (19.0%)             2 (20.0%) 
>                       |
  |               2                          920 (18.4%)             4 (40.0%) 
>                       |
  |               3                          926 (18.6%)             0 ( 0.0%) 
>                       |
  |               4                          944 (18.9%)             2 (20.0%) 
>                       |
  |               5                          976 (19.6%)             2 (20.0%) 
>                       |
  |----------------------------------------------------------------------------
> ----------------------|
  | smoking       Never smoked               518 (10.4%)             0 ( 0.0%) 
>                0.61   |
  |               Current smoker             1,003 (20.1%)           3 (30.0%) 
>                       |
  |               Ex-smoker                  701 (14.0%)             2 (20.0%) 
>                       |
  |               Unknown                    2,768 (55.5%)           5 (50.0%) 
>                       |
  |----------------------------------------------------------------------------
> ----------------------|
  | time_ra                                  54.57576 (31.50552)     53.8037 (2
> 1.83848)       0.96   |
  |----------------------------------------------------------------------------
> ----------------------|
  | bmi_cat       Missing                    1,014 (20.3%)           2 (20.0%) 
>                0.57   |
  |               Underweight                478 ( 9.6%)             0 ( 0.0%) 
>                       |
  |               Healthy range              919 (18.4%)             1 (10.0%) 
>                       |
  |               Overweight                 954 (19.1%)             2 (20.0%) 
>                       |
  |               Obese                      1,346 (27.0%)           5 (50.0%) 
>                       |
  |               Morbidly obese             279 ( 5.6%)             0 ( 0.0%) 
>                       |
  |----------------------------------------------------------------------------
> ----------------------|
  | eth5          White                      930 (18.6%)             0 ( 0.0%) 
>                0.34   |
  |               South Asian                970 (19.4%)             1 (10.0%) 
>                       |
  |               Black                      1,041 (20.9%)           2 (20.0%) 
>                       |
  |               Mixed                      1,037 (20.8%)           4 (40.0%) 
>                       |
  |               Other                      1,012 (20.3%)           3 (30.0%) 
>                       |
  +----------------------------------------------------------------------------
> ----------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file ./output/tables/characteristics_no_appts_all_2022.csv saved
_columna_1: contains nonnumeric characters not specified in ignore(); n1 genera
> ted as double
(2 missing values generated)
_columna_0: contains nonnumeric characters not specified in ignore()
_columna_0: character , removed; n0 generated as double
(2 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent1 generated as double
(2 missing values generated)
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
file ./output/tables/characteristics_no_appts_all_2022_rounded.csv saved

Iteration 0:   log likelihood = -933.27581  
Iteration 1:   log likelihood = -929.86201  
Iteration 2:   log likelihood = -929.86186  
Iteration 3:   log likelihood = -929.86186  

Logistic regression                             Number of obs     =      1,356
                                                LR chi2(5)        =       6.83
                                                Prob > chi2       =     0.2338
Log likelihood = -929.86186                     Pseudo R2         =     0.0037

------------------------------------------------------------------------------
fewer~l_2022 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
urban_rura~n |    .923712   .1011263    -0.72   0.469     .7453299    1.144787
             |
     age_cat |
18 - 40 y..  |   .7982713   .1054562    -1.71   0.088     .6161719    1.034187
61 - 80 y..  |   .8031082   .1151588    -1.53   0.126      .606344    1.063724
  >80 years  |   1.177671   .2682128     0.72   0.473     .7536408     1.84028
             |
        male |   .9206796    .101086    -0.75   0.452      .742422    1.141737
       _cons |   .9947571     .11625    -0.04   0.964     .7911218    1.250808
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/urban_rural_bin_diff_all_2022.dta not found)
file ./output/tempdata/urban_rural_bin_diff_all_2022.dta saved

Iteration 0:   log likelihood = -933.27581  
Iteration 1:   log likelihood = -927.22384  
Iteration 2:   log likelihood = -927.22267  
Iteration 3:   log likelihood = -927.22267  

Logistic regression                             Number of obs     =      1,356
                                                LR chi2(9)        =      12.11
                                                Prob > chi2       =     0.2074
Log likelihood = -927.22267                     Pseudo R2         =     0.0065

------------------------------------------------------------------------------
fewer~l_2022 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         imd |
          1  |   1.646653   .4697075     1.75   0.080     .9414492    2.880097
          2  |   1.327442   .3760676     1.00   0.317     .7618474    2.312933
          3  |   1.138915   .3212947     0.46   0.645     .6551827    1.979796
          4  |   1.318332   .3711648     0.98   0.326     .7592358    2.289144
          5  |   1.415145    .401258     1.22   0.221      .811795    2.466921
             |
     age_cat |
18 - 40 y..  |   .7914956   .1052562    -1.76   0.079     .6098912    1.027176
61 - 80 y..  |   .7912942   .1139131    -1.63   0.104     .5967614    1.049241
  >80 years  |    1.17053   .2672421     0.69   0.490     .7482485     1.83113
             |
        male |   .9221135   .1015125    -0.74   0.461     .7431533     1.14417
       _cons |    .722555   .1968895    -1.19   0.233     .4235712    1.232581
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/i.imd_diff_all_2022 not found)
file ./output/tempdata/i.imd_diff_all_2022 saved

Iteration 0:   log likelihood =  -739.9868  
Iteration 1:   log likelihood = -734.64433  
Iteration 2:   log likelihood = -734.64356  
Iteration 3:   log likelihood = -734.64356  

Logistic regression                             Number of obs     =      1,076
                                                LR chi2(9)        =      10.69
                                                Prob > chi2       =     0.2978
Log likelihood = -734.64356                     Pseudo R2         =     0.0072

------------------------------------------------------------------------------
fewer~l_2022 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    region_n |
          3  |   .8571217   .1846724    -0.72   0.474     .5618826    1.307493
          4  |   .9810308   .2398659    -0.08   0.938     .6075199    1.584181
          5  |   .9196119   .2292978    -0.34   0.737     .5641106    1.499149
          6  |   .8435473   .1838127    -0.78   0.435     .5503371    1.292975
          8  |    1.15275   .2859833     0.57   0.567     .7088631    1.874597
             |
     age_cat |
18 - 40 y..  |   .7173708   .1073284    -2.22   0.026     .5350476    .9618226
61 - 80 y..  |   .8633543   .1393748    -0.91   0.363     .6291817    1.184683
  >80 years  |   1.239024   .3220783     0.82   0.410     .7444128    2.062269
             |
        male |   1.002618   .1246405     0.02   0.983     .7858119    1.279242
       _cons |    .996829    .199464    -0.02   0.987     .6734362    1.475519
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/i.region_n_diff_all_2022 not found)
file ./output/tempdata/i.region_n_diff_all_2022 saved

Iteration 0:   log likelihood = -933.27581  
Iteration 1:   log likelihood = -929.79812  
Iteration 2:   log likelihood = -929.79795  
Iteration 3:   log likelihood = -929.79795  

Logistic regression                             Number of obs     =      1,356
                                                LR chi2(8)        =       6.96
                                                Prob > chi2       =     0.5414
Log likelihood = -929.79795                     Pseudo R2         =     0.0037

------------------------------------------------------------------------------
fewer~l_2022 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .9482291    .166291    -0.30   0.762      .672416    1.337176
      Black  |   .8878458   .1514565    -0.70   0.486     .6355243    1.240346
      Mixed  |   .9120662    .154661    -0.54   0.587     .6541636    1.271647
      Other  |   .8906327   .1619313    -0.64   0.524     .6236437    1.271923
             |
     age_cat |
18 - 40 y..  |   .7990942   .1056504    -1.70   0.090     .6166779     1.03547
61 - 80 y..  |   .7995114   .1147629    -1.56   0.119     .6034512    1.059271
  >80 years  |   1.178907   .2685648     0.72   0.470     .7543426    1.842427
             |
        male |   .9220418   .1013431    -0.74   0.460     .7433505    1.143688
       _cons |   1.032666   .1565494     0.21   0.832       .76722    1.389952
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/i.eth5_diff_all_2022 not found)
file ./output/tempdata/i.eth5_diff_all_2022 saved

Iteration 0:   log likelihood =  -739.9868  
Iteration 1:   log likelihood = -729.63336  
Iteration 2:   log likelihood = -729.62846  
Iteration 3:   log likelihood = -729.62846  

Logistic regression                             Number of obs     =      1,076
                                                LR chi2(19)       =      20.72
                                                Prob > chi2       =     0.3527
Log likelihood = -729.62846                     Pseudo R2         =     0.0140

------------------------------------------------------------------------------
fewer~l_2022 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     age_cat |
18 - 40 y..  |   .7209475   .1087761    -2.17   0.030     .5363829    .9690192
61 - 80 y..  |   .8720051   .1417541    -0.84   0.400     .6340839    1.199199
  >80 years  |    1.25938   .3289258     0.88   0.377     .7548131    2.101233
             |
        male |   1.009491   .1267601     0.08   0.940     .7892571    1.291179
urban_rura~n |   .8804015    .110187    -1.02   0.309     .6888875    1.125157
             |
         imd |
          1  |   1.947892   .6368239     2.04   0.041     1.026317    3.696988
          2  |   1.373401   .4442212     0.98   0.327     .7285838    2.588899
          3  |   1.263856     .40656     0.73   0.467     .6727924    2.374182
          4  |   1.402149   .4484358     1.06   0.291     .7491395    2.624374
          5  |   1.288755   .4181092     0.78   0.434     .6823642    2.434023
             |
    region_n |
          1  |   1.198193   .2616314     0.83   0.408      .781021    1.838192
          4  |    1.11732   .2349918     0.53   0.598     .7398691     1.68733
          5  |   1.057464   .2270613     0.26   0.795     .6942142    1.610785
          6  |   .9864266   .1756042    -0.08   0.939     .6958785    1.398286
          8  |   1.327641   .2842926     1.32   0.186      .872589    2.020001
             |
        eth5 |
South Asian  |   .9132037   .1805296    -0.46   0.646     .6198621    1.345365
      Black  |   .8653268   .1669002    -0.75   0.453     .5929313    1.262862
      Mixed  |    .942472   .1810921    -0.31   0.758      .646716    1.373483
      Other  |   .7705893     .16125    -1.25   0.213     .5113338    1.161292
             |
       _cons |   .7145971   .2523771    -0.95   0.341     .3576341    1.427853
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/multi_diff_all_2022.dta not found)
file ./output/tempdata/multi_diff_all_2022.dta saved

. * Put together 2020 and 2021 logistic regression results
. use "./output/tempdata/ib1.age_cat_diff_rheum_2020", clear 

. append using "./output/tempdata/male_diff_rheum_2020"

. append using "./output/tempdata/urban_rural_bin_diff_rheum_2020"
(note: variable idstr was str22, now str26 to accommodate using data's
       values)
(note: variable parm was str10, now str15 to accommodate using data's values)
(note: variable label was str8, now str11 to accommodate using data's values)

. append using "./output/tempdata/i.imd_diff_rheum_2020"

. append using "./output/tempdata/ib3.region_n_diff_rheum_2020"

. append using "./output/tempdata/i.eth5_diff_rheum_2020"

. append using "./output/tempdata/multi_diff_rheum_2020"

. append using "./output/tempdata/ib1.age_cat_diff_rheum_2021"

. append using "./output/tempdata/male_diff_rheum_2021"

. append using "./output/tempdata/urban_rural_bin_diff_rheum_2021"

. append using "./output/tempdata/i.imd_diff_rheum_2021"

. append using "./output/tempdata/ib3.region_n_diff_rheum_2021"

. append using "./output/tempdata/i.eth5_diff_rheum_2021"

. append using "./output/tempdata/multi_diff_rheum_2021"

. append using "./output/tempdata/ib1.age_cat_diff_rheum_2022"

. append using "./output/tempdata/male_diff_rheum_2022"

. append using "./output/tempdata/urban_rural_bin_diff_rheum_2022"

. append using "./output/tempdata/i.imd_diff_rheum_2022"

. append using "./output/tempdata/ib3.region_n_diff_rheum_2022"

. append using "./output/tempdata/i.eth5_diff_rheum_2022"

. append using "./output/tempdata/multi_diff_rheum_2022"

. drop stderr z 

. export delimited using ./output/tables/logistic_diff_all_results.csv
file ./output/tables/logistic_diff_all_results.csv saved

. 
.     
. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/outpatients.log
  log type:  text
 closed on:  15 Dec 2023, 16:09:50
-------------------------------------------------------------------------------
