
. 
. cap mkdir ./output/tables

. * Import data
. import delimited using ./output/input.csv
(44 vars, 10,000 obs)

. * Check data
. count if age==. 
  0

. count if age<18 
  2,144

. count if age>110 & age!=.
  0

. sum age, d

                             age
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            4              0
10%            8              0       Obs              10,000
25%           20              0       Sum of Wgt.      10,000

50%           39                      Mean            40.0565
                        Largest       Std. Dev.      23.74763
75%           59             98
90%           73             98       Variance       563.9497
95%           79             99       Skewness       .1411382
99%           89            107       Kurtosis       2.027736

. count if sex==""
  0

. tab sex

        sex |      Freq.     Percent        Cum.
------------+-----------------------------------
          F |      4,977       49.77       49.77
          M |      4,932       49.32       99.09
          U |         91        0.91      100.00
------------+-----------------------------------
      Total |     10,000      100.00

. sum household, d

                          household
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs              10,000
25%            2              0       Sum of Wgt.      10,000

50%            3                      Mean             2.5022
                        Largest       Std. Dev.      1.045708
75%            3              6
90%            4              6       Variance       1.093505
95%            4              6       Skewness       .0086009
99%            5              7       Kurtosis       2.907941

. tab care_home_type

care_home_t |
        ype |      Freq.     Percent        Cum.
------------+-----------------------------------
         PC |        476        4.82        4.82
         PN |        481        4.87        9.68
         PR |      8,475       85.74       95.43
         PS |        452        4.57      100.00
------------+-----------------------------------
      Total |      9,884      100.00

. * Checking RA algorithm variables
. * Checking type of DMARD that meets inclusion
. foreach dmard in metho leflu sulfa hydrox {
  2.     gen `dmard'_multi = (`dmard'_count>=2)
  3.     tab `dmard'_multi if has_dmards==1, m
  4. }

metho_multi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        807       16.14       16.14
          1 |      4,193       83.86      100.00
------------+-----------------------------------
      Total |      5,000      100.00

leflu_multi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        750       15.00       15.00
          1 |      4,250       85.00      100.00
------------+-----------------------------------
      Total |      5,000      100.00

sulfa_multi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        814       16.28       16.28
          1 |      4,186       83.72      100.00
------------+-----------------------------------
      Total |      5,000      100.00

hydrox_mult |
          i |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        838       16.76       16.76
          1 |      4,162       83.24      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. gen dmard_multi = (metho_multi==1 | leflu_multi==1 | sulfa_multi==1 | hydrox_
> multi==1)

. tab dmard_multi has_alt_dmard_diag

dmard_mult |  has_alt_dmard_diag
         i |         0          1 |     Total
-----------+----------------------+----------
         0 |         2          3 |         5 
         1 |     4,998      4,997 |     9,995 
-----------+----------------------+----------
     Total |     5,000      5,000 |    10,000 

. sum number_ra_codes

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
number_ra_~s |     10,000      2.5102    1.038847          0          6

. di "Number where no DMARDs but does have multiple RA codes and no alt diag"
Number where no DMARDs but does have multiple RA codes and no alt diag

. count if has_dmards==0 & number_ra_codes>=2 & alt_diag!=1
  2,095

. tab has_ra, m

     has_ra |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,000       50.00       50.00
          1 |      5,000       50.00      100.00
------------+-----------------------------------
      Total |     10,000      100.00

. * Time since first RA code
. gen first_ra_codeA = date(first_ra_code, "YMD")
(5,598 missing values generated)

. format first_ra_codeA %dD/N/CY

. gen time_ra = (date("01Mar2018", "DMY") - first_ra_codeA)/365.25
(5,598 missing values generated)

. sum time_ra, d

                           time_ra
-------------------------------------------------------------
      Percentiles      Smallest
 1%      .881588       .0082136
 5%     4.788501       .0301164
10%     10.04517       .0301164       Obs               4,402
25%     25.38261       .0465435       Sum of Wgt.       4,402

50%     52.92676                      Mean           53.69955
                        Largest       Std. Dev.      31.97833
75%     82.27515        108.835
90%     97.81519       108.9418       Variance       1022.614
95%     103.0993       108.9446       Skewness       .0228581
99%     107.9836       108.9911       Kurtosis       1.749037

. sum number_ra_codes, d

                       number_ra_codes
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs              10,000
25%            2              0       Sum of Wgt.      10,000

50%            2                      Mean             2.5102
                        Largest       Std. Dev.      1.038847
75%            3              6
90%            4              6       Variance       1.079204
95%            4              6       Skewness       .0771915
99%            5              6       Kurtosis       2.893814

. sum metho_count, d

                         metho_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs              10,000
25%            2              0       Sum of Wgt.      10,000

50%            2                      Mean             2.5057
                        Largest       Std. Dev.      1.048464
75%            3              6
90%            4              6       Variance       1.099277
95%            4              6       Skewness       .0739591
99%            5              7       Kurtosis        2.92355

. sum sulfa_count, d 

                         sulfa_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -1
 5%            1              0
10%            1              0       Obs              10,000
25%            2              0       Sum of Wgt.      10,000

50%            3                      Mean             2.5114
                        Largest       Std. Dev.       1.05479
75%            3              6
90%            4              7       Variance       1.112581
95%            4              7       Skewness       .0265067
99%            5              7       Kurtosis       2.970221

. sum leflu_count, d 

                         leflu_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs              10,000
25%            2              0       Sum of Wgt.      10,000

50%            3                      Mean             2.5136
                        Largest       Std. Dev.       1.03524
75%            3              6
90%            4              6       Variance       1.071722
95%            4              6       Skewness       .0093531
99%            5              7       Kurtosis       2.916202

. sum hydrox_count, d 

                        hydrox_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -1
 5%            1              0
10%            1              0       Obs              10,000
25%            2              0       Sum of Wgt.      10,000

50%            3                      Mean             2.5045
                        Largest       Std. Dev.      1.050757
75%            3              6
90%            4              6       Variance        1.10409
95%            4              6       Skewness       .0139843
99%            5              6       Kurtosis       2.818801

. 
. sum outpatient*, d

                    outpatient_appt_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              10,000
25%            6              0       Sum of Wgt.      10,000

50%            7                      Mean             6.7483
                        Largest       Std. Dev.      2.951138
75%            9             14
90%           10             15       Variance       8.709218
95%           11             15       Skewness      -.8674318
99%           12             17       Kurtosis       3.482911

                    outpatient_appt_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%           .5              0       Obs              10,000
25%            6              0       Sum of Wgt.      10,000

50%            7                      Mean             6.7506
                        Largest       Std. Dev.      2.947892
75%            9             14
90%           10             14       Variance       8.690069
95%           11             15       Skewness      -.8690804
99%           12             15       Kurtosis        3.48927

                    outpatient_appt_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%           .5              0       Obs              10,000
25%            6              0       Sum of Wgt.      10,000

50%            7                      Mean             6.7757
                        Largest       Std. Dev.      2.960349
75%            9             14
90%           10             14       Variance       8.763666
95%           11             16       Skewness      -.8485605
99%           12             17       Kurtosis       3.519724

                   outpatient_medium_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               5,000
25%            2              1       Sum of Wgt.       5,000

50%            5                      Mean             13.493
                        Largest       Std. Dev.      28.17236
75%            7             98
90%            8             98       Variance       793.6819
95%           98             98       Skewness       2.644367
99%           98             98       Kurtosis       8.066002

                   outpatient_medium_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               5,000
25%            2              1       Sum of Wgt.       5,000

50%            5                      Mean             13.958
                        Largest       Std. Dev.      28.87944
75%            7             98
90%           98             98       Variance       834.0218
95%           98             98       Skewness       2.546502
99%           98             98       Kurtosis       7.549955

                   outpatient_medium_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               5,000
25%            2              1       Sum of Wgt.       5,000

50%            4                      Mean             13.025
                        Largest       Std. Dev.      27.62991
75%            7             98
90%            8             98       Variance       763.4119
95%           98             98       Skewness       2.727259
99%           98             98       Kurtosis        8.51658

. 
. keep if has_ra
(5,000 observations deleted)

. 
. * How many people are not on DMARDs and have no RA appointments?
. 
. 
. * Format variables
. *re-order ethnicity
.  gen eth5=1 if ethnicity==1
(3,982 missing values generated)

.  replace eth5=2 if ethnicity==3
(993 real changes made)

.  replace eth5=3 if ethnicity==4
(1,003 real changes made)

.  replace eth5=4 if ethnicity==2
(1,012 real changes made)

.  replace eth5=5 if ethnicity==5
(974 real changes made)

.  replace eth5=. if ethnicity==.
(0 real changes made)

. 
.  label define eth5                      1 "White"                            
>            ///
>                                                         2 "South Asian"      
>                    ///                                             
>                                                         3 "Black"            
>                            ///
>                                                         4 "Mixed"            
>                            ///
>                                                         5 "Other"            
>                            

.                                         
. 
. label values eth5 eth5

. safetab eth5, m
5

       eth5 |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |      1,018       20.36       20.36
South Asian |        993       19.86       40.22
      Black |      1,003       20.06       60.28
      Mixed |      1,012       20.24       80.52
      Other |        974       19.48      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. 
. * formatting gender
. gen male=(sex=="M")

. replace male = 0 if sex == "F"
(0 real changes made)

. label define male 0"Female" 1"Male"

. label values male male

. safetab male, miss
5

       male |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |      2,537       50.74       50.74
       Male |      2,463       49.26      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. 
. * Make region numeric
. generate region2=.
(5,000 missing values generated)

. replace region2=0 if region=="East"
(0 real changes made)

. replace region2=1 if region=="East Midlands"
(509 real changes made)

. replace region2=2 if region=="London"
(1,008 real changes made)

. replace region2=3 if region=="North East"
(516 real changes made)

. replace region2=4 if region=="North West"
(497 real changes made)

. replace region2=5 if region=="South East"
(1,025 real changes made)

. replace region2=6 if region=="South West"
(0 real changes made)

. replace region2=7 if region=="West Midlands"
(490 real changes made)

. replace region2=8 if region=="Yorkshire and The Humber"
(0 real changes made)

. drop region

. rename region2 region

. label var region "region of England"

. label define region 0 "East" 1 "East Midlands"  2 "London" 3 "North East" 4 "
> North West" 5 "South East" 6 "South West" 7 "West Midlands" 8 "Yorkshire and 
> The Humber"

. label values region region

. safetab region, miss
7

       region of England |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
           East Midlands |        509       10.18       10.18
                  London |      1,008       20.16       30.34
              North East |        516       10.32       40.66
              North West |        497        9.94       50.60
              South East |      1,025       20.50       71.10
           West Midlands |        490        9.80       80.90
                       . |        955       19.10      100.00
-------------------------+-----------------------------------
                   Total |      5,000      100.00

. 
. *create a 4 category rural urban variable 
. generate urban_rural_5=.
(5,000 missing values generated)

. la var urban_rural_5 "Rural Urban in five categories"

. replace urban_rural_5=1 if urban_rural==1
(566 real changes made)

. replace urban_rural_5=2 if urban_rural==2
(654 real changes made)

. replace urban_rural_5=3 if urban_rural==3|urban_rural==4
(1,232 real changes made)

. replace urban_rural_5=4 if urban_rural==5|urban_rural==6
(1,279 real changes made)

. replace urban_rural_5=5 if urban_rural==7|urban_rural==8
(1,269 real changes made)

. label define urban_rural_5 1 "Urban major conurbation" 2 "Urban minor conurba
> tion" 3 "Urban city and town" 4 "Rural town and fringe" 5 "Rural village and 
> dispersed"

. label values urban_rural_5 urban_rural_5

. safetab urban_rural_5, miss
14

        Rural Urban in five |
                 categories |      Freq.     Percent        Cum.
----------------------------+-----------------------------------
    Urban major conurbation |        566       11.32       11.32
    Urban minor conurbation |        654       13.08       24.40
        Urban city and town |      1,232       24.64       49.04
      Rural town and fringe |      1,279       25.58       74.62
Rural village and dispersed |      1,269       25.38      100.00
----------------------------+-----------------------------------
                      Total |      5,000      100.00

. 
. *generate a binary rural urban (with missing assigned to urban)
. generate urban_rural_bin=.
(5,000 missing values generated)

. replace urban_rural_bin=1 if urban_rural<=4|urban_rural==.
(2,452 real changes made)

. replace urban_rural_bin=0 if urban_rural>4 & urban_rural!=.
(2,548 real changes made)

. label define urban_rural_bin 0 "Rural" 1 "Urban"

. label values urban_rural_bin urban_rural_bin

. safetab urban_rural_bin urban_rural, miss
28

urban_rura |                      urban_rural
     l_bin |         1          2          3          4          5 |     Total
-----------+-------------------------------------------------------+----------
     Rural |         0          0          0          0        642 |     2,548 
     Urban |       566        654        651        581          0 |     2,452 
-----------+-------------------------------------------------------+----------
     Total |       566        654        651        581        642 |     5,000 


urban_rura |           urban_rural
     l_bin |         6          7          8 |     Total
-----------+---------------------------------+----------
     Rural |       637        633        636 |     2,548 
     Urban |         0          0          0 |     2,452 
-----------+---------------------------------+----------
     Total |       637        633        636 |     5,000 

. label var urban_rural_bin "Rural-Urban"

. 
. * Define age categories
. * Create age categories
. egen age_cat = cut(age), at(18, 40, 60, 80, 120) icodes
(1099 missing values generated)

. label define age 0 "18 - 40 years" 1 "41 - 60 years" 2 "61 - 80 years" 3 ">80
>  years"

. label values age_cat age

. safetab age_cat, miss
8

      age_cat |      Freq.     Percent        Cum.
--------------+-----------------------------------
18 - 40 years |      1,435       28.70       28.70
41 - 60 years |      1,233       24.66       53.36
61 - 80 years |        968       19.36       72.72
    >80 years |        265        5.30       78.02
            . |      1,099       21.98      100.00
--------------+-----------------------------------
        Total |      5,000      100.00

. 
. * Flag if in a care-home
.     gen care_home=care_home_type!="PR"

. 
. * Smoking status
. gen smoking = 0 if smoking_status=="N"
(4,494 missing values generated)

. replace smoking = 1 if smoking_status=="S"
(1,032 real changes made)

. replace smoking = 2 if smoking_status=="E"
(739 real changes made)

. replace smoking = 3 if smoking==.
(2,723 real changes made)

. 
. label define smok 1 "Current smoker" 2 "Ex-smoker" 0 "Never smoked" 3 "Unknow
> n"

. label values smoking smok

. 
. * BMI categories
. egen bmi_cat = cut(bmi), at(0, 1, 18.5, 24.9, 29.9, 39.9, 100) icodes

. bys bmi_cat: sum bmi

-------------------------------------------------------------------------------
-> bmi_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        997           0           0          0          0

-------------------------------------------------------------------------------
-> bmi_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        471    14.95999    3.046804   3.154498   18.49268

-------------------------------------------------------------------------------
-> bmi_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        881    22.03118    1.840483   18.50547    24.8999

-------------------------------------------------------------------------------
-> bmi_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |      1,011    27.40307    1.414162   24.91258   29.89925

-------------------------------------------------------------------------------
-> bmi_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |      1,371    34.08469    2.746455   29.90307   39.89558

-------------------------------------------------------------------------------
-> bmi_cat = 5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        269    43.25455    2.987457   39.90205   55.05476


. label define bmi 0 "Missing" 1 "Underweight" 2 "Healthy range" 3 "Overweight"
>  4 "Obese" 5 "Morbidly obese"

. label values bmi_cat bmi

. 
. * Categorise number of outpatient appointments
. label define appt 0 "No appointments" 1 "1-2 per year" 2 "3 or more per year"
>  

. forvalues i=2019/2021 {
  2.     egen op_appt_`i'_cat = cut(outpatient_appt_`i'), at(0, 1, 3, 1000) ico
> des
  3.     label values op_appt_`i'_cat appt
  4.     }

. 
. * Calculate difference compared to 2019
. gen diff_op_2020 = outpatient_appt_2020 - outpatient_appt_2019

. gen diff_op_2021 = outpatient_appt_2021 - outpatient_appt_2019

. sum diff_op_2020 diff_op_2021, d

                        diff_op_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%          -10            -13
 5%           -7            -12
10%           -5            -12       Obs               5,000
25%           -2            -12       Sum of Wgt.       5,000

50%            0                      Mean              .0062
                        Largest       Std. Dev.       4.17881
75%            2             12
90%            6             12       Variance       17.46245
95%            8             13       Skewness       .0475647
99%           10             14       Kurtosis       3.180061

                        diff_op_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%          -10            -14
 5%           -7            -13
10%           -5            -13       Obs               5,000
25%           -2            -12       Sum of Wgt.       5,000

50%            0                      Mean              .0424
                        Largest       Std. Dev.       4.18446
75%            2             13
90%            6             13       Variance        17.5097
95%            7             14       Skewness       -.003627
99%           10             14       Kurtosis         3.2337

. 
. preserve

. * Tabulate number of appointments per year
. table1_mc, vars(op_appt_2019_cat cate \ op_appt_2020_cat cate \ op_appt_2021_
> cat cate \ diff_op_2020 contn \ diff_op_2021 contn) clear

  +--------------------------------+
  | factor               N_1   m_1 |
  |--------------------------------|
  | op_appt_2019_cat   5,000     0 |
  |--------------------------------|
  | op_appt_2020_cat   5,000     0 |
  |--------------------------------|
  | op_appt_2021_cat   5,000     0 |
  |--------------------------------|
  | diff_op_2020       5,000     0 |
  |--------------------------------|
  | diff_op_2021       5,000     0 |
  +--------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +---------------------------------------------------------+
  |                                         Total           |
  |---------------------------------------------------------|
  |                                         N=5,000         |
  |---------------------------------------------------------|
  | op_appt_2019_cat   No appointments      518 (10.4%)     |
  |                    1-2 per year         21 ( 0.4%)      |
  |                    3 or more per year   4,461 (89.2%)   |
  |---------------------------------------------------------|
  | op_appt_2020_cat   No appointments      500 (10.0%)     |
  |                    1-2 per year         26 ( 0.5%)      |
  |                    3 or more per year   4,474 (89.5%)   |
  |---------------------------------------------------------|
  | op_appt_2021_cat   No appointments      515 (10.3%)     |
  |                    1-2 per year         18 ( 0.4%)      |
  |                    3 or more per year   4,467 (89.3%)   |
  |---------------------------------------------------------|
  | diff_op_2020                            .0062 (4.17881) |
  |---------------------------------------------------------|
  | diff_op_2021                            .0424 (4.18446) |
  +---------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 

. export delimited using ./output/tables/op_appt_yrs.csv
file ./output/tables/op_appt_yrs.csv saved

. restore 

. * Tabulate overall characteristics 
. preserve

. table1_mc, vars(age_cat cate \ male cate \ region cate \ urban_rural_5 cate \
>  prescribed_biologics cate \ imd cate \ care_home cate \ smoking cate \ time_
> ra contn \ bmi_cat cate) clear

  +------------------------------------------------+
  | factor                             N_1     m_1 |
  |------------------------------------------------|
  | age_cat                          3,901   1,099 |
  |------------------------------------------------|
  | male                             5,000       0 |
  |------------------------------------------------|
  | region of England                4,045     955 |
  |------------------------------------------------|
  | Rural Urban in five categories   5,000       0 |
  |------------------------------------------------|
  | prescribed_biologics             5,000       0 |
  |------------------------------------------------|
  | imd                              5,000       0 |
  |------------------------------------------------|
  | care_home                        5,000       0 |
  |------------------------------------------------|
  | smoking                          5,000       0 |
  |------------------------------------------------|
  | time_ra                          2,283   2,717 |
  |------------------------------------------------|
  | bmi_cat                          5,000       0 |
  +------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=5,000     
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 1,435 (36.8%
> )       |
  |                                  41 - 60 years                 1,233 (31.6%
> )       |
  |                                  61 - 80 years                 968 (24.8%) 
>         |
  |                                  >80 years                     265 ( 6.8%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        2,537 (50.7%
> )       |
  |                                  Male                          2,463 (49.3%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | region of England                East Midlands                 509 (12.6%) 
>         |
  |                                  London                        1,008 (24.9%
> )       |
  |                                  North East                    516 (12.8%) 
>         |
  |                                  North West                    497 (12.3%) 
>         |
  |                                  South East                    1,025 (25.3%
> )       |
  |                                  West Midlands                 490 (12.1%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       566 (11.3%) 
>         |
  |                                  Urban minor conurbation       654 (13.1%) 
>         |
  |                                  Urban city and town           1,232 (24.6%
> )       |
  |                                  Rural town and fringe         1,279 (25.6%
> )       |
  |                                  Rural village and dispersed   1,269 (25.4%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             2,490 (49.8%
> )       |
  |                                  1                             2,510 (50.2%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             261 ( 5.2%) 
>         |
  |                                  1                             946 (18.9%) 
>         |
  |                                  2                             954 (19.1%) 
>         |
  |                                  3                             907 (18.1%) 
>         |
  |                                  4                             959 (19.2%) 
>         |
  |                                  5                             973 (19.5%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | care_home                        0                             4,246 (84.9%
> )       |
  |                                  1                             754 (15.1%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  506 (10.1%) 
>         |
  |                                  Current smoker                1,032 (20.6%
> )       |
  |                                  Ex-smoker                     739 (14.8%) 
>         |
  |                                  Unknown                       2,723 (54.5%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        53.99797 (31
> .76796) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       997 (19.9%) 
>         |
  |                                  Underweight                   471 ( 9.4%) 
>         |
  |                                  Healthy range                 881 (17.6%) 
>         |
  |                                  Overweight                    1,011 (20.2%
> )       |
  |                                  Obese                         1,371 (27.4%
> )       |
  |                                  Morbidly obese                269 ( 5.4%) 
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 

. export delimited using ./output/tables/op_chars.csv
file ./output/tables/op_chars.csv saved

. restore

. * Tabulate characteristics by category of outpatient appointments for each ye
> ar
. tempfile tempfile

. forvalues i=2019/2021 {
  2.     preserve
  3.     keep if op_appt_`i'_cat==0
  4.     table1_mc, vars(age_cat cate \ male cate \ region cate \ urban_rural_5
>  cate \ prescribed_biologics cate \ imd cate \ care_home cate \ smoking cate 
> \ time_ra contn \ bmi_cat cate) clear
  5.     save `tempfile', replace
  6.     restore
  7.     forvalues j=1/2 {
  8.         preserve
  9.         keep if op_appt_`i'_cat==`j'
 10.         table1_mc, vars(age_cat cate \ male cate \ region cate \ urban_rur
> al_5 cate \ prescribed_biologics cate \ imd cate \ care_home cate \ smoking c
> ate \ time_ra contn \ bmi_cat cate) clear
 11.         append using `tempfile'
 12.         save `tempfile', replace
 13.         if `j'==2 {
 14.             export delimited using ./output/tables/characteristics_strata`
> i'.csv
 15.         }
 16.         restore
 17.         }
 18.     }
(4,482 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                          402   116 |
  |--------------------------------------------|
  | male                             518     0 |
  |--------------------------------------------|
  | region of England                423    95 |
  |--------------------------------------------|
  | Rural Urban in five categories   518     0 |
  |--------------------------------------------|
  | prescribed_biologics             518     0 |
  |--------------------------------------------|
  | imd                              518     0 |
  |--------------------------------------------|
  | care_home                        518     0 |
  |--------------------------------------------|
  | smoking                          518     0 |
  |--------------------------------------------|
  | time_ra                          238   280 |
  |--------------------------------------------|
  | bmi_cat                          518     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=518       
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 141 (35.1%) 
>         |
  |                                  41 - 60 years                 124 (30.8%) 
>         |
  |                                  61 - 80 years                 104 (25.9%) 
>         |
  |                                  >80 years                     33 ( 8.2%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        274 (52.9%) 
>         |
  |                                  Male                          244 (47.1%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | region of England                East Midlands                 55 (13.0%)  
>         |
  |                                  London                        103 (24.3%) 
>         |
  |                                  North East                    51 (12.1%)  
>         |
  |                                  North West                    47 (11.1%)  
>         |
  |                                  South East                    116 (27.4%) 
>         |
  |                                  West Midlands                 51 (12.1%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       50 ( 9.7%)  
>         |
  |                                  Urban minor conurbation       68 (13.1%)  
>         |
  |                                  Urban city and town           139 (26.8%) 
>         |
  |                                  Rural town and fringe         118 (22.8%) 
>         |
  |                                  Rural village and dispersed   143 (27.6%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             266 (51.4%) 
>         |
  |                                  1                             252 (48.6%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             37 ( 7.1%)  
>         |
  |                                  1                             108 (20.8%) 
>         |
  |                                  2                             98 (18.9%)  
>         |
  |                                  3                             99 (19.1%)  
>         |
  |                                  4                             91 (17.6%)  
>         |
  |                                  5                             85 (16.4%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | care_home                        0                             433 (83.6%) 
>         |
  |                                  1                             85 (16.4%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  44 ( 8.5%)  
>         |
  |                                  Current smoker                114 (22.0%) 
>         |
  |                                  Ex-smoker                     70 (13.5%)  
>         |
  |                                  Unknown                       290 (56.0%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        53.03361 (31
> .37309) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       104 (20.1%) 
>         |
  |                                  Underweight                   53 (10.2%)  
>         |
  |                                  Healthy range                 91 (17.6%)  
>         |
  |                                  Overweight                    107 (20.7%) 
>         |
  |                                  Obese                         132 (25.5%) 
>         |
  |                                  Morbidly obese                31 ( 6.0%)  
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
(note: file /tmp/St00011.000003 not found)
file /tmp/St00011.000003 saved
(4,979 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                           15     6 |
  |--------------------------------------------|
  | male                              21     0 |
  |--------------------------------------------|
  | region of England                 12     9 |
  |--------------------------------------------|
  | Rural Urban in five categories    21     0 |
  |--------------------------------------------|
  | prescribed_biologics              21     0 |
  |--------------------------------------------|
  | imd                               21     0 |
  |--------------------------------------------|
  | care_home                         21     0 |
  |--------------------------------------------|
  | smoking                           21     0 |
  |--------------------------------------------|
  | time_ra                            8    13 |
  |--------------------------------------------|
  | bmi_cat                           21     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=21        
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 8 (53%)     
>         |
  |                                  41 - 60 years                 4 (27%)     
>         |
  |                                  61 - 80 years                 3 (20%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        15 (71%)    
>         |
  |                                  Male                          6 (29%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | region of England                East Midlands                 2 (17%)     
>         |
  |                                  London                        3 (25%)     
>         |
  |                                  North East                    2 (17%)     
>         |
  |                                  North West                    2 (17%)     
>         |
  |                                  South East                    3 (25%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       4 (19%)     
>         |
  |                                  Urban minor conurbation       2 (10%)     
>         |
  |                                  Urban city and town           2 (10%)     
>         |
  |                                  Rural town and fringe         4 (19%)     
>         |
  |                                  Rural village and dispersed   9 (43%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             10 (48%)    
>         |
  |                                  1                             11 (52%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             1 ( 5%)     
>         |
  |                                  1                             5 (24%)     
>         |
  |                                  2                             4 (19%)     
>         |
  |                                  3                             2 (10%)     
>         |
  |                                  4                             6 (29%)     
>         |
  |                                  5                             3 (14%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | care_home                        0                             19 (90%)    
>         |
  |                                  1                             2 (10%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  2 (10%)     
>         |
  |                                  Current smoker                3 (14%)     
>         |
  |                                  Ex-smoker                     3 (14%)     
>         |
  |                                  Unknown                       13 (62%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        48.06366 (25
> .87533) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       4 (19%)     
>         |
  |                                  Underweight                   2 (10%)     
>         |
  |                                  Healthy range                 5 (24%)     
>         |
  |                                  Overweight                    5 (24%)     
>         |
  |                                  Obese                         5 (24%)     
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000003 saved
(539 observations deleted)

  +------------------------------------------------+
  | factor                             N_1     m_1 |
  |------------------------------------------------|
  | age_cat                          3,484     977 |
  |------------------------------------------------|
  | male                             4,461       0 |
  |------------------------------------------------|
  | region of England                3,610     851 |
  |------------------------------------------------|
  | Rural Urban in five categories   4,461       0 |
  |------------------------------------------------|
  | prescribed_biologics             4,461       0 |
  |------------------------------------------------|
  | imd                              4,461       0 |
  |------------------------------------------------|
  | care_home                        4,461       0 |
  |------------------------------------------------|
  | smoking                          4,461       0 |
  |------------------------------------------------|
  | time_ra                          2,037   2,424 |
  |------------------------------------------------|
  | bmi_cat                          4,461       0 |
  +------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=4,461     
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 1,286 (36.9%
> )       |
  |                                  41 - 60 years                 1,105 (31.7%
> )       |
  |                                  61 - 80 years                 861 (24.7%) 
>         |
  |                                  >80 years                     232 ( 6.7%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        2,248 (50.4%
> )       |
  |                                  Male                          2,213 (49.6%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | region of England                East Midlands                 452 (12.5%) 
>         |
  |                                  London                        902 (25.0%) 
>         |
  |                                  North East                    463 (12.8%) 
>         |
  |                                  North West                    448 (12.4%) 
>         |
  |                                  South East                    906 (25.1%) 
>         |
  |                                  West Midlands                 439 (12.2%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       512 (11.5%) 
>         |
  |                                  Urban minor conurbation       584 (13.1%) 
>         |
  |                                  Urban city and town           1,091 (24.5%
> )       |
  |                                  Rural town and fringe         1,157 (25.9%
> )       |
  |                                  Rural village and dispersed   1,117 (25.0%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             2,214 (49.6%
> )       |
  |                                  1                             2,247 (50.4%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             223 ( 5.0%) 
>         |
  |                                  1                             833 (18.7%) 
>         |
  |                                  2                             852 (19.1%) 
>         |
  |                                  3                             806 (18.1%) 
>         |
  |                                  4                             862 (19.3%) 
>         |
  |                                  5                             885 (19.8%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | care_home                        0                             3,794 (85.0%
> )       |
  |                                  1                             667 (15.0%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  460 (10.3%) 
>         |
  |                                  Current smoker                915 (20.5%) 
>         |
  |                                  Ex-smoker                     666 (14.9%) 
>         |
  |                                  Unknown                       2,420 (54.2%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        54.13396 (31
> .84335) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       889 (19.9%) 
>         |
  |                                  Underweight                   416 ( 9.3%) 
>         |
  |                                  Healthy range                 785 (17.6%) 
>         |
  |                                  Overweight                    899 (20.2%) 
>         |
  |                                  Obese                         1,234 (27.7%
> )       |
  |                                  Morbidly obese                238 ( 5.3%) 
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000003 saved
file ./output/tables/characteristics_strata2019.csv saved
(4,500 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                          401    99 |
  |--------------------------------------------|
  | male                             500     0 |
  |--------------------------------------------|
  | region of England                402    98 |
  |--------------------------------------------|
  | Rural Urban in five categories   500     0 |
  |--------------------------------------------|
  | prescribed_biologics             500     0 |
  |--------------------------------------------|
  | imd                              500     0 |
  |--------------------------------------------|
  | care_home                        500     0 |
  |--------------------------------------------|
  | smoking                          500     0 |
  |--------------------------------------------|
  | time_ra                          231   269 |
  |--------------------------------------------|
  | bmi_cat                          500     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=500       
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 151 (37.7%) 
>         |
  |                                  41 - 60 years                 124 (30.9%) 
>         |
  |                                  61 - 80 years                 96 (23.9%)  
>         |
  |                                  >80 years                     30 ( 7.5%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        255 (51.0%) 
>         |
  |                                  Male                          245 (49.0%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | region of England                East Midlands                 58 (14.4%)  
>         |
  |                                  London                        104 (25.9%) 
>         |
  |                                  North East                    55 (13.7%)  
>         |
  |                                  North West                    49 (12.2%)  
>         |
  |                                  South East                    93 (23.1%)  
>         |
  |                                  West Midlands                 43 (10.7%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       40 ( 8.0%)  
>         |
  |                                  Urban minor conurbation       63 (12.6%)  
>         |
  |                                  Urban city and town           133 (26.6%) 
>         |
  |                                  Rural town and fringe         139 (27.8%) 
>         |
  |                                  Rural village and dispersed   125 (25.0%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             243 (48.6%) 
>         |
  |                                  1                             257 (51.4%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             33 ( 6.6%)  
>         |
  |                                  1                             103 (20.6%) 
>         |
  |                                  2                             80 (16.0%)  
>         |
  |                                  3                             94 (18.8%)  
>         |
  |                                  4                             103 (20.6%) 
>         |
  |                                  5                             87 (17.4%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | care_home                        0                             434 (86.8%) 
>         |
  |                                  1                             66 (13.2%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  54 (10.8%)  
>         |
  |                                  Current smoker                104 (20.8%) 
>         |
  |                                  Ex-smoker                     85 (17.0%)  
>         |
  |                                  Unknown                       257 (51.4%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        53.10058 (31
> .75312) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       93 (18.6%)  
>         |
  |                                  Underweight                   48 ( 9.6%)  
>         |
  |                                  Healthy range                 95 (19.0%)  
>         |
  |                                  Overweight                    100 (20.0%) 
>         |
  |                                  Obese                         138 (27.6%) 
>         |
  |                                  Morbidly obese                26 ( 5.2%)  
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000003 saved
(4,974 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                           22     4 |
  |--------------------------------------------|
  | male                              26     0 |
  |--------------------------------------------|
  | region of England                 21     5 |
  |--------------------------------------------|
  | Rural Urban in five categories    26     0 |
  |--------------------------------------------|
  | prescribed_biologics              26     0 |
  |--------------------------------------------|
  | imd                               26     0 |
  |--------------------------------------------|
  | care_home                         26     0 |
  |--------------------------------------------|
  | smoking                           26     0 |
  |--------------------------------------------|
  | time_ra                            7    19 |
  |--------------------------------------------|
  | bmi_cat                           26     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=26        
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 9 (41%)     
>         |
  |                                  41 - 60 years                 6 (27%)     
>         |
  |                                  61 - 80 years                 6 (27%)     
>         |
  |                                  >80 years                     1 ( 5%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        13 (50%)    
>         |
  |                                  Male                          13 (50%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | region of England                East Midlands                 4 (19%)     
>         |
  |                                  London                        7 (33%)     
>         |
  |                                  North East                    4 (19%)     
>         |
  |                                  North West                    1 ( 5%)     
>         |
  |                                  South East                    4 (19%)     
>         |
  |                                  West Midlands                 1 ( 5%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       4 (15%)     
>         |
  |                                  Urban minor conurbation       1 ( 4%)     
>         |
  |                                  Urban city and town           6 (23%)     
>         |
  |                                  Rural town and fringe         8 (31%)     
>         |
  |                                  Rural village and dispersed   7 (27%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             17 (65%)    
>         |
  |                                  1                             9 (35%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              1                             4 (15%)     
>         |
  |                                  2                             4 (15%)     
>         |
  |                                  3                             5 (19%)     
>         |
  |                                  4                             11 (42%)    
>         |
  |                                  5                             2 ( 8%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | care_home                        0                             22 (85%)    
>         |
  |                                  1                             4 (15%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  2 ( 8%)     
>         |
  |                                  Current smoker                5 (19%)     
>         |
  |                                  Ex-smoker                     3 (12%)     
>         |
  |                                  Unknown                       16 (62%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        66.36276 (41
> .31675) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       4 (15%)     
>         |
  |                                  Underweight                   1 ( 4%)     
>         |
  |                                  Healthy range                 4 (15%)     
>         |
  |                                  Overweight                    8 (31%)     
>         |
  |                                  Obese                         7 (27%)     
>         |
  |                                  Morbidly obese                2 ( 8%)     
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000003 saved
(526 observations deleted)

  +------------------------------------------------+
  | factor                             N_1     m_1 |
  |------------------------------------------------|
  | age_cat                          3,478     996 |
  |------------------------------------------------|
  | male                             4,474       0 |
  |------------------------------------------------|
  | region of England                3,622     852 |
  |------------------------------------------------|
  | Rural Urban in five categories   4,474       0 |
  |------------------------------------------------|
  | prescribed_biologics             4,474       0 |
  |------------------------------------------------|
  | imd                              4,474       0 |
  |------------------------------------------------|
  | care_home                        4,474       0 |
  |------------------------------------------------|
  | smoking                          4,474       0 |
  |------------------------------------------------|
  | time_ra                          2,045   2,429 |
  |------------------------------------------------|
  | bmi_cat                          4,474       0 |
  +------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=4,474     
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 1,275 (36.7%
> )       |
  |                                  41 - 60 years                 1,103 (31.7%
> )       |
  |                                  61 - 80 years                 866 (24.9%) 
>         |
  |                                  >80 years                     234 ( 6.7%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        2,269 (50.7%
> )       |
  |                                  Male                          2,205 (49.3%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | region of England                East Midlands                 447 (12.3%) 
>         |
  |                                  London                        897 (24.8%) 
>         |
  |                                  North East                    457 (12.6%) 
>         |
  |                                  North West                    447 (12.3%) 
>         |
  |                                  South East                    928 (25.6%) 
>         |
  |                                  West Midlands                 446 (12.3%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       522 (11.7%) 
>         |
  |                                  Urban minor conurbation       590 (13.2%) 
>         |
  |                                  Urban city and town           1,093 (24.4%
> )       |
  |                                  Rural town and fringe         1,132 (25.3%
> )       |
  |                                  Rural village and dispersed   1,137 (25.4%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             2,230 (49.8%
> )       |
  |                                  1                             2,244 (50.2%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             228 ( 5.1%) 
>         |
  |                                  1                             839 (18.8%) 
>         |
  |                                  2                             870 (19.4%) 
>         |
  |                                  3                             808 (18.1%) 
>         |
  |                                  4                             845 (18.9%) 
>         |
  |                                  5                             884 (19.8%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | care_home                        0                             3,790 (84.7%
> )       |
  |                                  1                             684 (15.3%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  450 (10.1%) 
>         |
  |                                  Current smoker                923 (20.6%) 
>         |
  |                                  Ex-smoker                     651 (14.6%) 
>         |
  |                                  Unknown                       2,450 (54.8%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        54.05702 (31
> .74319) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       900 (20.1%) 
>         |
  |                                  Underweight                   422 ( 9.4%) 
>         |
  |                                  Healthy range                 782 (17.5%) 
>         |
  |                                  Overweight                    903 (20.2%) 
>         |
  |                                  Obese                         1,226 (27.4%
> )       |
  |                                  Morbidly obese                241 ( 5.4%) 
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000003 saved
file ./output/tables/characteristics_strata2020.csv saved
(4,485 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                          412   103 |
  |--------------------------------------------|
  | male                             515     0 |
  |--------------------------------------------|
  | region of England                411   104 |
  |--------------------------------------------|
  | Rural Urban in five categories   515     0 |
  |--------------------------------------------|
  | prescribed_biologics             515     0 |
  |--------------------------------------------|
  | imd                              515     0 |
  |--------------------------------------------|
  | care_home                        515     0 |
  |--------------------------------------------|
  | smoking                          515     0 |
  |--------------------------------------------|
  | time_ra                          242   273 |
  |--------------------------------------------|
  | bmi_cat                          515     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=515       
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 148 (35.9%) 
>         |
  |                                  41 - 60 years                 136 (33.0%) 
>         |
  |                                  61 - 80 years                 98 (23.8%)  
>         |
  |                                  >80 years                     30 ( 7.3%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        259 (50.3%) 
>         |
  |                                  Male                          256 (49.7%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | region of England                East Midlands                 55 (13.4%)  
>         |
  |                                  London                        100 (24.3%) 
>         |
  |                                  North East                    49 (11.9%)  
>         |
  |                                  North West                    59 (14.4%)  
>         |
  |                                  South East                    93 (22.6%)  
>         |
  |                                  West Midlands                 55 (13.4%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       55 (10.7%)  
>         |
  |                                  Urban minor conurbation       57 (11.1%)  
>         |
  |                                  Urban city and town           137 (26.6%) 
>         |
  |                                  Rural town and fringe         130 (25.2%) 
>         |
  |                                  Rural village and dispersed   136 (26.4%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             270 (52.4%) 
>         |
  |                                  1                             245 (47.6%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             19 ( 3.7%)  
>         |
  |                                  1                             105 (20.4%) 
>         |
  |                                  2                             112 (21.7%) 
>         |
  |                                  3                             96 (18.6%)  
>         |
  |                                  4                             81 (15.7%)  
>         |
  |                                  5                             102 (19.8%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | care_home                        0                             448 (87.0%) 
>         |
  |                                  1                             67 (13.0%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  57 (11.1%)  
>         |
  |                                  Current smoker                125 (24.3%) 
>         |
  |                                  Ex-smoker                     67 (13.0%)  
>         |
  |                                  Unknown                       266 (51.7%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        55.88981 (32
> .08704) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       88 (17.1%)  
>         |
  |                                  Underweight                   43 ( 8.3%)  
>         |
  |                                  Healthy range                 104 (20.2%) 
>         |
  |                                  Overweight                    116 (22.5%) 
>         |
  |                                  Obese                         130 (25.2%) 
>         |
  |                                  Morbidly obese                34 ( 6.6%)  
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000003 saved
(4,982 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                           15     3 |
  |--------------------------------------------|
  | male                              18     0 |
  |--------------------------------------------|
  | region of England                 14     4 |
  |--------------------------------------------|
  | Rural Urban in five categories    18     0 |
  |--------------------------------------------|
  | prescribed_biologics              18     0 |
  |--------------------------------------------|
  | imd                               18     0 |
  |--------------------------------------------|
  | care_home                         18     0 |
  |--------------------------------------------|
  | smoking                           18     0 |
  |--------------------------------------------|
  | time_ra                            5    13 |
  |--------------------------------------------|
  | bmi_cat                           18     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=18        
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 5 (33%)     
>         |
  |                                  41 - 60 years                 5 (33%)     
>         |
  |                                  61 - 80 years                 2 (13%)     
>         |
  |                                  >80 years                     3 (20%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        10 (56%)    
>         |
  |                                  Male                          8 (44%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | region of England                East Midlands                 3 (21%)     
>         |
  |                                  London                        5 (36%)     
>         |
  |                                  North East                    2 (14%)     
>         |
  |                                  North West                    3 (21%)     
>         |
  |                                  South East                    1 ( 7%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       3 (17%)     
>         |
  |                                  Urban city and town           3 (17%)     
>         |
  |                                  Rural town and fringe         5 (28%)     
>         |
  |                                  Rural village and dispersed   7 (39%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             9 (50%)     
>         |
  |                                  1                             9 (50%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             1 ( 6%)     
>         |
  |                                  1                             1 ( 6%)     
>         |
  |                                  2                             7 (39%)     
>         |
  |                                  3                             2 (11%)     
>         |
  |                                  4                             2 (11%)     
>         |
  |                                  5                             5 (28%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | care_home                        0                             12 (67%)    
>         |
  |                                  1                             6 (33%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  2 (11%)     
>         |
  |                                  Current smoker                4 (22%)     
>         |
  |                                  Ex-smoker                     2 (11%)     
>         |
  |                                  Unknown                       10 (56%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        55.15126 (37
> .53189) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       4 (22%)     
>         |
  |                                  Underweight                   2 (11%)     
>         |
  |                                  Healthy range                 4 (22%)     
>         |
  |                                  Overweight                    3 (17%)     
>         |
  |                                  Obese                         4 (22%)     
>         |
  |                                  Morbidly obese                1 ( 6%)     
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000003 saved
(533 observations deleted)

  +------------------------------------------------+
  | factor                             N_1     m_1 |
  |------------------------------------------------|
  | age_cat                          3,474     993 |
  |------------------------------------------------|
  | male                             4,467       0 |
  |------------------------------------------------|
  | region of England                3,620     847 |
  |------------------------------------------------|
  | Rural Urban in five categories   4,467       0 |
  |------------------------------------------------|
  | prescribed_biologics             4,467       0 |
  |------------------------------------------------|
  | imd                              4,467       0 |
  |------------------------------------------------|
  | care_home                        4,467       0 |
  |------------------------------------------------|
  | smoking                          4,467       0 |
  |------------------------------------------------|
  | time_ra                          2,036   2,431 |
  |------------------------------------------------|
  | bmi_cat                          4,467       0 |
  +------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=4,467     
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 1,282 (36.9%
> )       |
  |                                  41 - 60 years                 1,092 (31.4%
> )       |
  |                                  61 - 80 years                 868 (25.0%) 
>         |
  |                                  >80 years                     232 ( 6.7%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        2,268 (50.8%
> )       |
  |                                  Male                          2,199 (49.2%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | region of England                East Midlands                 451 (12.5%) 
>         |
  |                                  London                        903 (24.9%) 
>         |
  |                                  North East                    465 (12.8%) 
>         |
  |                                  North West                    435 (12.0%) 
>         |
  |                                  South East                    931 (25.7%) 
>         |
  |                                  West Midlands                 435 (12.0%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       508 (11.4%) 
>         |
  |                                  Urban minor conurbation       597 (13.4%) 
>         |
  |                                  Urban city and town           1,092 (24.4%
> )       |
  |                                  Rural town and fringe         1,144 (25.6%
> )       |
  |                                  Rural village and dispersed   1,126 (25.2%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             2,211 (49.5%
> )       |
  |                                  1                             2,256 (50.5%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             241 ( 5.4%) 
>         |
  |                                  1                             840 (18.8%) 
>         |
  |                                  2                             835 (18.7%) 
>         |
  |                                  3                             809 (18.1%) 
>         |
  |                                  4                             876 (19.6%) 
>         |
  |                                  5                             866 (19.4%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | care_home                        0                             3,786 (84.8%
> )       |
  |                                  1                             681 (15.2%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  447 (10.0%) 
>         |
  |                                  Current smoker                903 (20.2%) 
>         |
  |                                  Ex-smoker                     670 (15.0%) 
>         |
  |                                  Unknown                       2,447 (54.8%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        53.77028 (31
> .72564) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       905 (20.3%) 
>         |
  |                                  Underweight                   426 ( 9.5%) 
>         |
  |                                  Healthy range                 773 (17.3%) 
>         |
  |                                  Overweight                    892 (20.0%) 
>         |
  |                                  Obese                         1,237 (27.7%
> )       |
  |                                  Morbidly obese                234 ( 5.2%) 
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000003 saved
file ./output/tables/characteristics_strata2021.csv saved

.     /* Tabulate characteristics by whether hospitalised with RA for each year
>     preserve
>     keep if ra_hosp_`i'==1
>     table1_mc, vars(age_cat cate \ male cate \ region cate \ urban_rural_5 ca
> te \ prescribed_biologics cate \ imd cate \ care_home cate \ smoking cate \ t
> ime_ra contn \ bmi_cat cate) clear
>     export delimited using ./output/tables/characteristics_ra_hosp_`i'.csv
>     restore
>     }
> preserve
>     keep if ra_hosp_2018==1
>     table1_mc, vars(age_cat cate \ male cate \ region cate \ urban_rural_5 ca
> te \ prescribed_biologics cate \ imd cate \ care_home cate \ smoking cate \ t
> ime_ra contn \ bmi_cat cate) clear
>     export delimited using ./output/tables/characteristics_ra_hosp_2018.csv
>     restore
>     */
. log close
      name:  <unnamed>
       log:  /workspace/logs/outpatients.log
  log type:  text
 closed on:  24 Oct 2022, 15:24:42
-------------------------------------------------------------------------------
