
. 
. cap mkdir ./output/tables/

. 
. * Import data
. import delimited using ./output/input.csv
(51 vars, 10,000 obs)

. * Check data
. count if age==. 
  0

. count if age<18 
  2,097

. count if age>110 & age!=.
  0

. sum age, d

                             age
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            4              0
10%            8              0       Obs              10,000
25%           21              0       Sum of Wgt.      10,000

50%           39                      Mean            40.5135
                        Largest       Std. Dev.      23.73978
75%           59            101
90%           73            103       Variance       563.5774
95%           80            105       Skewness        .144018
99%           89            107       Kurtosis       2.057714

. count if sex==""
  0

. tab sex

        sex |      Freq.     Percent        Cum.
------------+-----------------------------------
          F |      4,990       49.90       49.90
          M |      4,915       49.15       99.05
          U |         95        0.95      100.00
------------+-----------------------------------
      Total |     10,000      100.00

. * Checking RA algorithm variables
. * Checking type of DMARD that meets inclusion
. foreach dmard in metho leflu sulfa hydrox {
  2.     gen `dmard'_multi = (`dmard'_count>=2)
  3.     tab `dmard'_multi if has_dmards==1, m
  4. }

metho_multi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        770       15.40       15.40
          1 |      4,230       84.60      100.00
------------+-----------------------------------
      Total |      5,000      100.00

leflu_multi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        779       15.58       15.58
          1 |      4,221       84.42      100.00
------------+-----------------------------------
      Total |      5,000      100.00

sulfa_multi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        818       16.36       16.36
          1 |      4,182       83.64      100.00
------------+-----------------------------------
      Total |      5,000      100.00

hydrox_mult |
          i |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        767       15.34       15.34
          1 |      4,233       84.66      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. gen dmard_multi = (metho_multi==1 | leflu_multi==1 | sulfa_multi==1 | hydrox_
> multi==1)

. tab dmard_multi has_alt_dmard_diag

dmard_mult |  has_alt_dmard_diag
         i |         0          1 |     Total
-----------+----------------------+----------
         0 |         2          4 |         6 
         1 |     4,998      4,996 |     9,994 
-----------+----------------------+----------
     Total |     5,000      5,000 |    10,000 

. sum number_ra_codes

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
number_ra_~s |     10,000      2.4924    1.040889          0          7

. di "Number where no DMARDs but does have multiple RA codes and no alt diag"
Number where no DMARDs but does have multiple RA codes and no alt diag

. count if has_dmards==0 & number_ra_codes>=2 & alt_diag!=1
  2,116

. tab has_ra, m

     has_ra |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,000       50.00       50.00
          1 |      5,000       50.00      100.00
------------+-----------------------------------
      Total |     10,000      100.00

. keep if has_ra
(5,000 observations deleted)

. * Time since first RA code
. gen first_ra_codeA = date(first_ra_code, "YMD")
(2,785 missing values generated)

. format first_ra_codeA %dD/N/CY

. gen time_ra = (date("01Mar2019", "DMY") - first_ra_codeA)/365.25
(2,785 missing values generated)

. sum time_ra, d

                           time_ra
-------------------------------------------------------------
      Percentiles      Smallest
 1%       1.1718      -.0465435
 5%      5.24846       .0711841
10%     10.37098       .1368925       Obs               2,215
25%     29.19644       .2464066       Sum of Wgt.       2,215

50%      55.4141                      Mean           55.85648
                        Largest       Std. Dev.       32.0693
75%      83.9781       109.8344
90%     100.5777       109.8754       Variance        1028.44
95%     105.0048       109.8809       Skewness      -.0254381
99%     109.0376        109.922       Kurtosis       1.804476

. sum number_ra_codes, d

                       number_ra_codes
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            3                      Mean              2.505
                        Largest       Std. Dev.      1.034693
75%            3              6
90%            4              6       Variance       1.070589
95%            4              6       Skewness       .0153461
99%            5              7       Kurtosis       3.042499

. sum metho_count, d

                         metho_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            2                      Mean             2.4854
                        Largest       Std. Dev.      1.032667
75%            3              6
90%            4              6       Variance         1.0664
95%            4              6       Skewness        .029841
99%            5              6       Kurtosis       2.915014

. sum sulfa_count, d 

                         sulfa_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            2                      Mean             2.4916
                        Largest       Std. Dev.        1.0393
75%            3              6
90%            4              6       Variance       1.080145
95%            4              6       Skewness       .0934854
99%            5              6       Kurtosis       2.897299

. sum leflu_count, d 

                         leflu_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            2                      Mean             2.5092
                        Largest       Std. Dev.      1.028459
75%            3              6
90%            4              6       Variance       1.057727
95%            4              6       Skewness       .0541717
99%            5              6       Kurtosis       2.871755

. sum hydrox_count, d 

                        hydrox_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            3                      Mean              2.515
                        Largest       Std. Dev.      1.033822
75%            3              6
90%            4              6       Variance       1.068789
95%            4              6       Skewness       .0494844
99%            5              6       Kurtosis       2.831169

. 
. sum outpatient*, d

                    outpatient_appt_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            2              0       Obs               5,000
25%            6              0       Sum of Wgt.       5,000

50%            7                      Mean              6.803
                        Largest       Std. Dev.      2.943454
75%            9             14
90%           10             14       Variance       8.663924
95%           11             14       Skewness      -.8782071
99%           12             15       Kurtosis       3.543095

                    outpatient_appt_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               5,000
25%            6              0       Sum of Wgt.       5,000

50%            7                      Mean             6.7112
                        Largest       Std. Dev.      2.971794
75%            9             13
90%           10             14       Variance       8.831561
95%           11             15       Skewness      -.8840932
99%           12             15       Kurtosis        3.43807

                    outpatient_appt_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               5,000
25%            6              0       Sum of Wgt.       5,000

50%            7                      Mean             6.7752
                        Largest       Std. Dev.      3.008933
75%            9             14
90%           10             14       Variance       9.053676
95%           11             15       Skewness      -.8475836
99%           12             16       Kurtosis       3.413833

                   outpatient_medium_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               2,509
25%            2              1       Sum of Wgt.       2,509

50%            4                      Mean           13.34675
                        Largest       Std. Dev.      28.07333
75%            7             98
90%            8             98       Variance       788.1118
95%           98             98       Skewness       2.662133
99%           98             98       Kurtosis       8.160886

                   outpatient_medium_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               2,521
25%            2              1       Sum of Wgt.       2,521

50%            4                      Mean           12.34193
                        Largest       Std. Dev.      26.72206
75%            7             98
90%            8             98       Variance       714.0688
95%           98             98       Skewness       2.868444
99%           98             98       Kurtosis       9.317609

                   outpatient_medium_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               2,490
25%            2              1       Sum of Wgt.       2,490

50%            5                      Mean           13.96145
                        Largest       Std. Dev.      28.79337
75%            7             98
90%           98             98       Variance       829.0584
95%           98             98       Skewness       2.555962
99%           98             98       Kurtosis        7.59989

                  outpatient_appt_all_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               5,000
25%            6              0       Sum of Wgt.       5,000

50%            7                      Mean             6.7184
                        Largest       Std. Dev.      2.958522
75%            9             14
90%           10             14       Variance       8.752852
95%           11             14       Skewness      -.8698922
99%           12             16       Kurtosis       3.453114

                  outpatient_appt_all_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            3              0       Obs               5,000
25%            6              0       Sum of Wgt.       5,000

50%            7                      Mean             6.8048
                        Largest       Std. Dev.      2.912524
75%            9             14
90%           10             14       Variance       8.482794
95%           11             14       Skewness      -.8556175
99%           12             17       Kurtosis       3.577359

                  outpatient_appt_all_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            2              0       Obs               5,000
25%            6              0       Sum of Wgt.       5,000

50%            7                      Mean             6.7662
                        Largest       Std. Dev.      2.958258
75%            9             14
90%           10             15       Variance       8.751288
95%           11             15       Skewness      -.8237495
99%           12             16       Kurtosis       3.490289

. 
. forvalues i=2019/2021 {
  2.     sum ra_hosp_beddays_`i' if ra_hosp_`i'>0, d 
  3. }

                    ra_hosp_beddays_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -1
 5%            1             -1
10%            1              0       Obs               4,874
25%            2              0       Sum of Wgt.       4,874

50%            3                      Mean           2.504309
                        Largest       Std. Dev.      1.046077
75%            3              6
90%            4              6       Variance       1.094277
95%            4              6       Skewness       .0396814
99%            5              6       Kurtosis       3.023898

                    ra_hosp_beddays_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               4,887
25%            2              0       Sum of Wgt.       4,887

50%            3                      Mean           2.524657
                        Largest       Std. Dev.      1.047655
75%            3              6
90%            4              6       Variance       1.097581
95%            4              6       Skewness       .0522196
99%            5              6       Kurtosis       2.962328

                    ra_hosp_beddays_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -1
 5%            1              0
10%            1              0       Obs               4,868
25%            2              0       Sum of Wgt.       4,868

50%            3                      Mean           2.513558
                        Largest       Std. Dev.      1.054319
75%            3              6
90%            4              6       Variance       1.111589
95%            4              6       Skewness       .0132269
99%            5              6       Kurtosis       2.814631

. 
. 
. * How many people are not on DMARDs and have no RA appointments?
. 
. * Format variables
. *re-order ethnicity
.  gen eth5=1 if ethnicity==1
(4,051 missing values generated)

.  replace eth5=2 if ethnicity==3
(1,027 real changes made)

.  replace eth5=3 if ethnicity==4
(1,028 real changes made)

.  replace eth5=4 if ethnicity==2
(1,007 real changes made)

.  replace eth5=5 if ethnicity==5
(989 real changes made)

.  replace eth5=. if ethnicity==.
(0 real changes made)

. 
.  label define eth5                      1 "White"                            
>            ///
>                                                         2 "South Asian"      
>                    ///                                             
>                                                         3 "Black"            
>                            ///
>                                                         4 "Mixed"            
>                            ///
>                                                         5 "Other"            
>                            

.                                         
. 
. label values eth5 eth5

. safetab eth5, m
5

       eth5 |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |        949       18.98       18.98
South Asian |      1,027       20.54       39.52
      Black |      1,028       20.56       60.08
      Mixed |      1,007       20.14       80.22
      Other |        989       19.78      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. 
. * formatting gender
. gen male=(sex=="M")

. replace male = 0 if sex == "F"
(0 real changes made)

. label define male 0"Female" 1"Male"

. label values male male

. safetab male, miss
5

       male |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |      2,537       50.74       50.74
       Male |      2,463       49.26      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. 
. *create a 4 category rural urban variable 
. generate urban_rural_5=.
(5,000 missing values generated)

. la var urban_rural_5 "Rural Urban in five categories"

. replace urban_rural_5=1 if urban_rural==1
(582 real changes made)

. replace urban_rural_5=2 if urban_rural==2
(634 real changes made)

. replace urban_rural_5=3 if urban_rural==3|urban_rural==4
(1,262 real changes made)

. replace urban_rural_5=4 if urban_rural==5|urban_rural==6
(1,204 real changes made)

. replace urban_rural_5=5 if urban_rural==7|urban_rural==8
(1,318 real changes made)

. label define urban_rural_5 1 "Urban major conurbation" 2 "Urban minor conurba
> tion" 3 "Urban city and town" 4 "Rural town and fringe" 5 "Rural village and 
> dispersed"

. label values urban_rural_5 urban_rural_5

. safetab urban_rural_5, miss
14

        Rural Urban in five |
                 categories |      Freq.     Percent        Cum.
----------------------------+-----------------------------------
    Urban major conurbation |        582       11.64       11.64
    Urban minor conurbation |        634       12.68       24.32
        Urban city and town |      1,262       25.24       49.56
      Rural town and fringe |      1,204       24.08       73.64
Rural village and dispersed |      1,318       26.36      100.00
----------------------------+-----------------------------------
                      Total |      5,000      100.00

. 
. *generate a binary rural urban (with missing assigned to urban)
. generate urban_rural_bin=.
(5,000 missing values generated)

. replace urban_rural_bin=1 if urban_rural<=4|urban_rural==.
(2,478 real changes made)

. replace urban_rural_bin=0 if urban_rural>4 & urban_rural!=.
(2,522 real changes made)

. label define urban_rural_bin 0 "Rural" 1 "Urban"

. label values urban_rural_bin urban_rural_bin

. safetab urban_rural_bin urban_rural, miss
28

urban_rura |                      urban_rural
     l_bin |         1          2          3          4          5 |     Total
-----------+-------------------------------------------------------+----------
     Rural |         0          0          0          0        600 |     2,522 
     Urban |       582        634        654        608          0 |     2,478 
-----------+-------------------------------------------------------+----------
     Total |       582        634        654        608        600 |     5,000 


urban_rura |           urban_rural
     l_bin |         6          7          8 |     Total
-----------+---------------------------------+----------
     Rural |       604        677        641 |     2,522 
     Urban |         0          0          0 |     2,478 
-----------+---------------------------------+----------
     Total |       604        677        641 |     5,000 

. label var urban_rural_bin "Rural-Urban"

. 
. * Define age categories
. * Create age categories
. egen age_cat = cut(age), at(18, 40, 60, 80, 120) icodes
(1042 missing values generated)

. label define age 0 "18 - 40 years" 1 "41 - 60 years" 2 "61 - 80 years" 3 ">80
>  years"

. label values age_cat age

. safetab age_cat, miss
8

      age_cat |      Freq.     Percent        Cum.
--------------+-----------------------------------
18 - 40 years |      1,495       29.90       29.90
41 - 60 years |      1,242       24.84       54.74
61 - 80 years |        951       19.02       73.76
    >80 years |        270        5.40       79.16
            . |      1,042       20.84      100.00
--------------+-----------------------------------
        Total |      5,000      100.00

. 
. * Smoking status
. gen smoking = 0 if smoking_status=="N"
(4,536 missing values generated)

. replace smoking = 1 if smoking_status=="S"
(1,003 real changes made)

. replace smoking = 2 if smoking_status=="E"
(750 real changes made)

. replace smoking = 3 if smoking==.
(2,783 real changes made)

. 
. label define smok 1 "Current smoker" 2 "Ex-smoker" 0 "Never smoked" 3 "Unknow
> n"

. label values smoking smok

. 
. * BMI categories
. egen bmi_cat = cut(bmi), at(0, 1, 18.5, 24.9, 29.9, 39.9, 100) icodes
(1 missing value generated)

. bys bmi_cat: sum bmi

-------------------------------------------------------------------------------
-> bmi_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        978    .0006041    .0188915          0   .5907922

-------------------------------------------------------------------------------
-> bmi_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        468    14.48673    3.237252   2.318642   18.46871

-------------------------------------------------------------------------------
-> bmi_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        933    22.00676    1.836244   18.50977   24.87638

-------------------------------------------------------------------------------
-> bmi_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |      1,007    27.42038    1.403229   24.90053   29.89179

-------------------------------------------------------------------------------
-> bmi_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |      1,346    34.11094    2.713756   29.90325   39.85356

-------------------------------------------------------------------------------
-> bmi_cat = 5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        267    43.67529    3.212526   39.90829   59.52556

-------------------------------------------------------------------------------
-> bmi_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |          1   -1.145826           .  -1.145826  -1.145826


. label define bmi 0 "Missing" 1 "Underweight" 2 "Healthy range" 3 "Overweight"
>  4 "Obese" 5 "Morbidly obese"

. label values bmi_cat bmi

. 
. * Determine if still in follow-up for each year
. * Format dates
. gen died_fuA = date(died_fu, "YMD")
(2,527 missing values generated)

. gen dereg_dateA = date(dereg_date, "YMD")
(2,499 missing values generated)

. gen end_fu = date("`j'-03-31", "YMD")
(5,000 missing values generated)

. gen end_date = min(died_fuA, dereg_dateA, end_fu)
(1,275 missing values generated)

. drop end_fu

. sum end_date

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    end_date |      3,725    22449.11    300.5794      21976      23034

. di "Number where end date prior to follow-up start"
Number where end date prior to follow-up start

. count if end_date<date("2019-04-01", "YMD")
  0

. * determine range of dates for outpatient appointments to determine which sho
> uld be dropped
. gen end_2020 = end_date<date("2020-03-31", "YMD")

. gen end_2021 = end_date<date("2021-03-31", "YMD") 

. gen end_2022 = end_date<date("2022-03-31", "YMD") 

. tab end_2020

   end_2020 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,862       97.24       97.24
          1 |        138        2.76      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. tab end_2021

   end_2021 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,367       67.34       67.34
          1 |      1,633       32.66      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. tab end_2022

   end_2022 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,093       41.86       41.86
          1 |      2,907       58.14      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. 
. * Set outpatient appointment count to missing if end prior to the end of the 
> year 
. forvalues i=2019/2021 {
  2.     local j=`i'+1
  3.     di `j'
  4.     gen op_appt_`i'_orig = outpatient_appt_`i'
  5.     replace outpatient_appt_`i'=. if end_`j'
  6.     gen op_medium_`i'_orig = outpatient_medium_`i'
  7.     replace outpatient_medium_`i'=. if end_`j'
  8.     gen op_appt_all_`i'_orig = outpatient_appt_all_`i'
  9.     replace outpatient_appt_all_`i'=. if end_`j'
 10. }
2020
(138 real changes made, 138 to missing)
(2,491 missing values generated)
(78 real changes made, 78 to missing)
(138 real changes made, 138 to missing)
2021
(1,633 real changes made, 1,633 to missing)
(2,479 missing values generated)
(814 real changes made, 814 to missing)
(1,633 real changes made, 1,633 to missing)
2022
(2,907 real changes made, 2,907 to missing)
(2,510 missing values generated)
(1,427 real changes made, 1,427 to missing)
(2,907 real changes made, 2,907 to missing)

. 
. * Categorise number of outpatient appointments
. label define appt 0 "No appointments" 1 "1-2 per year" 2 "3 or more per year"
>  

. forvalues i=2019/2021 {
  2.     egen op_appt_`i'_cat = cut(outpatient_appt_`i'), at(0, 1, 3, 1000) ico
> des
  3.     * Check all categorised
.     bys op_appt_`i'_cat: sum outpatient_appt_`i'
  4.     label values op_appt_`i'_cat appt
  5.     * Same for orginal variables
.     egen op_appt_`i'_orig_cat = cut(op_appt_`i'_orig), at(0, 1, 3, 1000) icod
> es
  6.     * Check all categorised
.     bys op_appt_`i'_orig_cat: sum op_appt_`i'_orig
  7.     label values op_appt_`i'_orig_cat appt
  8.     }
(138 missing values generated)

-------------------------------------------------------------------------------
-> op_appt_2019_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2019 |        476           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_2019_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2019 |         27    1.703704    .4653216          1          2

-------------------------------------------------------------------------------
-> op_appt_2019_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2019 |      4,359    7.571691    1.966058          3         15

-------------------------------------------------------------------------------
-> op_appt_2019_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2019 |          0


-------------------------------------------------------------------------------
-> op_appt_2019_orig_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2019_orig |        488           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_2019_orig_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2019_orig |         28    1.678571    .4755949          1          2

-------------------------------------------------------------------------------
-> op_appt_2019_orig_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2019_orig |      4,484    7.575379     1.96498          3         15

(1633 missing values generated)

-------------------------------------------------------------------------------
-> op_appt_2020_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2020 |        357           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_2020_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2020 |         19    1.842105    .3746343          1          2

-------------------------------------------------------------------------------
-> op_appt_2020_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2020 |      2,991    7.512872    1.953408          3         13

-------------------------------------------------------------------------------
-> op_appt_2020_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2020 |          0


-------------------------------------------------------------------------------
-> op_appt_2020_orig_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2020_orig |        528           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_2020_orig_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2020_orig |         25         1.8    .4082483          1          2

-------------------------------------------------------------------------------
-> op_appt_2020_orig_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2020_orig |      4,447    7.535642    1.940298          3         15

(2907 missing values generated)

-------------------------------------------------------------------------------
-> op_appt_2021_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2021 |        211           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_2021_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2021 |         15    1.866667    .3518658          1          2

-------------------------------------------------------------------------------
-> op_appt_2021_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2021 |      1,867    7.674344    2.005886          3         16

-------------------------------------------------------------------------------
-> op_appt_2021_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2021 |          0


-------------------------------------------------------------------------------
-> op_appt_2021_orig_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2021_orig |        519           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_2021_orig_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2021_orig |         30    1.833333     .379049          1          2

-------------------------------------------------------------------------------
-> op_appt_2021_orig_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2021_orig |      4,451    7.598517    1.993334          3         16


. 
. * Calculate difference compared to 2019
. gen diff_op_2020 = outpatient_appt_2020 - outpatient_appt_2019
(1,633 missing values generated)

. gen diff_op_2021 = outpatient_appt_2021 - outpatient_appt_2020
(2,907 missing values generated)

. sum diff_op_2020 diff_op_2021, d

                        diff_op_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%          -10            -13
 5%           -8            -13
10%           -6            -13       Obs               3,367
25%           -2            -13       Sum of Wgt.       3,367

50%            0                      Mean          -.1300861
                        Largest       Std. Dev.      4.221758
75%            2             12
90%            5             12       Variance       17.82324
95%            8             12       Skewness       .0167834
99%           10             13       Kurtosis       3.320351

                        diff_op_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%          -10            -12
 5%           -7            -12
10%           -5            -11       Obs               2,093
25%           -2            -11       Sum of Wgt.       2,093

50%            0                      Mean           .1892021
                        Largest       Std. Dev.      4.174783
75%            3             12
90%            5             12       Variance       17.42881
95%            8             13       Skewness      -.0127987
99%           10             14       Kurtosis       3.252051

. * Categorise difference
. egen diff_op_cat_2020 = cut(diff_op_2020), at(-100, 0, 1, 100) icodes
(1633 missing values generated)

. egen diff_op_cat_2021 = cut(diff_op_2021), at(-100, 0, 1, 100) icodes
(2907 missing values generated)

. label define op_cat 0 "No appointments both years" 1 "Fewer appointments" 2 "
> Same number of appointments" 3 "More appointments"

. forvalues i=2020/2021 {
  2.     tab diff_op_cat_`i' op_appt_`i'_cat
  3.     * Update categories to include category of those with no appointments 
> in both years
.     replace diff_op_cat_`i' = diff_op_cat_`i' + 1
  4.     tab diff_op_cat_`i'
  5.     replace diff_op_cat_`i' = 0 if diff_op_cat_`i'==2 & op_appt_`i'_cat==0
  6.     tab diff_op_cat_`i'
  7.     label values diff_op_cat_`i' op_cat
  8. }

diff_op_ca |         op_appt_2020_cat
    t_2020 | No appoin  1-2 per y  3 or more |     Total
-----------+---------------------------------+----------
         0 |       331         18      1,178 |     1,527 
         1 |        26          0        395 |       421 
         2 |         0          1      1,418 |     1,419 
-----------+---------------------------------+----------
     Total |       357         19      2,991 |     3,367 
(3,367 real changes made)

diff_op_cat |
      _2020 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,527       45.35       45.35
          2 |        421       12.50       57.86
          3 |      1,419       42.14      100.00
------------+-----------------------------------
      Total |      3,367      100.00
(26 real changes made)

diff_op_cat |
      _2020 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         26        0.77        0.77
          1 |      1,527       45.35       46.12
          2 |        395       11.73       57.86
          3 |      1,419       42.14      100.00
------------+-----------------------------------
      Total |      3,367      100.00

diff_op_ca |         op_appt_2021_cat
    t_2021 | No appoin  1-2 per y  3 or more |     Total
-----------+---------------------------------+----------
         0 |       179         14        660 |       853 
         1 |        32          0        254 |       286 
         2 |         0          1        953 |       954 
-----------+---------------------------------+----------
     Total |       211         15      1,867 |     2,093 
(2,093 real changes made)

diff_op_cat |
      _2021 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        853       40.75       40.75
          2 |        286       13.66       54.42
          3 |        954       45.58      100.00
------------+-----------------------------------
      Total |      2,093      100.00
(32 real changes made)

diff_op_cat |
      _2021 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         32        1.53        1.53
          1 |        853       40.75       42.28
          2 |        254       12.14       54.42
          3 |        954       45.58      100.00
------------+-----------------------------------
      Total |      2,093      100.00

. 
. * Categorise number of outpatient appointments overall
. forvalues i=2019/2021 {
  2.     sum outpatient_appt_all_`i', d
  3.     egen op_appt_all_`i'_cat = cut(outpatient_appt_all_`i'), at(0, 1, 3, 1
> 000) icodes
  4.     * Check all categorised
.     bys op_appt_all_`i'_cat: sum outpatient_appt_all_`i'
  5.     label values op_appt_all_`i'_cat appt
  6.     * Same for orginal variables
.     egen op_appt_all_`i'_orig_cat = cut(op_appt_all_`i'_orig), at(0, 1, 3, 10
> 00) icodes
  7.     * Check all categorised
.     bys op_appt_all_`i'_orig_cat: sum op_appt_all_`i'_orig
  8.     label values op_appt_all_`i'_orig_cat appt
  9.     }

                  outpatient_appt_all_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               4,862
25%            6              0       Sum of Wgt.       4,862

50%            7                      Mean           6.716578
                        Largest       Std. Dev.      2.963102
75%            9             14
90%           10             14       Variance       8.779972
95%           11             14       Skewness      -.8701298
99%           12             16       Kurtosis       3.448829
(138 missing values generated)

-------------------------------------------------------------------------------
-> op_appt_all_2019_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2019 |        501           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_all_2019_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2019 |         25        1.76    .4358899          1          2

-------------------------------------------------------------------------------
-> op_appt_all_2019_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2019 |      4,336    7.521218    1.959924          3         16

-------------------------------------------------------------------------------
-> op_appt_all_2019_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2019 |          0


-------------------------------------------------------------------------------
-> op_appt_all_2019_orig_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2019_orig |        511           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_all_2019_orig_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2019_orig |         28        1.75    .4409586          1          2

-------------------------------------------------------------------------------
-> op_appt_all_2019_orig_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2019_orig |      4,461    7.519166    1.960004          3         16


                  outpatient_appt_all_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            3              0       Obs               3,367
25%            6              0       Sum of Wgt.       3,367

50%            7                      Mean           6.814078
                        Largest       Std. Dev.       2.90397
75%            9             13
90%           10             13       Variance        8.43304
95%           11             14       Skewness      -.8558956
99%           12             14       Kurtosis        3.58805
(1633 missing values generated)

-------------------------------------------------------------------------------
-> op_appt_all_2020_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2020 |        312           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_all_2020_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2020 |         15    1.733333    .4577377          1          2

-------------------------------------------------------------------------------
-> op_appt_all_2020_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2020 |      3,040    7.538487     1.97995          3         14

-------------------------------------------------------------------------------
-> op_appt_all_2020_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2020 |          0


-------------------------------------------------------------------------------
-> op_appt_all_2020_orig_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2020_orig |        468           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_all_2020_orig_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2020_orig |         22    1.772727     .428932          1          2

-------------------------------------------------------------------------------
-> op_appt_all_2020_orig_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2020_orig |      4,510    7.535477    1.984964          3         17


                  outpatient_appt_all_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            1              0       Obs               2,093
25%            6              0       Sum of Wgt.       2,093

50%            7                      Mean           6.754897
                        Largest       Std. Dev.      2.980759
75%            9             13
90%           10             13       Variance       8.884925
95%           11             14       Skewness      -.8295732
99%           12             15       Kurtosis       3.393393
(2907 missing values generated)

-------------------------------------------------------------------------------
-> op_appt_all_2021_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2021 |        209           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_all_2021_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2021 |         12    1.833333    .3892495          1          2

-------------------------------------------------------------------------------
-> op_appt_all_2021_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2021 |      1,872    7.540598    2.015827          3         15

-------------------------------------------------------------------------------
-> op_appt_all_2021_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2021 |          0


-------------------------------------------------------------------------------
-> op_appt_all_2021_orig_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2021_orig |        491           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_all_2021_orig_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2021_orig |         30    1.833333     .379049          1          2

-------------------------------------------------------------------------------
-> op_appt_all_2021_orig_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2021_orig |      4,479    7.540969    1.996325          3         16


. 
. bys diff_op_cat_2020: sum diff_op_2020

-------------------------------------------------------------------------------
-> diff_op_cat_2020 = No appointments both years

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
diff_op_2020 |         26           0           0          0          0

-------------------------------------------------------------------------------
-> diff_op_cat_2020 = Fewer appointments

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
diff_op_2020 |      1,527    -3.65095    2.676895        -13         -1

-------------------------------------------------------------------------------
-> diff_op_cat_2020 = Same number of appointments

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
diff_op_2020 |        395           0           0          0          0

-------------------------------------------------------------------------------
-> diff_op_cat_2020 = More appointments

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
diff_op_2020 |      1,419    3.620155    2.677317          1         13

-------------------------------------------------------------------------------
-> diff_op_cat_2020 = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
diff_op_2020 |          0


. sum ra_hosp*, d

                        ra_hosp_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -1
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            2                      Mean              2.491
                        Largest       Std. Dev.      1.045628
75%            3              6
90%            4              6       Variance       1.093338
95%            4              6       Skewness      -.0118429
99%            5              6       Kurtosis       2.843966

                        ra_hosp_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -1
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            2                      Mean             2.5064
                        Largest       Std. Dev.      1.048131
75%            3              6
90%            4              6       Variance       1.098579
95%            4              6       Skewness       .0669886
99%            5              6       Kurtosis       2.918168

                        ra_hosp_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -1
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            2                      Mean             2.4932
                        Largest       Std. Dev.      1.044496
75%            3              6
90%            4              6       Variance       1.090972
95%            4              6       Skewness       .0117205
99%            5              6       Kurtosis       2.957074

                    ra_hosp_beddays_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -1
 5%            1             -1
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            3                      Mean             2.5048
                        Largest       Std. Dev.      1.045273
75%            3              6
90%            4              6       Variance       1.092595
95%            4              6       Skewness       .0377236
99%            5              6       Kurtosis       3.011112

                    ra_hosp_beddays_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            3                      Mean              2.524
                        Largest       Std. Dev.      1.049783
75%            3              6
90%            4              6       Variance       1.102044
95%            4              6       Skewness       .0460459
99%            5              6       Kurtosis        2.95398

                    ra_hosp_beddays_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -1
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            3                      Mean              2.514
                        Largest       Std. Dev.      1.051487
75%            3              6
90%            4              6       Variance       1.105625
95%            4              6       Skewness       .0121066
99%            5              6       Kurtosis       2.809527

. 
. preserve

. * Tabulate number of rheumatology appointments per year of those with whole y
> ear available
. table1_mc, vars(op_appt_2019_cat cate \ op_appt_2020_cat cate \ op_appt_2021_
> cat cate \ diff_op_2020 conts \ diff_op_2021 conts \ diff_op_cat_2020 cate \ 
> diff_op_cat_2021 cate) clear

  +----------------------------------+
  | factor               N_1     m_1 |
  |----------------------------------|
  | op_appt_2019_cat   4,862     138 |
  |----------------------------------|
  | op_appt_2020_cat   3,367   1,633 |
  |----------------------------------|
  | op_appt_2021_cat   2,093   2,907 |
  |----------------------------------|
  | diff_op_2020       3,367   1,633 |
  |----------------------------------|
  | diff_op_2021       2,093   2,907 |
  |----------------------------------|
  | diff_op_cat_2020   3,367   1,633 |
  |----------------------------------|
  | diff_op_cat_2021   2,093   2,907 |
  +----------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------+
  |                                                  Total         |
  |----------------------------------------------------------------|
  |                                                  N=5,000       |
  |----------------------------------------------------------------|
  | op_appt_2019_cat   No appointments               476 ( 9.8%)   |
  |                    1-2 per year                  27 ( 0.6%)    |
  |                    3 or more per year            4,359 (89.7%) |
  |----------------------------------------------------------------|
  | op_appt_2020_cat   No appointments               357 (10.6%)   |
  |                    1-2 per year                  19 ( 0.6%)    |
  |                    3 or more per year            2,991 (88.8%) |
  |----------------------------------------------------------------|
  | op_appt_2021_cat   No appointments               211 (10.1%)   |
  |                    1-2 per year                  15 ( 0.7%)    |
  |                    3 or more per year            1,867 (89.2%) |
  |----------------------------------------------------------------|
  | diff_op_2020                                     0 (-2-2)      |
  |----------------------------------------------------------------|
  | diff_op_2021                                     0 (-2-3)      |
  |----------------------------------------------------------------|
  | diff_op_cat_2020   No appointments both years    26 ( 0.8%)    |
  |                    Fewer appointments            1,527 (45.4%) |
  |                    Same number of appointments   395 (11.7%)   |
  |                    More appointments             1,419 (42.1%) |
  |----------------------------------------------------------------|
  | diff_op_cat_2021   No appointments both years    32 ( 1.5%)    |
  |                    Fewer appointments            853 (40.8%)   |
  |                    Same number of appointments   254 (12.1%)   |
  |                    More appointments             954 (45.6%)   |
  +----------------------------------------------------------------+
Data are presented as median (IQR) for continuous measures, and n (%) for categ
> orical measures.
 

. export delimited using ./output/tables/op_appt_yrs.csv
file ./output/tables/op_appt_yrs.csv saved

. restore 

. preserve

. * Tabulate number of appointments per year
. table1_mc, vars(op_appt_2019_orig_cat cate \ op_appt_2020_orig_cat cate \ op_
> appt_2021_orig_cat cate) clear

  +-------------------------------------+
  | factor                    N_1   m_1 |
  |-------------------------------------|
  | op_appt_2019_orig_cat   5,000     0 |
  |-------------------------------------|
  | op_appt_2020_orig_cat   5,000     0 |
  |-------------------------------------|
  | op_appt_2021_orig_cat   5,000     0 |
  +-------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +------------------------------------------------------------+
  |                                              Total         |
  |------------------------------------------------------------|
  |                                              N=5,000       |
  |------------------------------------------------------------|
  | op_appt_2019_orig_cat   No appointments      488 ( 9.8%)   |
  |                         1-2 per year         28 ( 0.6%)    |
  |                         3 or more per year   4,484 (89.7%) |
  |------------------------------------------------------------|
  | op_appt_2020_orig_cat   No appointments      528 (10.6%)   |
  |                         1-2 per year         25 ( 0.5%)    |
  |                         3 or more per year   4,447 (88.9%) |
  |------------------------------------------------------------|
  | op_appt_2021_orig_cat   No appointments      519 (10.4%)   |
  |                         1-2 per year         30 ( 0.6%)    |
  |                         3 or more per year   4,451 (89.0%) |
  +------------------------------------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/op_appt_orig_yrs.csv
file ./output/tables/op_appt_orig_yrs.csv saved

. restore 

. preserve

. * Tabulate number of all outpatient appointments per year of those with whole
>  year available
. table1_mc, vars(op_appt_all_2019_cat cate \ op_appt_all_2020_cat cate \ op_ap
> pt_all_2021_cat cate ) clear

  +--------------------------------------+
  | factor                   N_1     m_1 |
  |--------------------------------------|
  | op_appt_all_2019_cat   4,862     138 |
  |--------------------------------------|
  | op_appt_all_2020_cat   3,367   1,633 |
  |--------------------------------------|
  | op_appt_all_2021_cat   2,093   2,907 |
  +--------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +-----------------------------------------------------------+
  |                                             Total         |
  |-----------------------------------------------------------|
  |                                             N=5,000       |
  |-----------------------------------------------------------|
  | op_appt_all_2019_cat   No appointments      501 (10.3%)   |
  |                        1-2 per year         25 ( 0.5%)    |
  |                        3 or more per year   4,336 (89.2%) |
  |-----------------------------------------------------------|
  | op_appt_all_2020_cat   No appointments      312 ( 9.3%)   |
  |                        1-2 per year         15 ( 0.4%)    |
  |                        3 or more per year   3,040 (90.3%) |
  |-----------------------------------------------------------|
  | op_appt_all_2021_cat   No appointments      209 (10.0%)   |
  |                        1-2 per year         12 ( 0.6%)    |
  |                        3 or more per year   1,872 (89.4%) |
  +-----------------------------------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/op_appt_all_yrs.csv
file ./output/tables/op_appt_all_yrs.csv saved

. restore 

. * Tabulate overall characteristics 
. preserve

. table1_mc, vars(age_cat cate \ male cate \ urban_rural_5 cate \ region cate \
>  imd cate \  smoking cate \ time_ra contn \ bmi_cat cate) clear

  +------------------------------------------------+
  | factor                             N_1     m_1 |
  |------------------------------------------------|
  | age_cat                          3,958   1,042 |
  |------------------------------------------------|
  | male                             5,000       0 |
  |------------------------------------------------|
  | Rural Urban in five categories   5,000       0 |
  |------------------------------------------------|
  | region                           5,000       0 |
  |------------------------------------------------|
  | imd                              5,000       0 |
  |------------------------------------------------|
  | smoking                          5,000       0 |
  |------------------------------------------------|
  | time_ra                          2,215   2,785 |
  |------------------------------------------------|
  | bmi_cat                          4,999       1 |
  +------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> -------+
  |                                                                Total       
>        |
  |----------------------------------------------------------------------------
> -------|
  |                                                                N=5,000     
>        |
  |----------------------------------------------------------------------------
> -------|
  | age_cat                          18 - 40 years                 1,495 (37.8%
> )      |
  |                                  41 - 60 years                 1,242 (31.4%
> )      |
  |                                  61 - 80 years                 951 (24.0%) 
>        |
  |                                  >80 years                     270 ( 6.8%) 
>        |
  |----------------------------------------------------------------------------
> -------|
  | male                             Female                        2,537 (50.7%
> )      |
  |                                  Male                          2,463 (49.3%
> )      |
  |----------------------------------------------------------------------------
> -------|
  | Rural Urban in five categories   Urban major conurbation       582 (11.6%) 
>        |
  |                                  Urban minor conurbation       634 (12.7%) 
>        |
  |                                  Urban city and town           1,262 (25.2%
> )      |
  |                                  Rural town and fringe         1,204 (24.1%
> )      |
  |                                  Rural village and dispersed   1,318 (26.4%
> )      |
  |----------------------------------------------------------------------------
> -------|
  | region                           East Midlands                 497 ( 9.9%) 
>        |
  |                                  East of England               502 (10.0%) 
>        |
  |                                  London                        971 (19.4%) 
>        |
  |                                  North East                    529 (10.6%) 
>        |
  |                                  North West                    489 ( 9.8%) 
>        |
  |                                  South East                    1,003 (20.1%
> )      |
  |                                  West Midlands                 469 ( 9.4%) 
>        |
  |                                  Yorkshire and the Humber      540 (10.8%) 
>        |
  |----------------------------------------------------------------------------
> -------|
  | imd                              0                             218 ( 4.4%) 
>        |
  |                                  1                             1,011 (20.2%
> )      |
  |                                  2                             986 (19.7%) 
>        |
  |                                  3                             964 (19.3%) 
>        |
  |                                  4                             914 (18.3%) 
>        |
  |                                  5                             907 (18.1%) 
>        |
  |----------------------------------------------------------------------------
> -------|
  | smoking                          Never smoked                  464 ( 9.3%) 
>        |
  |                                  Current smoker                1,003 (20.1%
> )      |
  |                                  Ex-smoker                     750 (15.0%) 
>        |
  |                                  Unknown                       2,783 (55.7%
> )      |
  |----------------------------------------------------------------------------
> -------|
  | time_ra                                                        55.85648 (32
> .0693) |
  |----------------------------------------------------------------------------
> -------|
  | bmi_cat                          Missing                       978 (19.6%) 
>        |
  |                                  Underweight                   468 ( 9.4%) 
>        |
  |                                  Healthy range                 933 (18.7%) 
>        |
  |                                  Overweight                    1,007 (20.1%
> )      |
  |                                  Obese                         1,346 (26.9%
> )      |
  |                                  Morbidly obese                267 ( 5.3%) 
>        |
  +----------------------------------------------------------------------------
> -------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 

. export delimited using ./output/tables/op_chars.csv
file ./output/tables/op_chars.csv saved

. restore

. * Tabulate characteristics by category of outpatient appointments for each ye
> ar
. tempfile tempfile

. forvalues i=2019/2021 {
  2.     preserve
  3.     keep if op_appt_`i'_cat==0
  4.     table1_mc, vars(age_cat cate \ male cate \ urban_rural_5 cate \ region
>  cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat cate) clear
  5.     save `tempfile', replace
  6.     restore
  7.     forvalues j=1/2 {
  8.         preserve
  9.         keep if op_appt_`i'_cat==`j'
 10.         table1_mc, vars(age_cat cate \ male cate \ urban_rural_5 cate \ re
> gion cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat cate) clear
 11.         append using `tempfile'
 12.         save `tempfile', replace
 13.         if `j'==2 {
 14.             export delimited using ./output/tables/characteristics_strata`
> i'.csv
 15.         }
 16.         restore
 17.     }
 18.    
.     * Tabulate characteristics by whether hospitalised with RA for each year
.     preserve
 19.     keep if ra_hosp_`i'==0
 20.     table1_mc, vars(age_cat cate \ male cate \ urban_rural_5 cate \ prescr
> ibed_biologics cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat cate)
>  clear
 21.     save `tempfile', replace
 22.     restore
 23.     preserve
 24.     keep if ra_hosp_`i'==1
 25.     table1_mc, vars(age_cat cate \ male cate \ urban_rural_5 cate \ prescr
> ibed_biologics cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat cate)
>  clear
 26.     append using `tempfile'
 27.     save `tempfile', replace
 28.     export delimited using ./output/tables/characteristics_ra_hosp_`i'.csv
 29.     restore
 30.     }
(4,524 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                          377    99 |
  |--------------------------------------------|
  | male                             476     0 |
  |--------------------------------------------|
  | Rural Urban in five categories   476     0 |
  |--------------------------------------------|
  | region                           476     0 |
  |--------------------------------------------|
  | imd                              476     0 |
  |--------------------------------------------|
  | smoking                          476     0 |
  |--------------------------------------------|
  | time_ra                          235   241 |
  |--------------------------------------------|
  | bmi_cat                          476     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=476       
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 139 (36.9%) 
>         |
  |                                  41 - 60 years                 117 (31.0%) 
>         |
  |                                  61 - 80 years                 85 (22.5%)  
>         |
  |                                  >80 years                     36 ( 9.5%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        258 (54.2%) 
>         |
  |                                  Male                          218 (45.8%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       48 (10.1%)  
>         |
  |                                  Urban minor conurbation       65 (13.7%)  
>         |
  |                                  Urban city and town           124 (26.1%) 
>         |
  |                                  Rural town and fringe         120 (25.2%) 
>         |
  |                                  Rural village and dispersed   119 (25.0%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | region                           East Midlands                 46 ( 9.7%)  
>         |
  |                                  East of England               47 ( 9.9%)  
>         |
  |                                  London                        80 (16.8%)  
>         |
  |                                  North East                    50 (10.5%)  
>         |
  |                                  North West                    34 ( 7.1%)  
>         |
  |                                  South East                    98 (20.6%)  
>         |
  |                                  West Midlands                 53 (11.1%)  
>         |
  |                                  Yorkshire and the Humber      68 (14.3%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             16 ( 3.4%)  
>         |
  |                                  1                             87 (18.3%)  
>         |
  |                                  2                             97 (20.4%)  
>         |
  |                                  3                             102 (21.4%) 
>         |
  |                                  4                             84 (17.6%)  
>         |
  |                                  5                             90 (18.9%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  42 ( 8.8%)  
>         |
  |                                  Current smoker                96 (20.2%)  
>         |
  |                                  Ex-smoker                     62 (13.0%)  
>         |
  |                                  Unknown                       276 (58.0%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        56.11014 (30
> .26809) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       101 (21.2%) 
>         |
  |                                  Underweight                   43 ( 9.0%)  
>         |
  |                                  Healthy range                 86 (18.1%)  
>         |
  |                                  Overweight                    91 (19.1%)  
>         |
  |                                  Obese                         124 (26.1%) 
>         |
  |                                  Morbidly obese                31 ( 6.5%)  
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
(note: file /tmp/St00015.000005 not found)
file /tmp/St00015.000005 saved
(4,973 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                           19     8 |
  |--------------------------------------------|
  | male                              27     0 |
  |--------------------------------------------|
  | Rural Urban in five categories    27     0 |
  |--------------------------------------------|
  | region                            27     0 |
  |--------------------------------------------|
  | imd                               27     0 |
  |--------------------------------------------|
  | smoking                           27     0 |
  |--------------------------------------------|
  | time_ra                           15    12 |
  |--------------------------------------------|
  | bmi_cat                           27     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=27        
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 10 (53%)    
>         |
  |                                  41 - 60 years                 3 (16%)     
>         |
  |                                  61 - 80 years                 4 (21%)     
>         |
  |                                  >80 years                     2 (11%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        19 (70%)    
>         |
  |                                  Male                          8 (30%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       1 ( 4%)     
>         |
  |                                  Urban minor conurbation       1 ( 4%)     
>         |
  |                                  Urban city and town           5 (19%)     
>         |
  |                                  Rural town and fringe         11 (41%)    
>         |
  |                                  Rural village and dispersed   9 (33%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | region                           East Midlands                 1 ( 4%)     
>         |
  |                                  East of England               2 ( 7%)     
>         |
  |                                  London                        6 (22%)     
>         |
  |                                  North East                    4 (15%)     
>         |
  |                                  North West                    4 (15%)     
>         |
  |                                  South East                    4 (15%)     
>         |
  |                                  West Midlands                 1 ( 4%)     
>         |
  |                                  Yorkshire and the Humber      5 (19%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              1                             5 (19%)     
>         |
  |                                  2                             5 (19%)     
>         |
  |                                  3                             7 (26%)     
>         |
  |                                  4                             6 (22%)     
>         |
  |                                  5                             4 (15%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Current smoker                3 (11%)     
>         |
  |                                  Ex-smoker                     6 (22%)     
>         |
  |                                  Unknown                       18 (67%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        44.90185 (35
> .42404) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       8 (30%)     
>         |
  |                                  Underweight                   1 ( 4%)     
>         |
  |                                  Healthy range                 3 (11%)     
>         |
  |                                  Overweight                    3 (11%)     
>         |
  |                                  Obese                         8 (30%)     
>         |
  |                                  Morbidly obese                4 (15%)     
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.000005 saved
(641 observations deleted)

  +------------------------------------------------+
  | factor                             N_1     m_1 |
  |------------------------------------------------|
  | age_cat                          3,457     902 |
  |------------------------------------------------|
  | male                             4,359       0 |
  |------------------------------------------------|
  | Rural Urban in five categories   4,359       0 |
  |------------------------------------------------|
  | region                           4,359       0 |
  |------------------------------------------------|
  | imd                              4,359       0 |
  |------------------------------------------------|
  | smoking                          4,359       0 |
  |------------------------------------------------|
  | time_ra                          1,899   2,460 |
  |------------------------------------------------|
  | bmi_cat                          4,358       1 |
  +------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=4,359     
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 1,301 (37.6%
> )       |
  |                                  41 - 60 years                 1,090 (31.5%
> )       |
  |                                  61 - 80 years                 839 (24.3%) 
>         |
  |                                  >80 years                     227 ( 6.6%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        2,195 (50.4%
> )       |
  |                                  Male                          2,164 (49.6%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       522 (12.0%) 
>         |
  |                                  Urban minor conurbation       556 (12.8%) 
>         |
  |                                  Urban city and town           1,096 (25.1%
> )       |
  |                                  Rural town and fringe         1,036 (23.8%
> )       |
  |                                  Rural village and dispersed   1,149 (26.4%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | region                           East Midlands                 434 (10.0%) 
>         |
  |                                  East of England               436 (10.0%) 
>         |
  |                                  London                        857 (19.7%) 
>         |
  |                                  North East                    458 (10.5%) 
>         |
  |                                  North West                    442 (10.1%) 
>         |
  |                                  South East                    878 (20.1%) 
>         |
  |                                  West Midlands                 404 ( 9.3%) 
>         |
  |                                  Yorkshire and the Humber      450 (10.3%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             195 ( 4.5%) 
>         |
  |                                  1                             897 (20.6%) 
>         |
  |                                  2                             862 (19.8%) 
>         |
  |                                  3                             825 (18.9%) 
>         |
  |                                  4                             797 (18.3%) 
>         |
  |                                  5                             783 (18.0%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  406 ( 9.3%) 
>         |
  |                                  Current smoker                870 (20.0%) 
>         |
  |                                  Ex-smoker                     662 (15.2%) 
>         |
  |                                  Unknown                       2,421 (55.5%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        56.01497 (32
> .11183) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       847 (19.4%) 
>         |
  |                                  Underweight                   409 ( 9.4%) 
>         |
  |                                  Healthy range                 821 (18.8%) 
>         |
  |                                  Overweight                    887 (20.4%) 
>         |
  |                                  Obese                         1,170 (26.8%
> )       |
  |                                  Morbidly obese                224 ( 5.1%) 
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.000005 saved
file ./output/tables/characteristics_strata2019.csv saved
(4,875 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                          104    21 |
  |--------------------------------------------|
  | male                             125     0 |
  |--------------------------------------------|
  | Rural Urban in five categories   125     0 |
  |--------------------------------------------|
  | prescribed_biologics             125     0 |
  |--------------------------------------------|
  | imd                              125     0 |
  |--------------------------------------------|
  | smoking                          125     0 |
  |--------------------------------------------|
  | time_ra                           55    70 |
  |--------------------------------------------|
  | bmi_cat                          125     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=125       
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 39 (37.5%)  
>         |
  |                                  41 - 60 years                 30 (28.8%)  
>         |
  |                                  61 - 80 years                 28 (26.9%)  
>         |
  |                                  >80 years                     7 ( 6.7%)   
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        61 (48.8%)  
>         |
  |                                  Male                          64 (51.2%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       16 (12.8%)  
>         |
  |                                  Urban minor conurbation       10 ( 8.0%)  
>         |
  |                                  Urban city and town           47 (37.6%)  
>         |
  |                                  Rural town and fringe         32 (25.6%)  
>         |
  |                                  Rural village and dispersed   20 (16.0%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             63 (50.4%)  
>         |
  |                                  1                             62 (49.6%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             5 ( 4.0%)   
>         |
  |                                  1                             25 (20.0%)  
>         |
  |                                  2                             24 (19.2%)  
>         |
  |                                  3                             27 (21.6%)  
>         |
  |                                  4                             19 (15.2%)  
>         |
  |                                  5                             25 (20.0%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  12 ( 9.6%)  
>         |
  |                                  Current smoker                14 (11.2%)  
>         |
  |                                  Ex-smoker                     17 (13.6%)  
>         |
  |                                  Unknown                       82 (65.6%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        53.10928 (32
> .61303) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       16 (12.8%)  
>         |
  |                                  Underweight                   16 (12.8%)  
>         |
  |                                  Healthy range                 21 (16.8%)  
>         |
  |                                  Overweight                    23 (18.4%)  
>         |
  |                                  Obese                         43 (34.4%)  
>         |
  |                                  Morbidly obese                6 ( 4.8%)   
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.000005 saved
(4,300 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                          551   149 |
  |--------------------------------------------|
  | male                             700     0 |
  |--------------------------------------------|
  | Rural Urban in five categories   700     0 |
  |--------------------------------------------|
  | prescribed_biologics             700     0 |
  |--------------------------------------------|
  | imd                              700     0 |
  |--------------------------------------------|
  | smoking                          700     0 |
  |--------------------------------------------|
  | time_ra                          308   392 |
  |--------------------------------------------|
  | bmi_cat                          700     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=700       
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 209 (37.9%) 
>         |
  |                                  41 - 60 years                 172 (31.2%) 
>         |
  |                                  61 - 80 years                 135 (24.5%) 
>         |
  |                                  >80 years                     35 ( 6.4%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        354 (50.6%) 
>         |
  |                                  Male                          346 (49.4%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       77 (11.0%)  
>         |
  |                                  Urban minor conurbation       103 (14.7%) 
>         |
  |                                  Urban city and town           169 (24.1%) 
>         |
  |                                  Rural town and fringe         176 (25.1%) 
>         |
  |                                  Rural village and dispersed   175 (25.0%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             350 (50.0%) 
>         |
  |                                  1                             350 (50.0%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             34 ( 4.9%)  
>         |
  |                                  1                             152 (21.7%) 
>         |
  |                                  2                             132 (18.9%) 
>         |
  |                                  3                             123 (17.6%) 
>         |
  |                                  4                             133 (19.0%) 
>         |
  |                                  5                             126 (18.0%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  61 ( 8.7%)  
>         |
  |                                  Current smoker                148 (21.1%) 
>         |
  |                                  Ex-smoker                     114 (16.3%) 
>         |
  |                                  Unknown                       377 (53.9%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        56.30833 (31
> .81516) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       137 (19.6%) 
>         |
  |                                  Underweight                   59 ( 8.4%)  
>         |
  |                                  Healthy range                 126 (18.0%) 
>         |
  |                                  Overweight                    159 (22.7%) 
>         |
  |                                  Obese                         185 (26.4%) 
>         |
  |                                  Morbidly obese                34 ( 4.9%)  
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.000005 saved
file ./output/tables/characteristics_ra_hosp_2019.csv saved
(4,643 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                          289    68 |
  |--------------------------------------------|
  | male                             357     0 |
  |--------------------------------------------|
  | Rural Urban in five categories   357     0 |
  |--------------------------------------------|
  | region                           357     0 |
  |--------------------------------------------|
  | imd                              357     0 |
  |--------------------------------------------|
  | smoking                          357     0 |
  |--------------------------------------------|
  | time_ra                          160   197 |
  |--------------------------------------------|
  | bmi_cat                          357     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> -------+
  |                                                                Total       
>        |
  |----------------------------------------------------------------------------
> -------|
  |                                                                N=357       
>        |
  |----------------------------------------------------------------------------
> -------|
  | age_cat                          18 - 40 years                 110 (38.1%) 
>        |
  |                                  41 - 60 years                 97 (33.6%)  
>        |
  |                                  61 - 80 years                 70 (24.2%)  
>        |
  |                                  >80 years                     12 ( 4.2%)  
>        |
  |----------------------------------------------------------------------------
> -------|
  | male                             Female                        192 (53.8%) 
>        |
  |                                  Male                          165 (46.2%) 
>        |
  |----------------------------------------------------------------------------
> -------|
  | Rural Urban in five categories   Urban major conurbation       36 (10.1%)  
>        |
  |                                  Urban minor conurbation       41 (11.5%)  
>        |
  |                                  Urban city and town           92 (25.8%)  
>        |
  |                                  Rural town and fringe         76 (21.3%)  
>        |
  |                                  Rural village and dispersed   112 (31.4%) 
>        |
  |----------------------------------------------------------------------------
> -------|
  | region                           East Midlands                 32 ( 9.0%)  
>        |
  |                                  East of England               31 ( 8.7%)  
>        |
  |                                  London                        62 (17.4%)  
>        |
  |                                  North East                    39 (10.9%)  
>        |
  |                                  North West                    27 ( 7.6%)  
>        |
  |                                  South East                    83 (23.2%)  
>        |
  |                                  West Midlands                 31 ( 8.7%)  
>        |
  |                                  Yorkshire and the Humber      52 (14.6%)  
>        |
  |----------------------------------------------------------------------------
> -------|
  | imd                              0                             14 ( 3.9%)  
>        |
  |                                  1                             69 (19.3%)  
>        |
  |                                  2                             69 (19.3%)  
>        |
  |                                  3                             80 (22.4%)  
>        |
  |                                  4                             62 (17.4%)  
>        |
  |                                  5                             63 (17.6%)  
>        |
  |----------------------------------------------------------------------------
> -------|
  | smoking                          Never smoked                  33 ( 9.2%)  
>        |
  |                                  Current smoker                73 (20.4%)  
>        |
  |                                  Ex-smoker                     54 (15.1%)  
>        |
  |                                  Unknown                       197 (55.2%) 
>        |
  |----------------------------------------------------------------------------
> -------|
  | time_ra                                                        56.7191 (34.
> 38653) |
  |----------------------------------------------------------------------------
> -------|
  | bmi_cat                          Missing                       72 (20.2%)  
>        |
  |                                  Underweight                   25 ( 7.0%)  
>        |
  |                                  Healthy range                 73 (20.4%)  
>        |
  |                                  Overweight                    72 (20.2%)  
>        |
  |                                  Obese                         95 (26.6%)  
>        |
  |                                  Morbidly obese                20 ( 5.6%)  
>        |
  +----------------------------------------------------------------------------
> -------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.000005 saved
(4,981 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                           18     1 |
  |--------------------------------------------|
  | male                              19     0 |
  |--------------------------------------------|
  | Rural Urban in five categories    19     0 |
  |--------------------------------------------|
  | region                            19     0 |
  |--------------------------------------------|
  | imd                               19     0 |
  |--------------------------------------------|
  | smoking                           19     0 |
  |--------------------------------------------|
  | time_ra                            9    10 |
  |--------------------------------------------|
  | bmi_cat                           19     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> -------+
  |                                                                Total       
>        |
  |----------------------------------------------------------------------------
> -------|
  |                                                                N=19        
>        |
  |----------------------------------------------------------------------------
> -------|
  | age_cat                          18 - 40 years                 4 (22%)     
>        |
  |                                  41 - 60 years                 8 (44%)     
>        |
  |                                  61 - 80 years                 5 (28%)     
>        |
  |                                  >80 years                     1 ( 6%)     
>        |
  |----------------------------------------------------------------------------
> -------|
  | male                             Female                        8 (42%)     
>        |
  |                                  Male                          11 (58%)    
>        |
  |----------------------------------------------------------------------------
> -------|
  | Rural Urban in five categories   Urban major conurbation       3 (16%)     
>        |
  |                                  Urban minor conurbation       3 (16%)     
>        |
  |                                  Urban city and town           6 (32%)     
>        |
  |                                  Rural town and fringe         2 (11%)     
>        |
  |                                  Rural village and dispersed   5 (26%)     
>        |
  |----------------------------------------------------------------------------
> -------|
  | region                           East Midlands                 4 (21%)     
>        |
  |                                  East of England               5 (26%)     
>        |
  |                                  London                        2 (11%)     
>        |
  |                                  North East                    4 (21%)     
>        |
  |                                  South East                    2 (11%)     
>        |
  |                                  West Midlands                 1 ( 5%)     
>        |
  |                                  Yorkshire and the Humber      1 ( 5%)     
>        |
  |----------------------------------------------------------------------------
> -------|
  | imd                              0                             2 (11%)     
>        |
  |                                  1                             1 ( 5%)     
>        |
  |                                  2                             5 (26%)     
>        |
  |                                  3                             2 (11%)     
>        |
  |                                  4                             3 (16%)     
>        |
  |                                  5                             6 (32%)     
>        |
  |----------------------------------------------------------------------------
> -------|
  | smoking                          Current smoker                3 (16%)     
>        |
  |                                  Ex-smoker                     3 (16%)     
>        |
  |                                  Unknown                       13 (68%)    
>        |
  |----------------------------------------------------------------------------
> -------|
  | time_ra                                                        51.16404 (33
> .2038) |
  |----------------------------------------------------------------------------
> -------|
  | bmi_cat                          Missing                       6 (32%)     
>        |
  |                                  Underweight                   2 (11%)     
>        |
  |                                  Healthy range                 2 (11%)     
>        |
  |                                  Overweight                    5 (26%)     
>        |
  |                                  Obese                         4 (21%)     
>        |
  +----------------------------------------------------------------------------
> -------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.000005 saved
(2,009 observations deleted)

  +------------------------------------------------+
  | factor                             N_1     m_1 |
  |------------------------------------------------|
  | age_cat                          2,345     646 |
  |------------------------------------------------|
  | male                             2,991       0 |
  |------------------------------------------------|
  | Rural Urban in five categories   2,991       0 |
  |------------------------------------------------|
  | region                           2,991       0 |
  |------------------------------------------------|
  | imd                              2,991       0 |
  |------------------------------------------------|
  | smoking                          2,991       0 |
  |------------------------------------------------|
  | time_ra                          1,306   1,685 |
  |------------------------------------------------|
  | bmi_cat                          2,990       1 |
  +------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=2,991     
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 887 (37.8%) 
>         |
  |                                  41 - 60 years                 724 (30.9%) 
>         |
  |                                  61 - 80 years                 568 (24.2%) 
>         |
  |                                  >80 years                     166 ( 7.1%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        1,489 (49.8%
> )       |
  |                                  Male                          1,502 (50.2%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       343 (11.5%) 
>         |
  |                                  Urban minor conurbation       387 (12.9%) 
>         |
  |                                  Urban city and town           744 (24.9%) 
>         |
  |                                  Rural town and fringe         739 (24.7%) 
>         |
  |                                  Rural village and dispersed   778 (26.0%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | region                           East Midlands                 301 (10.1%) 
>         |
  |                                  East of England               293 ( 9.8%) 
>         |
  |                                  London                        584 (19.5%) 
>         |
  |                                  North East                    316 (10.6%) 
>         |
  |                                  North West                    303 (10.1%) 
>         |
  |                                  South East                    598 (20.0%) 
>         |
  |                                  West Midlands                 280 ( 9.4%) 
>         |
  |                                  Yorkshire and the Humber      316 (10.6%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             139 ( 4.6%) 
>         |
  |                                  1                             603 (20.2%) 
>         |
  |                                  2                             583 (19.5%) 
>         |
  |                                  3                             565 (18.9%) 
>         |
  |                                  4                             566 (18.9%) 
>         |
  |                                  5                             535 (17.9%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  269 ( 9.0%) 
>         |
  |                                  Current smoker                596 (19.9%) 
>         |
  |                                  Ex-smoker                     455 (15.2%) 
>         |
  |                                  Unknown                       1,671 (55.9%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        55.92079 (31
> .71688) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       581 (19.4%) 
>         |
  |                                  Underweight                   295 ( 9.9%) 
>         |
  |                                  Healthy range                 559 (18.7%) 
>         |
  |                                  Overweight                    601 (20.1%) 
>         |
  |                                  Obese                         800 (26.8%) 
>         |
  |                                  Morbidly obese                154 ( 5.2%) 
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.000005 saved
file ./output/tables/characteristics_strata2020.csv saved
(4,888 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                           96    16 |
  |--------------------------------------------|
  | male                             112     0 |
  |--------------------------------------------|
  | Rural Urban in five categories   112     0 |
  |--------------------------------------------|
  | prescribed_biologics             112     0 |
  |--------------------------------------------|
  | imd                              112     0 |
  |--------------------------------------------|
  | smoking                          112     0 |
  |--------------------------------------------|
  | time_ra                           47    65 |
  |--------------------------------------------|
  | bmi_cat                          112     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=112       
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 40 (42%)    
>         |
  |                                  41 - 60 years                 32 (33%)    
>         |
  |                                  61 - 80 years                 18 (19%)    
>         |
  |                                  >80 years                     6 ( 6%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        54 (48.2%)  
>         |
  |                                  Male                          58 (51.8%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       17 (15.2%)  
>         |
  |                                  Urban minor conurbation       9 ( 8.0%)   
>         |
  |                                  Urban city and town           29 (25.9%)  
>         |
  |                                  Rural town and fringe         31 (27.7%)  
>         |
  |                                  Rural village and dispersed   26 (23.2%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             45 (40.2%)  
>         |
  |                                  1                             67 (59.8%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             4 ( 3.6%)   
>         |
  |                                  1                             22 (19.6%)  
>         |
  |                                  2                             16 (14.3%)  
>         |
  |                                  3                             23 (20.5%)  
>         |
  |                                  4                             31 (27.7%)  
>         |
  |                                  5                             16 (14.3%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  11 ( 9.8%)  
>         |
  |                                  Current smoker                18 (16.1%)  
>         |
  |                                  Ex-smoker                     12 (10.7%)  
>         |
  |                                  Unknown                       71 (63.4%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        47.79548 (28
> .55897) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       15 (13.4%)  
>         |
  |                                  Underweight                   10 ( 8.9%)  
>         |
  |                                  Healthy range                 15 (13.4%)  
>         |
  |                                  Overweight                    33 (29.5%)  
>         |
  |                                  Obese                         33 (29.5%)  
>         |
  |                                  Morbidly obese                6 ( 5.4%)   
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.000005 saved
(4,324 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                          528   148 |
  |--------------------------------------------|
  | male                             676     0 |
  |--------------------------------------------|
  | Rural Urban in five categories   676     0 |
  |--------------------------------------------|
  | prescribed_biologics             676     0 |
  |--------------------------------------------|
  | imd                              676     0 |
  |--------------------------------------------|
  | smoking                          676     0 |
  |--------------------------------------------|
  | time_ra                          303   373 |
  |--------------------------------------------|
  | bmi_cat                          676     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=676       
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 210 (39.8%) 
>         |
  |                                  41 - 60 years                 153 (29.0%) 
>         |
  |                                  61 - 80 years                 126 (23.9%) 
>         |
  |                                  >80 years                     39 ( 7.4%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        340 (50.3%) 
>         |
  |                                  Male                          336 (49.7%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       78 (11.5%)  
>         |
  |                                  Urban minor conurbation       89 (13.2%)  
>         |
  |                                  Urban city and town           156 (23.1%) 
>         |
  |                                  Rural town and fringe         165 (24.4%) 
>         |
  |                                  Rural village and dispersed   188 (27.8%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             361 (53.4%) 
>         |
  |                                  1                             315 (46.6%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             26 ( 3.8%)  
>         |
  |                                  1                             139 (20.6%) 
>         |
  |                                  2                             133 (19.7%) 
>         |
  |                                  3                             119 (17.6%) 
>         |
  |                                  4                             127 (18.8%) 
>         |
  |                                  5                             132 (19.5%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  61 ( 9.0%)  
>         |
  |                                  Current smoker                132 (19.5%) 
>         |
  |                                  Ex-smoker                     102 (15.1%) 
>         |
  |                                  Unknown                       381 (56.4%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        56.81575 (31
> .49938) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       131 (19.4%) 
>         |
  |                                  Underweight                   58 ( 8.6%)  
>         |
  |                                  Healthy range                 101 (14.9%) 
>         |
  |                                  Overweight                    148 (21.9%) 
>         |
  |                                  Obese                         199 (29.4%) 
>         |
  |                                  Morbidly obese                39 ( 5.8%)  
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.000005 saved
file ./output/tables/characteristics_ra_hosp_2020.csv saved
(4,789 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                          172    39 |
  |--------------------------------------------|
  | male                             211     0 |
  |--------------------------------------------|
  | Rural Urban in five categories   211     0 |
  |--------------------------------------------|
  | region                           211     0 |
  |--------------------------------------------|
  | imd                              211     0 |
  |--------------------------------------------|
  | smoking                          211     0 |
  |--------------------------------------------|
  | time_ra                           94   117 |
  |--------------------------------------------|
  | bmi_cat                          211     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=211       
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 73 (42.4%)  
>         |
  |                                  41 - 60 years                 54 (31.4%)  
>         |
  |                                  61 - 80 years                 35 (20.3%)  
>         |
  |                                  >80 years                     10 ( 5.8%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        105 (49.8%) 
>         |
  |                                  Male                          106 (50.2%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       30 (14.2%)  
>         |
  |                                  Urban minor conurbation       26 (12.3%)  
>         |
  |                                  Urban city and town           54 (25.6%)  
>         |
  |                                  Rural town and fringe         43 (20.4%)  
>         |
  |                                  Rural village and dispersed   58 (27.5%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | region                           East Midlands                 19 ( 9.0%)  
>         |
  |                                  East of England               24 (11.4%)  
>         |
  |                                  London                        35 (16.6%)  
>         |
  |                                  North East                    28 (13.3%)  
>         |
  |                                  North West                    22 (10.4%)  
>         |
  |                                  South East                    39 (18.5%)  
>         |
  |                                  West Midlands                 23 (10.9%)  
>         |
  |                                  Yorkshire and the Humber      21 (10.0%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             9 ( 4.3%)   
>         |
  |                                  1                             39 (18.5%)  
>         |
  |                                  2                             34 (16.1%)  
>         |
  |                                  3                             51 (24.2%)  
>         |
  |                                  4                             47 (22.3%)  
>         |
  |                                  5                             31 (14.7%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  16 ( 7.6%)  
>         |
  |                                  Current smoker                46 (21.8%)  
>         |
  |                                  Ex-smoker                     34 (16.1%)  
>         |
  |                                  Unknown                       115 (54.5%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        51.44658 (31
> .66433) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       40 (19.0%)  
>         |
  |                                  Underweight                   26 (12.3%)  
>         |
  |                                  Healthy range                 35 (16.6%)  
>         |
  |                                  Overweight                    41 (19.4%)  
>         |
  |                                  Obese                         59 (28.0%)  
>         |
  |                                  Morbidly obese                10 ( 4.7%)  
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.000005 saved
(4,985 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                           11     4 |
  |--------------------------------------------|
  | male                              15     0 |
  |--------------------------------------------|
  | Rural Urban in five categories    15     0 |
  |--------------------------------------------|
  | region                            15     0 |
  |--------------------------------------------|
  | imd                               15     0 |
  |--------------------------------------------|
  | smoking                           15     0 |
  |--------------------------------------------|
  | time_ra                            9     6 |
  |--------------------------------------------|
  | bmi_cat                           15     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=15        
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 4 (36%)     
>         |
  |                                  41 - 60 years                 3 (27%)     
>         |
  |                                  61 - 80 years                 3 (27%)     
>         |
  |                                  >80 years                     1 ( 9%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        7 (47%)     
>         |
  |                                  Male                          8 (53%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban city and town           5 (33%)     
>         |
  |                                  Rural town and fringe         2 (13%)     
>         |
  |                                  Rural village and dispersed   8 (53%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | region                           East Midlands                 1 ( 7%)     
>         |
  |                                  East of England               1 ( 7%)     
>         |
  |                                  London                        3 (20%)     
>         |
  |                                  North West                    4 (27%)     
>         |
  |                                  South East                    3 (20%)     
>         |
  |                                  West Midlands                 2 (13%)     
>         |
  |                                  Yorkshire and the Humber      1 ( 7%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              1                             2 (13%)     
>         |
  |                                  2                             2 (13%)     
>         |
  |                                  3                             6 (40%)     
>         |
  |                                  4                             1 ( 7%)     
>         |
  |                                  5                             4 (27%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  1 ( 7%)     
>         |
  |                                  Current smoker                1 ( 7%)     
>         |
  |                                  Ex-smoker                     3 (20%)     
>         |
  |                                  Unknown                       10 (67%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        75.38611 (26
> .32957) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       3 (20%)     
>         |
  |                                  Underweight                   1 ( 7%)     
>         |
  |                                  Healthy range                 5 (33%)     
>         |
  |                                  Overweight                    1 ( 7%)     
>         |
  |                                  Obese                         3 (20%)     
>         |
  |                                  Morbidly obese                2 (13%)     
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.000005 saved
(3,133 observations deleted)

  +------------------------------------------------+
  | factor                             N_1     m_1 |
  |------------------------------------------------|
  | age_cat                          1,465     402 |
  |------------------------------------------------|
  | male                             1,867       0 |
  |------------------------------------------------|
  | Rural Urban in five categories   1,867       0 |
  |------------------------------------------------|
  | region                           1,867       0 |
  |------------------------------------------------|
  | imd                              1,867       0 |
  |------------------------------------------------|
  | smoking                          1,867       0 |
  |------------------------------------------------|
  | time_ra                            819   1,048 |
  |------------------------------------------------|
  | bmi_cat                          1,866       1 |
  +------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=1,867     
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 557 (38.0%) 
>         |
  |                                  41 - 60 years                 449 (30.6%) 
>         |
  |                                  61 - 80 years                 362 (24.7%) 
>         |
  |                                  >80 years                     97 ( 6.6%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        941 (50.4%) 
>         |
  |                                  Male                          926 (49.6%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       213 (11.4%) 
>         |
  |                                  Urban minor conurbation       232 (12.4%) 
>         |
  |                                  Urban city and town           480 (25.7%) 
>         |
  |                                  Rural town and fringe         450 (24.1%) 
>         |
  |                                  Rural village and dispersed   492 (26.4%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | region                           East Midlands                 191 (10.2%) 
>         |
  |                                  East of England               178 ( 9.5%) 
>         |
  |                                  London                        365 (19.6%) 
>         |
  |                                  North East                    190 (10.2%) 
>         |
  |                                  North West                    169 ( 9.1%) 
>         |
  |                                  South East                    391 (20.9%) 
>         |
  |                                  West Midlands                 172 ( 9.2%) 
>         |
  |                                  Yorkshire and the Humber      211 (11.3%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             88 ( 4.7%)  
>         |
  |                                  1                             365 (19.6%) 
>         |
  |                                  2                             377 (20.2%) 
>         |
  |                                  3                             349 (18.7%) 
>         |
  |                                  4                             343 (18.4%) 
>         |
  |                                  5                             345 (18.5%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  173 ( 9.3%) 
>         |
  |                                  Current smoker                379 (20.3%) 
>         |
  |                                  Ex-smoker                     292 (15.6%) 
>         |
  |                                  Unknown                       1,023 (54.8%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        55.22933 (31
> .89348) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       370 (19.8%) 
>         |
  |                                  Underweight                   188 (10.1%) 
>         |
  |                                  Healthy range                 339 (18.2%) 
>         |
  |                                  Overweight                    354 (19.0%) 
>         |
  |                                  Obese                         514 (27.5%) 
>         |
  |                                  Morbidly obese                101 ( 5.4%) 
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.000005 saved
file ./output/tables/characteristics_strata2021.csv saved
(4,869 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                          114    17 |
  |--------------------------------------------|
  | male                             131     0 |
  |--------------------------------------------|
  | Rural Urban in five categories   131     0 |
  |--------------------------------------------|
  | prescribed_biologics             131     0 |
  |--------------------------------------------|
  | imd                              131     0 |
  |--------------------------------------------|
  | smoking                          131     0 |
  |--------------------------------------------|
  | time_ra                           59    72 |
  |--------------------------------------------|
  | bmi_cat                          131     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=131       
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 44 (38.6%)  
>         |
  |                                  41 - 60 years                 34 (29.8%)  
>         |
  |                                  61 - 80 years                 28 (24.6%)  
>         |
  |                                  >80 years                     8 ( 7.0%)   
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        66 (50.4%)  
>         |
  |                                  Male                          65 (49.6%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       13 ( 9.9%)  
>         |
  |                                  Urban minor conurbation       10 ( 7.6%)  
>         |
  |                                  Urban city and town           36 (27.5%)  
>         |
  |                                  Rural town and fringe         32 (24.4%)  
>         |
  |                                  Rural village and dispersed   40 (30.5%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             61 (46.6%)  
>         |
  |                                  1                             70 (53.4%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             8 ( 6.1%)   
>         |
  |                                  1                             26 (19.8%)  
>         |
  |                                  2                             30 (22.9%)  
>         |
  |                                  3                             21 (16.0%)  
>         |
  |                                  4                             18 (13.7%)  
>         |
  |                                  5                             28 (21.4%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  12 ( 9.2%)  
>         |
  |                                  Current smoker                24 (18.3%)  
>         |
  |                                  Ex-smoker                     18 (13.7%)  
>         |
  |                                  Unknown                       77 (58.8%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        61.47528 (34
> .11892) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       28 (21.4%)  
>         |
  |                                  Underweight                   12 ( 9.2%)  
>         |
  |                                  Healthy range                 19 (14.5%)  
>         |
  |                                  Overweight                    31 (23.7%)  
>         |
  |                                  Obese                         34 (26.0%)  
>         |
  |                                  Morbidly obese                7 ( 5.3%)   
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.000005 saved
(4,339 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                          520   141 |
  |--------------------------------------------|
  | male                             661     0 |
  |--------------------------------------------|
  | Rural Urban in five categories   661     0 |
  |--------------------------------------------|
  | prescribed_biologics             661     0 |
  |--------------------------------------------|
  | imd                              661     0 |
  |--------------------------------------------|
  | smoking                          661     0 |
  |--------------------------------------------|
  | time_ra                          297   364 |
  |--------------------------------------------|
  | bmi_cat                          661     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=661       
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 217 (41.7%) 
>         |
  |                                  41 - 60 years                 140 (26.9%) 
>         |
  |                                  61 - 80 years                 123 (23.7%) 
>         |
  |                                  >80 years                     40 ( 7.7%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        338 (51.1%) 
>         |
  |                                  Male                          323 (48.9%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       84 (12.7%)  
>         |
  |                                  Urban minor conurbation       89 (13.5%)  
>         |
  |                                  Urban city and town           184 (27.8%) 
>         |
  |                                  Rural town and fringe         137 (20.7%) 
>         |
  |                                  Rural village and dispersed   167 (25.3%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             313 (47.4%) 
>         |
  |                                  1                             348 (52.6%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             26 ( 3.9%)  
>         |
  |                                  1                             139 (21.0%) 
>         |
  |                                  2                             130 (19.7%) 
>         |
  |                                  3                             116 (17.5%) 
>         |
  |                                  4                             126 (19.1%) 
>         |
  |                                  5                             124 (18.8%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  72 (10.9%)  
>         |
  |                                  Current smoker                122 (18.5%) 
>         |
  |                                  Ex-smoker                     105 (15.9%) 
>         |
  |                                  Unknown                       362 (54.8%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        55.33086 (31
> .90634) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       139 (21.0%) 
>         |
  |                                  Underweight                   60 ( 9.1%)  
>         |
  |                                  Healthy range                 105 (15.9%) 
>         |
  |                                  Overweight                    140 (21.2%) 
>         |
  |                                  Obese                         182 (27.5%) 
>         |
  |                                  Morbidly obese                35 ( 5.3%)  
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.000005 saved
file ./output/tables/characteristics_ra_hosp_2021.csv saved

. 
. * Tabulate characteristics by categories of differences in outpatient appoint
> ments for each year
. tempfile tempfile

. forvalues i=2020/2021 {
  2.     preserve
  3.     keep if diff_op_cat_`i'==0
  4.     table1_mc, vars(age_cat cate \ male cate \ urban_rural_5 cate \ prescr
> ibed_biologics cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat cate)
>  clear
  5.     save `tempfile', replace
  6.     restore
  7.     forvalues j=1/3 {
  8.         preserve
  9.         keep if diff_op_cat_`i'==`j'
 10.         table1_mc, vars(age_cat cate \ male cate \ urban_rural_5 cate \ pr
> escribed_biologics cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat c
> ate) clear
 11.         append using `tempfile'
 12.         save `tempfile', replace
 13.         if `j'==3 {
 14.             export delimited using ./output/tables/characteristics_diff_st
> rata`i'.csv
 15.             }
 16.         restore
 17.         }
 18.     }
(4,974 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                           22     4 |
  |--------------------------------------------|
  | male                              26     0 |
  |--------------------------------------------|
  | Rural Urban in five categories    26     0 |
  |--------------------------------------------|
  | prescribed_biologics              26     0 |
  |--------------------------------------------|
  | imd                               26     0 |
  |--------------------------------------------|
  | smoking                           26     0 |
  |--------------------------------------------|
  | time_ra                           15    11 |
  |--------------------------------------------|
  | bmi_cat                           26     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> ------+
  |                                                                Total       
>       |
  |----------------------------------------------------------------------------
> ------|
  |                                                                N=26        
>       |
  |----------------------------------------------------------------------------
> ------|
  | age_cat                          18 - 40 years                 9 (41%)     
>       |
  |                                  41 - 60 years                 6 (27%)     
>       |
  |                                  61 - 80 years                 7 (32%)     
>       |
  |----------------------------------------------------------------------------
> ------|
  | male                             Female                        16 (62%)    
>       |
  |                                  Male                          10 (38%)    
>       |
  |----------------------------------------------------------------------------
> ------|
  | Rural Urban in five categories   Urban minor conurbation       1 ( 4%)     
>       |
  |                                  Urban city and town           11 (42%)    
>       |
  |                                  Rural town and fringe         8 (31%)     
>       |
  |                                  Rural village and dispersed   6 (23%)     
>       |
  |----------------------------------------------------------------------------
> ------|
  | prescribed_biologics             0                             19 (73%)    
>       |
  |                                  1                             7 (27%)     
>       |
  |----------------------------------------------------------------------------
> ------|
  | imd                              0                             1 ( 4%)     
>       |
  |                                  1                             5 (19%)     
>       |
  |                                  2                             4 (15%)     
>       |
  |                                  3                             7 (27%)     
>       |
  |                                  4                             5 (19%)     
>       |
  |                                  5                             4 (15%)     
>       |
  |----------------------------------------------------------------------------
> ------|
  | smoking                          Never smoked                  3 (12%)     
>       |
  |                                  Current smoker                5 (19%)     
>       |
  |                                  Ex-smoker                     2 ( 8%)     
>       |
  |                                  Unknown                       16 (62%)    
>       |
  |----------------------------------------------------------------------------
> ------|
  | time_ra                                                        58.047 (31.8
> 4009) |
  |----------------------------------------------------------------------------
> ------|
  | bmi_cat                          Missing                       5 (19%)     
>       |
  |                                  Healthy range                 6 (23%)     
>       |
  |                                  Overweight                    5 (19%)     
>       |
  |                                  Obese                         7 (27%)     
>       |
  |                                  Morbidly obese                3 (12%)     
>       |
  +----------------------------------------------------------------------------
> ------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
(note: file /tmp/St00015.00000l not found)
file /tmp/St00015.00000l saved
(3,473 observations deleted)

  +----------------------------------------------+
  | factor                             N_1   m_1 |
  |----------------------------------------------|
  | age_cat                          1,185   342 |
  |----------------------------------------------|
  | male                             1,527     0 |
  |----------------------------------------------|
  | Rural Urban in five categories   1,527     0 |
  |----------------------------------------------|
  | prescribed_biologics             1,527     0 |
  |----------------------------------------------|
  | imd                              1,527     0 |
  |----------------------------------------------|
  | smoking                          1,527     0 |
  |----------------------------------------------|
  | time_ra                            665   862 |
  |----------------------------------------------|
  | bmi_cat                          1,526     1 |
  +----------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=1,527     
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 450 (38.0%) 
>         |
  |                                  41 - 60 years                 363 (30.6%) 
>         |
  |                                  61 - 80 years                 296 (25.0%) 
>         |
  |                                  >80 years                     76 ( 6.4%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        769 (50.4%) 
>         |
  |                                  Male                          758 (49.6%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       163 (10.7%) 
>         |
  |                                  Urban minor conurbation       208 (13.6%) 
>         |
  |                                  Urban city and town           391 (25.6%) 
>         |
  |                                  Rural town and fringe         354 (23.2%) 
>         |
  |                                  Rural village and dispersed   411 (26.9%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             748 (49.0%) 
>         |
  |                                  1                             779 (51.0%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             69 ( 4.5%)  
>         |
  |                                  1                             303 (19.8%) 
>         |
  |                                  2                             308 (20.2%) 
>         |
  |                                  3                             308 (20.2%) 
>         |
  |                                  4                             273 (17.9%) 
>         |
  |                                  5                             266 (17.4%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  132 ( 8.6%) 
>         |
  |                                  Current smoker                318 (20.8%) 
>         |
  |                                  Ex-smoker                     245 (16.0%) 
>         |
  |                                  Unknown                       832 (54.5%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        57.69925 (32
> .49508) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       295 (19.3%) 
>         |
  |                                  Underweight                   136 ( 8.9%) 
>         |
  |                                  Healthy range                 287 (18.8%) 
>         |
  |                                  Overweight                    312 (20.4%) 
>         |
  |                                  Obese                         422 (27.7%) 
>         |
  |                                  Morbidly obese                74 ( 4.8%)  
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.00000l saved
(4,605 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                          322    73 |
  |--------------------------------------------|
  | male                             395     0 |
  |--------------------------------------------|
  | Rural Urban in five categories   395     0 |
  |--------------------------------------------|
  | prescribed_biologics             395     0 |
  |--------------------------------------------|
  | imd                              395     0 |
  |--------------------------------------------|
  | smoking                          395     0 |
  |--------------------------------------------|
  | time_ra                          170   225 |
  |--------------------------------------------|
  | bmi_cat                          395     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> -------+
  |                                                                Total       
>        |
  |----------------------------------------------------------------------------
> -------|
  |                                                                N=395       
>        |
  |----------------------------------------------------------------------------
> -------|
  | age_cat                          18 - 40 years                 130 (40.4%) 
>        |
  |                                  41 - 60 years                 111 (34.5%) 
>        |
  |                                  61 - 80 years                 62 (19.3%)  
>        |
  |                                  >80 years                     19 ( 5.9%)  
>        |
  |----------------------------------------------------------------------------
> -------|
  | male                             Female                        209 (52.9%) 
>        |
  |                                  Male                          186 (47.1%) 
>        |
  |----------------------------------------------------------------------------
> -------|
  | Rural Urban in five categories   Urban major conurbation       47 (11.9%)  
>        |
  |                                  Urban minor conurbation       57 (14.4%)  
>        |
  |                                  Urban city and town           90 (22.8%)  
>        |
  |                                  Rural town and fringe         100 (25.3%) 
>        |
  |                                  Rural village and dispersed   101 (25.6%) 
>        |
  |----------------------------------------------------------------------------
> -------|
  | prescribed_biologics             0                             205 (51.9%) 
>        |
  |                                  1                             190 (48.1%) 
>        |
  |----------------------------------------------------------------------------
> -------|
  | imd                              0                             25 ( 6.3%)  
>        |
  |                                  1                             84 (21.3%)  
>        |
  |                                  2                             63 (15.9%)  
>        |
  |                                  3                             72 (18.2%)  
>        |
  |                                  4                             82 (20.8%)  
>        |
  |                                  5                             69 (17.5%)  
>        |
  |----------------------------------------------------------------------------
> -------|
  | smoking                          Never smoked                  45 (11.4%)  
>        |
  |                                  Current smoker                72 (18.2%)  
>        |
  |                                  Ex-smoker                     65 (16.5%)  
>        |
  |                                  Unknown                       213 (53.9%) 
>        |
  |----------------------------------------------------------------------------
> -------|
  | time_ra                                                        53.9795 (31.
> 32433) |
  |----------------------------------------------------------------------------
> -------|
  | bmi_cat                          Missing                       78 (19.7%)  
>        |
  |                                  Underweight                   47 (11.9%)  
>        |
  |                                  Healthy range                 81 (20.5%)  
>        |
  |                                  Overweight                    85 (21.5%)  
>        |
  |                                  Obese                         89 (22.5%)  
>        |
  |                                  Morbidly obese                15 ( 3.8%)  
>        |
  +----------------------------------------------------------------------------
> -------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
(note: variable Total was str18, now str19 to accommodate using data's
       values)
file /tmp/St00015.00000l saved
(3,581 observations deleted)

  +----------------------------------------------+
  | factor                             N_1   m_1 |
  |----------------------------------------------|
  | age_cat                          1,123   296 |
  |----------------------------------------------|
  | male                             1,419     0 |
  |----------------------------------------------|
  | Rural Urban in five categories   1,419     0 |
  |----------------------------------------------|
  | prescribed_biologics             1,419     0 |
  |----------------------------------------------|
  | imd                              1,419     0 |
  |----------------------------------------------|
  | smoking                          1,419     0 |
  |----------------------------------------------|
  | time_ra                            625   794 |
  |----------------------------------------------|
  | bmi_cat                          1,419     0 |
  +----------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=1,419     
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 412 (36.7%) 
>         |
  |                                  41 - 60 years                 349 (31.1%) 
>         |
  |                                  61 - 80 years                 278 (24.8%) 
>         |
  |                                  >80 years                     84 ( 7.5%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        695 (49.0%) 
>         |
  |                                  Male                          724 (51.0%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       172 (12.1%) 
>         |
  |                                  Urban minor conurbation       165 (11.6%) 
>         |
  |                                  Urban city and town           350 (24.7%) 
>         |
  |                                  Rural town and fringe         355 (25.0%) 
>         |
  |                                  Rural village and dispersed   377 (26.6%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             717 (50.5%) 
>         |
  |                                  1                             702 (49.5%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             60 ( 4.2%)  
>         |
  |                                  1                             281 (19.8%) 
>         |
  |                                  2                             282 (19.9%) 
>         |
  |                                  3                             260 (18.3%) 
>         |
  |                                  4                             271 (19.1%) 
>         |
  |                                  5                             265 (18.7%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  122 ( 8.6%) 
>         |
  |                                  Current smoker                277 (19.5%) 
>         |
  |                                  Ex-smoker                     200 (14.1%) 
>         |
  |                                  Unknown                       820 (57.8%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        54.64139 (31
> .64608) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       281 (19.8%) 
>         |
  |                                  Underweight                   139 ( 9.8%) 
>         |
  |                                  Healthy range                 260 (18.3%) 
>         |
  |                                  Overweight                    276 (19.5%) 
>         |
  |                                  Obese                         381 (26.8%) 
>         |
  |                                  Morbidly obese                82 ( 5.8%)  
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.00000l saved
file ./output/tables/characteristics_diff_strata2020.csv saved
(4,968 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                           28     4 |
  |--------------------------------------------|
  | male                              32     0 |
  |--------------------------------------------|
  | Rural Urban in five categories    32     0 |
  |--------------------------------------------|
  | prescribed_biologics              32     0 |
  |--------------------------------------------|
  | imd                               32     0 |
  |--------------------------------------------|
  | smoking                           32     0 |
  |--------------------------------------------|
  | time_ra                           18    14 |
  |--------------------------------------------|
  | bmi_cat                           32     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=32        
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 12 (43%)    
>         |
  |                                  41 - 60 years                 9 (32%)     
>         |
  |                                  61 - 80 years                 5 (18%)     
>         |
  |                                  >80 years                     2 ( 7%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        22 (69%)    
>         |
  |                                  Male                          10 (31%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       3 ( 9%)     
>         |
  |                                  Urban minor conurbation       3 ( 9%)     
>         |
  |                                  Urban city and town           12 (38%)    
>         |
  |                                  Rural town and fringe         4 (12%)     
>         |
  |                                  Rural village and dispersed   10 (31%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             16 (50%)    
>         |
  |                                  1                             16 (50%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             1 ( 3%)     
>         |
  |                                  1                             6 (19%)     
>         |
  |                                  2                             6 (19%)     
>         |
  |                                  3                             7 (22%)     
>         |
  |                                  4                             4 (12%)     
>         |
  |                                  5                             8 (25%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  3 ( 9%)     
>         |
  |                                  Current smoker                9 (28%)     
>         |
  |                                  Ex-smoker                     3 ( 9%)     
>         |
  |                                  Unknown                       17 (53%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        48.28778 (33
> .31496) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       11 (34%)    
>         |
  |                                  Underweight                   4 (12%)     
>         |
  |                                  Healthy range                 2 ( 6%)     
>         |
  |                                  Overweight                    10 (31%)    
>         |
  |                                  Obese                         3 ( 9%)     
>         |
  |                                  Morbidly obese                2 ( 6%)     
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.00000l saved
(4,147 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                          670   183 |
  |--------------------------------------------|
  | male                             853     0 |
  |--------------------------------------------|
  | Rural Urban in five categories   853     0 |
  |--------------------------------------------|
  | prescribed_biologics             853     0 |
  |--------------------------------------------|
  | imd                              853     0 |
  |--------------------------------------------|
  | smoking                          853     0 |
  |--------------------------------------------|
  | time_ra                          365   488 |
  |--------------------------------------------|
  | bmi_cat                          853     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=853       
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 264 (39.4%) 
>         |
  |                                  41 - 60 years                 197 (29.4%) 
>         |
  |                                  61 - 80 years                 167 (24.9%) 
>         |
  |                                  >80 years                     42 ( 6.3%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        409 (47.9%) 
>         |
  |                                  Male                          444 (52.1%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       101 (11.8%) 
>         |
  |                                  Urban minor conurbation       102 (12.0%) 
>         |
  |                                  Urban city and town           214 (25.1%) 
>         |
  |                                  Rural town and fringe         198 (23.2%) 
>         |
  |                                  Rural village and dispersed   238 (27.9%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             417 (48.9%) 
>         |
  |                                  1                             436 (51.1%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             43 ( 5.0%)  
>         |
  |                                  1                             167 (19.6%) 
>         |
  |                                  2                             157 (18.4%) 
>         |
  |                                  3                             172 (20.2%) 
>         |
  |                                  4                             166 (19.5%) 
>         |
  |                                  5                             148 (17.4%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  74 ( 8.7%)  
>         |
  |                                  Current smoker                172 (20.2%) 
>         |
  |                                  Ex-smoker                     132 (15.5%) 
>         |
  |                                  Unknown                       475 (55.7%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        55.69258 (31
> .15696) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       167 (19.6%) 
>         |
  |                                  Underweight                   103 (12.1%) 
>         |
  |                                  Healthy range                 147 (17.2%) 
>         |
  |                                  Overweight                    148 (17.4%) 
>         |
  |                                  Obese                         243 (28.5%) 
>         |
  |                                  Morbidly obese                45 ( 5.3%)  
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.00000l saved
(4,746 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                          193    61 |
  |--------------------------------------------|
  | male                             254     0 |
  |--------------------------------------------|
  | Rural Urban in five categories   254     0 |
  |--------------------------------------------|
  | prescribed_biologics             254     0 |
  |--------------------------------------------|
  | imd                              254     0 |
  |--------------------------------------------|
  | smoking                          254     0 |
  |--------------------------------------------|
  | time_ra                          122   132 |
  |--------------------------------------------|
  | bmi_cat                          254     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> -------+
  |                                                                Total       
>        |
  |----------------------------------------------------------------------------
> -------|
  |                                                                N=254       
>        |
  |----------------------------------------------------------------------------
> -------|
  | age_cat                          18 - 40 years                 72 (37.3%)  
>        |
  |                                  41 - 60 years                 66 (34.2%)  
>        |
  |                                  61 - 80 years                 40 (20.7%)  
>        |
  |                                  >80 years                     15 ( 7.8%)  
>        |
  |----------------------------------------------------------------------------
> -------|
  | male                             Female                        122 (48.0%) 
>        |
  |                                  Male                          132 (52.0%) 
>        |
  |----------------------------------------------------------------------------
> -------|
  | Rural Urban in five categories   Urban major conurbation       24 ( 9.4%)  
>        |
  |                                  Urban minor conurbation       33 (13.0%)  
>        |
  |                                  Urban city and town           71 (28.0%)  
>        |
  |                                  Rural town and fringe         63 (24.8%)  
>        |
  |                                  Rural village and dispersed   63 (24.8%)  
>        |
  |----------------------------------------------------------------------------
> -------|
  | prescribed_biologics             0                             119 (46.9%) 
>        |
  |                                  1                             135 (53.1%) 
>        |
  |----------------------------------------------------------------------------
> -------|
  | imd                              0                             17 ( 6.7%)  
>        |
  |                                  1                             51 (20.1%)  
>        |
  |                                  2                             48 (18.9%)  
>        |
  |                                  3                             46 (18.1%)  
>        |
  |                                  4                             45 (17.7%)  
>        |
  |                                  5                             47 (18.5%)  
>        |
  |----------------------------------------------------------------------------
> -------|
  | smoking                          Never smoked                  31 (12.2%)  
>        |
  |                                  Current smoker                49 (19.3%)  
>        |
  |                                  Ex-smoker                     36 (14.2%)  
>        |
  |                                  Unknown                       138 (54.3%) 
>        |
  |----------------------------------------------------------------------------
> -------|
  | time_ra                                                        56.23629 (31
> .5272) |
  |----------------------------------------------------------------------------
> -------|
  | bmi_cat                          Missing                       67 (26.4%)  
>        |
  |                                  Underweight                   22 ( 8.7%)  
>        |
  |                                  Healthy range                 50 (19.7%)  
>        |
  |                                  Overweight                    46 (18.1%)  
>        |
  |                                  Obese                         60 (23.6%)  
>        |
  |                                  Morbidly obese                9 ( 3.5%)   
>        |
  +----------------------------------------------------------------------------
> -------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
(note: variable Total was str18, now str19 to accommodate using data's
       values)
file /tmp/St00015.00000l saved
(4,046 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                          757   197 |
  |--------------------------------------------|
  | male                             954     0 |
  |--------------------------------------------|
  | Rural Urban in five categories   954     0 |
  |--------------------------------------------|
  | prescribed_biologics             954     0 |
  |--------------------------------------------|
  | imd                              954     0 |
  |--------------------------------------------|
  | smoking                          954     0 |
  |--------------------------------------------|
  | time_ra                          417   537 |
  |--------------------------------------------|
  | bmi_cat                          953     1 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=954       
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 286 (37.8%) 
>         |
  |                                  41 - 60 years                 234 (30.9%) 
>         |
  |                                  61 - 80 years                 188 (24.8%) 
>         |
  |                                  >80 years                     49 ( 6.5%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        500 (52.4%) 
>         |
  |                                  Male                          454 (47.6%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       115 (12.1%) 
>         |
  |                                  Urban minor conurbation       120 (12.6%) 
>         |
  |                                  Urban city and town           242 (25.4%) 
>         |
  |                                  Rural town and fringe         230 (24.1%) 
>         |
  |                                  Rural village and dispersed   247 (25.9%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             476 (49.9%) 
>         |
  |                                  1                             478 (50.1%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             36 ( 3.8%)  
>         |
  |                                  1                             182 (19.1%) 
>         |
  |                                  2                             202 (21.2%) 
>         |
  |                                  3                             181 (19.0%) 
>         |
  |                                  4                             176 (18.4%) 
>         |
  |                                  5                             177 (18.6%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  82 ( 8.6%)  
>         |
  |                                  Current smoker                196 (20.5%) 
>         |
  |                                  Ex-smoker                     158 (16.6%) 
>         |
  |                                  Unknown                       518 (54.3%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        54.41122 (32
> .59659) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       168 (17.6%) 
>         |
  |                                  Underweight                   86 ( 9.0%)  
>         |
  |                                  Healthy range                 180 (18.9%) 
>         |
  |                                  Overweight                    192 (20.1%) 
>         |
  |                                  Obese                         270 (28.3%) 
>         |
  |                                  Morbidly obese                57 ( 6.0%)  
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.00000l saved
file ./output/tables/characteristics_diff_strata2021.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/outpatients.log
  log type:  text
 closed on:  24 Jan 2023, 11:57:49
-------------------------------------------------------------------------------
