
. 
. cap mkdir ./output/tables

. * Import data
. import delimited using ./output/input.csv
(42 vars, 10,000 obs)

. * Check data
. count if age==. 
  0

. count if age<18 
  2,065

. count if age>110 & age!=.
  0

. sum age, d

                             age
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            4              0
10%            8              0       Obs              10,000
25%           21              0       Sum of Wgt.      10,000

50%           40                      Mean             40.611
                        Largest       Std. Dev.      23.66198
75%           59            100
90%           73            105       Variance       559.8893
95%           80            106       Skewness       .1071215
99%           88            107       Kurtosis       2.033615

. count if sex==""
  0

. tab sex

        sex |      Freq.     Percent        Cum.
------------+-----------------------------------
          F |      5,041       50.41       50.41
          M |      4,860       48.60       99.01
          U |         99        0.99      100.00
------------+-----------------------------------
      Total |     10,000      100.00

. sum household, d

                          household
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs              10,000
25%            2              0       Sum of Wgt.      10,000

50%            2                      Mean             2.4889
                        Largest       Std. Dev.      1.043928
75%            3              6
90%            4              6       Variance       1.089786
95%            4              6       Skewness       .0160113
99%            5              6       Kurtosis       2.888004

. tab care_home_type

care_home_t |
        ype |      Freq.     Percent        Cum.
------------+-----------------------------------
         PC |        527        5.33        5.33
         PN |        516        5.22       10.56
         PR |      8,356       84.57       95.13
         PS |        481        4.87      100.00
------------+-----------------------------------
      Total |      9,880      100.00

. * Checking RA algorithm variables
. * Checking type of DMARD that meets inclusion
. foreach dmard in metho leflu sulfa hydrox {
  2.     gen `dmard'_multi = (`dmard'_count>=2)
  3.     tab `dmard'_multi if has_dmards==1, m
  4. }

metho_multi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        796       15.92       15.92
          1 |      4,204       84.08      100.00
------------+-----------------------------------
      Total |      5,000      100.00

leflu_multi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        798       15.96       15.96
          1 |      4,202       84.04      100.00
------------+-----------------------------------
      Total |      5,000      100.00

sulfa_multi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        817       16.34       16.34
          1 |      4,183       83.66      100.00
------------+-----------------------------------
      Total |      5,000      100.00

hydrox_mult |
          i |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        743       14.86       14.86
          1 |      4,257       85.14      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. gen dmard_multi = (metho_multi==1 | leflu_multi==1 | sulfa_multi==1 | hydrox_
> multi==1)

. tab dmard_multi has_alt_dmard_diag

dmard_mult |  has_alt_dmard_diag
         i |         0          1 |     Total
-----------+----------------------+----------
         0 |         7          5 |        12 
         1 |     4,993      4,995 |     9,988 
-----------+----------------------+----------
     Total |     5,000      5,000 |    10,000 

. sum number_ra_codes

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
number_ra_~s |     10,000      2.5209    1.035988          0          7

. di "Number where no DMARDs but does have multiple RA codes and no alt diag"
Number where no DMARDs but does have multiple RA codes and no alt diag

. count if has_dmards==0 & number_ra_codes>=2 & alt_diag!=1
  2,101

. tab has_ra, m

     has_ra |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,000       50.00       50.00
          1 |      5,000       50.00      100.00
------------+-----------------------------------
      Total |     10,000      100.00

. * Time since first RA code
. gen first_ra_codeA = date(first_ra_code, "YMD")
(5,556 missing values generated)

. format first_ra_codeA %dD/N/CY

. gen time_ra = (date("01Mar2018", "DMY") - first_ra_codeA)/365.25
(5,556 missing values generated)

. sum time_ra, d

                           time_ra
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0930869      -1.023956
 5%      4.66256      -.9555099
10%     9.409993      -.9336071       Obs               4,444
25%      25.3347      -.9226557       Sum of Wgt.       4,444

50%     53.57153                      Mean           53.57708
                        Largest       Std. Dev.      32.03502
75%      81.7358       108.9528
90%      97.4757       108.9665       Variance       1026.242
95%     103.5044       108.9884       Skewness       .0081732
99%     107.7563       108.9966       Kurtosis       1.776895

. sum number_ra_codes, d

                       number_ra_codes
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs              10,000
25%            2              0       Sum of Wgt.      10,000

50%            3                      Mean             2.5209
                        Largest       Std. Dev.      1.035988
75%            3              6
90%            4              6       Variance       1.073271
95%            4              6       Skewness       .0305187
99%            5              7       Kurtosis       2.866641

. sum metho_count, d

                         metho_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs              10,000
25%            2              0       Sum of Wgt.      10,000

50%            3                      Mean             2.5059
                        Largest       Std. Dev.      1.037339
75%            3              6
90%            4              6       Variance       1.076073
95%            4              6       Skewness       .0514568
99%            5              6       Kurtosis       2.924693

. sum sulfa_count, d 

                         sulfa_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs              10,000
25%            2              0       Sum of Wgt.      10,000

50%            3                      Mean             2.4958
                        Largest       Std. Dev.      1.034548
75%            3              6
90%            4              6       Variance       1.070289
95%            4              7       Skewness      -.0139695
99%            5              7       Kurtosis       2.923824

. sum leflu_count, d 

                         leflu_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs              10,000
25%            2              0       Sum of Wgt.      10,000

50%            2                      Mean             2.4939
                        Largest       Std. Dev.      1.049987
75%            3              6
90%            4              6       Variance       1.102473
95%            4              6       Skewness       .0596578
99%            5              6       Kurtosis       2.929993

. sum hydrox_count, d 

                        hydrox_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -1
 5%            1              0
10%            1              0       Obs              10,000
25%            2              0       Sum of Wgt.      10,000

50%            2                      Mean             2.5007
                        Largest       Std. Dev.      1.036005
75%            3              6
90%            4              6       Variance       1.073307
95%            4              6       Skewness       .0240346
99%            5              6       Kurtosis       2.912091

. 
. sum outpatient*, d

                    outpatient_appt_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            1              0       Obs              10,000
25%            6              0       Sum of Wgt.      10,000

50%            7                      Mean             6.7651
                        Largest       Std. Dev.      2.961317
75%            9             14
90%           10             14       Variance       8.769399
95%           11             15       Skewness      -.8501019
99%           12             15       Kurtosis       3.463223

                    outpatient_appt_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            1              0       Obs              10,000
25%            6              0       Sum of Wgt.      10,000

50%            7                      Mean             6.7508
                        Largest       Std. Dev.      2.947638
75%            9             14
90%           10             14       Variance       8.688568
95%           11             14       Skewness      -.8693591
99%           12             15       Kurtosis       3.481463

                    outpatient_appt_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%           .5              0       Obs              10,000
25%            6              0       Sum of Wgt.      10,000

50%            7                      Mean             6.7543
                        Largest       Std. Dev.      2.961116
75%            9             14
90%           10             14       Variance       8.768208
95%           11             14       Skewness      -.8481682
99%           12             15       Kurtosis       3.451577

                   outpatient_medium_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               5,000
25%            2              1       Sum of Wgt.       5,000

50%            5                      Mean            14.0612
                        Largest       Std. Dev.      28.96727
75%            7             98
90%           98             98       Variance       839.1025
95%           98             98       Skewness       2.532562
99%           98             98       Kurtosis       7.479212

                   outpatient_medium_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               5,000
25%            2              1       Sum of Wgt.       5,000

50%            5                      Mean            14.1072
                        Largest       Std. Dev.      29.01031
75%            7             98
90%           98             98       Variance        841.598
95%           98             98       Skewness       2.526488
99%           98             98       Kurtosis       7.446793

                   outpatient_medium_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               5,000
25%            2              1       Sum of Wgt.       5,000

50%            5                      Mean            13.8484
                        Largest       Std. Dev.         28.64
75%            7             98
90%           98             98       Variance       820.2495
95%           98             98       Skewness       2.577631
99%           98             98       Kurtosis       7.711097

. 
. * How many people are not on DMARDs and have no RA appointments?
. 
. 
. * Format variables
. *re-order ethnicity
.  gen eth5=1 if ethnicity==1
(7,996 missing values generated)

.  replace eth5=2 if ethnicity==3
(2,015 real changes made)

.  replace eth5=3 if ethnicity==4
(2,050 real changes made)

.  replace eth5=4 if ethnicity==2
(1,981 real changes made)

.  replace eth5=5 if ethnicity==5
(1,950 real changes made)

.  replace eth5=. if ethnicity==.
(0 real changes made)

. 
.  label define eth5                      1 "White"                            
>            ///
>                                                         2 "South Asian"      
>                    ///                                             
>                                                         3 "Black"            
>                            ///
>                                                         4 "Mixed"            
>                            ///
>                                                         5 "Other"            
>                            

.                                         
. 
. label values eth5 eth5

. safetab eth5, m
5

       eth5 |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |      2,004       20.04       20.04
South Asian |      2,015       20.15       40.19
      Black |      2,050       20.50       60.69
      Mixed |      1,981       19.81       80.50
      Other |      1,950       19.50      100.00
------------+-----------------------------------
      Total |     10,000      100.00

. 
. * formatting gender
. gen male=(sex=="M")

. replace male = 0 if sex == "F"
(0 real changes made)

. label define male 0"Female" 1"Male"

. label values male male

. safetab male, miss
5

       male |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |      5,140       51.40       51.40
       Male |      4,860       48.60      100.00
------------+-----------------------------------
      Total |     10,000      100.00

. 
. *create a 4 category rural urban variable 
. generate urban_rural_5=.
(10,000 missing values generated)

. la var urban_rural_5 "Rural Urban in five categories"

. replace urban_rural_5=1 if urban_rural==1
(1,259 real changes made)

. replace urban_rural_5=2 if urban_rural==2
(1,257 real changes made)

. replace urban_rural_5=3 if urban_rural==3|urban_rural==4
(2,507 real changes made)

. replace urban_rural_5=4 if urban_rural==5|urban_rural==6
(2,500 real changes made)

. replace urban_rural_5=5 if urban_rural==7|urban_rural==8
(2,477 real changes made)

. label define urban_rural_5 1 "Urban major conurbation" 2 "Urban minor conurba
> tion" 3 "Urban city and town" 4 "Rural town and fringe" 5 "Rural village and 
> dispersed"

. label values urban_rural_5 urban_rural_5

. safetab urban_rural_5, miss
14

        Rural Urban in five |
                 categories |      Freq.     Percent        Cum.
----------------------------+-----------------------------------
    Urban major conurbation |      1,259       12.59       12.59
    Urban minor conurbation |      1,257       12.57       25.16
        Urban city and town |      2,507       25.07       50.23
      Rural town and fringe |      2,500       25.00       75.23
Rural village and dispersed |      2,477       24.77      100.00
----------------------------+-----------------------------------
                      Total |     10,000      100.00

. 
. *generate a binary rural urban (with missing assigned to urban)
. generate urban_rural_bin=.
(10,000 missing values generated)

. replace urban_rural_bin=1 if urban_rural<=4|urban_rural==.
(5,023 real changes made)

. replace urban_rural_bin=0 if urban_rural>4 & urban_rural!=.
(4,977 real changes made)

. label define urban_rural_bin 0 "Rural" 1 "Urban"

. label values urban_rural_bin urban_rural_bin

. safetab urban_rural_bin urban_rural, miss
28

urban_rura |                      urban_rural
     l_bin |         1          2          3          4          5 |     Total
-----------+-------------------------------------------------------+----------
     Rural |         0          0          0          0      1,234 |     4,977 
     Urban |     1,259      1,257      1,223      1,284          0 |     5,023 
-----------+-------------------------------------------------------+----------
     Total |     1,259      1,257      1,223      1,284      1,234 |    10,000 


urban_rura |           urban_rural
     l_bin |         6          7          8 |     Total
-----------+---------------------------------+----------
     Rural |     1,266      1,274      1,203 |     4,977 
     Urban |         0          0          0 |     5,023 
-----------+---------------------------------+----------
     Total |     1,266      1,274      1,203 |    10,000 

. label var urban_rural_bin "Rural-Urban"

. 
. * Define age categories
. * Create age categories
. egen age_cat = cut(age), at(18, 40, 60, 80, 120) icodes
(2065 missing values generated)

. label define age 0 "18 - 40 years" 1 "41 - 60 years" 2 "61 - 80 years" 3 ">80
>  years"

. label values age_cat age

. safetab age_cat, miss
8

      age_cat |      Freq.     Percent        Cum.
--------------+-----------------------------------
18 - 40 years |      2,850       28.50       28.50
41 - 60 years |      2,674       26.74       55.24
61 - 80 years |      1,907       19.07       74.31
    >80 years |        504        5.04       79.35
            . |      2,065       20.65      100.00
--------------+-----------------------------------
        Total |     10,000      100.00

. 
. * Smoking status
. gen smoking = 0 if smoking_status=="N"
(8,981 missing values generated)

. replace smoking = 1 if smoking_status=="S"
(2,008 real changes made)

. replace smoking = 2 if smoking_status=="E"
(1,471 real changes made)

. replace smoking = 3 if smoking==.
(5,502 real changes made)

. 
. label define smok 1 "Current smoker" 2 "Ex-smoker" 0 "Never smoked" 3 "Unknow
> n"

. label values smoking smok

. 
. * BMI categories
. egen bmi_cat = cut(bmi), at(0, 1, 18.5, 24.9, 29.9, 39.9, 100) icodes
(4 missing values generated)

. bys bmi_cat: sum bmi

-------------------------------------------------------------------------------
-> bmi_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |      2,003    .0006425    .0149986          0   .4280399

-------------------------------------------------------------------------------
-> bmi_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        934    14.74197    3.176568   1.092033   18.49855

-------------------------------------------------------------------------------
-> bmi_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |      1,813    22.06048    1.749251   18.50344   24.89286

-------------------------------------------------------------------------------
-> bmi_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |      1,931    27.39476    1.415869   24.90618   29.88331

-------------------------------------------------------------------------------
-> bmi_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |      2,747    34.15423    2.748167   29.90288   39.89934

-------------------------------------------------------------------------------
-> bmi_cat = 5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        568    43.43095     3.27392   39.90691   59.30905

-------------------------------------------------------------------------------
-> bmi_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |          4   -.8375995    1.020078  -2.344364  -.1711571


. label define bmi 0 "Missing" 1 "Underweight" 2 "Healthy range" 3 "Overweight"
>  4 "Obese" 5 "Morbidly obese"

. label values bmi_cat bmi

. 
. * Categorise number of outpatient appointments
. label define appt 0 "No appointments" 1 "1-2 per year" 2 "3 or more per year"
>  

. forvalues i=2019/2021 {
  2.     egen op_appt_`i'_cat = cut(outpatient_appt_`i'), at(0, 1, 3, 1000) ico
> des
  3.     label values op_appt_`i'_cat appt
  4.     }

. 
. * Calculate difference compared to 2019
. gen diff_op_2020 = outpatient_appt_2020 - outpatient_appt_2019

. gen diff_op_2021 = outpatient_appt_2021 - outpatient_appt_2019

. sum diff_op_2020 diff_op_2021, d

                        diff_op_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%          -10            -14
 5%           -8            -13
10%           -5            -13       Obs              10,000
25%           -2            -12       Sum of Wgt.      10,000

50%            0                      Mean             -.0143
                        Largest       Std. Dev.         4.179
75%            2             13
90%            5             13       Variance       17.46404
95%            7             14       Skewness       .0016011
99%           10             14       Kurtosis       3.216058

                        diff_op_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%          -10            -14
 5%           -8            -14
10%           -5            -14       Obs              10,000
25%           -2            -13       Sum of Wgt.      10,000

50%            0                      Mean             -.0108
                        Largest       Std. Dev.      4.210589
75%            2             13
90%            5             14       Variance       17.72906
95%            7             14       Skewness      -.0224098
99%           10             14       Kurtosis       3.222124

. 
. egen diff_op_cat_2020 = cut(diff_op_2020), at(-100, 0, 1, 100) icodes

. egen diff_op_cat_2021 = cut(diff_op_2021), at(-100, 0, 1, 100) icodes

. label define op_cat 0 "Fewer appointments" 1 "Same number of appointments" 2 
> "More appointments"

. label values diff_op_cat_2020 op_cat

. label values diff_op_cat_2021 op_cat

. tab diff_op_cat_2020 op_appt_2020_cat

                      |         op_appt_2020_cat
     diff_op_cat_2020 | No appoin  1-2 per y  3 or more |     Total
----------------------+---------------------------------+----------
   Fewer appointments |       901         56      3,456 |     4,413 
Same number of appoin |        98          0      1,122 |     1,220 
    More appointments |         0          6      4,361 |     4,367 
----------------------+---------------------------------+----------
                Total |       999         62      8,939 |    10,000 

. tab diff_op_cat_2021 op_appt_2021_cat

                      |         op_appt_2021_cat
     diff_op_cat_2021 | No appoin  1-2 per y  3 or more |     Total
----------------------+---------------------------------+----------
   Fewer appointments |       913         44      3,462 |     4,419 
Same number of appoin |        87          0      1,102 |     1,189 
    More appointments |         0          6      4,386 |     4,392 
----------------------+---------------------------------+----------
                Total |     1,000         50      8,950 |    10,000 

. bys diff_op_cat_2020: sum diff_op_2020

-------------------------------------------------------------------------------
-> diff_op_cat_2020 = Fewer appointments

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
diff_op_2020 |      4,413    -3.61976    2.607262        -14         -1

-------------------------------------------------------------------------------
-> diff_op_cat_2020 = Same number of appointments

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
diff_op_2020 |      1,220           0           0          0          0

-------------------------------------------------------------------------------
-> diff_op_cat_2020 = More appointments

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
diff_op_2020 |      4,367    3.625143    2.595909          1         14


. 
. preserve

. * Tabulate number of appointments per year
. table1_mc, vars(op_appt_2019_cat cate \ op_appt_2020_cat cate \ op_appt_2021_
> cat cate \ diff_op_2020 conts \ diff_op_2021 conts \ diff_op_cat_2020 cate \ 
> diff_op_cat_2021 cate) clear

  +---------------------------------+
  | factor                N_1   m_1 |
  |---------------------------------|
  | op_appt_2019_cat   10,000     0 |
  |---------------------------------|
  | op_appt_2020_cat   10,000     0 |
  |---------------------------------|
  | op_appt_2021_cat   10,000     0 |
  |---------------------------------|
  | diff_op_2020       10,000     0 |
  |---------------------------------|
  | diff_op_2021       10,000     0 |
  |---------------------------------|
  | diff_op_cat_2020   10,000     0 |
  |---------------------------------|
  | diff_op_cat_2021   10,000     0 |
  +---------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------+
  |                                                  Total         |
  |----------------------------------------------------------------|
  |                                                  N=10,000      |
  |----------------------------------------------------------------|
  | op_appt_2019_cat   No appointments               999 (10.0%)   |
  |                    1-2 per year                  52 ( 0.5%)    |
  |                    3 or more per year            8,949 (89.5%) |
  |----------------------------------------------------------------|
  | op_appt_2020_cat   No appointments               999 (10.0%)   |
  |                    1-2 per year                  62 ( 0.6%)    |
  |                    3 or more per year            8,939 (89.4%) |
  |----------------------------------------------------------------|
  | op_appt_2021_cat   No appointments               1,000 (10.0%) |
  |                    1-2 per year                  50 ( 0.5%)    |
  |                    3 or more per year            8,950 (89.5%) |
  |----------------------------------------------------------------|
  | diff_op_2020                                     0 (-2-2)      |
  |----------------------------------------------------------------|
  | diff_op_2021                                     0 (-2-2)      |
  |----------------------------------------------------------------|
  | diff_op_cat_2020   Fewer appointments            4,413 (44.1%) |
  |                    Same number of appointments   1,220 (12.2%) |
  |                    More appointments             4,367 (43.7%) |
  |----------------------------------------------------------------|
  | diff_op_cat_2021   Fewer appointments            4,419 (44.2%) |
  |                    Same number of appointments   1,189 (11.9%) |
  |                    More appointments             4,392 (43.9%) |
  +----------------------------------------------------------------+
Data are presented as median (IQR) for continuous measures, and n (%) for categ
> orical measures.
 

. export delimited using ./output/tables/op_appt_yrs.csv
file ./output/tables/op_appt_yrs.csv saved

. restore 

. * Tabulate overall characteristics 
. preserve

. table1_mc, vars(age_cat cate \ male cate \ urban_rural_5 cate \ prescribed_bi
> ologics cate \ imd cate \  smoking cate \ time_ra contn \ bmi_cat cate) clear

  +-------------------------------------------------+
  | factor                              N_1     m_1 |
  |-------------------------------------------------|
  | age_cat                           7,935   2,065 |
  |-------------------------------------------------|
  | male                             10,000       0 |
  |-------------------------------------------------|
  | Rural Urban in five categories   10,000       0 |
  |-------------------------------------------------|
  | prescribed_biologics             10,000       0 |
  |-------------------------------------------------|
  | imd                              10,000       0 |
  |-------------------------------------------------|
  | smoking                          10,000       0 |
  |-------------------------------------------------|
  | time_ra                           4,444   5,556 |
  |-------------------------------------------------|
  | bmi_cat                           9,996       4 |
  +-------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=10,000    
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 2,850 (35.9%
> )       |
  |                                  41 - 60 years                 2,674 (33.7%
> )       |
  |                                  61 - 80 years                 1,907 (24.0%
> )       |
  |                                  >80 years                     504 ( 6.4%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        5,140 (51.4%
> )       |
  |                                  Male                          4,860 (48.6%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       1,259 (12.6%
> )       |
  |                                  Urban minor conurbation       1,257 (12.6%
> )       |
  |                                  Urban city and town           2,507 (25.1%
> )       |
  |                                  Rural town and fringe         2,500 (25.0%
> )       |
  |                                  Rural village and dispersed   2,477 (24.8%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             5,000 (50.0%
> )       |
  |                                  1                             5,000 (50.0%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             493 ( 4.9%) 
>         |
  |                                  1                             1,921 (19.2%
> )       |
  |                                  2                             1,904 (19.0%
> )       |
  |                                  3                             1,854 (18.5%
> )       |
  |                                  4                             1,887 (18.9%
> )       |
  |                                  5                             1,941 (19.4%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  1,019 (10.2%
> )       |
  |                                  Current smoker                2,008 (20.1%
> )       |
  |                                  Ex-smoker                     1,471 (14.7%
> )       |
  |                                  Unknown                       5,502 (55.0%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        53.57708 (32
> .03502) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       2,003 (20.0%
> )       |
  |                                  Underweight                   934 ( 9.3%) 
>         |
  |                                  Healthy range                 1,813 (18.1%
> )       |
  |                                  Overweight                    1,931 (19.3%
> )       |
  |                                  Obese                         2,747 (27.5%
> )       |
  |                                  Morbidly obese                568 ( 5.7%) 
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 

. export delimited using ./output/tables/op_chars.csv
file ./output/tables/op_chars.csv saved

. restore

. * Tabulate characteristics by category of outpatient appointments for each ye
> ar
. tempfile tempfile

. forvalues i=2020/2021 {
  2.     preserve
  3.     keep if diff_op_cat_`i'==0
  4.     table1_mc, vars(age_cat cate \ male cate \ urban_rural_5 cate \ prescr
> ibed_biologics cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat cate)
>  clear
  5.     save `tempfile', replace
  6.     restore
  7.     forvalues j=1/2 {
  8.         preserve
  9.         keep if diff_op_cat_`i'==`j'
 10.         table1_mc, vars(age_cat cate \ male cate \ urban_rural_5 cate \ pr
> escribed_biologics cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat c
> ate) clear
 11.         append using `tempfile'
 12.         save `tempfile', replace
 13.         if `j'==2 {
 14.             export delimited using ./output/tables/characteristics_strata`
> i'.csv
 15.         }
 16.         restore
 17.         }
 18.     }
(5,587 observations deleted)

  +------------------------------------------------+
  | factor                             N_1     m_1 |
  |------------------------------------------------|
  | age_cat                          3,488     925 |
  |------------------------------------------------|
  | male                             4,413       0 |
  |------------------------------------------------|
  | Rural Urban in five categories   4,413       0 |
  |------------------------------------------------|
  | prescribed_biologics             4,413       0 |
  |------------------------------------------------|
  | imd                              4,413       0 |
  |------------------------------------------------|
  | smoking                          4,413       0 |
  |------------------------------------------------|
  | time_ra                          1,947   2,466 |
  |------------------------------------------------|
  | bmi_cat                          4,411       2 |
  +------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> -------+
  |                                                                Total       
>        |
  |----------------------------------------------------------------------------
> -------|
  |                                                                N=4,413     
>        |
  |----------------------------------------------------------------------------
> -------|
  | age_cat                          18 - 40 years                 1,282 (36.8%
> )      |
  |                                  41 - 60 years                 1,151 (33.0%
> )      |
  |                                  61 - 80 years                 838 (24.0%) 
>        |
  |                                  >80 years                     217 ( 6.2%) 
>        |
  |----------------------------------------------------------------------------
> -------|
  | male                             Female                        2,275 (51.6%
> )      |
  |                                  Male                          2,138 (48.4%
> )      |
  |----------------------------------------------------------------------------
> -------|
  | Rural Urban in five categories   Urban major conurbation       586 (13.3%) 
>        |
  |                                  Urban minor conurbation       577 (13.1%) 
>        |
  |                                  Urban city and town           1,082 (24.5%
> )      |
  |                                  Rural town and fringe         1,149 (26.0%
> )      |
  |                                  Rural village and dispersed   1,019 (23.1%
> )      |
  |----------------------------------------------------------------------------
> -------|
  | prescribed_biologics             0                             2,198 (49.8%
> )      |
  |                                  1                             2,215 (50.2%
> )      |
  |----------------------------------------------------------------------------
> -------|
  | imd                              0                             217 ( 4.9%) 
>        |
  |                                  1                             870 (19.7%) 
>        |
  |                                  2                             831 (18.8%) 
>        |
  |                                  3                             794 (18.0%) 
>        |
  |                                  4                             837 (19.0%) 
>        |
  |                                  5                             864 (19.6%) 
>        |
  |----------------------------------------------------------------------------
> -------|
  | smoking                          Never smoked                  466 (10.6%) 
>        |
  |                                  Current smoker                872 (19.8%) 
>        |
  |                                  Ex-smoker                     635 (14.4%) 
>        |
  |                                  Unknown                       2,440 (55.3%
> )      |
  |----------------------------------------------------------------------------
> -------|
  | time_ra                                                        53.0548 (32.
> 33194) |
  |----------------------------------------------------------------------------
> -------|
  | bmi_cat                          Missing                       891 (20.2%) 
>        |
  |                                  Underweight                   408 ( 9.2%) 
>        |
  |                                  Healthy range                 793 (18.0%) 
>        |
  |                                  Overweight                    844 (19.1%) 
>        |
  |                                  Obese                         1,221 (27.7%
> )      |
  |                                  Morbidly obese                254 ( 5.8%) 
>        |
  +----------------------------------------------------------------------------
> -------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
(note: file /tmp/St00011.000003 not found)
file /tmp/St00011.000003 saved
(8,780 observations deleted)

  +----------------------------------------------+
  | factor                             N_1   m_1 |
  |----------------------------------------------|
  | age_cat                            952   268 |
  |----------------------------------------------|
  | male                             1,220     0 |
  |----------------------------------------------|
  | Rural Urban in five categories   1,220     0 |
  |----------------------------------------------|
  | prescribed_biologics             1,220     0 |
  |----------------------------------------------|
  | imd                              1,220     0 |
  |----------------------------------------------|
  | smoking                          1,220     0 |
  |----------------------------------------------|
  | time_ra                            543   677 |
  |----------------------------------------------|
  | bmi_cat                          1,220     0 |
  +----------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=1,220     
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 344 (36.1%) 
>         |
  |                                  41 - 60 years                 326 (34.2%) 
>         |
  |                                  61 - 80 years                 226 (23.7%) 
>         |
  |                                  >80 years                     56 ( 5.9%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        633 (51.9%) 
>         |
  |                                  Male                          587 (48.1%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       145 (11.9%) 
>         |
  |                                  Urban minor conurbation       154 (12.6%) 
>         |
  |                                  Urban city and town           301 (24.7%) 
>         |
  |                                  Rural town and fringe         299 (24.5%) 
>         |
  |                                  Rural village and dispersed   321 (26.3%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             608 (49.8%) 
>         |
  |                                  1                             612 (50.2%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             70 ( 5.7%)  
>         |
  |                                  1                             226 (18.5%) 
>         |
  |                                  2                             242 (19.8%) 
>         |
  |                                  3                             234 (19.2%) 
>         |
  |                                  4                             207 (17.0%) 
>         |
  |                                  5                             241 (19.8%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  132 (10.8%) 
>         |
  |                                  Current smoker                237 (19.4%) 
>         |
  |                                  Ex-smoker                     196 (16.1%) 
>         |
  |                                  Unknown                       655 (53.7%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        54.02389 (31
> .12921) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       254 (20.8%) 
>         |
  |                                  Underweight                   119 ( 9.8%) 
>         |
  |                                  Healthy range                 217 (17.8%) 
>         |
  |                                  Overweight                    242 (19.8%) 
>         |
  |                                  Obese                         320 (26.2%) 
>         |
  |                                  Morbidly obese                68 ( 5.6%)  
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000003 saved
(5,633 observations deleted)

  +------------------------------------------------+
  | factor                             N_1     m_1 |
  |------------------------------------------------|
  | age_cat                          3,495     872 |
  |------------------------------------------------|
  | male                             4,367       0 |
  |------------------------------------------------|
  | Rural Urban in five categories   4,367       0 |
  |------------------------------------------------|
  | prescribed_biologics             4,367       0 |
  |------------------------------------------------|
  | imd                              4,367       0 |
  |------------------------------------------------|
  | smoking                          4,367       0 |
  |------------------------------------------------|
  | time_ra                          1,954   2,413 |
  |------------------------------------------------|
  | bmi_cat                          4,365       2 |
  +------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=4,367     
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 1,224 (35.0%
> )       |
  |                                  41 - 60 years                 1,197 (34.2%
> )       |
  |                                  61 - 80 years                 843 (24.1%) 
>         |
  |                                  >80 years                     231 ( 6.6%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        2,232 (51.1%
> )       |
  |                                  Male                          2,135 (48.9%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       528 (12.1%) 
>         |
  |                                  Urban minor conurbation       526 (12.0%) 
>         |
  |                                  Urban city and town           1,124 (25.7%
> )       |
  |                                  Rural town and fringe         1,052 (24.1%
> )       |
  |                                  Rural village and dispersed   1,137 (26.0%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             2,194 (50.2%
> )       |
  |                                  1                             2,173 (49.8%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             206 ( 4.7%) 
>         |
  |                                  1                             825 (18.9%) 
>         |
  |                                  2                             831 (19.0%) 
>         |
  |                                  3                             826 (18.9%) 
>         |
  |                                  4                             843 (19.3%) 
>         |
  |                                  5                             836 (19.1%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  421 ( 9.6%) 
>         |
  |                                  Current smoker                899 (20.6%) 
>         |
  |                                  Ex-smoker                     640 (14.7%) 
>         |
  |                                  Unknown                       2,407 (55.1%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        53.97332 (31
> .99442) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       858 (19.7%) 
>         |
  |                                  Underweight                   407 ( 9.3%) 
>         |
  |                                  Healthy range                 803 (18.4%) 
>         |
  |                                  Overweight                    845 (19.4%) 
>         |
  |                                  Obese                         1,206 (27.6%
> )       |
  |                                  Morbidly obese                246 ( 5.6%) 
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000003 saved
file ./output/tables/characteristics_strata2020.csv saved
(5,581 observations deleted)

  +------------------------------------------------+
  | factor                             N_1     m_1 |
  |------------------------------------------------|
  | age_cat                          3,495     924 |
  |------------------------------------------------|
  | male                             4,419       0 |
  |------------------------------------------------|
  | Rural Urban in five categories   4,419       0 |
  |------------------------------------------------|
  | prescribed_biologics             4,419       0 |
  |------------------------------------------------|
  | imd                              4,419       0 |
  |------------------------------------------------|
  | smoking                          4,419       0 |
  |------------------------------------------------|
  | time_ra                          1,961   2,458 |
  |------------------------------------------------|
  | bmi_cat                          4,419       0 |
  +------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> -------+
  |                                                                Total       
>        |
  |----------------------------------------------------------------------------
> -------|
  |                                                                N=4,419     
>        |
  |----------------------------------------------------------------------------
> -------|
  | age_cat                          18 - 40 years                 1,257 (36.0%
> )      |
  |                                  41 - 60 years                 1,176 (33.6%
> )      |
  |                                  61 - 80 years                 837 (23.9%) 
>        |
  |                                  >80 years                     225 ( 6.4%) 
>        |
  |----------------------------------------------------------------------------
> -------|
  | male                             Female                        2,295 (51.9%
> )      |
  |                                  Male                          2,124 (48.1%
> )      |
  |----------------------------------------------------------------------------
> -------|
  | Rural Urban in five categories   Urban major conurbation       561 (12.7%) 
>        |
  |                                  Urban minor conurbation       573 (13.0%) 
>        |
  |                                  Urban city and town           1,093 (24.7%
> )      |
  |                                  Rural town and fringe         1,122 (25.4%
> )      |
  |                                  Rural village and dispersed   1,070 (24.2%
> )      |
  |----------------------------------------------------------------------------
> -------|
  | prescribed_biologics             0                             2,192 (49.6%
> )      |
  |                                  1                             2,227 (50.4%
> )      |
  |----------------------------------------------------------------------------
> -------|
  | imd                              0                             213 ( 4.8%) 
>        |
  |                                  1                             846 (19.1%) 
>        |
  |                                  2                             818 (18.5%) 
>        |
  |                                  3                             841 (19.0%) 
>        |
  |                                  4                             819 (18.5%) 
>        |
  |                                  5                             882 (20.0%) 
>        |
  |----------------------------------------------------------------------------
> -------|
  | smoking                          Never smoked                  466 (10.5%) 
>        |
  |                                  Current smoker                898 (20.3%) 
>        |
  |                                  Ex-smoker                     657 (14.9%) 
>        |
  |                                  Unknown                       2,398 (54.3%
> )      |
  |----------------------------------------------------------------------------
> -------|
  | time_ra                                                        54.3144 (31.
> 81177) |
  |----------------------------------------------------------------------------
> -------|
  | bmi_cat                          Missing                       890 (20.1%) 
>        |
  |                                  Underweight                   416 ( 9.4%) 
>        |
  |                                  Healthy range                 781 (17.7%) 
>        |
  |                                  Overweight                    856 (19.4%) 
>        |
  |                                  Obese                         1,213 (27.4%
> )      |
  |                                  Morbidly obese                263 ( 6.0%) 
>        |
  +----------------------------------------------------------------------------
> -------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000003 saved
(8,811 observations deleted)

  +----------------------------------------------+
  | factor                             N_1   m_1 |
  |----------------------------------------------|
  | age_cat                            962   227 |
  |----------------------------------------------|
  | male                             1,189     0 |
  |----------------------------------------------|
  | Rural Urban in five categories   1,189     0 |
  |----------------------------------------------|
  | prescribed_biologics             1,189     0 |
  |----------------------------------------------|
  | imd                              1,189     0 |
  |----------------------------------------------|
  | smoking                          1,189     0 |
  |----------------------------------------------|
  | time_ra                            534   655 |
  |----------------------------------------------|
  | bmi_cat                          1,189     0 |
  +----------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=1,189     
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 362 (37.6%) 
>         |
  |                                  41 - 60 years                 320 (33.3%) 
>         |
  |                                  61 - 80 years                 224 (23.3%) 
>         |
  |                                  >80 years                     56 ( 5.8%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        592 (49.8%) 
>         |
  |                                  Male                          597 (50.2%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       169 (14.2%) 
>         |
  |                                  Urban minor conurbation       151 (12.7%) 
>         |
  |                                  Urban city and town           299 (25.1%) 
>         |
  |                                  Rural town and fringe         292 (24.6%) 
>         |
  |                                  Rural village and dispersed   278 (23.4%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             588 (49.5%) 
>         |
  |                                  1                             601 (50.5%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             58 ( 4.9%)  
>         |
  |                                  1                             213 (17.9%) 
>         |
  |                                  2                             235 (19.8%) 
>         |
  |                                  3                             224 (18.8%) 
>         |
  |                                  4                             199 (16.7%) 
>         |
  |                                  5                             260 (21.9%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  122 (10.3%) 
>         |
  |                                  Current smoker                245 (20.6%) 
>         |
  |                                  Ex-smoker                     164 (13.8%) 
>         |
  |                                  Unknown                       658 (55.3%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        51.60062 (32
> .07356) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       253 (21.3%) 
>         |
  |                                  Underweight                   92 ( 7.7%)  
>         |
  |                                  Healthy range                 221 (18.6%) 
>         |
  |                                  Overweight                    209 (17.6%) 
>         |
  |                                  Obese                         354 (29.8%) 
>         |
  |                                  Morbidly obese                60 ( 5.0%)  
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000003 saved
(5,608 observations deleted)

  +------------------------------------------------+
  | factor                             N_1     m_1 |
  |------------------------------------------------|
  | age_cat                          3,478     914 |
  |------------------------------------------------|
  | male                             4,392       0 |
  |------------------------------------------------|
  | Rural Urban in five categories   4,392       0 |
  |------------------------------------------------|
  | prescribed_biologics             4,392       0 |
  |------------------------------------------------|
  | imd                              4,392       0 |
  |------------------------------------------------|
  | smoking                          4,392       0 |
  |------------------------------------------------|
  | time_ra                          1,949   2,443 |
  |------------------------------------------------|
  | bmi_cat                          4,388       4 |
  +------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=4,392     
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 1,231 (35.4%
> )       |
  |                                  41 - 60 years                 1,178 (33.9%
> )       |
  |                                  61 - 80 years                 846 (24.3%) 
>         |
  |                                  >80 years                     223 ( 6.4%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        2,253 (51.3%
> )       |
  |                                  Male                          2,139 (48.7%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       529 (12.0%) 
>         |
  |                                  Urban minor conurbation       533 (12.1%) 
>         |
  |                                  Urban city and town           1,115 (25.4%
> )       |
  |                                  Rural town and fringe         1,086 (24.7%
> )       |
  |                                  Rural village and dispersed   1,129 (25.7%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             2,220 (50.5%
> )       |
  |                                  1                             2,172 (49.5%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             222 ( 5.1%) 
>         |
  |                                  1                             862 (19.6%) 
>         |
  |                                  2                             851 (19.4%) 
>         |
  |                                  3                             789 (18.0%) 
>         |
  |                                  4                             869 (19.8%) 
>         |
  |                                  5                             799 (18.2%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  431 ( 9.8%) 
>         |
  |                                  Current smoker                865 (19.7%) 
>         |
  |                                  Ex-smoker                     650 (14.8%) 
>         |
  |                                  Unknown                       2,446 (55.7%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        53.37674 (32
> .23821) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       860 (19.6%) 
>         |
  |                                  Underweight                   426 ( 9.7%) 
>         |
  |                                  Healthy range                 811 (18.5%) 
>         |
  |                                  Overweight                    866 (19.7%) 
>         |
  |                                  Obese                         1,180 (26.9%
> )       |
  |                                  Morbidly obese                245 ( 5.6%) 
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000003 saved
file ./output/tables/characteristics_strata2021.csv saved

.     /* Tabulate characteristics by whether hospitalised with RA for each year
>     preserve
>     keep if ra_hosp_`i'==1
>     table1_mc, vars(age_cat cate \ male cate \ urban_rural_5 cate \ prescribe
> d_biologics cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat cate) cl
> ear
>     export delimited using ./output/tables/characteristics_ra_hosp_`i'.csv
>     restore
>     }
> preserve
>     keep if ra_hosp_2018==1
>     table1_mc, vars(age_cat cate \ male cate \ urban_rural_5 cate \ prescribe
> d_biologics cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat cate) cl
> ear
>     export delimited using ./output/tables/characteristics_ra_hosp_2018.csv
>     restore
>     */
. log close
      name:  <unnamed>
       log:  /workspace/logs/outpatients.log
  log type:  text
 closed on:  21 Nov 2022, 14:53:11
-------------------------------------------------------------------------------
