
. 
. cap mkdir ./output/tables

. * Import data
. import delimited using ./output/input.csv
(40 vars, 10,000 obs)

. * Check data
. count if age==. 
  0

. count if age<18 
  2,095

. count if age>110 & age!=.
  0

. sum age, d

                             age
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            3              0
10%            8              0       Obs              10,000
25%           21              0       Sum of Wgt.      10,000

50%           40                      Mean            40.3904
                        Largest       Std. Dev.      23.77873
75%           59            105
90%           73            107       Variance       565.4279
95%           79            108       Skewness        .119771
99%         89.5            109       Kurtosis        2.05857

. count if sex==""
  0

. tab sex

        sex |      Freq.     Percent        Cum.
------------+-----------------------------------
          F |      4,959       49.59       49.59
          M |      4,952       49.52       99.11
          U |         89        0.89      100.00
------------+-----------------------------------
      Total |     10,000      100.00

. * Checking RA algorithm variables
. * Checking type of DMARD that meets inclusion
. foreach dmard in metho leflu sulfa hydrox {
  2.     gen `dmard'_multi = (`dmard'_count>=2)
  3.     tab `dmard'_multi if has_dmards==1, m
  4. }

metho_multi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        801       16.02       16.02
          1 |      4,199       83.98      100.00
------------+-----------------------------------
      Total |      5,000      100.00

leflu_multi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        786       15.72       15.72
          1 |      4,214       84.28      100.00
------------+-----------------------------------
      Total |      5,000      100.00

sulfa_multi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        785       15.70       15.70
          1 |      4,215       84.30      100.00
------------+-----------------------------------
      Total |      5,000      100.00

hydrox_mult |
          i |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        788       15.76       15.76
          1 |      4,212       84.24      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. gen dmard_multi = (metho_multi==1 | leflu_multi==1 | sulfa_multi==1 | hydrox_
> multi==1)

. tab dmard_multi has_alt_dmard_diag

dmard_mult |  has_alt_dmard_diag
         i |         0          1 |     Total
-----------+----------------------+----------
         0 |         5          2 |         7 
         1 |     4,995      4,998 |     9,993 
-----------+----------------------+----------
     Total |     5,000      5,000 |    10,000 

. sum number_ra_codes

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
number_ra_~s |     10,000      2.5179    1.046799          0          6

. di "Number where no DMARDs but does have multiple RA codes and no alt diag"
Number where no DMARDs but does have multiple RA codes and no alt diag

. count if has_dmards==0 & number_ra_codes>=2 & alt_diag!=1
  2,097

. tab has_ra, m

     has_ra |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,000       50.00       50.00
          1 |      5,000       50.00      100.00
------------+-----------------------------------
      Total |     10,000      100.00

. keep if has_ra
(5,000 observations deleted)

. * Time since first RA code
. gen first_ra_codeA = date(first_ra_code, "YMD")
(2,726 missing values generated)

. format first_ra_codeA %dD/N/CY

. gen time_ra = (date("01Mar2018", "DMY") - first_ra_codeA)/365.25
(2,726 missing values generated)

. sum time_ra, d

                           time_ra
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .2874743      -.9253936
 5%     5.100616      -.9117043
10%      11.0308      -.8678987       Obs               2,274
25%     27.04175      -.8569473       Sum of Wgt.       2,274

50%     55.48391                      Mean           54.53444
                        Largest       Std. Dev.      31.63853
75%     81.54688       108.7666
90%     98.17385       108.9007       Variance       1000.996
95%     103.0883       108.9363       Skewness      -.0236033
99%      107.707       108.9665       Kurtosis       1.791959

. sum number_ra_codes, d

                       number_ra_codes
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            3                      Mean              2.511
                        Largest       Std. Dev.      1.057971
75%            3              6
90%            4              6       Variance       1.119303
95%            4              6       Skewness       .0172482
99%            5              6       Kurtosis       2.814727

. sum metho_count, d

                         metho_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            2                      Mean             2.4704
                        Largest       Std. Dev.      1.037757
75%            3              6
90%            4              6       Variance       1.076939
95%            4              6       Skewness       .0354786
99%            5              6       Kurtosis       2.934902

. sum sulfa_count, d 

                         sulfa_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            3                      Mean             2.5018
                        Largest       Std. Dev.      1.030053
75%            3              6
90%            4              6       Variance       1.061009
95%            4              6       Skewness       .0440446
99%            5              6       Kurtosis       2.833344

. sum leflu_count, d 

                         leflu_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            3                      Mean             2.4984
                        Largest       Std. Dev.      1.021473
75%            3              5
90%            4              5       Variance       1.043406
95%            4              5       Skewness      -.0052489
99%            5              6       Kurtosis       2.827859

. sum hydrox_count, d 

                        hydrox_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            2                      Mean              2.496
                        Largest       Std. Dev.      1.039712
75%            3              6
90%            4              6       Variance          1.081
95%            4              6       Skewness       .0250709
99%            5              6       Kurtosis       2.933194

. 
. sum outpatient*, d

                    outpatient_appt_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               5,000
25%            6              0       Sum of Wgt.       5,000

50%            7                      Mean             6.7624
                        Largest       Std. Dev.       2.99121
75%            9             14
90%           10             14       Variance       8.947336
95%           11             15       Skewness      -.8442804
99%           12             16       Kurtosis       3.456657

                    outpatient_appt_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            3              0       Obs               5,000
25%            6              0       Sum of Wgt.       5,000

50%            7                      Mean             6.7762
                        Largest       Std. Dev.      2.906579
75%            9             14
90%           10             14       Variance       8.448203
95%           11             14       Skewness      -.8519145
99%           12             15       Kurtosis       3.591445

                    outpatient_appt_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            2              0       Obs               5,000
25%            6              0       Sum of Wgt.       5,000

50%            7                      Mean              6.716
                        Largest       Std. Dev.      2.915106
75%            9             14
90%           10             14       Variance       8.497844
95%           11             14       Skewness      -.8617586
99%           12             16       Kurtosis       3.528138

                   outpatient_medium_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               2,473
25%            2              1       Sum of Wgt.       2,473

50%            4                      Mean           12.98504
                        Largest       Std. Dev.      27.58699
75%            7             98
90%            8             98       Variance       761.0423
95%           98             98       Skewness       2.733949
99%           98             98       Kurtosis       8.555081

                   outpatient_medium_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               2,476
25%            2              1       Sum of Wgt.       2,476

50%            5                      Mean           13.10258
                        Largest       Std. Dev.      27.72315
75%            7             98
90%            8             98       Variance       768.5729
95%           98             98       Skewness       2.713051
99%           98             98       Kurtosis       8.439078

                   outpatient_medium_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               2,517
25%            2              1       Sum of Wgt.       2,517

50%            5                      Mean           13.04926
                        Largest       Std. Dev.      27.61804
75%            7             98
90%            8             98       Variance       762.7559
95%           98             98       Skewness       2.727909
99%           98             98       Kurtosis       8.520789

. 
. * How many people are not on DMARDs and have no RA appointments?
. 
. 
. * Format variables
. *re-order ethnicity
.  gen eth5=1 if ethnicity==1
(3,976 missing values generated)

.  replace eth5=2 if ethnicity==3
(1,048 real changes made)

.  replace eth5=3 if ethnicity==4
(992 real changes made)

.  replace eth5=4 if ethnicity==2
(960 real changes made)

.  replace eth5=5 if ethnicity==5
(976 real changes made)

.  replace eth5=. if ethnicity==.
(0 real changes made)

. 
.  label define eth5                      1 "White"                            
>            ///
>                                                         2 "South Asian"      
>                    ///                                             
>                                                         3 "Black"            
>                            ///
>                                                         4 "Mixed"            
>                            ///
>                                                         5 "Other"            
>                            

.                                         
. 
. label values eth5 eth5

. safetab eth5, m
5

       eth5 |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |      1,024       20.48       20.48
South Asian |      1,048       20.96       41.44
      Black |        992       19.84       61.28
      Mixed |        960       19.20       80.48
      Other |        976       19.52      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. 
. * formatting gender
. gen male=(sex=="M")

. replace male = 0 if sex == "F"
(0 real changes made)

. label define male 0"Female" 1"Male"

. label values male male

. safetab male, miss
5

       male |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |      2,566       51.32       51.32
       Male |      2,434       48.68      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. 
. *create a 4 category rural urban variable 
. generate urban_rural_5=.
(5,000 missing values generated)

. la var urban_rural_5 "Rural Urban in five categories"

. replace urban_rural_5=1 if urban_rural==1
(638 real changes made)

. replace urban_rural_5=2 if urban_rural==2
(618 real changes made)

. replace urban_rural_5=3 if urban_rural==3|urban_rural==4
(1,274 real changes made)

. replace urban_rural_5=4 if urban_rural==5|urban_rural==6
(1,234 real changes made)

. replace urban_rural_5=5 if urban_rural==7|urban_rural==8
(1,236 real changes made)

. label define urban_rural_5 1 "Urban major conurbation" 2 "Urban minor conurba
> tion" 3 "Urban city and town" 4 "Rural town and fringe" 5 "Rural village and 
> dispersed"

. label values urban_rural_5 urban_rural_5

. safetab urban_rural_5, miss
14

        Rural Urban in five |
                 categories |      Freq.     Percent        Cum.
----------------------------+-----------------------------------
    Urban major conurbation |        638       12.76       12.76
    Urban minor conurbation |        618       12.36       25.12
        Urban city and town |      1,274       25.48       50.60
      Rural town and fringe |      1,234       24.68       75.28
Rural village and dispersed |      1,236       24.72      100.00
----------------------------+-----------------------------------
                      Total |      5,000      100.00

. 
. *generate a binary rural urban (with missing assigned to urban)
. generate urban_rural_bin=.
(5,000 missing values generated)

. replace urban_rural_bin=1 if urban_rural<=4|urban_rural==.
(2,530 real changes made)

. replace urban_rural_bin=0 if urban_rural>4 & urban_rural!=.
(2,470 real changes made)

. label define urban_rural_bin 0 "Rural" 1 "Urban"

. label values urban_rural_bin urban_rural_bin

. safetab urban_rural_bin urban_rural, miss
28

urban_rura |                      urban_rural
     l_bin |         1          2          3          4          5 |     Total
-----------+-------------------------------------------------------+----------
     Rural |         0          0          0          0        633 |     2,470 
     Urban |       638        618        645        629          0 |     2,530 
-----------+-------------------------------------------------------+----------
     Total |       638        618        645        629        633 |     5,000 


urban_rura |           urban_rural
     l_bin |         6          7          8 |     Total
-----------+---------------------------------+----------
     Rural |       601        623        613 |     2,470 
     Urban |         0          0          0 |     2,530 
-----------+---------------------------------+----------
     Total |       601        623        613 |     5,000 

. label var urban_rural_bin "Rural-Urban"

. 
. * Define age categories
. * Create age categories
. egen age_cat = cut(age), at(18, 40, 60, 80, 120) icodes
(1057 missing values generated)

. label define age 0 "18 - 40 years" 1 "41 - 60 years" 2 "61 - 80 years" 3 ">80
>  years"

. label values age_cat age

. safetab age_cat, miss
8

      age_cat |      Freq.     Percent        Cum.
--------------+-----------------------------------
18 - 40 years |      1,447       28.94       28.94
41 - 60 years |      1,311       26.22       55.16
61 - 80 years |        944       18.88       74.04
    >80 years |        241        4.82       78.86
            . |      1,057       21.14      100.00
--------------+-----------------------------------
        Total |      5,000      100.00

. 
. * Smoking status
. gen smoking = 0 if smoking_status=="N"
(4,450 missing values generated)

. replace smoking = 1 if smoking_status=="S"
(981 real changes made)

. replace smoking = 2 if smoking_status=="E"
(718 real changes made)

. replace smoking = 3 if smoking==.
(2,751 real changes made)

. 
. label define smok 1 "Current smoker" 2 "Ex-smoker" 0 "Never smoked" 3 "Unknow
> n"

. label values smoking smok

. 
. * BMI categories
. egen bmi_cat = cut(bmi), at(0, 1, 18.5, 24.9, 29.9, 39.9, 100) icodes
(2 missing values generated)

. bys bmi_cat: sum bmi

-------------------------------------------------------------------------------
-> bmi_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |      1,013           0           0          0          0

-------------------------------------------------------------------------------
-> bmi_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        451     14.7512    3.304418   1.112003   18.49301

-------------------------------------------------------------------------------
-> bmi_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        923     22.0311    1.833288   18.50301    24.8975

-------------------------------------------------------------------------------
-> bmi_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |      1,000    27.42017    1.413309   24.90034   29.89699

-------------------------------------------------------------------------------
-> bmi_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |      1,334    33.99916     2.77707   29.90076   39.88721

-------------------------------------------------------------------------------
-> bmi_cat = 5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        277    43.60535    3.153111   39.91406   55.23236

-------------------------------------------------------------------------------
-> bmi_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |          2   -3.729728     1.22243  -4.594117  -2.865339


. label define bmi 0 "Missing" 1 "Underweight" 2 "Healthy range" 3 "Overweight"
>  4 "Obese" 5 "Morbidly obese"

. label values bmi_cat bmi

. 
. * Determine if still in follow-up for each year
. * Format dates
. gen died_fuA = date(died_fu, "YMD")
(2,474 missing values generated)

. gen dereg_dateA = date(dereg_date, "YMD")
(2,495 missing values generated)

. gen end_fu = date("`j'-03-31", "YMD")
(5,000 missing values generated)

. gen end_date = min(died_fuA, dereg_dateA, end_fu)
(1,219 missing values generated)

. drop end_fu

. sum end_date

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    end_date |      3,781    22420.04    285.1061      21976      22970

. di "Number where end date prior to follow-up start"
Number where end date prior to follow-up start

. count if end_date<date("2019-04-01", "YMD")
  0

. * determine range of dates for outpatient appointments to determine which sho
> uld be dropped
. gen end_2020 = end_date<date("2020-03-31", "YMD")

. gen end_2021 = end_date<date("2021-03-31", "YMD")

. gen end_2022 = end_date<date("2022-03-31", "YMD")

. tab end_2020

   end_2020 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,852       97.04       97.04
          1 |        148        2.96      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. tab end_2021

   end_2021 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,193       63.86       63.86
          1 |      1,807       36.14      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. tab end_2022

   end_2022 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,921       38.42       38.42
          1 |      3,079       61.58      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. * Set outpatient appointment count to missing if end prior to the end of the 
> year 
. forvalues i=2019/2021 {
  2.     local j=`i'+1
  3.     di `j'
  4.     replace outpatient_appt_`i'=. if end_`j'
  5.     replace outpatient_medium_`i'=. if end_`j'
  6. }
2020
(148 real changes made, 148 to missing)
(76 real changes made, 76 to missing)
2021
(1,807 real changes made, 1,807 to missing)
(873 real changes made, 873 to missing)
2022
(3,079 real changes made, 3,079 to missing)
(1,549 real changes made, 1,549 to missing)

. 
. * Categorise number of outpatient appointments
. label define appt 0 "No appointments" 1 "1-2 per year" 2 "3 or more per year"
>  

. forvalues i=2019/2021 {
  2.     egen op_appt_`i'_cat = cut(outpatient_appt_`i'), at(0, 1, 3, 1000) ico
> des
  3.     label values op_appt_`i'_cat appt
  4.     local j=`i'+1
  5.     replace op_appt_`i'_cat=. if end_`j'==1
  6.     }
(148 missing values generated)
(0 real changes made)
(1807 missing values generated)
(0 real changes made)
(3079 missing values generated)
(0 real changes made)

. 
. * Calculate difference compared to 2019
. gen diff_op_2020 = outpatient_appt_2020 - outpatient_appt_2019
(1,807 missing values generated)

. gen diff_op_2021 = outpatient_appt_2021 - outpatient_appt_2019
(3,079 missing values generated)

. sum diff_op_2020 diff_op_2021, d

                        diff_op_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%          -10            -13
 5%           -7            -12
10%           -5            -12       Obs               3,193
25%           -2            -12       Sum of Wgt.       3,193

50%            0                      Mean           .0714062
                        Largest       Std. Dev.      4.211949
75%            3             12
90%            6             12       Variance       17.74051
95%            8             12       Skewness       .0278021
99%           10             13       Kurtosis       3.083792

                        diff_op_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%           -9            -13
 5%           -7            -13
10%           -5            -12       Obs               1,921
25%           -2            -12       Sum of Wgt.       1,921

50%            0                      Mean           .0265487
                        Largest       Std. Dev.      4.203523
75%            2             13
90%            6             13       Variance       17.66961
95%            8             14       Skewness       .1116568
99%           10             16       Kurtosis         3.2764

. 
. egen diff_op_cat_2020 = cut(diff_op_2020), at(-100, 0, 1, 100) icodes
(1807 missing values generated)

. egen diff_op_cat_2021 = cut(diff_op_2021), at(-100, 0, 1, 100) icodes
(3079 missing values generated)

. label define op_cat 0 "Fewer appointments" 1 "Same number of appointments" 2 
> "More appointments"

. label values diff_op_cat_2020 op_cat

. label values diff_op_cat_2021 op_cat

. tab diff_op_cat_2020 op_appt_2020_cat

                      |         op_appt_2020_cat
     diff_op_cat_2020 | No appoin  1-2 per y  3 or more |     Total
----------------------+---------------------------------+----------
   Fewer appointments |       274         12      1,120 |     1,406 
Same number of appoin |        30          0        344 |       374 
    More appointments |         0          3      1,410 |     1,413 
----------------------+---------------------------------+----------
                Total |       304         15      2,874 |     3,193 

. tab diff_op_cat_2021 op_appt_2021_cat

                      |         op_appt_2021_cat
     diff_op_cat_2021 | No appoin  1-2 per y  3 or more |     Total
----------------------+---------------------------------+----------
   Fewer appointments |       168         12        671 |       851 
Same number of appoin |        23          0        213 |       236 
    More appointments |         0          0        834 |       834 
----------------------+---------------------------------+----------
                Total |       191         12      1,718 |     1,921 

. bys diff_op_cat_2020: sum diff_op_2020

-------------------------------------------------------------------------------
-> diff_op_cat_2020 = Fewer appointments

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
diff_op_2020 |      1,406   -3.583215    2.557212        -13         -1

-------------------------------------------------------------------------------
-> diff_op_cat_2020 = Same number of appointments

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
diff_op_2020 |        374           0           0          0          0

-------------------------------------------------------------------------------
-> diff_op_cat_2020 = More appointments

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
diff_op_2020 |      1,413    3.726822      2.6316          1         13

-------------------------------------------------------------------------------
-> diff_op_cat_2020 = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
diff_op_2020 |          0


. 
. preserve

. * Tabulate number of appointments per year
. table1_mc, vars(op_appt_2019_cat cate \ op_appt_2020_cat cate \ op_appt_2021_
> cat cate \ diff_op_2020 conts \ diff_op_2021 conts \ diff_op_cat_2020 cate \ 
> diff_op_cat_2021 cate) clear

  +----------------------------------+
  | factor               N_1     m_1 |
  |----------------------------------|
  | op_appt_2019_cat   4,852     148 |
  |----------------------------------|
  | op_appt_2020_cat   3,193   1,807 |
  |----------------------------------|
  | op_appt_2021_cat   1,921   3,079 |
  |----------------------------------|
  | diff_op_2020       3,193   1,807 |
  |----------------------------------|
  | diff_op_2021       1,921   3,079 |
  |----------------------------------|
  | diff_op_cat_2020   3,193   1,807 |
  |----------------------------------|
  | diff_op_cat_2021   1,921   3,079 |
  +----------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------+
  |                                                  Total         |
  |----------------------------------------------------------------|
  |                                                  N=5,000       |
  |----------------------------------------------------------------|
  | op_appt_2019_cat   No appointments               501 (10.3%)   |
  |                    1-2 per year                  26 ( 0.5%)    |
  |                    3 or more per year            4,325 (89.1%) |
  |----------------------------------------------------------------|
  | op_appt_2020_cat   No appointments               304 ( 9.5%)   |
  |                    1-2 per year                  15 ( 0.5%)    |
  |                    3 or more per year            2,874 (90.0%) |
  |----------------------------------------------------------------|
  | op_appt_2021_cat   No appointments               191 ( 9.9%)   |
  |                    1-2 per year                  12 ( 0.6%)    |
  |                    3 or more per year            1,718 (89.4%) |
  |----------------------------------------------------------------|
  | diff_op_2020                                     0 (-2-3)      |
  |----------------------------------------------------------------|
  | diff_op_2021                                     0 (-2-2)      |
  |----------------------------------------------------------------|
  | diff_op_cat_2020   Fewer appointments            1,406 (44.0%) |
  |                    Same number of appointments   374 (11.7%)   |
  |                    More appointments             1,413 (44.3%) |
  |----------------------------------------------------------------|
  | diff_op_cat_2021   Fewer appointments            851 (44.3%)   |
  |                    Same number of appointments   236 (12.3%)   |
  |                    More appointments             834 (43.4%)   |
  +----------------------------------------------------------------+
Data are presented as median (IQR) for continuous measures, and n (%) for categ
> orical measures.
 

. export delimited using ./output/tables/op_appt_yrs.csv
file ./output/tables/op_appt_yrs.csv saved

. restore 

. * Tabulate overall characteristics 
. preserve

. table1_mc, vars(age_cat cate \ male cate \ urban_rural_5 cate \ prescribed_bi
> ologics cate \ imd cate \  smoking cate \ time_ra contn \ bmi_cat cate) clear

  +------------------------------------------------+
  | factor                             N_1     m_1 |
  |------------------------------------------------|
  | age_cat                          3,943   1,057 |
  |------------------------------------------------|
  | male                             5,000       0 |
  |------------------------------------------------|
  | Rural Urban in five categories   5,000       0 |
  |------------------------------------------------|
  | prescribed_biologics             5,000       0 |
  |------------------------------------------------|
  | imd                              5,000       0 |
  |------------------------------------------------|
  | smoking                          5,000       0 |
  |------------------------------------------------|
  | time_ra                          2,274   2,726 |
  |------------------------------------------------|
  | bmi_cat                          4,998       2 |
  +------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=5,000     
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 1,447 (36.7%
> )       |
  |                                  41 - 60 years                 1,311 (33.2%
> )       |
  |                                  61 - 80 years                 944 (23.9%) 
>         |
  |                                  >80 years                     241 ( 6.1%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        2,566 (51.3%
> )       |
  |                                  Male                          2,434 (48.7%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       638 (12.8%) 
>         |
  |                                  Urban minor conurbation       618 (12.4%) 
>         |
  |                                  Urban city and town           1,274 (25.5%
> )       |
  |                                  Rural town and fringe         1,234 (24.7%
> )       |
  |                                  Rural village and dispersed   1,236 (24.7%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             2,509 (50.2%
> )       |
  |                                  1                             2,491 (49.8%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             210 ( 4.2%) 
>         |
  |                                  1                             935 (18.7%) 
>         |
  |                                  2                             931 (18.6%) 
>         |
  |                                  3                             1,002 (20.0%
> )       |
  |                                  4                             970 (19.4%) 
>         |
  |                                  5                             952 (19.0%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  550 (11.0%) 
>         |
  |                                  Current smoker                981 (19.6%) 
>         |
  |                                  Ex-smoker                     718 (14.4%) 
>         |
  |                                  Unknown                       2,751 (55.0%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        54.53444 (31
> .63853) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       1,013 (20.3%
> )       |
  |                                  Underweight                   451 ( 9.0%) 
>         |
  |                                  Healthy range                 923 (18.5%) 
>         |
  |                                  Overweight                    1,000 (20.0%
> )       |
  |                                  Obese                         1,334 (26.7%
> )       |
  |                                  Morbidly obese                277 ( 5.5%) 
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 

. export delimited using ./output/tables/op_chars.csv
file ./output/tables/op_chars.csv saved

. restore

. * Tabulate characteristics by category of outpatient appointments for each ye
> ar
. tempfile tempfile

. forvalues i=2020/2021 {
  2.     preserve
  3.     keep if diff_op_cat_`i'==0
  4.     table1_mc, vars(age_cat cate \ male cate \ urban_rural_5 cate \ prescr
> ibed_biologics cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat cate)
>  clear
  5.     save `tempfile', replace
  6.     restore
  7.     forvalues j=1/2 {
  8.         preserve
  9.         keep if diff_op_cat_`i'==`j'
 10.         table1_mc, vars(age_cat cate \ male cate \ urban_rural_5 cate \ pr
> escribed_biologics cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat c
> ate) clear
 11.         append using `tempfile'
 12.         save `tempfile', replace
 13.         if `j'==2 {
 14.             export delimited using ./output/tables/characteristics_strata`
> i'.csv
 15.         }
 16.         restore
 17.         }
 18.     }
(3,594 observations deleted)

  +----------------------------------------------+
  | factor                             N_1   m_1 |
  |----------------------------------------------|
  | age_cat                          1,106   300 |
  |----------------------------------------------|
  | male                             1,406     0 |
  |----------------------------------------------|
  | Rural Urban in five categories   1,406     0 |
  |----------------------------------------------|
  | prescribed_biologics             1,406     0 |
  |----------------------------------------------|
  | imd                              1,406     0 |
  |----------------------------------------------|
  | smoking                          1,406     0 |
  |----------------------------------------------|
  | time_ra                            616   790 |
  |----------------------------------------------|
  | bmi_cat                          1,406     0 |
  +----------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=1,406     
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 425 (38.4%) 
>         |
  |                                  41 - 60 years                 365 (33.0%) 
>         |
  |                                  61 - 80 years                 250 (22.6%) 
>         |
  |                                  >80 years                     66 ( 6.0%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        714 (50.8%) 
>         |
  |                                  Male                          692 (49.2%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       216 (15.4%) 
>         |
  |                                  Urban minor conurbation       165 (11.7%) 
>         |
  |                                  Urban city and town           335 (23.8%) 
>         |
  |                                  Rural town and fringe         349 (24.8%) 
>         |
  |                                  Rural village and dispersed   341 (24.3%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             685 (48.7%) 
>         |
  |                                  1                             721 (51.3%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             75 ( 5.3%)  
>         |
  |                                  1                             250 (17.8%) 
>         |
  |                                  2                             237 (16.9%) 
>         |
  |                                  3                             307 (21.8%) 
>         |
  |                                  4                             270 (19.2%) 
>         |
  |                                  5                             267 (19.0%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  144 (10.2%) 
>         |
  |                                  Current smoker                287 (20.4%) 
>         |
  |                                  Ex-smoker                     203 (14.4%) 
>         |
  |                                  Unknown                       772 (54.9%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        53.84676 (32
> .03775) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       287 (20.4%) 
>         |
  |                                  Underweight                   135 ( 9.6%) 
>         |
  |                                  Healthy range                 270 (19.2%) 
>         |
  |                                  Overweight                    272 (19.3%) 
>         |
  |                                  Obese                         373 (26.5%) 
>         |
  |                                  Morbidly obese                69 ( 4.9%)  
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
(note: file /tmp/St00011.000003 not found)
file /tmp/St00011.000003 saved
(4,626 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                          289    85 |
  |--------------------------------------------|
  | male                             374     0 |
  |--------------------------------------------|
  | Rural Urban in five categories   374     0 |
  |--------------------------------------------|
  | prescribed_biologics             374     0 |
  |--------------------------------------------|
  | imd                              374     0 |
  |--------------------------------------------|
  | smoking                          374     0 |
  |--------------------------------------------|
  | time_ra                          190   184 |
  |--------------------------------------------|
  | bmi_cat                          374     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=374       
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 111 (38.4%) 
>         |
  |                                  41 - 60 years                 100 (34.6%) 
>         |
  |                                  61 - 80 years                 65 (22.5%)  
>         |
  |                                  >80 years                     13 ( 4.5%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        195 (52.1%) 
>         |
  |                                  Male                          179 (47.9%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       40 (10.7%)  
>         |
  |                                  Urban minor conurbation       56 (15.0%)  
>         |
  |                                  Urban city and town           101 (27.0%) 
>         |
  |                                  Rural town and fringe         92 (24.6%)  
>         |
  |                                  Rural village and dispersed   85 (22.7%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             189 (50.5%) 
>         |
  |                                  1                             185 (49.5%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             17 ( 4.5%)  
>         |
  |                                  1                             72 (19.3%)  
>         |
  |                                  2                             65 (17.4%)  
>         |
  |                                  3                             67 (17.9%)  
>         |
  |                                  4                             66 (17.6%)  
>         |
  |                                  5                             87 (23.3%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  45 (12.0%)  
>         |
  |                                  Current smoker                68 (18.2%)  
>         |
  |                                  Ex-smoker                     54 (14.4%)  
>         |
  |                                  Unknown                       207 (55.3%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        55.21337 (30
> .82197) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       87 (23.3%)  
>         |
  |                                  Underweight                   37 ( 9.9%)  
>         |
  |                                  Healthy range                 60 (16.0%)  
>         |
  |                                  Overweight                    76 (20.3%)  
>         |
  |                                  Obese                         92 (24.6%)  
>         |
  |                                  Morbidly obese                22 ( 5.9%)  
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000003 saved
(3,587 observations deleted)

  +----------------------------------------------+
  | factor                             N_1   m_1 |
  |----------------------------------------------|
  | age_cat                          1,101   312 |
  |----------------------------------------------|
  | male                             1,413     0 |
  |----------------------------------------------|
  | Rural Urban in five categories   1,413     0 |
  |----------------------------------------------|
  | prescribed_biologics             1,413     0 |
  |----------------------------------------------|
  | imd                              1,413     0 |
  |----------------------------------------------|
  | smoking                          1,413     0 |
  |----------------------------------------------|
  | time_ra                            645   768 |
  |----------------------------------------------|
  | bmi_cat                          1,412     1 |
  +----------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=1,413     
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 385 (35.0%) 
>         |
  |                                  41 - 60 years                 382 (34.7%) 
>         |
  |                                  61 - 80 years                 264 (24.0%) 
>         |
  |                                  >80 years                     70 ( 6.4%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        705 (49.9%) 
>         |
  |                                  Male                          708 (50.1%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       154 (10.9%) 
>         |
  |                                  Urban minor conurbation       164 (11.6%) 
>         |
  |                                  Urban city and town           381 (27.0%) 
>         |
  |                                  Rural town and fringe         344 (24.3%) 
>         |
  |                                  Rural village and dispersed   370 (26.2%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             731 (51.7%) 
>         |
  |                                  1                             682 (48.3%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             46 ( 3.3%)  
>         |
  |                                  1                             262 (18.5%) 
>         |
  |                                  2                             265 (18.8%) 
>         |
  |                                  3                             288 (20.4%) 
>         |
  |                                  4                             273 (19.3%) 
>         |
  |                                  5                             279 (19.7%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  150 (10.6%) 
>         |
  |                                  Current smoker                280 (19.8%) 
>         |
  |                                  Ex-smoker                     192 (13.6%) 
>         |
  |                                  Unknown                       791 (56.0%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        54.12313 (32
> .45661) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       279 (19.8%) 
>         |
  |                                  Underweight                   125 ( 8.9%) 
>         |
  |                                  Healthy range                 264 (18.7%) 
>         |
  |                                  Overweight                    289 (20.5%) 
>         |
  |                                  Obese                         380 (26.9%) 
>         |
  |                                  Morbidly obese                75 ( 5.3%)  
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000003 saved
file ./output/tables/characteristics_strata2020.csv saved
(4,149 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                          653   198 |
  |--------------------------------------------|
  | male                             851     0 |
  |--------------------------------------------|
  | Rural Urban in five categories   851     0 |
  |--------------------------------------------|
  | prescribed_biologics             851     0 |
  |--------------------------------------------|
  | imd                              851     0 |
  |--------------------------------------------|
  | smoking                          851     0 |
  |--------------------------------------------|
  | time_ra                          374   477 |
  |--------------------------------------------|
  | bmi_cat                          851     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> -------+
  |                                                                Total       
>        |
  |----------------------------------------------------------------------------
> -------|
  |                                                                N=851       
>        |
  |----------------------------------------------------------------------------
> -------|
  | age_cat                          18 - 40 years                 263 (40.3%) 
>        |
  |                                  41 - 60 years                 210 (32.2%) 
>        |
  |                                  61 - 80 years                 145 (22.2%) 
>        |
  |                                  >80 years                     35 ( 5.4%)  
>        |
  |----------------------------------------------------------------------------
> -------|
  | male                             Female                        444 (52.2%) 
>        |
  |                                  Male                          407 (47.8%) 
>        |
  |----------------------------------------------------------------------------
> -------|
  | Rural Urban in five categories   Urban major conurbation       118 (13.9%) 
>        |
  |                                  Urban minor conurbation       110 (12.9%) 
>        |
  |                                  Urban city and town           215 (25.3%) 
>        |
  |                                  Rural town and fringe         212 (24.9%) 
>        |
  |                                  Rural village and dispersed   196 (23.0%) 
>        |
  |----------------------------------------------------------------------------
> -------|
  | prescribed_biologics             0                             422 (49.6%) 
>        |
  |                                  1                             429 (50.4%) 
>        |
  |----------------------------------------------------------------------------
> -------|
  | imd                              0                             35 ( 4.1%)  
>        |
  |                                  1                             147 (17.3%) 
>        |
  |                                  2                             140 (16.5%) 
>        |
  |                                  3                             194 (22.8%) 
>        |
  |                                  4                             167 (19.6%) 
>        |
  |                                  5                             168 (19.7%) 
>        |
  |----------------------------------------------------------------------------
> -------|
  | smoking                          Never smoked                  90 (10.6%)  
>        |
  |                                  Current smoker                170 (20.0%) 
>        |
  |                                  Ex-smoker                     113 (13.3%) 
>        |
  |                                  Unknown                       478 (56.2%) 
>        |
  |----------------------------------------------------------------------------
> -------|
  | time_ra                                                        56.73711 (32
> .1734) |
  |----------------------------------------------------------------------------
> -------|
  | bmi_cat                          Missing                       173 (20.3%) 
>        |
  |                                  Underweight                   71 ( 8.3%)  
>        |
  |                                  Healthy range                 168 (19.7%) 
>        |
  |                                  Overweight                    170 (20.0%) 
>        |
  |                                  Obese                         225 (26.4%) 
>        |
  |                                  Morbidly obese                44 ( 5.2%)  
>        |
  +----------------------------------------------------------------------------
> -------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000003 saved
(4,764 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                          185    51 |
  |--------------------------------------------|
  | male                             236     0 |
  |--------------------------------------------|
  | Rural Urban in five categories   236     0 |
  |--------------------------------------------|
  | prescribed_biologics             236     0 |
  |--------------------------------------------|
  | imd                              236     0 |
  |--------------------------------------------|
  | smoking                          236     0 |
  |--------------------------------------------|
  | time_ra                          107   129 |
  |--------------------------------------------|
  | bmi_cat                          236     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=236       
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 74 (40.0%)  
>         |
  |                                  41 - 60 years                 48 (25.9%)  
>         |
  |                                  61 - 80 years                 44 (23.8%)  
>         |
  |                                  >80 years                     19 (10.3%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        112 (47.5%) 
>         |
  |                                  Male                          124 (52.5%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       28 (11.9%)  
>         |
  |                                  Urban minor conurbation       21 ( 8.9%)  
>         |
  |                                  Urban city and town           72 (30.5%)  
>         |
  |                                  Rural town and fringe         58 (24.6%)  
>         |
  |                                  Rural village and dispersed   57 (24.2%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             121 (51.3%) 
>         |
  |                                  1                             115 (48.7%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             5 ( 2.1%)   
>         |
  |                                  1                             41 (17.4%)  
>         |
  |                                  2                             41 (17.4%)  
>         |
  |                                  3                             49 (20.8%)  
>         |
  |                                  4                             38 (16.1%)  
>         |
  |                                  5                             62 (26.3%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  24 (10.2%)  
>         |
  |                                  Current smoker                42 (17.8%)  
>         |
  |                                  Ex-smoker                     40 (16.9%)  
>         |
  |                                  Unknown                       130 (55.1%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        57.04062 (30
> .93827) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       47 (19.9%)  
>         |
  |                                  Underweight                   22 ( 9.3%)  
>         |
  |                                  Healthy range                 52 (22.0%)  
>         |
  |                                  Overweight                    46 (19.5%)  
>         |
  |                                  Obese                         53 (22.5%)  
>         |
  |                                  Morbidly obese                16 ( 6.8%)  
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000003 saved
(4,166 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                          661   173 |
  |--------------------------------------------|
  | male                             834     0 |
  |--------------------------------------------|
  | Rural Urban in five categories   834     0 |
  |--------------------------------------------|
  | prescribed_biologics             834     0 |
  |--------------------------------------------|
  | imd                              834     0 |
  |--------------------------------------------|
  | smoking                          834     0 |
  |--------------------------------------------|
  | time_ra                          388   446 |
  |--------------------------------------------|
  | bmi_cat                          833     1 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> -------+
  |                                                                Total       
>        |
  |----------------------------------------------------------------------------
> -------|
  |                                                                N=834       
>        |
  |----------------------------------------------------------------------------
> -------|
  | age_cat                          18 - 40 years                 223 (33.7%) 
>        |
  |                                  41 - 60 years                 238 (36.0%) 
>        |
  |                                  61 - 80 years                 167 (25.3%) 
>        |
  |                                  >80 years                     33 ( 5.0%)  
>        |
  |----------------------------------------------------------------------------
> -------|
  | male                             Female                        412 (49.4%) 
>        |
  |                                  Male                          422 (50.6%) 
>        |
  |----------------------------------------------------------------------------
> -------|
  | Rural Urban in five categories   Urban major conurbation       98 (11.8%)  
>        |
  |                                  Urban minor conurbation       94 (11.3%)  
>        |
  |                                  Urban city and town           208 (24.9%) 
>        |
  |                                  Rural town and fringe         203 (24.3%) 
>        |
  |                                  Rural village and dispersed   231 (27.7%) 
>        |
  |----------------------------------------------------------------------------
> -------|
  | prescribed_biologics             0                             407 (48.8%) 
>        |
  |                                  1                             427 (51.2%) 
>        |
  |----------------------------------------------------------------------------
> -------|
  | imd                              0                             39 ( 4.7%)  
>        |
  |                                  1                             155 (18.6%) 
>        |
  |                                  2                             158 (18.9%) 
>        |
  |                                  3                             169 (20.3%) 
>        |
  |                                  4                             161 (19.3%) 
>        |
  |                                  5                             152 (18.2%) 
>        |
  |----------------------------------------------------------------------------
> -------|
  | smoking                          Never smoked                  89 (10.7%)  
>        |
  |                                  Current smoker                161 (19.3%) 
>        |
  |                                  Ex-smoker                     126 (15.1%) 
>        |
  |                                  Unknown                       458 (54.9%) 
>        |
  |----------------------------------------------------------------------------
> -------|
  | time_ra                                                        52.72499 (32
> .5504) |
  |----------------------------------------------------------------------------
> -------|
  | bmi_cat                          Missing                       167 (20.0%) 
>        |
  |                                  Underweight                   76 ( 9.1%)  
>        |
  |                                  Healthy range                 139 (16.7%) 
>        |
  |                                  Overweight                    178 (21.4%) 
>        |
  |                                  Obese                         226 (27.1%) 
>        |
  |                                  Morbidly obese                47 ( 5.6%)  
>        |
  +----------------------------------------------------------------------------
> -------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
(note: variable Total was str18, now str19 to accommodate using data's
       values)
file /tmp/St00011.000003 saved
file ./output/tables/characteristics_strata2021.csv saved

.     /* Tabulate characteristics by whether hospitalised with RA for each year
>     preserve
>     keep if ra_hosp_`i'==1
>     table1_mc, vars(age_cat cate \ male cate \ urban_rural_5 cate \ prescribe
> d_biologics cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat cate) cl
> ear
>     export delimited using ./output/tables/characteristics_ra_hosp_`i'.csv
>     restore
>     }
> preserve
>     keep if ra_hosp_2018==1
>     table1_mc, vars(age_cat cate \ male cate \ urban_rural_5 cate \ prescribe
> d_biologics cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat cate) cl
> ear
>     export delimited using ./output/tables/characteristics_ra_hosp_2018.csv
>     restore
>     */
. log close
      name:  <unnamed>
       log:  /workspace/logs/outpatients.log
  log type:  text
 closed on:  23 Nov 2022, 16:48:05
-------------------------------------------------------------------------------
