
. 
. cap mkdir ./output/tables/

. cap mkdir ./output/tempdata

. 
. * Import data
. import delimited using ./output/input.csv
(51 vars, 10,000 obs)

. * Check data
. count if age==. 
  0

. count if age<18 
  2,109

. count if age>110 & age!=.
  0

. sum age, d

                             age
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            4              0
10%            8              0       Obs              10,000
25%           21              0       Sum of Wgt.      10,000

50%           39                      Mean             40.081
                        Largest       Std. Dev.      23.43283
75%           59             99
90%           72             99       Variance       549.0975
95%           79            105       Skewness       .1474981
99%           89            108       Kurtosis       2.054333

. count if sex==""
  0

. tab sex

        sex |      Freq.     Percent        Cum.
------------+-----------------------------------
          F |      5,067       50.67       50.67
          M |      4,836       48.36       99.03
          U |         97        0.97      100.00
------------+-----------------------------------
      Total |     10,000      100.00

. * Checking RA algorithm variables
. * Checking type of DMARD that meets inclusion
. foreach dmard in metho leflu sulfa hydrox {
  2.     gen `dmard'_multi = (`dmard'_count>=2)
  3.     tab `dmard'_multi if has_dmards==1, m
  4. }

metho_multi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        773       15.46       15.46
          1 |      4,227       84.54      100.00
------------+-----------------------------------
      Total |      5,000      100.00

leflu_multi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        829       16.58       16.58
          1 |      4,171       83.42      100.00
------------+-----------------------------------
      Total |      5,000      100.00

sulfa_multi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        827       16.54       16.54
          1 |      4,173       83.46      100.00
------------+-----------------------------------
      Total |      5,000      100.00

hydrox_mult |
          i |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        809       16.18       16.18
          1 |      4,191       83.82      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. gen dmard_multi = (metho_multi==1 | leflu_multi==1 | sulfa_multi==1 | hydrox_
> multi==1)

. tab dmard_multi has_alt_dmard_diag

dmard_mult |  has_alt_dmard_diag
         i |         0          1 |     Total
-----------+----------------------+----------
         0 |         4          2 |         6 
         1 |     4,996      4,998 |     9,994 
-----------+----------------------+----------
     Total |     5,000      5,000 |    10,000 

. sum number_ra_codes

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
number_ra_~s |     10,000      2.4987    1.039089          0          6

. di "Number where no DMARDs but does have multiple RA codes and no alt diag"
Number where no DMARDs but does have multiple RA codes and no alt diag

. count if has_dmards==0 & number_ra_codes>=2 & alt_diag!=1
  2,082

. tab has_ra, m

     has_ra |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,000       50.00       50.00
          1 |      5,000       50.00      100.00
------------+-----------------------------------
      Total |     10,000      100.00

. keep if has_ra
(5,000 observations deleted)

. * Time since first RA code
. gen first_ra_codeA = date(first_ra_code, "YMD")
(2,755 missing values generated)

. format first_ra_codeA %dD/N/CY

. gen time_ra = (date("01Mar2019", "DMY") - first_ra_codeA)/365.25
(2,755 missing values generated)

. sum time_ra, d

                           time_ra
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .7200547       .0301164
 5%     4.851471       .1040383
10%     9.809719       .1396304       Obs               2,245
25%     25.95756       .1615332       Sum of Wgt.       2,245

50%     54.67214                      Mean            54.7392
                        Largest       Std. Dev.      32.48661
75%     83.30459       109.8207
90%     99.31828       109.8699       Variance        1055.38
95%     103.9726        109.911       Skewness      -.0069804
99%     108.8679       109.9658       Kurtosis       1.740655

. sum number_ra_codes, d

                       number_ra_codes
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            2                      Mean             2.4944
                        Largest       Std. Dev.       1.03527
75%            3              6
90%            4              6       Variance       1.071783
95%            4              6       Skewness       .0971849
99%            5              6       Kurtosis       2.886032

. sum metho_count, d

                         metho_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            2                      Mean             2.4932
                        Largest       Std. Dev.      1.026141
75%            3              6
90%            4              6       Variance       1.052964
95%            4              6       Skewness       .0488596
99%            5              6       Kurtosis       2.916423

. sum sulfa_count, d 

                         sulfa_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            2                      Mean             2.4834
                        Largest       Std. Dev.      1.029726
75%            3              6
90%            4              6       Variance       1.060337
95%            4              6       Skewness       .0544638
99%            5              6       Kurtosis       2.808431

. sum leflu_count, d 

                         leflu_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            2                      Mean             2.4738
                        Largest       Std. Dev.      1.038041
75%            3              5
90%            4              6       Variance       1.077529
95%            4              6       Skewness       .0226661
99%            5              6       Kurtosis       2.799505

. sum hydrox_count, d 

                        hydrox_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            2                      Mean             2.4806
                        Largest       Std. Dev.      1.031036
75%            3              6
90%            4              6       Variance       1.063036
95%            4              6       Skewness       .0733902
99%            5              6       Kurtosis       2.886825

. 
. sum outpatient*, d

                    outpatient_appt_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            2              0       Obs               5,000
25%            6              0       Sum of Wgt.       5,000

50%            7                      Mean             6.7872
                        Largest       Std. Dev.      2.917056
75%            9             14
90%           10             14       Variance       8.509218
95%           11             14       Skewness      -.8538891
99%           12             15       Kurtosis        3.54522

                    outpatient_appt_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            2              0       Obs               5,000
25%            6              0       Sum of Wgt.       5,000

50%            7                      Mean             6.7796
                        Largest       Std. Dev.      2.942508
75%            9             14
90%           10             14       Variance       8.658356
95%           11             14       Skewness      -.8909405
99%           12             14       Kurtosis       3.489146

                    outpatient_appt_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            3              0       Obs               5,000
25%            6              0       Sum of Wgt.       5,000

50%            7                      Mean             6.8028
                        Largest       Std. Dev.       2.92992
75%            9             14
90%           10             14       Variance       8.584429
95%           11             14       Skewness      -.8723463
99%           12             14       Kurtosis       3.528966

                   outpatient_medium_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               2,488
25%            2              1       Sum of Wgt.       2,488

50%            5                      Mean           13.60008
                        Largest       Std. Dev.      28.36945
75%            7             98
90%           98             98       Variance       804.8255
95%           98             98       Skewness       2.618126
99%           98             98       Kurtosis       7.924776

                   outpatient_medium_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               2,459
25%            2              1       Sum of Wgt.       2,459

50%            5                      Mean           13.98536
                        Largest       Std. Dev.      28.80095
75%            7             98
90%           98             98       Variance       829.4945
95%           98             98       Skewness       2.553981
99%           98             98       Kurtosis       7.590452

                   outpatient_medium_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               2,494
25%            2              1       Sum of Wgt.       2,494

50%            5                      Mean           12.89495
                        Largest       Std. Dev.      27.42343
75%            7             98
90%            8             98       Variance       752.0443
95%           98             98       Skewness       2.757557
99%           98             98       Kurtosis         8.6863

                  outpatient_appt_all_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               5,000
25%            6              0       Sum of Wgt.       5,000

50%            7                      Mean             6.7394
                        Largest       Std. Dev.      2.993272
75%            9             14
90%           10             14       Variance        8.95968
95%           11             14       Skewness      -.8494822
99%           12             14       Kurtosis       3.406827

                  outpatient_appt_all_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               5,000
25%            6              0       Sum of Wgt.       5,000

50%            7                      Mean             6.7218
                        Largest       Std. Dev.      2.951702
75%            9             14
90%           10             14       Variance       8.712547
95%           11             14       Skewness      -.8600302
99%           12             15       Kurtosis       3.434725

                  outpatient_appt_all_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            2              0       Obs               5,000
25%            6              0       Sum of Wgt.       5,000

50%            7                      Mean             6.7864
                        Largest       Std. Dev.       2.92713
75%            9             14
90%           10             15       Variance       8.568089
95%           11             15       Skewness      -.8807667
99%           12             15       Kurtosis       3.551128

. 
. forvalues i=2019/2021 {
  2.     sum ra_hosp_beddays_`i' if ra_hosp_`i'>0, d 
  3. }

                    ra_hosp_beddays_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               4,903
25%            2              0       Sum of Wgt.       4,903

50%            3                      Mean           2.516419
                        Largest       Std. Dev.      1.039846
75%            3              6
90%            4              6       Variance       1.081279
95%            4              6       Skewness      -.0001764
99%            5              6       Kurtosis       2.848119

                    ra_hosp_beddays_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               4,888
25%            2              0       Sum of Wgt.       4,888

50%            3                      Mean           2.496931
                        Largest       Std. Dev.      1.049419
75%            3              6
90%            4              6       Variance        1.10128
95%            4              6       Skewness       .0421079
99%            5              7       Kurtosis       2.932945

                    ra_hosp_beddays_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -1
 5%            1              0
10%            1              0       Obs               4,884
25%            2              0       Sum of Wgt.       4,884

50%            2                      Mean           2.486486
                        Largest       Std. Dev.      1.040458
75%            3              6
90%            4              6       Variance       1.082553
95%            4              6       Skewness       .0430616
99%            5              6       Kurtosis       2.909338

. 
. 
. * How many people are not on DMARDs and have no RA appointments?
. 
. * Format variables
. *re-order ethnicity
.  gen eth5=1 if ethnicity==1
(3,987 missing values generated)

.  replace eth5=2 if ethnicity==3
(1,022 real changes made)

.  replace eth5=3 if ethnicity==4
(980 real changes made)

.  replace eth5=4 if ethnicity==2
(974 real changes made)

.  replace eth5=5 if ethnicity==5
(1,011 real changes made)

.  replace eth5=6 if ethnicity==0
(0 real changes made)

. 
.  label define eth5                      1 "White"                            
>            ///
>                                                         2 "South Asian"      
>                    ///                                             
>                                                         3 "Black"            
>                            ///
>                                                         4 "Mixed"            
>                            ///
>                                                         5 "Other"            
>        ///
>                             6 "Missing"                                 

.                                         
. 
. label values eth5 eth5

. safetab eth5, m
5

       eth5 |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |      1,013       20.26       20.26
South Asian |      1,022       20.44       40.70
      Black |        980       19.60       60.30
      Mixed |        974       19.48       79.78
      Other |      1,011       20.22      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. 
. * formatting gender
. gen male=(sex=="M")

. replace male = 0 if sex == "F"
(0 real changes made)

. label define male 0"Female" 1"Male"

. label values male male

. safetab male, miss
5

       male |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |      2,618       52.36       52.36
       Male |      2,382       47.64      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. 
. *create a 4 category rural urban variable 
. generate urban_rural_5=.
(5,000 missing values generated)

. la var urban_rural_5 "Rural Urban in five categories"

. replace urban_rural_5=1 if urban_rural==1
(616 real changes made)

. replace urban_rural_5=2 if urban_rural==2
(620 real changes made)

. replace urban_rural_5=3 if urban_rural==3|urban_rural==4
(1,198 real changes made)

. replace urban_rural_5=4 if urban_rural==5|urban_rural==6
(1,262 real changes made)

. replace urban_rural_5=5 if urban_rural==7|urban_rural==8
(1,304 real changes made)

. label define urban_rural_5 1 "Urban major conurbation" 2 "Urban minor conurba
> tion" 3 "Urban city and town" 4 "Rural town and fringe" 5 "Rural village and 
> dispersed"

. label values urban_rural_5 urban_rural_5

. safetab urban_rural_5, miss
14

        Rural Urban in five |
                 categories |      Freq.     Percent        Cum.
----------------------------+-----------------------------------
    Urban major conurbation |        616       12.32       12.32
    Urban minor conurbation |        620       12.40       24.72
        Urban city and town |      1,198       23.96       48.68
      Rural town and fringe |      1,262       25.24       73.92
Rural village and dispersed |      1,304       26.08      100.00
----------------------------+-----------------------------------
                      Total |      5,000      100.00

. 
. *generate a binary rural urban (with missing assigned to urban)
. generate urban_rural_bin=.
(5,000 missing values generated)

. replace urban_rural_bin=1 if urban_rural<=4|urban_rural==.
(2,434 real changes made)

. replace urban_rural_bin=0 if urban_rural>4 & urban_rural!=.
(2,566 real changes made)

. label define urban_rural_bin 0 "Rural" 1 "Urban"

. label values urban_rural_bin urban_rural_bin

. safetab urban_rural_bin urban_rural, miss
28

urban_rura |                      urban_rural
     l_bin |         1          2          3          4          5 |     Total
-----------+-------------------------------------------------------+----------
     Rural |         0          0          0          0        644 |     2,566 
     Urban |       616        620        605        593          0 |     2,434 
-----------+-------------------------------------------------------+----------
     Total |       616        620        605        593        644 |     5,000 


urban_rura |           urban_rural
     l_bin |         6          7          8 |     Total
-----------+---------------------------------+----------
     Rural |       618        674        630 |     2,566 
     Urban |         0          0          0 |     2,434 
-----------+---------------------------------+----------
     Total |       618        674        630 |     5,000 

. label var urban_rural_bin "Rural-Urban"

. 
. * Make missing category for region
. replace region = "missing" if region==""
(0 real changes made)

. * Make numeric region variable 
. gen region_n = 1 if region=="East Midlands"
(4,508 missing values generated)

. replace region_n = 2 if region=="East of England"
(538 real changes made)

. replace region_n = 3 if region=="London"
(1,038 real changes made)

. replace region_n = 4 if region=="North East"
(490 real changes made)

. replace region_n = 5 if region=="North West"
(501 real changes made)

. replace region_n = 6 if region=="South East"
(954 real changes made)

. replace region_n = 7 if region=="South West"
(0 real changes made)

. replace region_n = 8 if region=="West Midlands"
(480 real changes made)

. replace region_n = 9 if region=="Yorkshire and the Humber"
(507 real changes made)

. tab region*, m 

                      |                  region_n
               region |         1          2          3          4 |     Total
----------------------+--------------------------------------------+----------
        East Midlands |       492          0          0          0 |       492 
      East of England |         0        538          0          0 |       538 
               London |         0          0      1,038          0 |     1,038 
           North East |         0          0          0        490 |       490 
           North West |         0          0          0          0 |       501 
           South East |         0          0          0          0 |       954 
        West Midlands |         0          0          0          0 |       480 
Yorkshire and the H.. |         0          0          0          0 |       507 
----------------------+--------------------------------------------+----------
                Total |       492        538      1,038        490 |     5,000 


                      |                  region_n
               region |         5          6          8          9 |     Total
----------------------+--------------------------------------------+----------
        East Midlands |         0          0          0          0 |       492 
      East of England |         0          0          0          0 |       538 
               London |         0          0          0          0 |     1,038 
           North East |         0          0          0          0 |       490 
           North West |       501          0          0          0 |       501 
           South East |         0        954          0          0 |       954 
        West Midlands |         0          0        480          0 |       480 
Yorkshire and the H.. |         0          0          0        507 |       507 
----------------------+--------------------------------------------+----------
                Total |       501        954        480        507 |     5,000 

. 
. * Define age categories
. * Create age categories
. egen age_cat = cut(age), at(18, 40, 60, 80, 120) icodes
(1066 missing values generated)

. label define age 0 "18 - 40 years" 1 "41 - 60 years" 2 "61 - 80 years" 3 ">80
>  years"

. label values age_cat age

. safetab age_cat, miss
8

      age_cat |      Freq.     Percent        Cum.
--------------+-----------------------------------
18 - 40 years |      1,467       29.34       29.34
41 - 60 years |      1,303       26.06       55.40
61 - 80 years |        942       18.84       74.24
    >80 years |        222        4.44       78.68
            . |      1,066       21.32      100.00
--------------+-----------------------------------
        Total |      5,000      100.00

. 
. * Smoking status
. gen smoking = 0 if smoking_status=="N"
(4,483 missing values generated)

. replace smoking = 1 if smoking_status=="S"
(955 real changes made)

. replace smoking = 2 if smoking_status=="E"
(730 real changes made)

. replace smoking = 3 if smoking==.
(2,798 real changes made)

. 
. label define smok 1 "Current smoker" 2 "Ex-smoker" 0 "Never smoked" 3 "Unknow
> n"

. label values smoking smok

. 
. * BMI categories
. egen bmi_cat = cut(bmi), at(0, 1, 18.5, 24.9, 29.9, 39.9, 100) icodes
(2 missing values generated)

. bys bmi_cat: sum bmi

-------------------------------------------------------------------------------
-> bmi_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        991           0           0          0          0

-------------------------------------------------------------------------------
-> bmi_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        497    14.58525    3.135432   1.777325   18.48783

-------------------------------------------------------------------------------
-> bmi_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        934    22.04407    1.794865   18.50702   24.89782

-------------------------------------------------------------------------------
-> bmi_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        964    27.34485    1.439143   24.90137   29.89403

-------------------------------------------------------------------------------
-> bmi_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |      1,349    34.05688    2.692066   29.90012   39.89632

-------------------------------------------------------------------------------
-> bmi_cat = 5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        263     43.9701    3.455935   39.93222   56.19979

-------------------------------------------------------------------------------
-> bmi_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |          2   -1.900379    .3767544  -2.166785  -1.633974


. * add missing . to zero category
. replace bmi_cat = 0 if bmi_cat==. 
(2 real changes made)

. label define bmi 0 "Missing" 1 "Underweight" 2 "Healthy range" 3 "Overweight"
>  4 "Obese" 5 "Morbidly obese"

. label values bmi_cat bmi

. 
. * Determine if still in follow-up for each year
. * Format dates
. gen died_fuA = date(died_fu, "YMD")
(2,548 missing values generated)

. gen dereg_dateA = date(dereg_date, "YMD")
(2,426 missing values generated)

. gen end_fu = date("`j'-03-31", "YMD")
(5,000 missing values generated)

. gen end_date = min(died_fuA, dereg_dateA, end_fu)
(1,252 missing values generated)

. drop end_fu

. sum end_date

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    end_date |      3,748    22449.49    299.3403      21976      23034

. di "Number where end date prior to follow-up start"
Number where end date prior to follow-up start

. count if end_date<date("2019-04-01", "YMD")
  0

. * determine range of dates for outpatient appointments to determine which sho
> uld be dropped
. gen end_2020 = end_date<date("2020-03-31", "YMD")

. gen end_2021 = end_date<date("2021-03-31", "YMD") 

. gen end_2022 = end_date<date("2022-03-31", "YMD") 

. tab end_2020

   end_2020 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,870       97.40       97.40
          1 |        130        2.60      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. tab end_2021

   end_2021 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,327       66.54       66.54
          1 |      1,673       33.46      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. tab end_2022

   end_2022 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,066       41.32       41.32
          1 |      2,934       58.68      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. 
. * Set outpatient appointment count to missing if end prior to the end of the 
> year 
. forvalues i=2019/2021 {
  2.     local j=`i'+1
  3.     di `j'
  4.     gen op_appt_`i'_orig = outpatient_appt_`i'
  5.     replace outpatient_appt_`i'=. if end_`j'
  6.     gen op_medium_`i'_orig = outpatient_medium_`i'
  7.     replace outpatient_medium_`i'=. if end_`j'
  8.     gen op_appt_all_`i'_orig = outpatient_appt_all_`i'
  9.     replace outpatient_appt_all_`i'=. if end_`j'
 10. }
2020
(130 real changes made, 130 to missing)
(2,512 missing values generated)
(63 real changes made, 63 to missing)
(130 real changes made, 130 to missing)
2021
(1,673 real changes made, 1,673 to missing)
(2,541 missing values generated)
(848 real changes made, 848 to missing)
(1,673 real changes made, 1,673 to missing)
2022
(2,934 real changes made, 2,934 to missing)
(2,506 missing values generated)
(1,431 real changes made, 1,431 to missing)
(2,934 real changes made, 2,934 to missing)

. 
. * Categorise number of outpatient appointments
. label define appt 0 "No appointments" 1 "1-2 per year" 2 "3 or more per year"
>  

. forvalues i=2019/2021 {
  2.     * Rheumatology outpatient appointments
.     egen op_appt_`i'_cat = cut(outpatient_appt_`i'), at(0, 1, 3, 1000) icodes
  3.     * Check all categorised
.     bys op_appt_`i'_cat: sum outpatient_appt_`i'
  4.     label values op_appt_`i'_cat appt
  5.     * Same for orginal variables
.     egen op_appt_`i'_orig_cat = cut(op_appt_`i'_orig), at(0, 1, 3, 1000) icod
> es
  6.     * Check all categorised
.     bys op_appt_`i'_orig_cat: sum op_appt_`i'_orig
  7.     label values op_appt_`i'_orig_cat appt
  8.     }
(130 missing values generated)

-------------------------------------------------------------------------------
-> op_appt_2019_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2019 |        466           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_2019_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2019 |         29    1.862069    .3509312          1          2

-------------------------------------------------------------------------------
-> op_appt_2019_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2019 |      4,375      7.5344    1.975187          3         15

-------------------------------------------------------------------------------
-> op_appt_2019_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2019 |          0


-------------------------------------------------------------------------------
-> op_appt_2019_orig_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2019_orig |        472           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_2019_orig_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2019_orig |         30    1.866667    .3457459          1          2

-------------------------------------------------------------------------------
-> op_appt_2019_orig_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2019_orig |      4,498    7.532237    1.976503          3         15

(1673 missing values generated)

-------------------------------------------------------------------------------
-> op_appt_2020_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2020 |        315           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_2020_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2020 |         22    1.727273    .4558423          1          2

-------------------------------------------------------------------------------
-> op_appt_2020_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2020 |      2,990    7.544147    1.956167          3         14

-------------------------------------------------------------------------------
-> op_appt_2020_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2020 |          0


-------------------------------------------------------------------------------
-> op_appt_2020_orig_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2020_orig |        491           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_2020_orig_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2020_orig |         29    1.793103    .4122508          1          2

-------------------------------------------------------------------------------
-> op_appt_2020_orig_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2020_orig |      4,480    7.554911    1.965117          3         14

(2934 missing values generated)

-------------------------------------------------------------------------------
-> op_appt_2021_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2021 |        206           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_2021_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2021 |          5         1.8    .4472136          1          2

-------------------------------------------------------------------------------
-> op_appt_2021_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2021 |      1,855    7.616712     1.96387          3         14

-------------------------------------------------------------------------------
-> op_appt_2021_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2021 |          0


-------------------------------------------------------------------------------
-> op_appt_2021_orig_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2021_orig |        479           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_2021_orig_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2021_orig |         20         1.9    .3077935          1          2

-------------------------------------------------------------------------------
-> op_appt_2021_orig_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2021_orig |      4,501    7.548545    1.986658          3         14


. 
. * Calculate difference in rheumatology appointments compared to 2019
. gen diff_op_2020 = outpatient_appt_2020 - outpatient_appt_2019
(1,673 missing values generated)

. gen diff_op_2021 = outpatient_appt_2021 - outpatient_appt_2019
(2,934 missing values generated)

. sum diff_op_2020 diff_op_2021, d

                        diff_op_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%          -10            -13
 5%           -7            -12
10%           -5            -12       Obs               3,327
25%           -2            -12       Sum of Wgt.       3,327

50%            0                      Mean          -.0246468
                        Largest       Std. Dev.      4.163596
75%            2             11
90%            5             12       Variance       17.33553
95%            8             12       Skewness       .0018719
99%           10             12       Kurtosis        3.22603

                        diff_op_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%          -10            -14
 5%           -8            -14
10%           -6            -12       Obs               2,066
25%           -2            -12       Sum of Wgt.       2,066

50%            0                      Mean           .0246854
                        Largest       Std. Dev.      4.251064
75%            2             12
90%            5             12       Variance       18.07155
95%            8             13       Skewness      -.0339759
99%           10             13       Kurtosis       3.208453

. 
. * Identify people with no appointments in either year flag them and set diffe
> rence to missing
. forvalues i=2020/2021 {
  2.     gen no_appts_`i' = diff_op_`i'==0 & op_appt_`i'_cat==0
  3.     tab no_appts_`i' op_appt_`i'_cat
  4.     replace diff_op_`i'=. if no_appts_`i'==1
  5. }

no_appts_2 |         op_appt_2020_cat
       020 | No appoin  1-2 per y  3 or more |     Total
-----------+---------------------------------+----------
         0 |       281         22      2,990 |     3,293 
         1 |        34          0          0 |        34 
-----------+---------------------------------+----------
     Total |       315         22      2,990 |     3,327 
(34 real changes made, 34 to missing)

no_appts_2 |         op_appt_2021_cat
       021 | No appoin  1-2 per y  3 or more |     Total
-----------+---------------------------------+----------
         0 |       190          5      1,855 |     2,050 
         1 |        16          0          0 |        16 
-----------+---------------------------------+----------
     Total |       206          5      1,855 |     2,066 
(16 real changes made, 16 to missing)

. 
. * Identify of people with appointments whether they had fewer appointments 
. forvalues i=2020/2021 {
  2.     gen fewer_appts_`i' = (diff_op_`i' < 0) if diff_op_`i'!=.
  3. }
(1,707 missing values generated)
(2,950 missing values generated)

. 
. * Categorise number of outpatient appointments (all specialties)
. label define appt_all 0 "No appointments" 1 "1-2 per year" 2 "3-5 per year" 3
>  "6 or more per year"

. forvalues i=2019/2021 {
  2.     sum outpatient_appt_all_`i', d
  3.     egen op_appt_all_`i'_cat = cut(outpatient_appt_all_`i'), at(0, 1, 3, 6
> , 1000) icodes
  4.     * Check all categorised
.     bys op_appt_all_`i'_cat: sum outpatient_appt_all_`i'
  5.     label values op_appt_all_`i'_cat appt_all
  6.     * Same for orginal variables
.     egen op_appt_all_`i'_orig_cat = cut(op_appt_all_`i'_orig), at(0, 1, 3, 6,
>  1000) icodes
  7.     * Check all categorised
.     bys op_appt_all_`i'_orig_cat: sum op_appt_all_`i'_orig
  8.     label values op_appt_all_`i'_orig_cat appt_all
  9.     }

                  outpatient_appt_all_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               4,870
25%            6              0       Sum of Wgt.       4,870

50%            7                      Mean           6.727721
                        Largest       Std. Dev.      2.996574
75%            9             14
90%           10             14       Variance       8.979453
95%           11             14       Skewness      -.8495503
99%           12             14       Kurtosis       3.400881
(130 missing values generated)

-------------------------------------------------------------------------------
-> op_appt_all_2019_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2019 |        513           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_all_2019_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2019 |         27    1.777778    .4236593          1          2

-------------------------------------------------------------------------------
-> op_appt_all_2019_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2019 |        670    4.540299    .6678748          3          5

-------------------------------------------------------------------------------
-> op_appt_all_2019_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2019 |      3,660     8.10765    1.599534          6         14

-------------------------------------------------------------------------------
-> op_appt_all_2019_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2019 |          0


-------------------------------------------------------------------------------
-> op_appt_all_2019_orig_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2019_orig |        521           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_all_2019_orig_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2019_orig |         29    1.793103    .4122508          1          2

-------------------------------------------------------------------------------
-> op_appt_all_2019_orig_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2019_orig |        686    4.533528    .6756763          3          5

-------------------------------------------------------------------------------
-> op_appt_all_2019_orig_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2019_orig |      3,764     8.11238     1.60267          6         14


                  outpatient_appt_all_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               3,327
25%            6              0       Sum of Wgt.       3,327

50%            7                      Mean           6.695521
                        Largest       Std. Dev.      2.962207
75%            9             14
90%           10             14       Variance       8.774673
95%           11             14       Skewness      -.8446411
99%           12             15       Kurtosis       3.419268
(1673 missing values generated)

-------------------------------------------------------------------------------
-> op_appt_all_2020_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2020 |        340           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_all_2020_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2020 |         13    1.615385    .5063697          1          2

-------------------------------------------------------------------------------
-> op_appt_all_2020_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2020 |        460    4.395652    .7468034          3          5

-------------------------------------------------------------------------------
-> op_appt_all_2020_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2020 |      2,514     8.04813    1.585245          6         15

-------------------------------------------------------------------------------
-> op_appt_all_2020_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2020 |          0


-------------------------------------------------------------------------------
-> op_appt_all_2020_orig_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2020_orig |        503           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_all_2020_orig_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2020_orig |         22    1.727273    .4558423          1          2

-------------------------------------------------------------------------------
-> op_appt_all_2020_orig_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2020_orig |        694    4.436599    .7274363          3          5

-------------------------------------------------------------------------------
-> op_appt_all_2020_orig_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2020_orig |      3,781    8.064533    1.582498          6         15


                  outpatient_appt_all_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               2,066
25%            6              0       Sum of Wgt.       2,066

50%            7                      Mean           6.755566
                        Largest       Std. Dev.      2.989049
75%            9             13
90%           10             14       Variance       8.934412
95%           11             14       Skewness       -.879464
99%           12             15       Kurtosis        3.42734
(2934 missing values generated)

-------------------------------------------------------------------------------
-> op_appt_all_2021_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2021 |        215           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_all_2021_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2021 |          9    1.666667          .5          1          2

-------------------------------------------------------------------------------
-> op_appt_all_2021_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2021 |        278    4.453237     .708107          3          5

-------------------------------------------------------------------------------
-> op_appt_all_2021_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2021 |      1,564    8.122762    1.572807          6         15

-------------------------------------------------------------------------------
-> op_appt_all_2021_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2021 |          0


-------------------------------------------------------------------------------
-> op_appt_all_2021_orig_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2021_orig |        483           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_all_2021_orig_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2021_orig |         26    1.846154    .3679465          1          2

-------------------------------------------------------------------------------
-> op_appt_all_2021_orig_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2021_orig |        673    4.456166    .7038974          3          5

-------------------------------------------------------------------------------
-> op_appt_all_2021_orig_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2021_orig |      3,818    8.089314    1.575998          6         15


. 
. * Calculate difference in all outpatient appointments compared to 2019
. gen diff_op_all_2020 = outpatient_appt_all_2020 - outpatient_appt_all_2019
(1,673 missing values generated)

. gen diff_op_all_2021 = outpatient_appt_all_2021 - outpatient_appt_all_2019
(2,934 missing values generated)

. sum diff_op_all_2020 diff_op_all_2021, d

                      diff_op_all_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%          -10            -13
 5%           -7            -13
10%           -5            -13       Obs               3,327
25%           -3            -12       Sum of Wgt.       3,327

50%            0                      Mean          -.0309588
                        Largest       Std. Dev.      4.219682
75%            2             12
90%            6             12       Variance       17.80572
95%            8             12       Skewness       .0147819
99%           10             12       Kurtosis       3.197213

                      diff_op_all_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%          -10            -13
 5%           -8            -12
10%           -5            -12       Obs               2,066
25%           -2            -11       Sum of Wgt.       2,066

50%            0                      Mean           .0058083
                        Largest       Std. Dev.      4.220894
75%            2             12
90%            5             12       Variance       17.81595
95%            8             13       Skewness      -.0021969
99%           10             13       Kurtosis       3.299214

. 
. * Identify people with no appointments in either year flag them and set diffe
> rence to missing
. forvalues i=2020/2021 {
  2.     gen no_appts_all_`i' = diff_op_all_`i'==0 & op_appt_all_`i'_cat==0
  3.     tab no_appts_all_`i' op_appt_all_`i'_cat
  4.     replace diff_op_all_`i'=. if no_appts_all_`i'==1
  5.     }

no_appts_a |            op_appt_all_2020_cat
   ll_2020 | No appoin  1-2 per y  3-5 per y  6 or more |     Total
-----------+--------------------------------------------+----------
         0 |       297         13        460      2,514 |     3,284 
         1 |        43          0          0          0 |        43 
-----------+--------------------------------------------+----------
     Total |       340         13        460      2,514 |     3,327 
(43 real changes made, 43 to missing)

no_appts_a |            op_appt_all_2021_cat
   ll_2021 | No appoin  1-2 per y  3-5 per y  6 or more |     Total
-----------+--------------------------------------------+----------
         0 |       194          9        278      1,564 |     2,045 
         1 |        21          0          0          0 |        21 
-----------+--------------------------------------------+----------
     Total |       215          9        278      1,564 |     2,066 
(21 real changes made, 21 to missing)

. 
. * Identify of people with appointments whether they had fewer appointments 
. forvalues i=2020/2021 {
  2.     gen fewer_appts_all_`i' = (diff_op_all_`i' < 0) if diff_op_all_`i'!=.
  3. }
(1,716 missing values generated)
(2,955 missing values generated)

. 
. preserve

. * Tabulate number of rheumatology appointments per year of those with whole y
> ear available
. table1_mc, vars(op_appt_2019_cat cate \ op_appt_2020_cat cate \ op_appt_2021_
> cat cate \ no_appts_2020 cate \ no_appts_2021 cate \ fewer_appts_2020 cate \ 
> fewer_appts_2021 cate) clear

  +----------------------------------+
  | factor               N_1     m_1 |
  |----------------------------------|
  | op_appt_2019_cat   4,870     130 |
  |----------------------------------|
  | op_appt_2020_cat   3,327   1,673 |
  |----------------------------------|
  | op_appt_2021_cat   2,066   2,934 |
  |----------------------------------|
  | no_appts_2020      5,000       0 |
  |----------------------------------|
  | no_appts_2021      5,000       0 |
  |----------------------------------|
  | fewer_appts_2020   3,293   1,707 |
  |----------------------------------|
  | fewer_appts_2021   2,050   2,950 |
  +----------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +-------------------------------------------------------+
  |                                         Total         |
  |-------------------------------------------------------|
  |                                         N=5,000       |
  |-------------------------------------------------------|
  | op_appt_2019_cat   No appointments      466 ( 9.6%)   |
  |                    1-2 per year         29 ( 0.6%)    |
  |                    3 or more per year   4,375 (89.8%) |
  |-------------------------------------------------------|
  | op_appt_2020_cat   No appointments      315 ( 9.5%)   |
  |                    1-2 per year         22 ( 0.7%)    |
  |                    3 or more per year   2,990 (89.9%) |
  |-------------------------------------------------------|
  | op_appt_2021_cat   No appointments      206 (10.0%)   |
  |                    1-2 per year         5 ( 0.2%)     |
  |                    3 or more per year   1,855 (89.8%) |
  |-------------------------------------------------------|
  | no_appts_2020      0                    4,966 (99.3%) |
  |                    1                    34 ( 0.7%)    |
  |-------------------------------------------------------|
  | no_appts_2021      0                    4,984 (99.7%) |
  |                    1                    16 ( 0.3%)    |
  |-------------------------------------------------------|
  | fewer_appts_2020   0                    1,805 (54.8%) |
  |                    1                    1,488 (45.2%) |
  |-------------------------------------------------------|
  | fewer_appts_2021   0                    1,176 (57.4%) |
  |                    1                    874 (42.6%)   |
  +-------------------------------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/op_appt_yrs.csv
file ./output/tables/op_appt_yrs.csv saved

. restore 

. preserve

. * Tabulate number of rheumatology appointments per year (includes people who 
> end follow-up during year)
. table1_mc, vars(op_appt_2019_orig_cat cate \ op_appt_2020_orig_cat cate \ op_
> appt_2021_orig_cat cate) clear

  +-------------------------------------+
  | factor                    N_1   m_1 |
  |-------------------------------------|
  | op_appt_2019_orig_cat   5,000     0 |
  |-------------------------------------|
  | op_appt_2020_orig_cat   5,000     0 |
  |-------------------------------------|
  | op_appt_2021_orig_cat   5,000     0 |
  +-------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +------------------------------------------------------------+
  |                                              Total         |
  |------------------------------------------------------------|
  |                                              N=5,000       |
  |------------------------------------------------------------|
  | op_appt_2019_orig_cat   No appointments      472 ( 9.4%)   |
  |                         1-2 per year         30 ( 0.6%)    |
  |                         3 or more per year   4,498 (90.0%) |
  |------------------------------------------------------------|
  | op_appt_2020_orig_cat   No appointments      491 ( 9.8%)   |
  |                         1-2 per year         29 ( 0.6%)    |
  |                         3 or more per year   4,480 (89.6%) |
  |------------------------------------------------------------|
  | op_appt_2021_orig_cat   No appointments      479 ( 9.6%)   |
  |                         1-2 per year         20 ( 0.4%)    |
  |                         3 or more per year   4,501 (90.0%) |
  +------------------------------------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/op_appt_orig_yrs.csv
file ./output/tables/op_appt_orig_yrs.csv saved

. restore 

. preserve

. * Tabulate number of all outpatient appointments per year of those with whole
>  year available
. table1_mc, vars(op_appt_all_2019_cat cate \ op_appt_all_2020_cat cate \ op_ap
> pt_all_2021_cat cate \ no_appts_all_2020 cate \ no_appts_all_2021 cate \ fewe
> r_appts_all_2020 cate \ fewer_appts_all_2021 cate) clear

  +--------------------------------------+
  | factor                   N_1     m_1 |
  |--------------------------------------|
  | op_appt_all_2019_cat   4,870     130 |
  |--------------------------------------|
  | op_appt_all_2020_cat   3,327   1,673 |
  |--------------------------------------|
  | op_appt_all_2021_cat   2,066   2,934 |
  |--------------------------------------|
  | no_appts_all_2020      5,000       0 |
  |--------------------------------------|
  | no_appts_all_2021      5,000       0 |
  |--------------------------------------|
  | fewer_appts_all_2020   3,284   1,716 |
  |--------------------------------------|
  | fewer_appts_all_2021   2,045   2,955 |
  +--------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +-----------------------------------------------------------+
  |                                             Total         |
  |-----------------------------------------------------------|
  |                                             N=5,000       |
  |-----------------------------------------------------------|
  | op_appt_all_2019_cat   No appointments      513 (10.5%)   |
  |                        1-2 per year         27 ( 0.6%)    |
  |                        3-5 per year         670 (13.8%)   |
  |                        6 or more per year   3,660 (75.2%) |
  |-----------------------------------------------------------|
  | op_appt_all_2020_cat   No appointments      340 (10.2%)   |
  |                        1-2 per year         13 ( 0.4%)    |
  |                        3-5 per year         460 (13.8%)   |
  |                        6 or more per year   2,514 (75.6%) |
  |-----------------------------------------------------------|
  | op_appt_all_2021_cat   No appointments      215 (10.4%)   |
  |                        1-2 per year         9 ( 0.4%)     |
  |                        3-5 per year         278 (13.5%)   |
  |                        6 or more per year   1,564 (75.7%) |
  |-----------------------------------------------------------|
  | no_appts_all_2020      0                    4,957 (99.1%) |
  |                        1                    43 ( 0.9%)    |
  |-----------------------------------------------------------|
  | no_appts_all_2021      0                    4,979 (99.6%) |
  |                        1                    21 ( 0.4%)    |
  |-----------------------------------------------------------|
  | fewer_appts_all_2020   0                    1,793 (54.6%) |
  |                        1                    1,491 (45.4%) |
  |-----------------------------------------------------------|
  | fewer_appts_all_2021   0                    1,151 (56.3%) |
  |                        1                    894 (43.7%)   |
  +-----------------------------------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/op_appt_all_yrs.csv
file ./output/tables/op_appt_all_yrs.csv saved

. restore 

. * Tabulate overall characteristics 
. preserve

. table1_mc, vars(age_cat cate \ male cate \ urban_rural_bin cate \ region cate
>  \ imd cate \  smoking cate \ time_ra contn \ bmi_cat cate \ eth5 cate) clear

  +-----------------------------+
  | factor          N_1     m_1 |
  |-----------------------------|
  | age_cat       3,934   1,066 |
  |-----------------------------|
  | male          5,000       0 |
  |-----------------------------|
  | Rural-Urban   5,000       0 |
  |-----------------------------|
  | region        5,000       0 |
  |-----------------------------|
  | imd           5,000       0 |
  |-----------------------------|
  | smoking       5,000       0 |
  |-----------------------------|
  | time_ra       2,245   2,755 |
  |-----------------------------|
  | bmi_cat       5,000       0 |
  |-----------------------------|
  | eth5          5,000       0 |
  +-----------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +-------------------------------------------------------------+
  |                                          Total              |
  |-------------------------------------------------------------|
  |                                          N=5,000            |
  |-------------------------------------------------------------|
  | age_cat       18 - 40 years              1,467 (37.3%)      |
  |               41 - 60 years              1,303 (33.1%)      |
  |               61 - 80 years              942 (23.9%)        |
  |               >80 years                  222 ( 5.6%)        |
  |-------------------------------------------------------------|
  | male          Female                     2,618 (52.4%)      |
  |               Male                       2,382 (47.6%)      |
  |-------------------------------------------------------------|
  | Rural-Urban   Rural                      2,566 (51.3%)      |
  |               Urban                      2,434 (48.7%)      |
  |-------------------------------------------------------------|
  | region        East Midlands              492 ( 9.8%)        |
  |               East of England            538 (10.8%)        |
  |               London                     1,038 (20.8%)      |
  |               North East                 490 ( 9.8%)        |
  |               North West                 501 (10.0%)        |
  |               South East                 954 (19.1%)        |
  |               West Midlands              480 ( 9.6%)        |
  |               Yorkshire and the Humber   507 (10.1%)        |
  |-------------------------------------------------------------|
  | imd           0                          255 ( 5.1%)        |
  |               1                          999 (20.0%)        |
  |               2                          898 (18.0%)        |
  |               3                          940 (18.8%)        |
  |               4                          942 (18.8%)        |
  |               5                          966 (19.3%)        |
  |-------------------------------------------------------------|
  | smoking       Never smoked               517 (10.3%)        |
  |               Current smoker             955 (19.1%)        |
  |               Ex-smoker                  730 (14.6%)        |
  |               Unknown                    2,798 (56.0%)      |
  |-------------------------------------------------------------|
  | time_ra                                  54.7392 (32.48661) |
  |-------------------------------------------------------------|
  | bmi_cat       Missing                    993 (19.9%)        |
  |               Underweight                497 ( 9.9%)        |
  |               Healthy range              934 (18.7%)        |
  |               Overweight                 964 (19.3%)        |
  |               Obese                      1,349 (27.0%)      |
  |               Morbidly obese             263 ( 5.3%)        |
  |-------------------------------------------------------------|
  | eth5          White                      1,013 (20.3%)      |
  |               South Asian                1,022 (20.4%)      |
  |               Black                      980 (19.6%)        |
  |               Mixed                      974 (19.5%)        |
  |               Other                      1,011 (20.2%)      |
  +-------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 

. export delimited using ./output/tables/op_chars.csv
file ./output/tables/op_chars.csv saved

. * Rounding numbers in table to nearest 5
.     destring _columna_1, gen(n) force
_columna_1: contains nonnumeric characters; n generated as double
(14 missing values generated)

.     destring _columnb_1, gen(percent) ignore("-" "%" "(" ")")  force
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent generated as double
(2 missing values generated)

.     gen rounded_n = round(n, 5)
(14 missing values generated)

.     keep factor level rounded_n percent

.     export delimited using ./output/tables/op_chars_rounded.csv
file ./output/tables/op_chars_rounded.csv saved

. restore

. * Tabulate characteristics by category of outpatient appointments for each ye
> ar
. tempfile tempfile

. forvalues i=2019/2021 {
  2.     preserve
  3.     keep if op_appt_`i'_cat==0
  4.     table1_mc, vars(age_cat cate \ male cate \ urban_rural_bin cate \ regi
> on cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat cate \ eth5 cate)
>  clear
  5.     save `tempfile', replace
  6.     restore
  7.     forvalues j=1/2 {
  8.         preserve
  9.         keep if op_appt_`i'_cat==`j'
 10.         table1_mc, vars(age_cat cate \ male cate \ urban_rural_bin cate \ 
> region cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat cate \ eth5 c
> ate) clear
 11.         append using `tempfile'
 12.         save `tempfile', replace
 13.         if `j'==2 {
 14.             export delimited using ./output/tables/characteristics_strata`
> i'.csv
 15.             destring _columna_1, gen(n) force
 16.             destring _columnb_1, gen(percent) ignore("-" "%" "(" ")") forc
> e
 17.             gen rounded_n = round(n, 5)
 18.             keep factor level rounded_n percent
 19.             export delimited using ./output/tables/characteristics_strata`
> i'_rounded.csv
 20.         }
 21.         restore
 22.     }
 23.    
.     /* Tabulate characteristics by whether hospitalised with RA for each year
>     preserve
>     keep if ra_hosp_`i'==0
>     table1_mc, vars(age_cat cate \ male cate \ urban_rural_5 cate \ prescribe
> d_biologics cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat cate) cl
> ear
>     save `tempfile', replace
>     restore
>     preserve
>     keep if ra_hosp_`i'==1
>     table1_mc, vars(age_cat cate \ male cate \ urban_rural_5 cate \ prescribe
> d_biologics cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat cate) cl
> ear
>     append using `tempfile'
>     save `tempfile', replace
>     export delimited using ./output/tables/characteristics_ra_hosp_`i'.csv
>     restore*/
.     }
(4,534 observations deleted)

  +-------------------------+
  | factor        N_1   m_1 |
  |-------------------------|
  | age_cat       352   114 |
  |-------------------------|
  | male          466     0 |
  |-------------------------|
  | Rural-Urban   466     0 |
  |-------------------------|
  | region        466     0 |
  |-------------------------|
  | imd           466     0 |
  |-------------------------|
  | smoking       466     0 |
  |-------------------------|
  | time_ra       198   268 |
  |-------------------------|
  | bmi_cat       466     0 |
  |-------------------------|
  | eth5          466     0 |
  +-------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +-------------------------------------------------------------+
  |                                          Total              |
  |-------------------------------------------------------------|
  |                                          N=466              |
  |-------------------------------------------------------------|
  | age_cat       18 - 40 years              133 (37.8%)        |
  |               41 - 60 years              120 (34.1%)        |
  |               61 - 80 years              87 (24.7%)         |
  |               >80 years                  12 ( 3.4%)         |
  |-------------------------------------------------------------|
  | male          Female                     250 (53.6%)        |
  |               Male                       216 (46.4%)        |
  |-------------------------------------------------------------|
  | Rural-Urban   Rural                      239 (51.3%)        |
  |               Urban                      227 (48.7%)        |
  |-------------------------------------------------------------|
  | region        East Midlands              52 (11.2%)         |
  |               East of England            50 (10.7%)         |
  |               London                     87 (18.7%)         |
  |               North East                 39 ( 8.4%)         |
  |               North West                 47 (10.1%)         |
  |               South East                 79 (17.0%)         |
  |               West Midlands              49 (10.5%)         |
  |               Yorkshire and the Humber   63 (13.5%)         |
  |-------------------------------------------------------------|
  | imd           0                          28 ( 6.0%)         |
  |               1                          100 (21.5%)        |
  |               2                          83 (17.8%)         |
  |               3                          85 (18.2%)         |
  |               4                          73 (15.7%)         |
  |               5                          97 (20.8%)         |
  |-------------------------------------------------------------|
  | smoking       Never smoked               50 (10.7%)         |
  |               Current smoker             90 (19.3%)         |
  |               Ex-smoker                  65 (13.9%)         |
  |               Unknown                    261 (56.0%)        |
  |-------------------------------------------------------------|
  | time_ra                                  61.22634 (31.6361) |
  |-------------------------------------------------------------|
  | bmi_cat       Missing                    89 (19.1%)         |
  |               Underweight                56 (12.0%)         |
  |               Healthy range              82 (17.6%)         |
  |               Overweight                 85 (18.2%)         |
  |               Obese                      129 (27.7%)        |
  |               Morbidly obese             25 ( 5.4%)         |
  |-------------------------------------------------------------|
  | eth5          White                      73 (15.7%)         |
  |               South Asian                114 (24.5%)        |
  |               Black                      95 (20.4%)         |
  |               Mixed                      98 (21.0%)         |
  |               Other                      86 (18.5%)         |
  +-------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
(note: file /tmp/St00015.000005 not found)
file /tmp/St00015.000005 saved
(4,971 observations deleted)

  +-------------------------+
  | factor        N_1   m_1 |
  |-------------------------|
  | age_cat        25     4 |
  |-------------------------|
  | male           29     0 |
  |-------------------------|
  | Rural-Urban    29     0 |
  |-------------------------|
  | region         29     0 |
  |-------------------------|
  | imd            29     0 |
  |-------------------------|
  | smoking        29     0 |
  |-------------------------|
  | time_ra        14    15 |
  |-------------------------|
  | bmi_cat        29     0 |
  |-------------------------|
  | eth5           29     0 |
  +-------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------------------+
  |                                          Total               |
  |--------------------------------------------------------------|
  |                                          N=29                |
  |--------------------------------------------------------------|
  | age_cat       18 - 40 years              7 (28%)             |
  |               41 - 60 years              10 (40%)            |
  |               61 - 80 years              6 (24%)             |
  |               >80 years                  2 ( 8%)             |
  |--------------------------------------------------------------|
  | male          Female                     13 (45%)            |
  |               Male                       16 (55%)            |
  |--------------------------------------------------------------|
  | Rural-Urban   Rural                      12 (41%)            |
  |               Urban                      17 (59%)            |
  |--------------------------------------------------------------|
  | region        East Midlands              6 (21%)             |
  |               East of England            4 (14%)             |
  |               London                     6 (21%)             |
  |               North East                 4 (14%)             |
  |               North West                 1 ( 3%)             |
  |               South East                 2 ( 7%)             |
  |               West Midlands              2 ( 7%)             |
  |               Yorkshire and the Humber   4 (14%)             |
  |--------------------------------------------------------------|
  | imd           0                          2 ( 7%)             |
  |               1                          4 (14%)             |
  |               2                          7 (24%)             |
  |               3                          4 (14%)             |
  |               4                          3 (10%)             |
  |               5                          9 (31%)             |
  |--------------------------------------------------------------|
  | smoking       Never smoked               1 ( 3%)             |
  |               Current smoker             5 (17%)             |
  |               Ex-smoker                  5 (17%)             |
  |               Unknown                    18 (62%)            |
  |--------------------------------------------------------------|
  | time_ra                                  70.37196 (31.73187) |
  |--------------------------------------------------------------|
  | bmi_cat       Missing                    4 (14%)             |
  |               Underweight                3 (10%)             |
  |               Healthy range              7 (24%)             |
  |               Overweight                 8 (28%)             |
  |               Obese                      7 (24%)             |
  |--------------------------------------------------------------|
  | eth5          White                      7 (24%)             |
  |               South Asian                5 (17%)             |
  |               Black                      4 (14%)             |
  |               Mixed                      7 (24%)             |
  |               Other                      6 (21%)             |
  +--------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.000005 saved
(625 observations deleted)

  +-----------------------------+
  | factor          N_1     m_1 |
  |-----------------------------|
  | age_cat       3,451     924 |
  |-----------------------------|
  | male          4,375       0 |
  |-----------------------------|
  | Rural-Urban   4,375       0 |
  |-----------------------------|
  | region        4,375       0 |
  |-----------------------------|
  | imd           4,375       0 |
  |-----------------------------|
  | smoking       4,375       0 |
  |-----------------------------|
  | time_ra       1,979   2,396 |
  |-----------------------------|
  | bmi_cat       4,375       0 |
  |-----------------------------|
  | eth5          4,375       0 |
  +-----------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------------------+
  |                                          Total               |
  |--------------------------------------------------------------|
  |                                          N=4,375             |
  |--------------------------------------------------------------|
  | age_cat       18 - 40 years              1,290 (37.4%)       |
  |               41 - 60 years              1,140 (33.0%)       |
  |               61 - 80 years              819 (23.7%)         |
  |               >80 years                  202 ( 5.9%)         |
  |--------------------------------------------------------------|
  | male          Female                     2,289 (52.3%)       |
  |               Male                       2,086 (47.7%)       |
  |--------------------------------------------------------------|
  | Rural-Urban   Rural                      2,242 (51.2%)       |
  |               Urban                      2,133 (48.8%)       |
  |--------------------------------------------------------------|
  | region        East Midlands              420 ( 9.6%)         |
  |               East of England            473 (10.8%)         |
  |               London                     917 (21.0%)         |
  |               North East                 433 ( 9.9%)         |
  |               North West                 442 (10.1%)         |
  |               South East                 844 (19.3%)         |
  |               West Midlands              421 ( 9.6%)         |
  |               Yorkshire and the Humber   425 ( 9.7%)         |
  |--------------------------------------------------------------|
  | imd           0                          215 ( 4.9%)         |
  |               1                          866 (19.8%)         |
  |               2                          782 (17.9%)         |
  |               3                          831 (19.0%)         |
  |               4                          850 (19.4%)         |
  |               5                          831 (19.0%)         |
  |--------------------------------------------------------------|
  | smoking       Never smoked               451 (10.3%)         |
  |               Current smoker             835 (19.1%)         |
  |               Ex-smoker                  640 (14.6%)         |
  |               Unknown                    2,449 (56.0%)       |
  |--------------------------------------------------------------|
  | time_ra                                  53.99981 (32.43506) |
  |--------------------------------------------------------------|
  | bmi_cat       Missing                    879 (20.1%)         |
  |               Underweight                419 ( 9.6%)         |
  |               Healthy range              825 (18.9%)         |
  |               Overweight                 848 (19.4%)         |
  |               Obese                      1,177 (26.9%)       |
  |               Morbidly obese             227 ( 5.2%)         |
  |--------------------------------------------------------------|
  | eth5          White                      905 (20.7%)         |
  |               South Asian                869 (19.9%)         |
  |               Black                      855 (19.5%)         |
  |               Mixed                      849 (19.4%)         |
  |               Other                      897 (20.5%)         |
  +--------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.000005 saved
file ./output/tables/characteristics_strata2019.csv saved
_columna_1: contains nonnumeric characters; n generated as double
(14 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent generated as double
(6 missing values generated)
(14 missing values generated)
file ./output/tables/characteristics_strata2019_rounded.csv saved
(4,685 observations deleted)

  +-------------------------+
  | factor        N_1   m_1 |
  |-------------------------|
  | age_cat       250    65 |
  |-------------------------|
  | male          315     0 |
  |-------------------------|
  | Rural-Urban   315     0 |
  |-------------------------|
  | region        315     0 |
  |-------------------------|
  | imd           315     0 |
  |-------------------------|
  | smoking       315     0 |
  |-------------------------|
  | time_ra       137   178 |
  |-------------------------|
  | bmi_cat       315     0 |
  |-------------------------|
  | eth5          315     0 |
  +-------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------------------+
  |                                          Total               |
  |--------------------------------------------------------------|
  |                                          N=315               |
  |--------------------------------------------------------------|
  | age_cat       18 - 40 years              92 (36.8%)          |
  |               41 - 60 years              83 (33.2%)          |
  |               61 - 80 years              63 (25.2%)          |
  |               >80 years                  12 ( 4.8%)          |
  |--------------------------------------------------------------|
  | male          Female                     182 (57.8%)         |
  |               Male                       133 (42.2%)         |
  |--------------------------------------------------------------|
  | Rural-Urban   Rural                      145 (46.0%)         |
  |               Urban                      170 (54.0%)         |
  |--------------------------------------------------------------|
  | region        East Midlands              32 (10.2%)          |
  |               East of England            38 (12.1%)          |
  |               London                     65 (20.6%)          |
  |               North East                 36 (11.4%)          |
  |               North West                 30 ( 9.5%)          |
  |               South East                 57 (18.1%)          |
  |               West Midlands              22 ( 7.0%)          |
  |               Yorkshire and the Humber   35 (11.1%)          |
  |--------------------------------------------------------------|
  | imd           0                          13 ( 4.1%)          |
  |               1                          63 (20.0%)          |
  |               2                          70 (22.2%)          |
  |               3                          65 (20.6%)          |
  |               4                          48 (15.2%)          |
  |               5                          56 (17.8%)          |
  |--------------------------------------------------------------|
  | smoking       Never smoked               29 ( 9.2%)          |
  |               Current smoker             75 (23.8%)          |
  |               Ex-smoker                  30 ( 9.5%)          |
  |               Unknown                    181 (57.5%)         |
  |--------------------------------------------------------------|
  | time_ra                                  58.70839 (33.54249) |
  |--------------------------------------------------------------|
  | bmi_cat       Missing                    71 (22.5%)          |
  |               Underweight                25 ( 7.9%)          |
  |               Healthy range              55 (17.5%)          |
  |               Overweight                 68 (21.6%)          |
  |               Obese                      85 (27.0%)          |
  |               Morbidly obese             11 ( 3.5%)          |
  |--------------------------------------------------------------|
  | eth5          White                      67 (21.3%)          |
  |               South Asian                67 (21.3%)          |
  |               Black                      55 (17.5%)          |
  |               Mixed                      70 (22.2%)          |
  |               Other                      56 (17.8%)          |
  +--------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.000005 saved
(4,978 observations deleted)

  +-------------------------+
  | factor        N_1   m_1 |
  |-------------------------|
  | age_cat        16     6 |
  |-------------------------|
  | male           22     0 |
  |-------------------------|
  | Rural-Urban    22     0 |
  |-------------------------|
  | region         22     0 |
  |-------------------------|
  | imd            22     0 |
  |-------------------------|
  | smoking        22     0 |
  |-------------------------|
  | time_ra         5    17 |
  |-------------------------|
  | bmi_cat        22     0 |
  |-------------------------|
  | eth5           22     0 |
  +-------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------------------+
  |                                          Total               |
  |--------------------------------------------------------------|
  |                                          N=22                |
  |--------------------------------------------------------------|
  | age_cat       18 - 40 years              6 (38%)             |
  |               41 - 60 years              4 (25%)             |
  |               61 - 80 years              6 (38%)             |
  |--------------------------------------------------------------|
  | male          Female                     12 (55%)            |
  |               Male                       10 (45%)            |
  |--------------------------------------------------------------|
  | Rural-Urban   Rural                      8 (36%)             |
  |               Urban                      14 (64%)            |
  |--------------------------------------------------------------|
  | region        East Midlands              2 ( 9%)             |
  |               East of England            3 (14%)             |
  |               London                     4 (18%)             |
  |               North East                 4 (18%)             |
  |               North West                 2 ( 9%)             |
  |               South East                 4 (18%)             |
  |               West Midlands              1 ( 5%)             |
  |               Yorkshire and the Humber   2 ( 9%)             |
  |--------------------------------------------------------------|
  | imd           1                          1 ( 5%)             |
  |               2                          7 (32%)             |
  |               3                          4 (18%)             |
  |               4                          6 (27%)             |
  |               5                          4 (18%)             |
  |--------------------------------------------------------------|
  | smoking       Never smoked               1 ( 5%)             |
  |               Current smoker             3 (14%)             |
  |               Ex-smoker                  4 (18%)             |
  |               Unknown                    14 (64%)            |
  |--------------------------------------------------------------|
  | time_ra                                  55.88446 (30.92495) |
  |--------------------------------------------------------------|
  | bmi_cat       Missing                    6 (27%)             |
  |               Underweight                5 (23%)             |
  |               Healthy range              2 ( 9%)             |
  |               Overweight                 2 ( 9%)             |
  |               Obese                      5 (23%)             |
  |               Morbidly obese             2 ( 9%)             |
  |--------------------------------------------------------------|
  | eth5          White                      6 (27%)             |
  |               South Asian                3 (14%)             |
  |               Black                      6 (27%)             |
  |               Mixed                      5 (23%)             |
  |               Other                      2 ( 9%)             |
  +--------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.000005 saved
(2,010 observations deleted)

  +-----------------------------+
  | factor          N_1     m_1 |
  |-----------------------------|
  | age_cat       2,361     629 |
  |-----------------------------|
  | male          2,990       0 |
  |-----------------------------|
  | Rural-Urban   2,990       0 |
  |-----------------------------|
  | region        2,990       0 |
  |-----------------------------|
  | imd           2,990       0 |
  |-----------------------------|
  | smoking       2,990       0 |
  |-----------------------------|
  | time_ra       1,353   1,637 |
  |-----------------------------|
  | bmi_cat       2,990       0 |
  |-----------------------------|
  | eth5          2,990       0 |
  +-----------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------------------+
  |                                          Total               |
  |--------------------------------------------------------------|
  |                                          N=2,990             |
  |--------------------------------------------------------------|
  | age_cat       18 - 40 years              884 (37.4%)         |
  |               41 - 60 years              782 (33.1%)         |
  |               61 - 80 years              569 (24.1%)         |
  |               >80 years                  126 ( 5.3%)         |
  |--------------------------------------------------------------|
  | male          Female                     1,567 (52.4%)       |
  |               Male                       1,423 (47.6%)       |
  |--------------------------------------------------------------|
  | Rural-Urban   Rural                      1,507 (50.4%)       |
  |               Urban                      1,483 (49.6%)       |
  |--------------------------------------------------------------|
  | region        East Midlands              290 ( 9.7%)         |
  |               East of England            314 (10.5%)         |
  |               London                     634 (21.2%)         |
  |               North East                 274 ( 9.2%)         |
  |               North West                 307 (10.3%)         |
  |               South East                 567 (19.0%)         |
  |               West Midlands              304 (10.2%)         |
  |               Yorkshire and the Humber   300 (10.0%)         |
  |--------------------------------------------------------------|
  | imd           0                          144 ( 4.8%)         |
  |               1                          597 (20.0%)         |
  |               2                          525 (17.6%)         |
  |               3                          539 (18.0%)         |
  |               4                          585 (19.6%)         |
  |               5                          600 (20.1%)         |
  |--------------------------------------------------------------|
  | smoking       Never smoked               322 (10.8%)         |
  |               Current smoker             544 (18.2%)         |
  |               Ex-smoker                  453 (15.2%)         |
  |               Unknown                    1,671 (55.9%)       |
  |--------------------------------------------------------------|
  | time_ra                                  54.55819 (32.48086) |
  |--------------------------------------------------------------|
  | bmi_cat       Missing                    594 (19.9%)         |
  |               Underweight                293 ( 9.8%)         |
  |               Healthy range              566 (18.9%)         |
  |               Overweight                 588 (19.7%)         |
  |               Obese                      791 (26.5%)         |
  |               Morbidly obese             158 ( 5.3%)         |
  |--------------------------------------------------------------|
  | eth5          White                      588 (19.7%)         |
  |               South Asian                602 (20.1%)         |
  |               Black                      571 (19.1%)         |
  |               Mixed                      577 (19.3%)         |
  |               Other                      652 (21.8%)         |
  +--------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.000005 saved
file ./output/tables/characteristics_strata2020.csv saved
_columna_1: contains nonnumeric characters; n generated as double
(11 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent generated as double
(6 missing values generated)
(11 missing values generated)
file ./output/tables/characteristics_strata2020_rounded.csv saved
(4,794 observations deleted)

  +-------------------------+
  | factor        N_1   m_1 |
  |-------------------------|
  | age_cat       164    42 |
  |-------------------------|
  | male          206     0 |
  |-------------------------|
  | Rural-Urban   206     0 |
  |-------------------------|
  | region        206     0 |
  |-------------------------|
  | imd           206     0 |
  |-------------------------|
  | smoking       206     0 |
  |-------------------------|
  | time_ra        77   129 |
  |-------------------------|
  | bmi_cat       206     0 |
  |-------------------------|
  | eth5          206     0 |
  +-------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------------------+
  |                                          Total               |
  |--------------------------------------------------------------|
  |                                          N=206               |
  |--------------------------------------------------------------|
  | age_cat       18 - 40 years              60 (36.6%)          |
  |               41 - 60 years              65 (39.6%)          |
  |               61 - 80 years              30 (18.3%)          |
  |               >80 years                  9 ( 5.5%)           |
  |--------------------------------------------------------------|
  | male          Female                     111 (53.9%)         |
  |               Male                       95 (46.1%)          |
  |--------------------------------------------------------------|
  | Rural-Urban   Rural                      105 (51.0%)         |
  |               Urban                      101 (49.0%)         |
  |--------------------------------------------------------------|
  | region        East Midlands              20 ( 9.7%)          |
  |               East of England            23 (11.2%)          |
  |               London                     49 (23.8%)          |
  |               North East                 14 ( 6.8%)          |
  |               North West                 29 (14.1%)          |
  |               South East                 41 (19.9%)          |
  |               West Midlands              13 ( 6.3%)          |
  |               Yorkshire and the Humber   17 ( 8.3%)          |
  |--------------------------------------------------------------|
  | imd           0                          11 ( 5.3%)          |
  |               1                          43 (20.9%)          |
  |               2                          29 (14.1%)          |
  |               3                          42 (20.4%)          |
  |               4                          41 (19.9%)          |
  |               5                          40 (19.4%)          |
  |--------------------------------------------------------------|
  | smoking       Never smoked               24 (11.7%)          |
  |               Current smoker             30 (14.6%)          |
  |               Ex-smoker                  38 (18.4%)          |
  |               Unknown                    114 (55.3%)         |
  |--------------------------------------------------------------|
  | time_ra                                  56.99793 (33.17112) |
  |--------------------------------------------------------------|
  | bmi_cat       Missing                    44 (21.4%)          |
  |               Underweight                27 (13.1%)          |
  |               Healthy range              37 (18.0%)          |
  |               Overweight                 40 (19.4%)          |
  |               Obese                      50 (24.3%)          |
  |               Morbidly obese             8 ( 3.9%)           |
  |--------------------------------------------------------------|
  | eth5          White                      35 (17.0%)          |
  |               South Asian                39 (18.9%)          |
  |               Black                      50 (24.3%)          |
  |               Mixed                      39 (18.9%)          |
  |               Other                      43 (20.9%)          |
  +--------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.000005 saved
(4,995 observations deleted)

  +-------------------------+
  | factor        N_1   m_1 |
  |-------------------------|
  | age_cat         5     0 |
  |-------------------------|
  | male            5     0 |
  |-------------------------|
  | Rural-Urban     5     0 |
  |-------------------------|
  | region          5     0 |
  |-------------------------|
  | imd             5     0 |
  |-------------------------|
  | smoking         5     0 |
  |-------------------------|
  | time_ra         0     5 |
  |-------------------------|
  | bmi_cat         5     0 |
  |-------------------------|
  | eth5            5     0 |
  +-------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +------------------------------------------+
  |                                 Total    |
  |------------------------------------------|
  |                                 N=5      |
  |------------------------------------------|
  | age_cat       18 - 40 years     5 (100%) |
  |------------------------------------------|
  | male          Female            3 (60%)  |
  |               Male              2 (40%)  |
  |------------------------------------------|
  | Rural-Urban   Rural             4 (80%)  |
  |               Urban             1 (20%)  |
  |------------------------------------------|
  | region        East of England   1 (20%)  |
  |               North East        1 (20%)  |
  |               South East        2 (40%)  |
  |               West Midlands     1 (20%)  |
  |------------------------------------------|
  | imd           1                 1 (20%)  |
  |               4                 3 (60%)  |
  |               5                 1 (20%)  |
  |------------------------------------------|
  | smoking       Never smoked      1 (20%)  |
  |               Current smoker    1 (20%)  |
  |               Unknown           3 (60%)  |
  |------------------------------------------|
  | time_ra                                  |
  |------------------------------------------|
  | bmi_cat       Missing           3 (60%)  |
  |               Overweight        1 (20%)  |
  |               Obese             1 (20%)  |
  |------------------------------------------|
  | eth5          White             1 (20%)  |
  |               Black             1 (20%)  |
  |               Mixed             2 (40%)  |
  |               Other             1 (20%)  |
  +------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
(note: variable level was str15, now str24 to accommodate using data's
       values)
(note: variable Total was str8, now str19 to accommodate using data's values)
file /tmp/St00015.000005 saved
(3,145 observations deleted)

  +-----------------------------+
  | factor          N_1     m_1 |
  |-----------------------------|
  | age_cat       1,473     382 |
  |-----------------------------|
  | male          1,855       0 |
  |-----------------------------|
  | Rural-Urban   1,855       0 |
  |-----------------------------|
  | region        1,855       0 |
  |-----------------------------|
  | imd           1,855       0 |
  |-----------------------------|
  | smoking       1,855       0 |
  |-----------------------------|
  | time_ra         844   1,011 |
  |-----------------------------|
  | bmi_cat       1,855       0 |
  |-----------------------------|
  | eth5          1,855       0 |
  +-----------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------------------+
  |                                          Total               |
  |--------------------------------------------------------------|
  |                                          N=1,855             |
  |--------------------------------------------------------------|
  | age_cat       18 - 40 years              538 (36.5%)         |
  |               41 - 60 years              486 (33.0%)         |
  |               61 - 80 years              373 (25.3%)         |
  |               >80 years                  76 ( 5.2%)          |
  |--------------------------------------------------------------|
  | male          Female                     990 (53.4%)         |
  |               Male                       865 (46.6%)         |
  |--------------------------------------------------------------|
  | Rural-Urban   Rural                      918 (49.5%)         |
  |               Urban                      937 (50.5%)         |
  |--------------------------------------------------------------|
  | region        East Midlands              188 (10.1%)         |
  |               East of England            192 (10.4%)         |
  |               London                     378 (20.4%)         |
  |               North East                 179 ( 9.6%)         |
  |               North West                 175 ( 9.4%)         |
  |               South East                 362 (19.5%)         |
  |               West Midlands              180 ( 9.7%)         |
  |               Yorkshire and the Humber   201 (10.8%)         |
  |--------------------------------------------------------------|
  | imd           0                          86 ( 4.6%)          |
  |               1                          366 (19.7%)         |
  |               2                          349 (18.8%)         |
  |               3                          334 (18.0%)         |
  |               4                          357 (19.2%)         |
  |               5                          363 (19.6%)         |
  |--------------------------------------------------------------|
  | smoking       Never smoked               190 (10.2%)         |
  |               Current smoker             347 (18.7%)         |
  |               Ex-smoker                  273 (14.7%)         |
  |               Unknown                    1,045 (56.3%)       |
  |--------------------------------------------------------------|
  | time_ra                                  54.01324 (32.91662) |
  |--------------------------------------------------------------|
  | bmi_cat       Missing                    378 (20.4%)         |
  |               Underweight                180 ( 9.7%)         |
  |               Healthy range              349 (18.8%)         |
  |               Overweight                 362 (19.5%)         |
  |               Obese                      497 (26.8%)         |
  |               Morbidly obese             89 ( 4.8%)          |
  |--------------------------------------------------------------|
  | eth5          White                      377 (20.3%)         |
  |               South Asian                387 (20.9%)         |
  |               Black                      347 (18.7%)         |
  |               Mixed                      347 (18.7%)         |
  |               Other                      397 (21.4%)         |
  +--------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.000005 saved
file ./output/tables/characteristics_strata2021.csv saved
_columna_1: contains nonnumeric characters; n generated as double
(8 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent generated as double
(7 missing values generated)
(8 missing values generated)
file ./output/tables/characteristics_strata2021_rounded.csv saved

. 
. * Tabulate characteristics by categories of differences in rheumatology outpa
> tient appointments for each year
. drop if region=="missing"
(0 observations deleted)

. tempfile tempfile

. forvalues i=2020/2021 {
  2.     * Same number or more appointments 
.     preserve
  3.     keep if fewer_appts_`i'==0
  4.     table1_mc, vars(age_cat cate \ male cate \ urban_rural_bin cate \ regi
> on cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat cate \ eth5 cate)
>  clear
  5.     save `tempfile', replace
  6.     restore
  7.     * Fewer appointments 
.     preserve
  8.     keep if fewer_appts_`i'==1
  9.     table1_mc, vars(age_cat cate \ male cate \ urban_rural_bin cate \ regi
> on cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat cate \ eth5 cate)
>  clear
 10.     append using `tempfile'
 11.     save `tempfile', replace
 12.     restore 
 13.     * No appointments
.     preserve 
 14.     keep if no_appts_`i' ==1
 15.     table1_mc, vars(age_cat cate \ male cate \ urban_rural_bin cate \ regi
> on cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat cate \ eth5 cate)
>  clear
 16.     append using `tempfile'
 17.     save `tempfile', replace
 18.     export delimited using ./output/tables/characteristics_diff_strata`i'.
> csv    
 19.     destring _columna_1, gen(n) force
 20.     destring _columnb_1, gen(percent) ignore("-" "%" "(" ")") force
 21.     gen rounded_n = round(n, 5)
 22.     keep factor level rounded_n percent
 23.     export delimited using ./output/tables/characteristics_diff_strata`i'_
> rounded.csv
 24.     restore
 25.     * Logistic regression 
.     foreach var in urban_rural_bin i.imd ib3.region_n i.eth5 {
 26.         logit fewer_appts_`i' `var' ib1.age_cat male, or 
 27.         est sto m1 
 28.         parmest, label eform format(estimate p min95 max95) saving("./outp
> ut/tempdata/`var'_diff_rheum_`i'", replace) idstr("`var'_rheum_`i'")
 29.         }
 30.     logit fewer_appts_`i' ib1.age_cat male urban_rural_bin i.imd ib3.regio
> n_n i.eth5, or 
 31.     est sto m1
 32.     parmest, label eform format(estimate p min95 max95) saving("./output/t
> empdata/multi_diff_rheum_`i'", replace) idstr("multi_rheum_`i'")
 33.     }
(3,195 observations deleted)

  +---------------------------+
  | factor          N_1   m_1 |
  |---------------------------|
  | age_cat       1,406   399 |
  |---------------------------|
  | male          1,805     0 |
  |---------------------------|
  | Rural-Urban   1,805     0 |
  |---------------------------|
  | region        1,805     0 |
  |---------------------------|
  | imd           1,805     0 |
  |---------------------------|
  | smoking       1,805     0 |
  |---------------------------|
  | time_ra         812   993 |
  |---------------------------|
  | bmi_cat       1,805     0 |
  |---------------------------|
  | eth5          1,805     0 |
  +---------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------------------+
  |                                          Total               |
  |--------------------------------------------------------------|
  |                                          N=1,805             |
  |--------------------------------------------------------------|
  | age_cat       18 - 40 years              546 (38.8%)         |
  |               41 - 60 years              443 (31.5%)         |
  |               61 - 80 years              341 (24.3%)         |
  |               >80 years                  76 ( 5.4%)          |
  |--------------------------------------------------------------|
  | male          Female                     938 (52.0%)         |
  |               Male                       867 (48.0%)         |
  |--------------------------------------------------------------|
  | Rural-Urban   Rural                      934 (51.7%)         |
  |               Urban                      871 (48.3%)         |
  |--------------------------------------------------------------|
  | region        East Midlands              179 ( 9.9%)         |
  |               East of England            185 (10.2%)         |
  |               London                     380 (21.1%)         |
  |               North East                 161 ( 8.9%)         |
  |               North West                 176 ( 9.8%)         |
  |               South East                 335 (18.6%)         |
  |               West Midlands              191 (10.6%)         |
  |               Yorkshire and the Humber   198 (11.0%)         |
  |--------------------------------------------------------------|
  | imd           0                          86 ( 4.8%)          |
  |               1                          385 (21.3%)         |
  |               2                          316 (17.5%)         |
  |               3                          327 (18.1%)         |
  |               4                          334 (18.5%)         |
  |               5                          357 (19.8%)         |
  |--------------------------------------------------------------|
  | smoking       Never smoked               189 (10.5%)         |
  |               Current smoker             330 (18.3%)         |
  |               Ex-smoker                  276 (15.3%)         |
  |               Unknown                    1,010 (56.0%)       |
  |--------------------------------------------------------------|
  | time_ra                                  55.20283 (32.66828) |
  |--------------------------------------------------------------|
  | bmi_cat       Missing                    358 (19.8%)         |
  |               Underweight                178 ( 9.9%)         |
  |               Healthy range              345 (19.1%)         |
  |               Overweight                 351 (19.4%)         |
  |               Obese                      479 (26.5%)         |
  |               Morbidly obese             94 ( 5.2%)          |
  |--------------------------------------------------------------|
  | eth5          White                      352 (19.5%)         |
  |               South Asian                387 (21.4%)         |
  |               Black                      346 (19.2%)         |
  |               Mixed                      339 (18.8%)         |
  |               Other                      381 (21.1%)         |
  +--------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
(note: file /tmp/St00015.00000f not found)
file /tmp/St00015.00000f saved
(3,512 observations deleted)

  +---------------------------+
  | factor          N_1   m_1 |
  |---------------------------|
  | age_cat       1,195   293 |
  |---------------------------|
  | male          1,488     0 |
  |---------------------------|
  | Rural-Urban   1,488     0 |
  |---------------------------|
  | region        1,488     0 |
  |---------------------------|
  | imd           1,488     0 |
  |---------------------------|
  | smoking       1,488     0 |
  |---------------------------|
  | time_ra         665   823 |
  |---------------------------|
  | bmi_cat       1,488     0 |
  |---------------------------|
  | eth5          1,488     0 |
  +---------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------------------+
  |                                          Total               |
  |--------------------------------------------------------------|
  |                                          N=1,488             |
  |--------------------------------------------------------------|
  | age_cat       18 - 40 years              428 (35.8%)         |
  |               41 - 60 years              419 (35.1%)         |
  |               61 - 80 years              286 (23.9%)         |
  |               >80 years                  62 ( 5.2%)          |
  |--------------------------------------------------------------|
  | male          Female                     801 (53.8%)         |
  |               Male                       687 (46.2%)         |
  |--------------------------------------------------------------|
  | Rural-Urban   Rural                      710 (47.7%)         |
  |               Urban                      778 (52.3%)         |
  |--------------------------------------------------------------|
  | region        East Midlands              142 ( 9.5%)         |
  |               East of England            165 (11.1%)         |
  |               London                     320 (21.5%)         |
  |               North East                 149 (10.0%)         |
  |               North West                 159 (10.7%)         |
  |               South East                 282 (19.0%)         |
  |               West Midlands              135 ( 9.1%)         |
  |               Yorkshire and the Humber   136 ( 9.1%)         |
  |--------------------------------------------------------------|
  | imd           0                          71 ( 4.8%)          |
  |               1                          266 (17.9%)         |
  |               2                          281 (18.9%)         |
  |               3                          274 (18.4%)         |
  |               4                          302 (20.3%)         |
  |               5                          294 (19.8%)         |
  |--------------------------------------------------------------|
  | smoking       Never smoked               157 (10.6%)         |
  |               Current smoker             283 (19.0%)         |
  |               Ex-smoker                  208 (14.0%)         |
  |               Unknown                    840 (56.5%)         |
  |--------------------------------------------------------------|
  | time_ra                                  54.39684 (32.41229) |
  |--------------------------------------------------------------|
  | bmi_cat       Missing                    307 (20.6%)         |
  |               Underweight                140 ( 9.4%)         |
  |               Healthy range              273 (18.3%)         |
  |               Overweight                 299 (20.1%)         |
  |               Obese                      395 (26.5%)         |
  |               Morbidly obese             74 ( 5.0%)          |
  |--------------------------------------------------------------|
  | eth5          White                      303 (20.4%)         |
  |               South Asian                280 (18.8%)         |
  |               Black                      276 (18.5%)         |
  |               Mixed                      306 (20.6%)         |
  |               Other                      323 (21.7%)         |
  +--------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.00000f saved
(4,966 observations deleted)

  +-------------------------+
  | factor        N_1   m_1 |
  |-------------------------|
  | age_cat        26     8 |
  |-------------------------|
  | male           34     0 |
  |-------------------------|
  | Rural-Urban    34     0 |
  |-------------------------|
  | region         34     0 |
  |-------------------------|
  | imd            34     0 |
  |-------------------------|
  | smoking        34     0 |
  |-------------------------|
  | time_ra        18    16 |
  |-------------------------|
  | bmi_cat        34     0 |
  |-------------------------|
  | eth5           34     0 |
  +-------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------------------+
  |                                          Total               |
  |--------------------------------------------------------------|
  |                                          N=34                |
  |--------------------------------------------------------------|
  | age_cat       18 - 40 years              8 (31%)             |
  |               41 - 60 years              7 (27%)             |
  |               61 - 80 years              11 (42%)            |
  |--------------------------------------------------------------|
  | male          Female                     22 (65%)            |
  |               Male                       12 (35%)            |
  |--------------------------------------------------------------|
  | Rural-Urban   Rural                      16 (47%)            |
  |               Urban                      18 (53%)            |
  |--------------------------------------------------------------|
  | region        East Midlands              3 ( 9%)             |
  |               East of England            5 (15%)             |
  |               London                     3 ( 9%)             |
  |               North East                 4 (12%)             |
  |               North West                 4 (12%)             |
  |               South East                 11 (32%)            |
  |               West Midlands              1 ( 3%)             |
  |               Yorkshire and the Humber   3 ( 9%)             |
  |--------------------------------------------------------------|
  | imd           1                          10 (29%)            |
  |               2                          5 (15%)             |
  |               3                          7 (21%)             |
  |               4                          3 ( 9%)             |
  |               5                          9 (26%)             |
  |--------------------------------------------------------------|
  | smoking       Never smoked               6 (18%)             |
  |               Current smoker             9 (26%)             |
  |               Ex-smoker                  3 ( 9%)             |
  |               Unknown                    16 (47%)            |
  |--------------------------------------------------------------|
  | time_ra                                  63.39478 (34.92302) |
  |--------------------------------------------------------------|
  | bmi_cat       Missing                    6 (18%)             |
  |               Underweight                5 (15%)             |
  |               Healthy range              5 (15%)             |
  |               Overweight                 8 (24%)             |
  |               Obese                      7 (21%)             |
  |               Morbidly obese             3 ( 9%)             |
  |--------------------------------------------------------------|
  | eth5          White                      6 (18%)             |
  |               South Asian                5 (15%)             |
  |               Black                      10 (29%)            |
  |               Mixed                      7 (21%)             |
  |               Other                      6 (18%)             |
  +--------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.00000f saved
file ./output/tables/characteristics_diff_strata2020.csv saved
_columna_1: contains nonnumeric characters; n generated as double
(7 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent generated as double
(6 missing values generated)
(7 missing values generated)
file ./output/tables/characteristics_diff_strata2020_rounded.csv saved

Iteration 0:   log likelihood =  -1794.308  
Iteration 1:   log likelihood =  -1789.432  
Iteration 2:   log likelihood = -1789.4318  

Logistic regression                             Number of obs     =      2,601
                                                LR chi2(5)        =       9.75
                                                Prob > chi2       =     0.0826
Log likelihood = -1789.4318                     Pseudo R2         =     0.0027

------------------------------------------------------------------------------
fewer~s_2020 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
urban_rura~n |   1.203788   .0950586     2.35   0.019     1.031178    1.405291
             |
     age_cat |
18 - 40 y..  |   .8316421   .0781884    -1.96   0.050     .6916863    .9999166
61 - 80 y..  |   .8917651   .0939733    -1.09   0.277     .7253569     1.09635
  >80 years  |   .8694905   .1603706    -0.76   0.448     .6057138    1.248137
             |
        male |   .9651982    .076377    -0.45   0.654     .8265329    1.127127
       _cons |   .8728621   .0762981    -1.56   0.120     .7354292    1.035978
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/urban_rural_bin_diff_rheum_2020.dta not found)
file ./output/tempdata/urban_rural_bin_diff_rheum_2020.dta saved

Iteration 0:   log likelihood =  -1794.308  
Iteration 1:   log likelihood = -1787.0015  
Iteration 2:   log likelihood = -1787.0005  
Iteration 3:   log likelihood = -1787.0005  

Logistic regression                             Number of obs     =      2,601
                                                LR chi2(9)        =      14.62
                                                Prob > chi2       =     0.1021
Log likelihood = -1787.0005                     Pseudo R2         =     0.0041

------------------------------------------------------------------------------
fewer~s_2020 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         imd |
          1  |   .8066779   .1631614    -1.06   0.288     .5426669    1.199132
          2  |   1.120543   .2273022     0.56   0.575     .7529437    1.667612
          3  |   1.028997   .2098195     0.14   0.889      .689999    1.534546
          4  |   1.171444   .2370467     0.78   0.434     .7879107    1.741669
          5  |   1.027131   .2071284     0.13   0.894     .6917907    1.525024
             |
     age_cat |
18 - 40 y..  |   .8290868   .0780977    -1.99   0.047     .6893173    .9971968
61 - 80 y..  |   .8853891   .0934526    -1.15   0.249     .7199296    1.088876
  >80 years  |   .8728092    .161181    -0.74   0.461     .6077551    1.253459
             |
        male |   .9754687   .0771848    -0.31   0.754     .8353362    1.139109
       _cons |   .9378678   .1812472    -0.33   0.740     .6421598    1.369746
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/i.imd_diff_rheum_2020 not found)
file ./output/tempdata/i.imd_diff_rheum_2020 saved

Iteration 0:   log likelihood =  -1794.308  
Iteration 1:   log likelihood =  -1788.327  
Iteration 2:   log likelihood = -1788.3265  
Iteration 3:   log likelihood = -1788.3265  

Logistic regression                             Number of obs     =      2,601
                                                LR chi2(11)       =      11.96
                                                Prob > chi2       =     0.3664
Log likelihood = -1788.3265                     Pseudo R2         =     0.0033

------------------------------------------------------------------------------
fewer~s_2020 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    region_n |
          1  |   .8820653   .1356469    -0.82   0.414     .6525296    1.192343
          2  |   1.051498   .1547633     0.34   0.733     .7879991    1.403109
          4  |   1.149009   .1760522     0.91   0.365      .850945    1.551477
          5  |   .9857078   .1492577    -0.10   0.924     .7325844    1.326291
          6  |   .9880862   .1243567    -0.10   0.924     .7720864    1.264514
          8  |   .7668478   .1175121    -1.73   0.083     .5678984    1.035494
          9  |   .8429591   .1261982    -1.14   0.254        .6286    1.130417
             |
     age_cat |
18 - 40 y..  |   .8295008   .0781161    -1.98   0.047      .689695    .9976461
61 - 80 y..  |   .8930165    .094374    -1.07   0.284     .7259463    1.098536
  >80 years  |   .8638001   .1595416    -0.79   0.428     .6014487    1.240589
             |
        male |    .977188     .07748    -0.29   0.771     .8365414    1.141481
       _cons |   .9940569   .1087798    -0.05   0.957     .8021657    1.231852
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/ib3.region_n_diff_rheum_2020 not found)
file ./output/tempdata/ib3.region_n_diff_rheum_2020 saved

Iteration 0:   log likelihood =  -1794.308  
Iteration 1:   log likelihood = -1789.4328  
Iteration 2:   log likelihood = -1789.4326  
Iteration 3:   log likelihood = -1789.4326  

Logistic regression                             Number of obs     =      2,601
                                                LR chi2(8)        =       9.75
                                                Prob > chi2       =     0.2830
Log likelihood = -1789.4326                     Pseudo R2         =     0.0027

------------------------------------------------------------------------------
fewer~s_2020 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .7983705   .0993315    -1.81   0.070     .6256045    1.018847
      Black  |    .868262   .1097307    -1.12   0.264     .6777603    1.112309
      Mixed  |   1.028569   .1293286     0.22   0.823     .8039077    1.316013
      Other  |   .9435389   .1153381    -0.48   0.634     .7425215    1.198976
             |
     age_cat |
18 - 40 y..  |   .8248134   .0775683    -2.05   0.041      .685971    .9917578
61 - 80 y..  |   .8956206    .094436    -1.05   0.296      .728403    1.101226
  >80 years  |   .8694488   .1603998    -0.76   0.448     .6056344    1.248181
             |
        male |   .9642533   .0763251    -0.46   0.646     .8256853    1.126076
       _cons |   1.040952   .1154774     0.36   0.718      .837535    1.293773
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/i.eth5_diff_rheum_2020 not found)
file ./output/tempdata/i.eth5_diff_rheum_2020 saved

Iteration 0:   log likelihood =  -1794.308  
Iteration 1:   log likelihood = -1777.1573  
Iteration 2:   log likelihood = -1777.1519  
Iteration 3:   log likelihood = -1777.1519  

Logistic regression                             Number of obs     =      2,601
                                                LR chi2(21)       =      34.31
                                                Prob > chi2       =     0.0335
Log likelihood = -1777.1519                     Pseudo R2         =     0.0096

------------------------------------------------------------------------------
fewer~s_2020 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     age_cat |
18 - 40 y..  |   .8310199   .0787248    -1.95   0.051     .6901996    1.000571
61 - 80 y..  |   .9046706   .0962029    -0.94   0.346      .734469    1.114314
  >80 years  |   .8890342   .1650345    -0.63   0.526      .617884    1.279175
             |
        male |   .9591145   .0765919    -0.52   0.601     .8201554    1.121617
urban_rura~n |    1.22378   .0974934     2.53   0.011     1.046868     1.43059
             |
         imd |
          1  |    .801902   .1630436    -1.09   0.278     .5383368    1.194506
          2  |   1.105796   .2253433     0.49   0.622     .7416756    1.648679
          3  |   1.033588   .2118522     0.16   0.872     .6916375    1.544601
          4  |   1.183499   .2405246     0.83   0.407     .7946516    1.762622
          5  |   1.036325   .2099338     0.18   0.860     .6967288    1.541446
             |
    region_n |
          1  |    .880251   .1365189    -0.82   0.411     .6495207    1.192944
          2  |   1.079757   .1600183     0.52   0.605     .8075682    1.443686
          4  |   1.184217   .1827099     1.10   0.273      .875188    1.602363
          5  |     .99733   .1519643    -0.02   0.986     .7398443    1.344428
          6  |   .9975062   .1262849    -0.02   0.984     .7783107    1.278434
          8  |   .7816483   .1204534    -1.60   0.110     .5778828    1.057263
          9  |   .8603557   .1297402    -1.00   0.319     .6402038    1.156213
             |
        eth5 |
South Asian  |   .7884333   .0988377    -1.90   0.058     .6166783    1.008025
      Black  |   .8709968    .110944    -1.08   0.278     .6785689    1.117993
      Mixed  |   1.030435   .1305229     0.24   0.813     .8038981     1.32081
      Other  |   .9366567   .1154502    -0.53   0.595     .7356365    1.192608
             |
       _cons |   .9464057    .213777    -0.24   0.807     .6078625    1.473497
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/multi_diff_rheum_2020.dta not found)
file ./output/tempdata/multi_diff_rheum_2020.dta saved
(3,824 observations deleted)

  +---------------------------+
  | factor          N_1   m_1 |
  |---------------------------|
  | age_cat         935   241 |
  |---------------------------|
  | male          1,176     0 |
  |---------------------------|
  | Rural-Urban   1,176     0 |
  |---------------------------|
  | region        1,176     0 |
  |---------------------------|
  | imd           1,176     0 |
  |---------------------------|
  | smoking       1,176     0 |
  |---------------------------|
  | time_ra         526   650 |
  |---------------------------|
  | bmi_cat       1,176     0 |
  |---------------------------|
  | eth5          1,176     0 |
  +---------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------------------+
  |                                          Total               |
  |--------------------------------------------------------------|
  |                                          N=1,176             |
  |--------------------------------------------------------------|
  | age_cat       18 - 40 years              346 (37.0%)         |
  |               41 - 60 years              317 (33.9%)         |
  |               61 - 80 years              225 (24.1%)         |
  |               >80 years                  47 ( 5.0%)          |
  |--------------------------------------------------------------|
  | male          Female                     625 (53.1%)         |
  |               Male                       551 (46.9%)         |
  |--------------------------------------------------------------|
  | Rural-Urban   Rural                      586 (49.8%)         |
  |               Urban                      590 (50.2%)         |
  |--------------------------------------------------------------|
  | region        East Midlands              117 ( 9.9%)         |
  |               East of England            114 ( 9.7%)         |
  |               London                     249 (21.2%)         |
  |               North East                 118 (10.0%)         |
  |               North West                 113 ( 9.6%)         |
  |               South East                 220 (18.7%)         |
  |               West Midlands              121 (10.3%)         |
  |               Yorkshire and the Humber   124 (10.5%)         |
  |--------------------------------------------------------------|
  | imd           0                          52 ( 4.4%)          |
  |               1                          252 (21.4%)         |
  |               2                          218 (18.5%)         |
  |               3                          215 (18.3%)         |
  |               4                          203 (17.3%)         |
  |               5                          236 (20.1%)         |
  |--------------------------------------------------------------|
  | smoking       Never smoked               119 (10.1%)         |
  |               Current smoker             224 (19.0%)         |
  |               Ex-smoker                  176 (15.0%)         |
  |               Unknown                    657 (55.9%)         |
  |--------------------------------------------------------------|
  | time_ra                                  53.97665 (33.09614) |
  |--------------------------------------------------------------|
  | bmi_cat       Missing                    252 (21.4%)         |
  |               Underweight                107 ( 9.1%)         |
  |               Healthy range              228 (19.4%)         |
  |               Overweight                 225 (19.1%)         |
  |               Obese                      306 (26.0%)         |
  |               Morbidly obese             58 ( 4.9%)          |
  |--------------------------------------------------------------|
  | eth5          White                      228 (19.4%)         |
  |               South Asian                250 (21.3%)         |
  |               Black                      225 (19.1%)         |
  |               Mixed                      232 (19.7%)         |
  |               Other                      241 (20.5%)         |
  +--------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.00000f saved
(4,126 observations deleted)

  +-------------------------+
  | factor        N_1   m_1 |
  |-------------------------|
  | age_cat       693   181 |
  |-------------------------|
  | male          874     0 |
  |-------------------------|
  | Rural-Urban   874     0 |
  |-------------------------|
  | region        874     0 |
  |-------------------------|
  | imd           874     0 |
  |-------------------------|
  | smoking       874     0 |
  |-------------------------|
  | time_ra       392   482 |
  |-------------------------|
  | bmi_cat       874     0 |
  |-------------------------|
  | eth5          874     0 |
  +-------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------------------+
  |                                          Total               |
  |--------------------------------------------------------------|
  |                                          N=874               |
  |--------------------------------------------------------------|
  | age_cat       18 - 40 years              252 (36.4%)         |
  |               41 - 60 years              226 (32.6%)         |
  |               61 - 80 years              177 (25.5%)         |
  |               >80 years                  38 ( 5.5%)          |
  |--------------------------------------------------------------|
  | male          Female                     471 (53.9%)         |
  |               Male                       403 (46.1%)         |
  |--------------------------------------------------------------|
  | Rural-Urban   Rural                      433 (49.5%)         |
  |               Urban                      441 (50.5%)         |
  |--------------------------------------------------------------|
  | region        East Midlands              91 (10.4%)          |
  |               East of England            99 (11.3%)          |
  |               London                     176 (20.1%)         |
  |               North East                 76 ( 8.7%)          |
  |               North West                 87 (10.0%)          |
  |               South East                 182 (20.8%)         |
  |               West Midlands              71 ( 8.1%)          |
  |               Yorkshire and the Humber   92 (10.5%)          |
  |--------------------------------------------------------------|
  | imd           0                          45 ( 5.1%)          |
  |               1                          153 (17.5%)         |
  |               2                          159 (18.2%)         |
  |               3                          158 (18.1%)         |
  |               4                          195 (22.3%)         |
  |               5                          164 (18.8%)         |
  |--------------------------------------------------------------|
  | smoking       Never smoked               94 (10.8%)          |
  |               Current smoker             152 (17.4%)         |
  |               Ex-smoker                  133 (15.2%)         |
  |               Unknown                    495 (56.6%)         |
  |--------------------------------------------------------------|
  | time_ra                                  54.60958 (32.74388) |
  |--------------------------------------------------------------|
  | bmi_cat       Missing                    172 (19.7%)         |
  |               Underweight                95 (10.9%)          |
  |               Healthy range              155 (17.7%)         |
  |               Overweight                 175 (20.0%)         |
  |               Obese                      238 (27.2%)         |
  |               Morbidly obese             39 ( 4.5%)          |
  |--------------------------------------------------------------|
  | eth5          White                      185 (21.2%)         |
  |               South Asian                172 (19.7%)         |
  |               Black                      170 (19.5%)         |
  |               Mixed                      151 (17.3%)         |
  |               Other                      196 (22.4%)         |
  +--------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.00000f saved
(4,984 observations deleted)

  +-------------------------+
  | factor        N_1   m_1 |
  |-------------------------|
  | age_cat        14     2 |
  |-------------------------|
  | male           16     0 |
  |-------------------------|
  | Rural-Urban    16     0 |
  |-------------------------|
  | region         16     0 |
  |-------------------------|
  | imd            16     0 |
  |-------------------------|
  | smoking        16     0 |
  |-------------------------|
  | time_ra         3    13 |
  |-------------------------|
  | bmi_cat        16     0 |
  |-------------------------|
  | eth5           16     0 |
  +-------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------------------+
  |                                          Total               |
  |--------------------------------------------------------------|
  |                                          N=16                |
  |--------------------------------------------------------------|
  | age_cat       18 - 40 years              5 (36%)             |
  |               41 - 60 years              8 (57%)             |
  |               61 - 80 years              1 ( 7%)             |
  |--------------------------------------------------------------|
  | male          Female                     8 (50%)             |
  |               Male                       8 (50%)             |
  |--------------------------------------------------------------|
  | Rural-Urban   Rural                      8 (50%)             |
  |               Urban                      8 (50%)             |
  |--------------------------------------------------------------|
  | region        East of England            3 (19%)             |
  |               London                     2 (12%)             |
  |               North West                 4 (25%)             |
  |               South East                 3 (19%)             |
  |               West Midlands              2 (12%)             |
  |               Yorkshire and the Humber   2 (12%)             |
  |--------------------------------------------------------------|
  | imd           1                          5 (31%)             |
  |               2                          1 ( 6%)             |
  |               3                          3 (19%)             |
  |               4                          3 (19%)             |
  |               5                          4 (25%)             |
  |--------------------------------------------------------------|
  | smoking       Never smoked               2 (12%)             |
  |               Current smoker             2 (12%)             |
  |               Ex-smoker                  2 (12%)             |
  |               Unknown                    10 (62%)            |
  |--------------------------------------------------------------|
  | time_ra                                  59.11476 (40.06078) |
  |--------------------------------------------------------------|
  | bmi_cat       Missing                    1 ( 6%)             |
  |               Underweight                5 (31%)             |
  |               Healthy range              3 (19%)             |
  |               Overweight                 3 (19%)             |
  |               Obese                      4 (25%)             |
  |--------------------------------------------------------------|
  | eth5          South Asian                4 (25%)             |
  |               Black                      3 (19%)             |
  |               Mixed                      5 (31%)             |
  |               Other                      4 (25%)             |
  +--------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.00000f saved
file ./output/tables/characteristics_diff_strata2021.csv saved
_columna_1: contains nonnumeric characters; n generated as double
(6 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent generated as double
(6 missing values generated)
(6 missing values generated)
file ./output/tables/characteristics_diff_strata2021_rounded.csv saved

Iteration 0:   log likelihood = -1110.3903  
Iteration 1:   log likelihood = -1109.7648  
Iteration 2:   log likelihood = -1109.7648  

Logistic regression                             Number of obs     =      1,628
                                                LR chi2(5)        =       1.25
                                                Prob > chi2       =     0.9399
Log likelihood = -1109.7648                     Pseudo R2         =     0.0006

------------------------------------------------------------------------------
fewer~s_2021 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
urban_rura~n |    1.07281   .1078966     0.70   0.485     .8808753    1.306567
             |
     age_cat |
18 - 40 y..  |   1.021831   .1228472     0.18   0.857     .8073194     1.29334
61 - 80 y..  |   1.104927   .1469432     0.75   0.453     .8513993    1.433951
  >80 years  |   1.139888   .2679295     0.56   0.578      .719098    1.806909
             |
        male |   .9860264   .0995477    -0.14   0.889     .8090076    1.201779
       _cons |   .6915259   .0766065    -3.33   0.001     .5565616    .8592184
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/urban_rural_bin_diff_rheum_2021.dta not found)
file ./output/tempdata/urban_rural_bin_diff_rheum_2021.dta saved

Iteration 0:   log likelihood = -1110.3903  
Iteration 1:   log likelihood = -1105.4883  
Iteration 2:   log likelihood = -1105.4872  
Iteration 3:   log likelihood = -1105.4872  

Logistic regression                             Number of obs     =      1,628
                                                LR chi2(9)        =       9.81
                                                Prob > chi2       =     0.3664
Log likelihood = -1105.4872                     Pseudo R2         =     0.0044

------------------------------------------------------------------------------
fewer~s_2021 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         imd |
          1  |   .7816616   .2008767    -0.96   0.338      .472358      1.2935
          2  |   .9283346   .2386582    -0.29   0.772     .5608877    1.536502
          3  |   .8964104   .2326101    -0.42   0.673     .5390487    1.490685
          4  |   1.245182    .319267     0.86   0.392     .7533265    2.058176
          5  |   .9018902   .2305438    -0.40   0.686     .5464709    1.488471
             |
     age_cat |
18 - 40 y..  |   1.028332   .1242199     0.23   0.817     .8115411    1.303036
61 - 80 y..  |   1.114479   .1487655     0.81   0.417     .8579259    1.447752
  >80 years  |   1.175997   .2774964     0.69   0.492     .7405437    1.867504
             |
        male |   .9865951     .09974    -0.13   0.894     .8092572    1.202794
       _cons |   .7559596   .1853683    -1.14   0.254     .4674941    1.222422
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/i.imd_diff_rheum_2021 not found)
file ./output/tempdata/i.imd_diff_rheum_2021 saved

Iteration 0:   log likelihood = -1110.3903  
Iteration 1:   log likelihood = -1106.5591  
Iteration 2:   log likelihood = -1106.5571  
Iteration 3:   log likelihood = -1106.5571  

Logistic regression                             Number of obs     =      1,628
                                                LR chi2(11)       =       7.67
                                                Prob > chi2       =     0.7428
Log likelihood = -1106.5571                     Pseudo R2         =     0.0035

------------------------------------------------------------------------------
fewer~s_2021 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    region_n |
          1  |   1.061929      .2054     0.31   0.756     .7268667    1.551444
          2  |    1.18553   .2237651     0.90   0.367     .8189377    1.716225
          4  |    .938842   .1860667    -0.32   0.750     .6366416     1.38449
          5  |   1.282196   .2510886     1.27   0.204     .8735068      1.8821
          6  |   1.125632   .1784566     0.75   0.455     .8249883    1.535837
          8  |    .757696   .1550355    -1.36   0.175     .5073724    1.131522
          9  |   1.041662   .1958289     0.22   0.828     .7206159     1.50574
             |
     age_cat |
18 - 40 y..  |   1.012693   .1223782     0.10   0.917     .7991254    1.283337
61 - 80 y..  |   1.094046   .1461984     0.67   0.501     .8419548    1.421617
  >80 years  |   1.105065   .2608416     0.42   0.672     .6957743     1.75512
             |
        male |   .9905337   .1003438    -0.09   0.925     .8121573    1.208087
       _cons |   .6888163   .0962735    -2.67   0.008     .5237618    .9058848
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/ib3.region_n_diff_rheum_2021 not found)
file ./output/tempdata/ib3.region_n_diff_rheum_2021 saved

Iteration 0:   log likelihood = -1110.3903  
Iteration 1:   log likelihood = -1108.2482  
Iteration 2:   log likelihood =  -1108.248  
Iteration 3:   log likelihood =  -1108.248  

Logistic regression                             Number of obs     =      1,628
                                                LR chi2(8)        =       4.28
                                                Prob > chi2       =     0.8306
Log likelihood =  -1108.248                     Pseudo R2         =     0.0019

------------------------------------------------------------------------------
fewer~s_2021 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |    .813627   .1270761    -1.32   0.187     .5990743     1.10502
      Black  |   .8875126   .1409948    -0.75   0.453     .6500523    1.211716
      Mixed  |   .7695115   .1255542    -1.61   0.108     .5588977    1.059493
      Other  |    .943532   .1463314    -0.37   0.708      .696217      1.2787
             |
     age_cat |
18 - 40 y..  |    1.02435   .1233684     0.20   0.842     .8089714     1.29707
61 - 80 y..  |   1.110895    .147994     0.79   0.430     .8556093     1.44235
  >80 years  |   1.142444   .2689945     0.57   0.572     .7201371    1.812403
             |
        male |   .9910962   .1001799    -0.09   0.929     .8129735    1.208246
       _cons |    .809174   .1125778    -1.52   0.128     .6160515    1.062837
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/i.eth5_diff_rheum_2021 not found)
file ./output/tempdata/i.eth5_diff_rheum_2021 saved

Iteration 0:   log likelihood = -1110.3903  
Iteration 1:   log likelihood = -1100.2322  
Iteration 2:   log likelihood = -1100.2264  
Iteration 3:   log likelihood = -1100.2264  

Logistic regression                             Number of obs     =      1,628
                                                LR chi2(21)       =      20.33
                                                Prob > chi2       =     0.5006
Log likelihood = -1100.2264                     Pseudo R2         =     0.0092

------------------------------------------------------------------------------
fewer~s_2021 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     age_cat |
18 - 40 y..  |   1.022304   .1243781     0.18   0.856     .8054142    1.297601
61 - 80 y..  |   1.111938   .1494546     0.79   0.430     .8544197    1.447071
  >80 years  |    1.15797   .2753436     0.62   0.537     .7266039    1.845428
             |
        male |   .9824661   .1003681    -0.17   0.863     .8041914    1.200261
urban_rura~n |   1.064319   .1081673     0.61   0.540     .8720945    1.298912
             |
         imd |
          1  |   .7990105   .2064356    -0.87   0.385     .4815402    1.325783
          2  |    .947753   .2451539    -0.21   0.836     .5708423    1.573527
          3  |   .9078057   .2368116    -0.37   0.711     .5444364    1.513696
          4  |   1.263955   .3254186     0.91   0.363     .7630986    2.093546
          5  |   .9098387   .2338075    -0.37   0.713      .549826    1.505579
             |
    region_n |
          1  |   1.064794   .2081417     0.32   0.748     .7258991    1.561907
          2  |   1.193005   .2268329     0.93   0.353     .8218614    1.731754
          4  |   .9766882   .1950546    -0.12   0.906      .660332    1.444606
          5  |   1.305853   .2583849     1.35   0.177     .8860731    1.924504
          6  |   1.125023     .17943     0.74   0.460     .8230063     1.53787
          8  |   .7667876   .1577882    -1.29   0.197     .5122905    1.147714
          9  |     1.0438   .1979228     0.23   0.821     .7198042    1.513631
             |
        eth5 |
South Asian  |    .801453   .1265414    -1.40   0.161     .5881416     1.09213
      Black  |   .8761834   .1405277    -0.82   0.410      .639844     1.19982
      Mixed  |   .7777916   .1281202    -1.53   0.127     .5631846    1.074177
      Other  |   .9371978   .1469287    -0.41   0.679     .6892623    1.274318
             |
       _cons |   .7836778   .2235694    -0.85   0.393     .4480276    1.370788
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/multi_diff_rheum_2021.dta not found)
file ./output/tempdata/multi_diff_rheum_2021.dta saved

. * Put together 2020 and 2021 logistic regression results
. preserve 

. use "./output/tempdata/urban_rural_bin_diff_rheum_2020", clear 

. append using "./output/tempdata/i.imd_diff_rheum_2020"

. append using "./output/tempdata/ib3.region_n_diff_rheum_2020"

. append using "./output/tempdata/i.eth5_diff_rheum_2020"

. append using "./output/tempdata/multi_diff_rheum_2020"

. append using "./output/tempdata/urban_rural_bin_diff_rheum_2021"

. append using "./output/tempdata/i.imd_diff_rheum_2021"

. append using "./output/tempdata/ib3.region_n_diff_rheum_2021"

. append using "./output/tempdata/i.eth5_diff_rheum_2021"

. append using "./output/tempdata/multi_diff_rheum_2021"

. drop stderr z 

. export delimited using ./output/tables/logistic_diff_results.csv 
file ./output/tables/logistic_diff_results.csv saved

. restore

. 
. 
. * Tabulate characteristics by categories of differences in all outpatient app
> ointments for each year
. * When stratified there are small numbers with missing region therefore tabul
> ate only those without region missing
. drop if region=="missing"
(0 observations deleted)

. tempfile tempfile

. forvalues i=2020/2021 {
  2.     preserve
  3.     keep if fewer_appts_all_`i'==0
  4.     table1_mc, vars(age_cat cate \ male cate \ urban_rural_bin cate \ regi
> on cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat cate \ eth5 cate)
>  clear
  5.     save `tempfile', replace
  6.     restore
  7.     preserve
  8.     keep if fewer_appts_all_`i'==1
  9.     table1_mc, vars(age_cat cate \ male cate \ urban_rural_bin cate \ regi
> on cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat cate \ eth5 cate)
>  clear
 10.     append using `tempfile'
 11.     save `tempfile', replace
 12.     restore 
 13.     * No appointments 
.     preserve
 14.     keep if no_appts_all_`i' ==1
 15.     table1_mc, vars(age_cat cate \ male cate \ urban_rural_bin cate \ regi
> on cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat cate \ eth5 cate)
>  clear
 16.     append using `tempfile'
 17.     save `tempfile', replace
 18.     export delimited using ./output/tables/characteristics_diff_all_strata
> `i'.csv   
 19.     destring _columna_1, gen(n) force
 20.     destring _columnb_1, gen(percent) ignore("-" "%" "(" ")") force
 21.     gen rounded_n = round(n, 5)
 22.     keep factor level rounded_n percent
 23.     export delimited using ./output/tables/characteristics_diff_all_strata
> `i'_rounded.csv 
 24.     restore
 25.     * Logistic regression 
.     foreach var in urban_rural_bin i.imd i.region_n i.eth5 {
 26.         logit fewer_appts_all_`i' `var' ib1.age_cat male, or 
 27.         est sto m2
 28.         parmest, label eform format(estimate p min95 max95) saving("./outp
> ut/tempdata/`var'_diff_all_`i'", replace) idstr("`var'_all_`i'")
 29.         }
 30.     logit fewer_appts_all_`i' ib1.age_cat male urban_rural_bin i.imd i.reg
> ion_n i.eth5, or 
 31.     est sto m2
 32.     parmest, label eform format(estimate p min95 max95) saving("./output/t
> empdata/multi_diff_all_`i'", replace) idstr("multi_all_`i'")
 33.     }
(3,207 observations deleted)

  +-----------------------------+
  | factor          N_1     m_1 |
  |-----------------------------|
  | age_cat       1,433     360 |
  |-----------------------------|
  | male          1,793       0 |
  |-----------------------------|
  | Rural-Urban   1,793       0 |
  |-----------------------------|
  | region        1,793       0 |
  |-----------------------------|
  | imd           1,793       0 |
  |-----------------------------|
  | smoking       1,793       0 |
  |-----------------------------|
  | time_ra         781   1,012 |
  |-----------------------------|
  | bmi_cat       1,793       0 |
  |-----------------------------|
  | eth5          1,793       0 |
  +-----------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------------------+
  |                                          Total               |
  |--------------------------------------------------------------|
  |                                          N=1,793             |
  |--------------------------------------------------------------|
  | age_cat       18 - 40 years              537 (37.5%)         |
  |               41 - 60 years              491 (34.3%)         |
  |               61 - 80 years              329 (23.0%)         |
  |               >80 years                  76 ( 5.3%)          |
  |--------------------------------------------------------------|
  | male          Female                     930 (51.9%)         |
  |               Male                       863 (48.1%)         |
  |--------------------------------------------------------------|
  | Rural-Urban   Rural                      883 (49.2%)         |
  |               Urban                      910 (50.8%)         |
  |--------------------------------------------------------------|
  | region        East Midlands              177 ( 9.9%)         |
  |               East of England            184 (10.3%)         |
  |               London                     401 (22.4%)         |
  |               North East                 163 ( 9.1%)         |
  |               North West                 175 ( 9.8%)         |
  |               South East                 355 (19.8%)         |
  |               West Midlands              184 (10.3%)         |
  |               Yorkshire and the Humber   154 ( 8.6%)         |
  |--------------------------------------------------------------|
  | imd           0                          83 ( 4.6%)          |
  |               1                          360 (20.1%)         |
  |               2                          307 (17.1%)         |
  |               3                          326 (18.2%)         |
  |               4                          357 (19.9%)         |
  |               5                          360 (20.1%)         |
  |--------------------------------------------------------------|
  | smoking       Never smoked               190 (10.6%)         |
  |               Current smoker             338 (18.9%)         |
  |               Ex-smoker                  255 (14.2%)         |
  |               Unknown                    1,010 (56.3%)       |
  |--------------------------------------------------------------|
  | time_ra                                  53.70999 (32.32407) |
  |--------------------------------------------------------------|
  | bmi_cat       Missing                    375 (20.9%)         |
  |               Underweight                166 ( 9.3%)         |
  |               Healthy range              356 (19.9%)         |
  |               Overweight                 345 (19.2%)         |
  |               Obese                      451 (25.2%)         |
  |               Morbidly obese             100 ( 5.6%)         |
  |--------------------------------------------------------------|
  | eth5          White                      359 (20.0%)         |
  |               South Asian                362 (20.2%)         |
  |               Black                      332 (18.5%)         |
  |               Mixed                      358 (20.0%)         |
  |               Other                      382 (21.3%)         |
  +--------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
(note: file /tmp/St00015.00000n not found)
file /tmp/St00015.00000n saved
(3,509 observations deleted)

  +---------------------------+
  | factor          N_1   m_1 |
  |---------------------------|
  | age_cat       1,161   330 |
  |---------------------------|
  | male          1,491     0 |
  |---------------------------|
  | Rural-Urban   1,491     0 |
  |---------------------------|
  | region        1,491     0 |
  |---------------------------|
  | imd           1,491     0 |
  |---------------------------|
  | smoking       1,491     0 |
  |---------------------------|
  | time_ra         698   793 |
  |---------------------------|
  | bmi_cat       1,491     0 |
  |---------------------------|
  | eth5          1,491     0 |
  +---------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +------------------------------------------------------------+
  |                                          Total             |
  |------------------------------------------------------------|
  |                                          N=1,491           |
  |------------------------------------------------------------|
  | age_cat       18 - 40 years              429 (37.0%)       |
  |               41 - 60 years              366 (31.5%)       |
  |               61 - 80 years              304 (26.2%)       |
  |               >80 years                  62 ( 5.3%)        |
  |------------------------------------------------------------|
  | male          Female                     805 (54.0%)       |
  |               Male                       686 (46.0%)       |
  |------------------------------------------------------------|
  | Rural-Urban   Rural                      752 (50.4%)       |
  |               Urban                      739 (49.6%)       |
  |------------------------------------------------------------|
  | region        East Midlands              144 ( 9.7%)       |
  |               East of England            167 (11.2%)       |
  |               London                     297 (19.9%)       |
  |               North East                 149 (10.0%)       |
  |               North West                 155 (10.4%)       |
  |               South East                 261 (17.5%)       |
  |               West Midlands              142 ( 9.5%)       |
  |               Yorkshire and the Humber   176 (11.8%)       |
  |------------------------------------------------------------|
  | imd           0                          72 ( 4.8%)        |
  |               1                          295 (19.8%)       |
  |               2                          287 (19.2%)       |
  |               3                          275 (18.4%)       |
  |               4                          276 (18.5%)       |
  |               5                          286 (19.2%)       |
  |------------------------------------------------------------|
  | smoking       Never smoked               156 (10.5%)       |
  |               Current smoker             276 (18.5%)       |
  |               Ex-smoker                  225 (15.1%)       |
  |               Unknown                    834 (55.9%)       |
  |------------------------------------------------------------|
  | time_ra                                  56.383 (32.88858) |
  |------------------------------------------------------------|
  | bmi_cat       Missing                    283 (19.0%)       |
  |               Underweight                151 (10.1%)       |
  |               Healthy range              260 (17.4%)       |
  |               Overweight                 305 (20.5%)       |
  |               Obese                      421 (28.2%)       |
  |               Morbidly obese             71 ( 4.8%)        |
  |------------------------------------------------------------|
  | eth5          White                      296 (19.9%)       |
  |               South Asian                301 (20.2%)       |
  |               Black                      296 (19.9%)       |
  |               Mixed                      284 (19.0%)       |
  |               Other                      314 (21.1%)       |
  +------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
(note: variable Total was str17, now str19 to accommodate using data's
       values)
file /tmp/St00015.00000n saved
(4,957 observations deleted)

  +-------------------------+
  | factor        N_1   m_1 |
  |-------------------------|
  | age_cat        33    10 |
  |-------------------------|
  | male           43     0 |
  |-------------------------|
  | Rural-Urban    43     0 |
  |-------------------------|
  | region         43     0 |
  |-------------------------|
  | imd            43     0 |
  |-------------------------|
  | smoking        43     0 |
  |-------------------------|
  | time_ra        16    27 |
  |-------------------------|
  | bmi_cat        43     0 |
  |-------------------------|
  | eth5           43     0 |
  +-------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------------------+
  |                                          Total               |
  |--------------------------------------------------------------|
  |                                          N=43                |
  |--------------------------------------------------------------|
  | age_cat       18 - 40 years              16 (48%)            |
  |               41 - 60 years              12 (36%)            |
  |               61 - 80 years              5 (15%)             |
  |--------------------------------------------------------------|
  | male          Female                     26 (60%)            |
  |               Male                       17 (40%)            |
  |--------------------------------------------------------------|
  | Rural-Urban   Rural                      25 (58%)            |
  |               Urban                      18 (42%)            |
  |--------------------------------------------------------------|
  | region        East Midlands              3 ( 7%)             |
  |               East of England            4 ( 9%)             |
  |               London                     5 (12%)             |
  |               North East                 2 ( 5%)             |
  |               North West                 9 (21%)             |
  |               South East                 12 (28%)            |
  |               West Midlands              1 ( 2%)             |
  |               Yorkshire and the Humber   7 (16%)             |
  |--------------------------------------------------------------|
  | imd           0                          2 ( 5%)             |
  |               1                          6 (14%)             |
  |               2                          8 (19%)             |
  |               3                          7 (16%)             |
  |               4                          6 (14%)             |
  |               5                          14 (33%)            |
  |--------------------------------------------------------------|
  | smoking       Never smoked               6 (14%)             |
  |               Current smoker             8 (19%)             |
  |               Ex-smoker                  7 (16%)             |
  |               Unknown                    22 (51%)            |
  |--------------------------------------------------------------|
  | time_ra                                  52.30373 (30.23585) |
  |--------------------------------------------------------------|
  | bmi_cat       Missing                    13 (30%)            |
  |               Underweight                6 (14%)             |
  |               Healthy range              7 (16%)             |
  |               Overweight                 8 (19%)             |
  |               Obese                      9 (21%)             |
  |--------------------------------------------------------------|
  | eth5          White                      6 (14%)             |
  |               South Asian                9 (21%)             |
  |               Black                      4 ( 9%)             |
  |               Mixed                      10 (23%)            |
  |               Other                      14 (33%)            |
  +--------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.00000n saved
file ./output/tables/characteristics_diff_all_strata2020.csv saved
_columna_1: contains nonnumeric characters; n generated as double
(7 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent generated as double
(6 missing values generated)
(7 missing values generated)
file ./output/tables/characteristics_diff_all_strata2020_rounded.csv saved

Iteration 0:   log likelihood = -1783.7369  
Iteration 1:   log likelihood = -1780.6221  
Iteration 2:   log likelihood =  -1780.622  

Logistic regression                             Number of obs     =      2,594
                                                LR chi2(5)        =       6.23
                                                Prob > chi2       =     0.2845
Log likelihood =  -1780.622                     Pseudo R2         =     0.0017

------------------------------------------------------------------------------
fewer~l_2020 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
urban_rura~n |   1.000559   .0792476     0.01   0.994     .8566924    1.168586
             |
     age_cat |
18 - 40 y..  |   1.067919    .101197     0.69   0.488     .8869064    1.285876
61 - 80 y..  |   1.242107   .1309495     2.06   0.040     1.010231    1.527205
  >80 years  |   1.094349   .2020716     0.49   0.625     .7620462    1.571557
             |
        male |   .8940329   .0709762    -1.41   0.158     .7652046     1.04455
       _cons |   .7861444   .0692948    -2.73   0.006     .6614134    .9343974
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/urban_rural_bin_diff_all_2020.dta not found)
file ./output/tempdata/urban_rural_bin_diff_all_2020.dta saved

Iteration 0:   log likelihood = -1783.7369  
Iteration 1:   log likelihood = -1778.1496  
Iteration 2:   log likelihood = -1778.1493  
Iteration 3:   log likelihood = -1778.1493  

Logistic regression                             Number of obs     =      2,594
                                                LR chi2(9)        =      11.18
                                                Prob > chi2       =     0.2639
Log likelihood = -1778.1493                     Pseudo R2         =     0.0031

------------------------------------------------------------------------------
fewer~l_2020 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         imd |
          1  |    .918203   .1857323    -0.42   0.673     .6176741    1.364954
          2  |     1.1021   .2244041     0.48   0.633     .7394413    1.642625
          3  |   1.012195   .2070062     0.06   0.953      .677927    1.511281
          4  |   .8440796   .1719158    -0.83   0.405     .5662615      1.2582
          5  |   .9388381   .1901976    -0.31   0.755     .6311713    1.396478
             |
     age_cat |
18 - 40 y..  |    1.07208    .101758     0.73   0.463     .8900904    1.291279
61 - 80 y..  |   1.235845   .1304685     2.01   0.045     1.004853    1.519937
  >80 years  |   1.091732   .2018116     0.47   0.635     .7599199    1.568428
             |
        male |   .8935027   .0709207    -1.42   0.156     .7647734      1.0439
       _cons |   .8197271   .1590615    -1.02   0.306      .560403    1.199052
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/i.imd_diff_all_2020 not found)
file ./output/tempdata/i.imd_diff_all_2020 saved

Iteration 0:   log likelihood = -1783.7369  
Iteration 1:   log likelihood = -1773.3938  
Iteration 2:   log likelihood = -1773.3928  
Iteration 3:   log likelihood = -1773.3928  

Logistic regression                             Number of obs     =      2,594
                                                LR chi2(11)       =      20.69
                                                Prob > chi2       =     0.0367
Log likelihood = -1773.3928                     Pseudo R2         =     0.0058

------------------------------------------------------------------------------
fewer~l_2020 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    region_n |
          2  |   1.089238   .1899417     0.49   0.624     .7739091    1.533048
          3  |   .9264311   .1426586    -0.50   0.620     .6850763    1.252816
          4  |    1.03271   .1855877     0.18   0.858     .7261219    1.468748
          5  |   1.067229   .1902536     0.36   0.715     .7525145    1.513562
          6  |   .8247807     .12997    -1.22   0.222     .6056268    1.123238
          8  |   .8413732   .1507594    -0.96   0.335     .5921998    1.195389
          9  |   1.375555   .2424178     1.81   0.070     .9737967    1.943066
             |
     age_cat |
18 - 40 y..  |   1.061551   .1009715     0.63   0.530     .8810029    1.279101
61 - 80 y..  |   1.235542   .1308818     2.00   0.046     1.003897    1.520638
  >80 years  |   1.064612   .1974156     0.34   0.736     .7402005    1.531205
             |
        male |   .8774411   .0700048    -1.64   0.101     .7504238    1.025957
       _cons |   .8102303   .1173993    -1.45   0.146     .6099197    1.076327
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/i.region_n_diff_all_2020 not found)
file ./output/tempdata/i.region_n_diff_all_2020 saved

Iteration 0:   log likelihood = -1783.7369  
Iteration 1:   log likelihood = -1778.7208  
Iteration 2:   log likelihood = -1778.7206  
Iteration 3:   log likelihood = -1778.7206  

Logistic regression                             Number of obs     =      2,594
                                                LR chi2(8)        =      10.03
                                                Prob > chi2       =     0.2627
Log likelihood = -1778.7206                     Pseudo R2         =     0.0028

------------------------------------------------------------------------------
fewer~l_2020 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.047211   .1305846     0.37   0.711     .8201468     1.33714
      Black  |    1.19572    .150902     1.42   0.157     .9336979    1.531273
      Mixed  |   .9552343   .1214705    -0.36   0.719     .7445065    1.225607
      Other  |   1.106534   .1363581     0.82   0.411      .869103    1.408829
             |
     age_cat |
18 - 40 y..  |   1.070664    .101553     0.72   0.472     .8890295    1.289407
61 - 80 y..  |   1.237936   .1306686     2.02   0.043     1.006585    1.522458
  >80 years  |   1.096741   .2027074     0.50   0.617     .7634475    1.575539
             |
        male |   .8987123   .0714108    -1.34   0.179     .7691039    1.050162
       _cons |   .7408892   .0828519    -2.68   0.007     .5950663    .9224464
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/i.eth5_diff_all_2020 not found)
file ./output/tempdata/i.eth5_diff_all_2020 saved

Iteration 0:   log likelihood = -1783.7369  
Iteration 1:   log likelihood = -1769.0749  
Iteration 2:   log likelihood = -1769.0723  
Iteration 3:   log likelihood = -1769.0723  

Logistic regression                             Number of obs     =      2,594
                                                LR chi2(21)       =      29.33
                                                Prob > chi2       =     0.1063
Log likelihood = -1769.0723                     Pseudo R2         =     0.0082

------------------------------------------------------------------------------
fewer~l_2020 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     age_cat |
18 - 40 y..  |   1.067953   .1019185     0.69   0.491     .8857659    1.287613
61 - 80 y..  |   1.224262   .1301086     1.90   0.057     .9940601    1.507773
  >80 years  |   1.065362   .1980894     0.34   0.733     .7399937    1.533792
             |
        male |   .8813919   .0706297    -1.58   0.115     .7532838    1.031287
urban_rura~n |   1.008839    .080561     0.11   0.912     .8626788    1.179763
             |
         imd |
          1  |    .910602   .1851923    -0.46   0.645      .611247    1.356564
          2  |   1.105995   .2262907     0.49   0.622     .7406175    1.651628
          3  |   .9927005   .2041343    -0.04   0.972     .6634086    1.485441
          4  |   .8407674   .1720119    -0.85   0.397     .5630271    1.255517
          5  |   .9306855   .1894408    -0.35   0.724     .6245123    1.386963
             |
    region_n |
          2  |   1.090976   .1912136     0.50   0.619     .7737965    1.538169
          3  |   .9437428   .1460475    -0.37   0.708     .6968306    1.278145
          4  |   1.033453   .1866124     0.18   0.855     .7254166    1.472291
          5  |   1.078041   .1927848     0.42   0.674     .7593046    1.530575
          6  |   .8294935   .1311203    -1.18   0.237     .6085009    1.130745
          8  |    .851468   .1530295    -0.89   0.371     .5986689    1.211016
          9  |   1.389747   .2465333     1.86   0.064     .9816062    1.967588
             |
        eth5 |
South Asian  |   1.063006   .1334518     0.49   0.626     .8311405    1.359557
      Black  |   1.193169   .1515694     1.39   0.164     .9301924    1.530491
      Mixed  |   .9556799   .1222902    -0.35   0.723     .7436892    1.228099
      Other  |     1.1115   .1379265     0.85   0.394     .8715324     1.41754
             |
       _cons |   .7884518   .1945525    -0.96   0.335     .4861149    1.278826
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/multi_diff_all_2020.dta not found)
file ./output/tempdata/multi_diff_all_2020.dta saved
(3,849 observations deleted)

  +---------------------------+
  | factor          N_1   m_1 |
  |---------------------------|
  | age_cat         910   241 |
  |---------------------------|
  | male          1,151     0 |
  |---------------------------|
  | Rural-Urban   1,151     0 |
  |---------------------------|
  | region        1,151     0 |
  |---------------------------|
  | imd           1,151     0 |
  |---------------------------|
  | smoking       1,151     0 |
  |---------------------------|
  | time_ra         496   655 |
  |---------------------------|
  | bmi_cat       1,151     0 |
  |---------------------------|
  | eth5          1,151     0 |
  +---------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------------------+
  |                                          Total               |
  |--------------------------------------------------------------|
  |                                          N=1,151             |
  |--------------------------------------------------------------|
  | age_cat       18 - 40 years              327 (35.9%)         |
  |               41 - 60 years              306 (33.6%)         |
  |               61 - 80 years              230 (25.3%)         |
  |               >80 years                  47 ( 5.2%)          |
  |--------------------------------------------------------------|
  | male          Female                     616 (53.5%)         |
  |               Male                       535 (46.5%)         |
  |--------------------------------------------------------------|
  | Rural-Urban   Rural                      570 (49.5%)         |
  |               Urban                      581 (50.5%)         |
  |--------------------------------------------------------------|
  | region        East Midlands              117 (10.2%)         |
  |               East of England            122 (10.6%)         |
  |               London                     241 (20.9%)         |
  |               North East                 113 ( 9.8%)         |
  |               North West                 104 ( 9.0%)         |
  |               South East                 226 (19.6%)         |
  |               West Midlands              107 ( 9.3%)         |
  |               Yorkshire and the Humber   121 (10.5%)         |
  |--------------------------------------------------------------|
  | imd           0                          60 ( 5.2%)          |
  |               1                          232 (20.2%)         |
  |               2                          191 (16.6%)         |
  |               3                          209 (18.2%)         |
  |               4                          228 (19.8%)         |
  |               5                          231 (20.1%)         |
  |--------------------------------------------------------------|
  | smoking       Never smoked               109 ( 9.5%)         |
  |               Current smoker             223 (19.4%)         |
  |               Ex-smoker                  175 (15.2%)         |
  |               Unknown                    644 (56.0%)         |
  |--------------------------------------------------------------|
  | time_ra                                  52.73209 (32.81021) |
  |--------------------------------------------------------------|
  | bmi_cat       Missing                    231 (20.1%)         |
  |               Underweight                115 (10.0%)         |
  |               Healthy range              234 (20.3%)         |
  |               Overweight                 210 (18.2%)         |
  |               Obese                      303 (26.3%)         |
  |               Morbidly obese             58 ( 5.0%)          |
  |--------------------------------------------------------------|
  | eth5          White                      225 (19.5%)         |
  |               South Asian                250 (21.7%)         |
  |               Black                      223 (19.4%)         |
  |               Mixed                      203 (17.6%)         |
  |               Other                      250 (21.7%)         |
  +--------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.00000n saved
(4,106 observations deleted)

  +-------------------------+
  | factor        N_1   m_1 |
  |-------------------------|
  | age_cat       716   178 |
  |-------------------------|
  | male          894     0 |
  |-------------------------|
  | Rural-Urban   894     0 |
  |-------------------------|
  | region        894     0 |
  |-------------------------|
  | imd           894     0 |
  |-------------------------|
  | smoking       894     0 |
  |-------------------------|
  | time_ra       415   479 |
  |-------------------------|
  | bmi_cat       894     0 |
  |-------------------------|
  | eth5          894     0 |
  +-------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------------------+
  |                                          Total               |
  |--------------------------------------------------------------|
  |                                          N=894               |
  |--------------------------------------------------------------|
  | age_cat       18 - 40 years              268 (37.4%)         |
  |               41 - 60 years              242 (33.8%)         |
  |               61 - 80 years              169 (23.6%)         |
  |               >80 years                  37 ( 5.2%)          |
  |--------------------------------------------------------------|
  | male          Female                     475 (53.1%)         |
  |               Male                       419 (46.9%)         |
  |--------------------------------------------------------------|
  | Rural-Urban   Rural                      444 (49.7%)         |
  |               Urban                      450 (50.3%)         |
  |--------------------------------------------------------------|
  | region        East Midlands              90 (10.1%)          |
  |               East of England            89 (10.0%)          |
  |               London                     182 (20.4%)         |
  |               North East                 80 ( 8.9%)          |
  |               North West                 96 (10.7%)          |
  |               South East                 177 (19.8%)         |
  |               West Midlands              85 ( 9.5%)          |
  |               Yorkshire and the Humber   95 (10.6%)          |
  |--------------------------------------------------------------|
  | imd           0                          36 ( 4.0%)          |
  |               1                          173 (19.4%)         |
  |               2                          183 (20.5%)         |
  |               3                          164 (18.3%)         |
  |               4                          169 (18.9%)         |
  |               5                          169 (18.9%)         |
  |--------------------------------------------------------------|
  | smoking       Never smoked               101 (11.3%)         |
  |               Current smoker             152 (17.0%)         |
  |               Ex-smoker                  132 (14.8%)         |
  |               Unknown                    509 (56.9%)         |
  |--------------------------------------------------------------|
  | time_ra                                  55.77001 (33.05574) |
  |--------------------------------------------------------------|
  | bmi_cat       Missing                    189 (21.1%)         |
  |               Underweight                92 (10.3%)          |
  |               Healthy range              143 (16.0%)         |
  |               Overweight                 189 (21.1%)         |
  |               Obese                      243 (27.2%)         |
  |               Morbidly obese             38 ( 4.3%)          |
  |--------------------------------------------------------------|
  | eth5          White                      184 (20.6%)         |
  |               South Asian                171 (19.1%)         |
  |               Black                      170 (19.0%)         |
  |               Mixed                      182 (20.4%)         |
  |               Other                      187 (20.9%)         |
  +--------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.00000n saved
(4,979 observations deleted)

  +-------------------------+
  | factor        N_1   m_1 |
  |-------------------------|
  | age_cat        16     5 |
  |-------------------------|
  | male           21     0 |
  |-------------------------|
  | Rural-Urban    21     0 |
  |-------------------------|
  | region         21     0 |
  |-------------------------|
  | imd            21     0 |
  |-------------------------|
  | smoking        21     0 |
  |-------------------------|
  | time_ra        10    11 |
  |-------------------------|
  | bmi_cat        21     0 |
  |-------------------------|
  | eth5           21     0 |
  +-------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +-------------------------------------------------------------+
  |                                          Total              |
  |-------------------------------------------------------------|
  |                                          N=21               |
  |-------------------------------------------------------------|
  | age_cat       18 - 40 years              8 (50%)            |
  |               41 - 60 years              3 (19%)            |
  |               61 - 80 years              4 (25%)            |
  |               >80 years                  1 ( 6%)            |
  |-------------------------------------------------------------|
  | male          Female                     13 (62%)           |
  |               Male                       8 (38%)            |
  |-------------------------------------------------------------|
  | Rural-Urban   Rural                      13 (62%)           |
  |               Urban                      8 (38%)            |
  |-------------------------------------------------------------|
  | region        East Midlands              1 ( 5%)            |
  |               East of England            5 (24%)            |
  |               London                     4 (19%)            |
  |               North East                 1 ( 5%)            |
  |               North West                 4 (19%)            |
  |               South East                 2 (10%)            |
  |               West Midlands              2 (10%)            |
  |               Yorkshire and the Humber   2 (10%)            |
  |-------------------------------------------------------------|
  | imd           0                          1 ( 5%)            |
  |               1                          5 (24%)            |
  |               2                          4 (19%)            |
  |               3                          3 (14%)            |
  |               4                          4 (19%)            |
  |               5                          4 (19%)            |
  |-------------------------------------------------------------|
  | smoking       Never smoked               5 (24%)            |
  |               Current smoker             3 (14%)            |
  |               Ex-smoker                  4 (19%)            |
  |               Unknown                    9 (43%)            |
  |-------------------------------------------------------------|
  | time_ra                                  67.6345 (30.75153) |
  |-------------------------------------------------------------|
  | bmi_cat       Missing                    5 (24%)            |
  |               Healthy range              9 (43%)            |
  |               Overweight                 4 (19%)            |
  |               Obese                      2 (10%)            |
  |               Morbidly obese             1 ( 5%)            |
  |-------------------------------------------------------------|
  | eth5          White                      4 (19%)            |
  |               South Asian                5 (24%)            |
  |               Black                      5 (24%)            |
  |               Mixed                      3 (14%)            |
  |               Other                      4 (19%)            |
  +-------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
(note: variable Total was str18, now str19 to accommodate using data's
       values)
file /tmp/St00015.00000n saved
file ./output/tables/characteristics_diff_all_strata2021.csv saved
_columna_1: contains nonnumeric characters; n generated as double
(6 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent generated as double
(6 missing values generated)
(6 missing values generated)
file ./output/tables/characteristics_diff_all_strata2021_rounded.csv saved

Iteration 0:   log likelihood = -1115.4565  
Iteration 1:   log likelihood = -1115.0862  
Iteration 2:   log likelihood = -1115.0862  

Logistic regression                             Number of obs     =      1,626
                                                LR chi2(5)        =       0.74
                                                Prob > chi2       =     0.9807
Log likelihood = -1115.0862                     Pseudo R2         =     0.0003

------------------------------------------------------------------------------
fewer~l_2021 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
urban_rura~n |    .992874   .0994663    -0.07   0.943     .8158693     1.20828
             |
     age_cat |
18 - 40 y..  |   1.036833   .1235633     0.30   0.761     .8208577    1.309633
61 - 80 y..  |   .9286474   .1234567    -0.56   0.578     .7156324    1.205068
  >80 years  |   .9945447   .2348329    -0.02   0.982     .6260914    1.579832
             |
        male |   1.017887   .1023549     0.18   0.860     .8358069    1.239633
       _cons |   .7873375   .0865503    -2.18   0.030     .6347318    .9766335
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/urban_rural_bin_diff_all_2021.dta not found)
file ./output/tempdata/urban_rural_bin_diff_all_2021.dta saved

Iteration 0:   log likelihood = -1115.4565  
Iteration 1:   log likelihood = -1111.5232  
Iteration 2:   log likelihood = -1111.5219  
Iteration 3:   log likelihood = -1111.5219  

Logistic regression                             Number of obs     =      1,626
                                                LR chi2(9)        =       7.87
                                                Prob > chi2       =     0.5474
Log likelihood = -1111.5219                     Pseudo R2         =     0.0035

------------------------------------------------------------------------------
fewer~l_2021 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         imd |
          1  |   1.367851   .3626198     1.18   0.237     .8135491     2.29982
          2  |   1.782989    .473751     2.18   0.030     1.059203     3.00136
          3  |    1.46494   .3921459     1.43   0.154     .8668901    2.475573
          4  |   1.291046   .3437157     0.96   0.337     .7661714    2.175492
          5  |   1.365823   .3613601     1.18   0.239     .8131854    2.294033
             |
     age_cat |
18 - 40 y..  |   1.031175   .1233631     0.26   0.797     .8156429    1.303661
61 - 80 y..  |   .9230088   .1231025    -0.60   0.548     .7106902    1.198758
  >80 years  |    1.00077   .2370522     0.00   0.997     .6290866    1.592056
             |
        male |   1.014672   .1021444     0.14   0.885      .832985    1.235987
       _cons |   .5551698   .1412627    -2.31   0.021     .3371615     .914142
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/i.imd_diff_all_2021 not found)
file ./output/tempdata/i.imd_diff_all_2021 saved

Iteration 0:   log likelihood = -1115.4565  
Iteration 1:   log likelihood = -1113.3272  
Iteration 2:   log likelihood = -1113.3271  
Iteration 3:   log likelihood = -1113.3271  

Logistic regression                             Number of obs     =      1,626
                                                LR chi2(11)       =       4.26
                                                Prob > chi2       =     0.9617
Log likelihood = -1113.3271                     Pseudo R2         =     0.0019

------------------------------------------------------------------------------
fewer~l_2021 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    region_n |
          2  |   .8370741   .1848937    -0.81   0.421     .5429374    1.290559
          3  |    .861102   .1659406    -0.78   0.438     .5902308    1.256283
          4  |   .7980765    .181392    -0.99   0.321     .5111848     1.24598
          5  |   1.076258   .2430145     0.33   0.745     .6913833    1.675383
          6  |   .8698041   .1689828    -0.72   0.473     .5943643    1.272888
          8  |   1.002068    .228459     0.01   0.993     .6409642    1.566609
          9  |   1.001848    .218015     0.01   0.993     .6539873    1.534738
             |
     age_cat |
18 - 40 y..  |   1.027376   .1229135     0.23   0.821     .8126305     1.29887
61 - 80 y..  |   .9221607   .1230538    -0.61   0.544       .70994     1.19782
  >80 years  |   .9761151   .2313066    -0.10   0.919     .6134719    1.553128
             |
        male |   1.012188   .1020554     0.12   0.904      .830687    1.233346
       _cons |   .8663624    .156012    -0.80   0.426     .6087202    1.233052
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/i.region_n_diff_all_2021 not found)
file ./output/tempdata/i.region_n_diff_all_2021 saved

Iteration 0:   log likelihood = -1115.4565  
Iteration 1:   log likelihood = -1113.8442  
Iteration 2:   log likelihood = -1113.8441  

Logistic regression                             Number of obs     =      1,626
                                                LR chi2(8)        =       3.22
                                                Prob > chi2       =     0.9195
Log likelihood = -1113.8441                     Pseudo R2         =     0.0014

------------------------------------------------------------------------------
fewer~l_2021 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .8431947   .1321185    -1.09   0.276     .6202329    1.146307
      Black  |   .9408925   .1495775    -0.38   0.702     .6890029    1.284869
      Mixed  |   1.075045   .1736531     0.45   0.654     .7833055    1.475442
      Other  |   .9635023   .1498437    -0.24   0.811     .7103527    1.306867
             |
     age_cat |
18 - 40 y..  |   1.034008   .1234131     0.28   0.779     .8183323    1.306527
61 - 80 y..  |   .9356572   .1245706    -0.50   0.617     .7207594    1.214628
  >80 years  |   .9927876   .2347833    -0.03   0.976     .6245347    1.578179
             |
        male |   1.007211   .1014366     0.07   0.943      .826791    1.227002
       _cons |   .8216744   .1143884    -1.41   0.158     .6254618     1.07944
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/i.eth5_diff_all_2021 not found)
file ./output/tempdata/i.eth5_diff_all_2021 saved

Iteration 0:   log likelihood = -1115.4565  
Iteration 1:   log likelihood =  -1108.473  
Iteration 2:   log likelihood = -1108.4707  
Iteration 3:   log likelihood = -1108.4707  

Logistic regression                             Number of obs     =      1,626
                                                LR chi2(21)       =      13.97
                                                Prob > chi2       =     0.8708
Log likelihood = -1108.4707                     Pseudo R2         =     0.0063

------------------------------------------------------------------------------
fewer~l_2021 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     age_cat |
18 - 40 y..  |   1.018787   .1225416     0.15   0.877     .8048212    1.289637
61 - 80 y..  |    .923437   .1238236    -0.59   0.552     .7100187    1.201005
  >80 years  |   .9778112   .2332211    -0.09   0.925     .6126775    1.560551
             |
        male |   .9995931   .1015679    -0.00   0.997     .8190932    1.219869
urban_rura~n |   .9864894   .0996578    -0.13   0.893     .8092855    1.202494
             |
         imd |
          1  |   1.352635   .3599779     1.13   0.256     .8028786    2.278829
          2  |   1.758516   .4693718     2.11   0.034     1.042196    2.967178
          3  |   1.453956   .3906745     1.39   0.164     .8586881    2.461881
          4  |   1.283993   .3427364     0.94   0.349     .7609414    2.166576
          5  |   1.357748    .360595     1.15   0.250     .8067783    2.284988
             |
    region_n |
          2  |   .8462308   .1885502    -0.75   0.454     .5468032    1.309624
          3  |    .860634   .1674255    -0.77   0.440     .5877979    1.260112
          4  |    .782187   .1789908    -1.07   0.283     .4994901    1.224882
          5  |   1.092288   .2481589     0.39   0.698     .6997633    1.704995
          6  |   .8779936   .1717785    -0.67   0.506     .5983492    1.288333
          8  |   1.005292   .2304718     0.02   0.982     .6414268    1.575569
          9  |   1.016538   .2235294     0.07   0.941     .6606181    1.564216
             |
        eth5 |
South Asian  |   .8350202   .1321452    -1.14   0.255     .6123378    1.138683
      Black  |   .9474582   .1518763    -0.34   0.736     .6920119    1.297199
      Mixed  |   1.074278    .174921     0.44   0.660     .7807617    1.478138
      Other  |   .9614439   .1509128    -0.25   0.802     .7068306    1.307774
             |
       _cons |   .6500311   .2082013    -1.34   0.179     .3469757    1.217781
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/multi_diff_all_2021.dta not found)
file ./output/tempdata/multi_diff_all_2021.dta saved

. * Put together 2020 and 2021 logistic regression results
. use "./output/tempdata/urban_rural_bin_diff_all_2020", clear 

. append using "./output/tempdata/i.imd_diff_all_2020"

. append using "./output/tempdata/i.region_n_diff_all_2020"

. append using "./output/tempdata/i.eth5_diff_all_2020"

. append using "./output/tempdata/multi_diff_all_2020"

. append using "./output/tempdata/urban_rural_bin_diff_all_2021"

. append using "./output/tempdata/i.imd_diff_all_2021"

. append using "./output/tempdata/i.region_n_diff_all_2021"

. append using "./output/tempdata/i.eth5_diff_all_2021"

. append using "./output/tempdata/multi_diff_all_2021"

. drop stderr z 

. export delimited using ./output/tables/logistic_diff_all_results.csv
file ./output/tables/logistic_diff_all_results.csv saved

. 
.     
. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/outpatients.log
  log type:  text
 closed on:  26 May 2023, 13:39:35
-------------------------------------------------------------------------------
