
. 
. cap mkdir ./output/tables/

. cap mkdir ./output/tempdata

. 
. * Import data
. import delimited using ./output/input.csv
(54 vars, 10,000 obs)

. * Check data
. count if age==. 
  0

. count if age<18 
  2,150

. count if age>110 & age!=.
  0

. sum age, d

                             age
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            4              0
10%            7              0       Obs              10,000
25%           20              0       Sum of Wgt.      10,000

50%           40                      Mean            40.5273
                        Largest       Std. Dev.      24.13454
75%           59             99
90%           73            103       Variance       582.4759
95%           80            107       Skewness       .1416943
99%           91            108       Kurtosis       2.048606

. count if sex==""
  0

. tab sex

        sex |      Freq.     Percent        Cum.
------------+-----------------------------------
          F |      5,052       50.52       50.52
          M |      4,837       48.37       98.89
          U |        111        1.11      100.00
------------+-----------------------------------
      Total |     10,000      100.00

. * Checking RA algorithm variables
. * Checking type of DMARD that meets inclusion
. foreach dmard in metho leflu sulfa hydrox {
  2.     gen `dmard'_multi = (`dmard'_count>=2)
  3.     tab `dmard'_multi if has_dmards==1, m
  4. }

metho_multi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        783       15.66       15.66
          1 |      4,217       84.34      100.00
------------+-----------------------------------
      Total |      5,000      100.00

leflu_multi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        760       15.20       15.20
          1 |      4,240       84.80      100.00
------------+-----------------------------------
      Total |      5,000      100.00

sulfa_multi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        766       15.32       15.32
          1 |      4,234       84.68      100.00
------------+-----------------------------------
      Total |      5,000      100.00

hydrox_mult |
          i |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        793       15.86       15.86
          1 |      4,207       84.14      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. gen dmard_multi = (metho_multi==1 | leflu_multi==1 | sulfa_multi==1 | hydrox_
> multi==1)

. tab dmard_multi has_alt_dmard_diag

dmard_mult |  has_alt_dmard_diag
         i |         0          1 |     Total
-----------+----------------------+----------
         0 |         6          1 |         7 
         1 |     4,994      4,999 |     9,993 
-----------+----------------------+----------
     Total |     5,000      5,000 |    10,000 

. sum number_ra_codes

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
number_ra_~s |     10,000      2.4936    1.039359          0          6

. di "Number where no DMARDs but does have multiple RA codes and no alt diag"
Number where no DMARDs but does have multiple RA codes and no alt diag

. count if has_dmards==0 & number_ra_codes>=2 & alt_diag!=1
  2,062

. tab has_ra, m

     has_ra |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,000       50.00       50.00
          1 |      5,000       50.00      100.00
------------+-----------------------------------
      Total |     10,000      100.00

. keep if has_ra
(5,000 observations deleted)

. * Time since first RA code
. gen first_ra_codeA = date(first_ra_code, "YMD")
(2,798 missing values generated)

. format first_ra_codeA %dD/N/CY

. gen time_ra = (date("01Mar2019", "DMY") - first_ra_codeA)/365.25
(2,798 missing values generated)

. sum time_ra, d

                           time_ra
-------------------------------------------------------------
      Percentiles      Smallest
 1%     1.013005      -.0602327
 5%     4.566735       .0657084
10%     10.02875       .1177276       Obs               2,202
25%     26.93224       .1533196       Sum of Wgt.       2,202

50%     56.70637                      Mean           54.88472
                        Largest       Std. Dev.      31.95055
75%     81.56332       109.8809
90%     98.19849       109.9439       Variance       1020.838
95%     104.3614       109.9439       Skewness      -.0347504
99%     109.0021       109.9822       Kurtosis       1.789306

. sum number_ra_codes, d

                       number_ra_codes
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            2                      Mean             2.4906
                        Largest       Std. Dev.      1.044859
75%            3              6
90%            4              6       Variance        1.09173
95%            4              6       Skewness       .0375595
99%            5              6       Kurtosis       2.907116

. sum metho_count, d

                         metho_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            2                      Mean             2.4946
                        Largest       Std. Dev.      1.038935
75%            3              6
90%            4              6       Variance       1.079387
95%            4              6       Skewness       .0566712
99%            5              6       Kurtosis       2.844458

. sum sulfa_count, d 

                         sulfa_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            3                      Mean              2.504
                        Largest       Std. Dev.       1.03605
75%            3              6
90%            4              6       Variance       1.073399
95%            4              6       Skewness      -.0074461
99%            5              6       Kurtosis       2.916436

. sum leflu_count, d 

                         leflu_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            3                      Mean             2.5176
                        Largest       Std. Dev.        1.0501
75%            3              6
90%            4              6       Variance       1.102711
95%            4              6       Skewness       .0758313
99%            5              6       Kurtosis       3.042631

. sum hydrox_count, d 

                        hydrox_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            3                      Mean             2.4968
                        Largest       Std. Dev.      1.041252
75%            3              6
90%            4              6       Variance       1.084207
95%            4              6       Skewness        .015423
99%            5              6       Kurtosis       2.865327

. 
. sum outpatient*, d

                    outpatient_appt_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               5,000
25%            6              0       Sum of Wgt.       5,000

50%            7                      Mean             6.7016
                        Largest       Std. Dev.      2.933237
75%            9             14
90%           10             14       Variance       8.603878
95%           11             14       Skewness      -.8647597
99%           12             15       Kurtosis       3.503894

                    outpatient_appt_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               5,000
25%            6              0       Sum of Wgt.       5,000

50%            7                      Mean              6.735
                        Largest       Std. Dev.      2.967176
75%            9             14
90%           10             14       Variance       8.804136
95%           11             14       Skewness      -.8649433
99%           12             14       Kurtosis       3.457087

                    outpatient_appt_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            2              0       Obs               5,000
25%            6              0       Sum of Wgt.       5,000

50%            7                      Mean             6.8272
                        Largest       Std. Dev.      2.914831
75%            9             14
90%           10             14       Variance       8.496239
95%           11             14       Skewness      -.8958221
99%           12             14       Kurtosis       3.605991

                   outpatient_medium_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               2,484
25%            2              1       Sum of Wgt.       2,484

50%            5                      Mean           13.56804
                        Largest       Std. Dev.      28.27879
75%            7             98
90%           98             98       Variance       799.6897
95%           98             98       Skewness       2.630099
99%           98             98       Kurtosis       7.987579

                   outpatient_medium_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               2,527
25%            2              1       Sum of Wgt.       2,527

50%            5                      Mean           13.97665
                        Largest       Std. Dev.      28.85652
75%            7             98
90%           98             98       Variance        832.699
95%           98             98       Skewness       2.548422
99%           98             98       Kurtosis       7.560654

                   outpatient_medium_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               2,494
25%            2              1       Sum of Wgt.       2,494

50%            5                      Mean           13.53248
                        Largest       Std. Dev.      28.23062
75%            7             98
90%            8             98       Variance       796.9679
95%           98             98       Skewness       2.636426
99%           98             98       Kurtosis        8.02341

                  outpatient_appt_all_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               5,000
25%            6              0       Sum of Wgt.       5,000

50%            7                      Mean             6.7886
                        Largest       Std. Dev.      2.959199
75%            9             14
90%           10             14       Variance       8.756861
95%           11             14       Skewness      -.8794364
99%           12             15       Kurtosis       3.517551

                  outpatient_appt_all_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               5,000
25%            6              0       Sum of Wgt.       5,000

50%            7                      Mean             6.7802
                        Largest       Std. Dev.      3.009934
75%            9             13
90%           10             13       Variance         9.0597
95%           11             14       Skewness        -.86722
99%           12             14       Kurtosis       3.387943

                  outpatient_appt_all_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               5,000
25%            6              0       Sum of Wgt.       5,000

50%            7                      Mean             6.6984
                        Largest       Std. Dev.      2.955061
75%            9             14
90%           10             14       Variance       8.732384
95%           11             14       Skewness      -.8873861
99%           12             15       Kurtosis       3.498702

. 
. forvalues i=2019/2021 {
  2.     sum ra_hosp_beddays_`i' if ra_hosp_`i'>0, d 
  3. }

                    ra_hosp_beddays_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               4,878
25%            2              0       Sum of Wgt.       4,878

50%            3                      Mean            2.49344
                        Largest       Std. Dev.      1.034894
75%            3              6
90%            4              6       Variance       1.071005
95%            4              6       Skewness       .0008875
99%            5              6       Kurtosis       2.861003

                    ra_hosp_beddays_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               4,857
25%            2              0       Sum of Wgt.       4,857

50%            3                      Mean           2.527898
                        Largest       Std. Dev.      1.028273
75%            3              6
90%            4              6       Variance       1.057346
95%            4              6       Skewness      -.0193126
99%            5              6       Kurtosis       2.860272

                    ra_hosp_beddays_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               4,877
25%            2              0       Sum of Wgt.       4,877

50%            2                      Mean            2.49026
                        Largest       Std. Dev.      1.039892
75%            3              6
90%            4              6       Variance       1.081376
95%            4              6       Skewness      -.0041597
99%            5              6       Kurtosis       2.912614

. 
. 
. * How many people are not on DMARDs and have no RA appointments?
. 
. * Format variables
. *re-order ethnicity
.  gen eth5=1 if ethnicity==1
(4,007 missing values generated)

.  replace eth5=2 if ethnicity==3
(1,005 real changes made)

.  replace eth5=3 if ethnicity==4
(1,012 real changes made)

.  replace eth5=4 if ethnicity==2
(988 real changes made)

.  replace eth5=5 if ethnicity==5
(1,002 real changes made)

.  replace eth5=6 if ethnicity==0
(0 real changes made)

. 
.  label define eth5                      1 "White"                            
>            ///
>                                                         2 "South Asian"      
>                    ///                                             
>                                                         3 "Black"            
>                            ///
>                                                         4 "Mixed"            
>                            ///
>                                                         5 "Other"            
>        ///
>                             6 "Missing"                                 

.                                         
. 
. label values eth5 eth5

. safetab eth5, m
5

       eth5 |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |        993       19.86       19.86
South Asian |      1,005       20.10       39.96
      Black |      1,012       20.24       60.20
      Mixed |        988       19.76       79.96
      Other |      1,002       20.04      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. 
. * formatting gender
. gen male=(sex=="M")

. replace male = 0 if sex == "F"
(0 real changes made)

. label define male 0"Female" 1"Male"

. label values male male

. safetab male, miss
5

       male |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |      2,546       50.92       50.92
       Male |      2,454       49.08      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. 
. *create a 4 category rural urban variable 
. generate urban_rural_5=.
(5,000 missing values generated)

. la var urban_rural_5 "Rural Urban in five categories"

. replace urban_rural_5=1 if urban_rural==1
(611 real changes made)

. replace urban_rural_5=2 if urban_rural==2
(625 real changes made)

. replace urban_rural_5=3 if urban_rural==3|urban_rural==4
(1,242 real changes made)

. replace urban_rural_5=4 if urban_rural==5|urban_rural==6
(1,241 real changes made)

. replace urban_rural_5=5 if urban_rural==7|urban_rural==8
(1,281 real changes made)

. label define urban_rural_5 1 "Urban major conurbation" 2 "Urban minor conurba
> tion" 3 "Urban city and town" 4 "Rural town and fringe" 5 "Rural village and 
> dispersed"

. label values urban_rural_5 urban_rural_5

. safetab urban_rural_5, miss
14

        Rural Urban in five |
                 categories |      Freq.     Percent        Cum.
----------------------------+-----------------------------------
    Urban major conurbation |        611       12.22       12.22
    Urban minor conurbation |        625       12.50       24.72
        Urban city and town |      1,242       24.84       49.56
      Rural town and fringe |      1,241       24.82       74.38
Rural village and dispersed |      1,281       25.62      100.00
----------------------------+-----------------------------------
                      Total |      5,000      100.00

. 
. *generate a binary rural urban (with missing assigned to urban)
. generate urban_rural_bin=.
(5,000 missing values generated)

. replace urban_rural_bin=1 if urban_rural<=4|urban_rural==.
(2,478 real changes made)

. replace urban_rural_bin=0 if urban_rural>4 & urban_rural!=.
(2,522 real changes made)

. label define urban_rural_bin 0 "Rural" 1 "Urban"

. label values urban_rural_bin urban_rural_bin

. safetab urban_rural_bin urban_rural, miss
28

urban_rura |                      urban_rural
     l_bin |         1          2          3          4          5 |     Total
-----------+-------------------------------------------------------+----------
     Rural |         0          0          0          0        592 |     2,522 
     Urban |       611        625        619        623          0 |     2,478 
-----------+-------------------------------------------------------+----------
     Total |       611        625        619        623        592 |     5,000 


urban_rura |           urban_rural
     l_bin |         6          7          8 |     Total
-----------+---------------------------------+----------
     Rural |       649        660        621 |     2,522 
     Urban |         0          0          0 |     2,478 
-----------+---------------------------------+----------
     Total |       649        660        621 |     5,000 

. label var urban_rural_bin "Rural-Urban"

. 
. * Make missing category for region
. replace region = "missing" if region==""
(0 real changes made)

. * Make numeric region variable 
. gen region_n = 1 if region=="East Midlands"
(4,506 missing values generated)

. replace region_n = 2 if region=="East of England"
(481 real changes made)

. replace region_n = 3 if region=="London"
(1,024 real changes made)

. replace region_n = 4 if region=="North East"
(509 real changes made)

. replace region_n = 5 if region=="North West"
(510 real changes made)

. replace region_n = 6 if region=="South East"
(994 real changes made)

. replace region_n = 7 if region=="South West"
(0 real changes made)

. replace region_n = 8 if region=="West Midlands"
(472 real changes made)

. replace region_n = 9 if region=="Yorkshire and the Humber"
(516 real changes made)

. tab region*, m 

                      |                  region_n
               region |         1          2          3          4 |     Total
----------------------+--------------------------------------------+----------
        East Midlands |       494          0          0          0 |       494 
      East of England |         0        481          0          0 |       481 
               London |         0          0      1,024          0 |     1,024 
           North East |         0          0          0        509 |       509 
           North West |         0          0          0          0 |       510 
           South East |         0          0          0          0 |       994 
        West Midlands |         0          0          0          0 |       472 
Yorkshire and the H.. |         0          0          0          0 |       516 
----------------------+--------------------------------------------+----------
                Total |       494        481      1,024        509 |     5,000 


                      |                  region_n
               region |         5          6          8          9 |     Total
----------------------+--------------------------------------------+----------
        East Midlands |         0          0          0          0 |       494 
      East of England |         0          0          0          0 |       481 
               London |         0          0          0          0 |     1,024 
           North East |         0          0          0          0 |       509 
           North West |       510          0          0          0 |       510 
           South East |         0        994          0          0 |       994 
        West Midlands |         0          0        472          0 |       472 
Yorkshire and the H.. |         0          0          0        516 |       516 
----------------------+--------------------------------------------+----------
                Total |       510        994        472        516 |     5,000 

. 
. * Define age categories
. * Create age categories
. egen age_cat = cut(age), at(18, 40, 60, 80, 120) icodes
(1097 missing values generated)

. label define age 0 "18 - 40 years" 1 "41 - 60 years" 2 "61 - 80 years" 3 ">80
>  years"

. label values age_cat age

. safetab age_cat, miss
8

      age_cat |      Freq.     Percent        Cum.
--------------+-----------------------------------
18 - 40 years |      1,438       28.76       28.76
41 - 60 years |      1,235       24.70       53.46
61 - 80 years |        972       19.44       72.90
    >80 years |        258        5.16       78.06
            . |      1,097       21.94      100.00
--------------+-----------------------------------
        Total |      5,000      100.00

. 
. * Smoking status
. gen smoking = 0 if smoking_status=="N"
(4,492 missing values generated)

. replace smoking = 1 if smoking_status=="S"
(988 real changes made)

. replace smoking = 2 if smoking_status=="E"
(765 real changes made)

. replace smoking = 3 if smoking==.
(2,739 real changes made)

. 
. label define smok 1 "Current smoker" 2 "Ex-smoker" 0 "Never smoked" 3 "Unknow
> n"

. label values smoking smok

. 
. * BMI categories
. egen bmi_cat = cut(bmi), at(0, 1, 18.5, 24.9, 29.9, 39.9, 100) icodes
(1 missing value generated)

. bys bmi_cat: sum bmi

-------------------------------------------------------------------------------
-> bmi_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        961           0           0          0          0

-------------------------------------------------------------------------------
-> bmi_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        482    14.86155    3.278099    1.13756   18.49182

-------------------------------------------------------------------------------
-> bmi_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        948    22.02805    1.830221   18.51077   24.89693

-------------------------------------------------------------------------------
-> bmi_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |      1,014    27.42878    1.458009   24.90034   29.89448

-------------------------------------------------------------------------------
-> bmi_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |      1,303    33.97556     2.71814   29.90062   39.89543

-------------------------------------------------------------------------------
-> bmi_cat = 5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        291    43.40477    3.341114   39.90509   58.63921

-------------------------------------------------------------------------------
-> bmi_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |          1   -6.232856           .  -6.232856  -6.232856


. * add missing . to zero category
. replace bmi_cat = 0 if bmi_cat==. 
(1 real change made)

. label define bmi 0 "Missing" 1 "Underweight" 2 "Healthy range" 3 "Overweight"
>  4 "Obese" 5 "Morbidly obese"

. label values bmi_cat bmi

. 
. * Determine if still in follow-up for each year
. * Format dates
. gen died_fuA = date(died_fu, "YMD")
(2,505 missing values generated)

. gen dereg_dateA = date(dereg_date, "YMD")
(2,554 missing values generated)

. gen end_fu = date("`j'-03-31", "YMD")
(5,000 missing values generated)

. gen end_date = min(died_fuA, dereg_dateA, end_fu)
(1,253 missing values generated)

. drop end_fu

. sum end_date

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    end_date |      3,747    22495.46    337.2664      21976      23160

. di "Number where end date prior to follow-up start"
Number where end date prior to follow-up start

. count if end_date<date("2019-04-01", "YMD")
  0

. * determine range of dates for outpatient appointments to determine which sho
> uld be dropped
. gen end_2020 = end_date<date("2020-03-31", "YMD")

. gen end_2021 = end_date<date("2021-03-31", "YMD") 

. gen end_2022 = end_date<date("2022-03-31", "YMD") 

. tab end_2020

   end_2020 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,875       97.50       97.50
          1 |        125        2.50      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. tab end_2021

   end_2021 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,414       68.28       68.28
          1 |      1,586       31.72      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. tab end_2022

   end_2022 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,294       45.88       45.88
          1 |      2,706       54.12      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. 
. * Set outpatient appointment count to missing if end prior to the end of the 
> year 
. forvalues i=2019/2021 {
  2.     local j=`i'+1
  3.     di `j'
  4.     gen op_appt_`i'_orig = outpatient_appt_`i'
  5.     replace outpatient_appt_`i'=. if end_`j'
  6.     gen op_medium_`i'_orig = outpatient_medium_`i'
  7.     replace outpatient_medium_`i'=. if end_`j'
  8.     gen op_appt_all_`i'_orig = outpatient_appt_all_`i'
  9.     replace outpatient_appt_all_`i'=. if end_`j'
 10. }
2020
(125 real changes made, 125 to missing)
(2,516 missing values generated)
(59 real changes made, 59 to missing)
(125 real changes made, 125 to missing)
2021
(1,586 real changes made, 1,586 to missing)
(2,473 missing values generated)
(821 real changes made, 821 to missing)
(1,586 real changes made, 1,586 to missing)
2022
(2,706 real changes made, 2,706 to missing)
(2,506 missing values generated)
(1,299 real changes made, 1,299 to missing)
(2,706 real changes made, 2,706 to missing)

. 
. * Categorise number of outpatient appointments
. label define appt 0 "No appointments" 1 "1-2 per year" 2 "3 or more per year"
>  

. forvalues i=2019/2021 {
  2.     * Rheumatology outpatient appointments
.     egen op_appt_`i'_cat = cut(outpatient_appt_`i'), at(0, 1, 3, 1000) icodes
  3.     * Check all categorised
.     bys op_appt_`i'_cat: sum outpatient_appt_`i'
  4.     label values op_appt_`i'_cat appt
  5.     * Same for orginal variables
.     egen op_appt_`i'_orig_cat = cut(op_appt_`i'_orig), at(0, 1, 3, 1000) icod
> es
  6.     * Check all categorised
.     bys op_appt_`i'_orig_cat: sum op_appt_`i'_orig
  7.     label values op_appt_`i'_orig_cat appt
  8.     }
(125 missing values generated)

-------------------------------------------------------------------------------
-> op_appt_2019_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2019 |        491           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_2019_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2019 |         23    1.826087    .3875534          1          2

-------------------------------------------------------------------------------
-> op_appt_2019_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2019 |      4,361    7.493235    1.950538          3         15

-------------------------------------------------------------------------------
-> op_appt_2019_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2019 |          0


-------------------------------------------------------------------------------
-> op_appt_2019_orig_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2019_orig |        505           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_2019_orig_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2019_orig |         24    1.833333    .3806935          1          2

-------------------------------------------------------------------------------
-> op_appt_2019_orig_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2019_orig |      4,471    7.484679     1.95112          3         15

(1586 missing values generated)

-------------------------------------------------------------------------------
-> op_appt_2020_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2020 |        345           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_2020_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2020 |         17    1.764706    .4372373          1          2

-------------------------------------------------------------------------------
-> op_appt_2020_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2020 |      3,052    7.529161    1.982421          3         14

-------------------------------------------------------------------------------
-> op_appt_2020_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2020 |          0


-------------------------------------------------------------------------------
-> op_appt_2020_orig_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2020_orig |        515           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_2020_orig_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2020_orig |         24    1.791667    .4148511          1          2

-------------------------------------------------------------------------------
-> op_appt_2020_orig_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2020_orig |      4,461    7.539117    1.962452          3         14

(2706 missing values generated)

-------------------------------------------------------------------------------
-> op_appt_2021_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2021 |        218           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_2021_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2021 |         12    1.833333    .3892495          1          2

-------------------------------------------------------------------------------
-> op_appt_2021_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2021 |      2,064    7.532946    1.917059          3         14

-------------------------------------------------------------------------------
-> op_appt_2021_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2021 |          0


-------------------------------------------------------------------------------
-> op_appt_2021_orig_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2021_orig |        476           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_2021_orig_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2021_orig |         25        1.88    .3316625          1          2

-------------------------------------------------------------------------------
-> op_appt_2021_orig_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2021_orig |      4,499    7.577017    1.952189          3         14


. 
. * Calculate difference in rheumatology appointments compared to 2019
. gen diff_op_2020 = outpatient_appt_2020 - outpatient_appt_2019
(1,586 missing values generated)

. gen diff_op_2021 = outpatient_appt_2021 - outpatient_appt_2019
(2,706 missing values generated)

. sum diff_op_2020 diff_op_2021, d

                        diff_op_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%          -10            -14
 5%           -8            -13
10%           -5            -13       Obs               3,414
25%           -2            -12       Sum of Wgt.       3,414

50%            0                      Mean           .0413005
                        Largest       Std. Dev.      4.165179
75%            2             12
90%            5             12       Variance       17.34872
95%            7             13       Skewness      -.0522959
99%           10             13       Kurtosis       3.310237

                        diff_op_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%          -10            -13
 5%           -7            -12
10%           -5            -12       Obs               2,294
25%           -2            -11       Sum of Wgt.       2,294

50%            0                      Mean            .136007
                        Largest       Std. Dev.      4.083172
75%            2             12
90%            6             12       Variance       16.67229
95%            7             13       Skewness      -.0461621
99%           10             14       Kurtosis        3.36364

. 
. * Identify people with no appointments in either year flag them and set diffe
> rence to missing
. forvalues i=2020/2021 {
  2.     gen no_appts_`i' = diff_op_`i'==0 & op_appt_`i'_cat==0
  3.     tab no_appts_`i' op_appt_`i'_cat
  4.     replace diff_op_`i'=. if no_appts_`i'==1
  5. }

no_appts_2 |         op_appt_2020_cat
       020 | No appoin  1-2 per y  3 or more |     Total
-----------+---------------------------------+----------
         0 |       316         17      3,052 |     3,385 
         1 |        29          0          0 |        29 
-----------+---------------------------------+----------
     Total |       345         17      3,052 |     3,414 
(29 real changes made, 29 to missing)

no_appts_2 |         op_appt_2021_cat
       021 | No appoin  1-2 per y  3 or more |     Total
-----------+---------------------------------+----------
         0 |       189         12      2,064 |     2,265 
         1 |        29          0          0 |        29 
-----------+---------------------------------+----------
     Total |       218         12      2,064 |     2,294 
(29 real changes made, 29 to missing)

. 
. * Identify of people with appointments whether they had fewer appointments 
. forvalues i=2020/2021 {
  2.     gen fewer_appts_`i' = (diff_op_`i' < 0) if diff_op_`i'!=.
  3.     tab fewer_appts_`i' no_appts_`i'
  4. }
(1,615 missing values generated)

           | no_appts_2
fewer_appt |    020
    s_2020 |         0 |     Total
-----------+-----------+----------
         0 |     1,910 |     1,910 
         1 |     1,475 |     1,475 
-----------+-----------+----------
     Total |     3,385 |     3,385 
(2,735 missing values generated)

           | no_appts_2
fewer_appt |    021
    s_2021 |         0 |     Total
-----------+-----------+----------
         0 |     1,310 |     1,310 
         1 |       955 |       955 
-----------+-----------+----------
     Total |     2,265 |     2,265 

. 
. * Categorise number of outpatient appointments (all specialties)
. label define appt_all 0 "No appointments" 1 "1-2 per year" 2 "3-5 per year" 3
>  "6 or more per year"

. forvalues i=2019/2021 {
  2.     sum outpatient_appt_all_`i', d
  3.     egen op_appt_all_`i'_cat = cut(outpatient_appt_all_`i'), at(0, 1, 3, 6
> , 1000) icodes
  4.     * Check all categorised
.     bys op_appt_all_`i'_cat: sum outpatient_appt_all_`i'
  5.     label values op_appt_all_`i'_cat appt_all
  6.     * Same for orginal variables
.     egen op_appt_all_`i'_orig_cat = cut(op_appt_all_`i'_orig), at(0, 1, 3, 6,
>  1000) icodes
  7.     * Check all categorised
.     bys op_appt_all_`i'_orig_cat: sum op_appt_all_`i'_orig
  8.     label values op_appt_all_`i'_orig_cat appt_all
  9.     }

                  outpatient_appt_all_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               4,875
25%            6              0       Sum of Wgt.       4,875

50%            7                      Mean           6.793641
                        Largest       Std. Dev.      2.961537
75%            9             14
90%           10             14       Variance       8.770702
95%           11             14       Skewness      -.8815418
99%           12             15       Kurtosis       3.507827
(125 missing values generated)

-------------------------------------------------------------------------------
-> op_appt_all_2019_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2019 |        488           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_all_2019_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2019 |         26    1.846154    .3679465          1          2

-------------------------------------------------------------------------------
-> op_appt_all_2019_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2019 |        660    4.510606    .6890932          3          5

-------------------------------------------------------------------------------
-> op_appt_all_2019_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2019 |      3,701    8.131316    1.577732          6         15

-------------------------------------------------------------------------------
-> op_appt_all_2019_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2019 |          0


-------------------------------------------------------------------------------
-> op_appt_all_2019_orig_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2019_orig |        501           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_all_2019_orig_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2019_orig |         27    1.851852     .362014          1          2

-------------------------------------------------------------------------------
-> op_appt_all_2019_orig_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2019_orig |        676    4.517751     .685065          3          5

-------------------------------------------------------------------------------
-> op_appt_all_2019_orig_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2019_orig |      3,796    8.124078    1.578225          6         15


                  outpatient_appt_all_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               3,414
25%            6              0       Sum of Wgt.       3,414

50%            7                      Mean           6.777387
                        Largest       Std. Dev.      3.041986
75%            9             13
90%           10             13       Variance       9.253681
95%           11             14       Skewness      -.8603348
99%           12             14       Kurtosis       3.323328
(1586 missing values generated)

-------------------------------------------------------------------------------
-> op_appt_all_2020_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2020 |        367           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_all_2020_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2020 |         16      1.9375         .25          1          2

-------------------------------------------------------------------------------
-> op_appt_all_2020_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2020 |        444    4.452703    .6950433          3          5

-------------------------------------------------------------------------------
-> op_appt_all_2020_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2020 |      2,587    8.167762    1.613841          6         14

-------------------------------------------------------------------------------
-> op_appt_all_2020_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2020 |          0


-------------------------------------------------------------------------------
-> op_appt_all_2020_orig_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2020_orig |        522           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_all_2020_orig_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2020_orig |         34    1.882353     .327035          1          2

-------------------------------------------------------------------------------
-> op_appt_all_2020_orig_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2020_orig |        644    4.506211    .6680618          3          5

-------------------------------------------------------------------------------
-> op_appt_all_2020_orig_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2020_orig |      3,800    8.140789    1.607897          6         14


                  outpatient_appt_all_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               2,294
25%            6              0       Sum of Wgt.       2,294

50%            7                      Mean           6.738012
                        Largest       Std. Dev.      2.948722
75%            9             13
90%           10             14       Variance       8.694961
95%           11             14       Skewness      -.8913207
99%           12             14       Kurtosis       3.537405
(2706 missing values generated)

-------------------------------------------------------------------------------
-> op_appt_all_2021_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2021 |        237           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_all_2021_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2021 |          8        1.75      .46291          1          2

-------------------------------------------------------------------------------
-> op_appt_all_2021_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2021 |        298         4.5    .6729502          3          5

-------------------------------------------------------------------------------
-> op_appt_all_2021_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2021 |      1,751    8.053684    1.570979          6         14

-------------------------------------------------------------------------------
-> op_appt_all_2021_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2021 |          0


-------------------------------------------------------------------------------
-> op_appt_all_2021_orig_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2021_orig |        527           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_all_2021_orig_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2021_orig |         22    1.772727     .428932          1          2

-------------------------------------------------------------------------------
-> op_appt_all_2021_orig_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2021_orig |        646         4.5    .6836972          3          5

-------------------------------------------------------------------------------
-> op_appt_all_2021_orig_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2021_orig |      3,805    8.027858    1.565352          6         15


. 
. * Calculate difference in all outpatient appointments compared to 2019
. gen diff_op_all_2020 = outpatient_appt_all_2020 - outpatient_appt_all_2019
(1,586 missing values generated)

. gen diff_op_all_2021 = outpatient_appt_all_2021 - outpatient_appt_all_2019
(2,706 missing values generated)

. sum diff_op_all_2020 diff_op_all_2021, d

                      diff_op_all_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%          -10            -14
 5%           -8            -13
10%           -6            -12       Obs               3,414
25%           -2            -12       Sum of Wgt.       3,414

50%            0                      Mean           .0158172
                        Largest       Std. Dev.      4.309691
75%            2             12
90%            5             13       Variance       18.57344
95%            8             13       Skewness      -.0510551
99%           10             13       Kurtosis           3.19

                      diff_op_all_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%          -10            -13
 5%           -8            -13
10%           -5            -12       Obs               2,294
25%           -3            -12       Sum of Wgt.       2,294

50%            0                      Mean          -.0274629
                        Largest       Std. Dev.      4.264646
75%            2             13
90%            6             13       Variance       18.18721
95%            8             13       Skewness       .0455255
99%           10             14       Kurtosis       3.339152

. 
. * Identify people with no appointments in either year flag them and set diffe
> rence to missing
. forvalues i=2020/2021 {
  2.     gen no_appts_all_`i' = diff_op_all_`i'==0 & op_appt_all_`i'_cat==0
  3.     tab no_appts_all_`i' op_appt_all_`i'_cat
  4.     replace diff_op_all_`i'=. if no_appts_all_`i'==1
  5.     }

no_appts_a |            op_appt_all_2020_cat
   ll_2020 | No appoin  1-2 per y  3-5 per y  6 or more |     Total
-----------+--------------------------------------------+----------
         0 |       335         16        444      2,587 |     3,382 
         1 |        32          0          0          0 |        32 
-----------+--------------------------------------------+----------
     Total |       367         16        444      2,587 |     3,414 
(32 real changes made, 32 to missing)

no_appts_a |            op_appt_all_2021_cat
   ll_2021 | No appoin  1-2 per y  3-5 per y  6 or more |     Total
-----------+--------------------------------------------+----------
         0 |       218          8        298      1,751 |     2,275 
         1 |        19          0          0          0 |        19 
-----------+--------------------------------------------+----------
     Total |       237          8        298      1,751 |     2,294 
(19 real changes made, 19 to missing)

. 
. * Identify of people with appointments whether they had fewer appointments 
. forvalues i=2020/2021 {
  2.     gen fewer_appts_all_`i' = (diff_op_all_`i' < 0) if diff_op_all_`i'!=.
  3. }
(1,618 missing values generated)
(2,725 missing values generated)

. 
. preserve

. * Tabulate number of rheumatology appointments per year of those with whole y
> ear available
. table1_mc, vars(op_appt_2019_cat cate \ op_appt_2020_cat cate \ op_appt_2021_
> cat cate \ no_appts_2020 cate \ no_appts_2021 cate \ fewer_appts_2020 cate \ 
> fewer_appts_2021 cate) clear

  +----------------------------------+
  | factor               N_1     m_1 |
  |----------------------------------|
  | op_appt_2019_cat   4,875     125 |
  |----------------------------------|
  | op_appt_2020_cat   3,414   1,586 |
  |----------------------------------|
  | op_appt_2021_cat   2,294   2,706 |
  |----------------------------------|
  | no_appts_2020      5,000       0 |
  |----------------------------------|
  | no_appts_2021      5,000       0 |
  |----------------------------------|
  | fewer_appts_2020   3,385   1,615 |
  |----------------------------------|
  | fewer_appts_2021   2,265   2,735 |
  +----------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +-------------------------------------------------------+
  |                                         Total         |
  |-------------------------------------------------------|
  |                                         N=5,000       |
  |-------------------------------------------------------|
  | op_appt_2019_cat   No appointments      491 (10.1%)   |
  |                    1-2 per year         23 ( 0.5%)    |
  |                    3 or more per year   4,361 (89.5%) |
  |-------------------------------------------------------|
  | op_appt_2020_cat   No appointments      345 (10.1%)   |
  |                    1-2 per year         17 ( 0.5%)    |
  |                    3 or more per year   3,052 (89.4%) |
  |-------------------------------------------------------|
  | op_appt_2021_cat   No appointments      218 ( 9.5%)   |
  |                    1-2 per year         12 ( 0.5%)    |
  |                    3 or more per year   2,064 (90.0%) |
  |-------------------------------------------------------|
  | no_appts_2020      0                    4,971 (99.4%) |
  |                    1                    29 ( 0.6%)    |
  |-------------------------------------------------------|
  | no_appts_2021      0                    4,971 (99.4%) |
  |                    1                    29 ( 0.6%)    |
  |-------------------------------------------------------|
  | fewer_appts_2020   0                    1,910 (56.4%) |
  |                    1                    1,475 (43.6%) |
  |-------------------------------------------------------|
  | fewer_appts_2021   0                    1,310 (57.8%) |
  |                    1                    955 (42.2%)   |
  +-------------------------------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/op_appt_yrs.csv
file ./output/tables/op_appt_yrs.csv saved

. * Rounding numbers in table to nearest 5
. describe

Contains data from /tmp/St00015.000002
  obs:            19                          
 vars:             7                          1 Jun 2023 08:53
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
factor          str16   %-16s                 Factor
level           str18   %-18s                 Level
Total           str13   %-13s                 Total
N_1             str5    %9s                   
m_1             str5    %9s                   
_columna_1      str11   %6s                   1 _columna_
_columnb_1      str11   %-11s                 1 _columnb_
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. destring _columna_1, gen(n) ignore(",") force
_columna_1: contains nonnumeric characters not specified in ignore()
_columna_1: character , removed; n generated as int
(2 missing values generated)

. destring _columnb_1, gen(percent) ignore("-" "%" "(" ")") force
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent generated as double
(2 missing values generated)

. gen rounded_n = round(n, 5)
(2 missing values generated)

. keep factor level rounded_n percent

. export delimited using ./output/tables/op_appt_yrs_rounded.csv
file ./output/tables/op_appt_yrs_rounded.csv saved

. restore 

. preserve

. * Tabulate number of rheumatology appointments per year (includes people who 
> end follow-up during year)
. table1_mc, vars(op_appt_2019_orig_cat cate \ op_appt_2020_orig_cat cate \ op_
> appt_2021_orig_cat cate) clear

  +-------------------------------------+
  | factor                    N_1   m_1 |
  |-------------------------------------|
  | op_appt_2019_orig_cat   5,000     0 |
  |-------------------------------------|
  | op_appt_2020_orig_cat   5,000     0 |
  |-------------------------------------|
  | op_appt_2021_orig_cat   5,000     0 |
  +-------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +------------------------------------------------------------+
  |                                              Total         |
  |------------------------------------------------------------|
  |                                              N=5,000       |
  |------------------------------------------------------------|
  | op_appt_2019_orig_cat   No appointments      505 (10.1%)   |
  |                         1-2 per year         24 ( 0.5%)    |
  |                         3 or more per year   4,471 (89.4%) |
  |------------------------------------------------------------|
  | op_appt_2020_orig_cat   No appointments      515 (10.3%)   |
  |                         1-2 per year         24 ( 0.5%)    |
  |                         3 or more per year   4,461 (89.2%) |
  |------------------------------------------------------------|
  | op_appt_2021_orig_cat   No appointments      476 ( 9.5%)   |
  |                         1-2 per year         25 ( 0.5%)    |
  |                         3 or more per year   4,499 (90.0%) |
  +------------------------------------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/op_appt_orig_yrs.csv
file ./output/tables/op_appt_orig_yrs.csv saved

. restore 

. preserve

. * Tabulate number of all outpatient appointments per year of those with whole
>  year available
. table1_mc, vars(op_appt_all_2019_cat cate \ op_appt_all_2020_cat cate \ op_ap
> pt_all_2021_cat cate \ no_appts_all_2020 cate \ no_appts_all_2021 cate \ fewe
> r_appts_all_2020 cate \ fewer_appts_all_2021 cate) clear

  +--------------------------------------+
  | factor                   N_1     m_1 |
  |--------------------------------------|
  | op_appt_all_2019_cat   4,875     125 |
  |--------------------------------------|
  | op_appt_all_2020_cat   3,414   1,586 |
  |--------------------------------------|
  | op_appt_all_2021_cat   2,294   2,706 |
  |--------------------------------------|
  | no_appts_all_2020      5,000       0 |
  |--------------------------------------|
  | no_appts_all_2021      5,000       0 |
  |--------------------------------------|
  | fewer_appts_all_2020   3,382   1,618 |
  |--------------------------------------|
  | fewer_appts_all_2021   2,275   2,725 |
  +--------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +-----------------------------------------------------------+
  |                                             Total         |
  |-----------------------------------------------------------|
  |                                             N=5,000       |
  |-----------------------------------------------------------|
  | op_appt_all_2019_cat   No appointments      488 (10.0%)   |
  |                        1-2 per year         26 ( 0.5%)    |
  |                        3-5 per year         660 (13.5%)   |
  |                        6 or more per year   3,701 (75.9%) |
  |-----------------------------------------------------------|
  | op_appt_all_2020_cat   No appointments      367 (10.7%)   |
  |                        1-2 per year         16 ( 0.5%)    |
  |                        3-5 per year         444 (13.0%)   |
  |                        6 or more per year   2,587 (75.8%) |
  |-----------------------------------------------------------|
  | op_appt_all_2021_cat   No appointments      237 (10.3%)   |
  |                        1-2 per year         8 ( 0.3%)     |
  |                        3-5 per year         298 (13.0%)   |
  |                        6 or more per year   1,751 (76.3%) |
  |-----------------------------------------------------------|
  | no_appts_all_2020      0                    4,968 (99.4%) |
  |                        1                    32 ( 0.6%)    |
  |-----------------------------------------------------------|
  | no_appts_all_2021      0                    4,981 (99.6%) |
  |                        1                    19 ( 0.4%)    |
  |-----------------------------------------------------------|
  | fewer_appts_all_2020   0                    1,910 (56.5%) |
  |                        1                    1,472 (43.5%) |
  |-----------------------------------------------------------|
  | fewer_appts_all_2021   0                    1,269 (55.8%) |
  |                        1                    1,006 (44.2%) |
  +-----------------------------------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/op_appt_all_yrs.csv
file ./output/tables/op_appt_all_yrs.csv saved

. * Rounding numbers in table to nearest 5
. describe

Contains data from /tmp/St00015.000004
  obs:            22                          
 vars:             7                          1 Jun 2023 08:53
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
factor          str20   %-20s                 Factor
level           str18   %-18s                 Level
Total           str13   %-13s                 Total
N_1             str5    %9s                   
m_1             str5    %9s                   
_columna_1      str11   %6s                   1 _columna_
_columnb_1      str11   %-11s                 1 _columnb_
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. destring _columna_1, gen(n) ignore(",") force
_columna_1: contains nonnumeric characters not specified in ignore()
_columna_1: character , removed; n generated as int
(2 missing values generated)

. destring _columnb_1, gen(percent) ignore("-" "%" "(" ")") force
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent generated as double
(2 missing values generated)

. gen rounded_n = round(n, 5)
(2 missing values generated)

. keep factor level rounded_n percent

. export delimited using ./output/tables/op_appt_all_yrs_rounded.csv
file ./output/tables/op_appt_all_yrs_rounded.csv saved

. restore 

. * Tabulate overall characteristics 
. preserve

. table1_mc, vars(age_cat cate \ male cate \ urban_rural_bin cate \ region cate
>  \ imd cate \  smoking cate \ time_ra contn \ bmi_cat cate \ eth5 cate) clear

  +-----------------------------+
  | factor          N_1     m_1 |
  |-----------------------------|
  | age_cat       3,903   1,097 |
  |-----------------------------|
  | male          5,000       0 |
  |-----------------------------|
  | Rural-Urban   5,000       0 |
  |-----------------------------|
  | region        5,000       0 |
  |-----------------------------|
  | imd           5,000       0 |
  |-----------------------------|
  | smoking       5,000       0 |
  |-----------------------------|
  | time_ra       2,202   2,798 |
  |-----------------------------|
  | bmi_cat       5,000       0 |
  |-----------------------------|
  | eth5          5,000       0 |
  +-----------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------------------+
  |                                          Total               |
  |--------------------------------------------------------------|
  |                                          N=5,000             |
  |--------------------------------------------------------------|
  | age_cat       18 - 40 years              1,438 (36.8%)       |
  |               41 - 60 years              1,235 (31.6%)       |
  |               61 - 80 years              972 (24.9%)         |
  |               >80 years                  258 ( 6.6%)         |
  |--------------------------------------------------------------|
  | male          Female                     2,546 (50.9%)       |
  |               Male                       2,454 (49.1%)       |
  |--------------------------------------------------------------|
  | Rural-Urban   Rural                      2,522 (50.4%)       |
  |               Urban                      2,478 (49.6%)       |
  |--------------------------------------------------------------|
  | region        East Midlands              494 ( 9.9%)         |
  |               East of England            481 ( 9.6%)         |
  |               London                     1,024 (20.5%)       |
  |               North East                 509 (10.2%)         |
  |               North West                 510 (10.2%)         |
  |               South East                 994 (19.9%)         |
  |               West Midlands              472 ( 9.4%)         |
  |               Yorkshire and the Humber   516 (10.3%)         |
  |--------------------------------------------------------------|
  | imd           0                          243 ( 4.9%)         |
  |               1                          945 (18.9%)         |
  |               2                          957 (19.1%)         |
  |               3                          961 (19.2%)         |
  |               4                          978 (19.6%)         |
  |               5                          916 (18.3%)         |
  |--------------------------------------------------------------|
  | smoking       Never smoked               508 (10.2%)         |
  |               Current smoker             988 (19.8%)         |
  |               Ex-smoker                  765 (15.3%)         |
  |               Unknown                    2,739 (54.8%)       |
  |--------------------------------------------------------------|
  | time_ra                                  54.88472 (31.95055) |
  |--------------------------------------------------------------|
  | bmi_cat       Missing                    962 (19.2%)         |
  |               Underweight                482 ( 9.6%)         |
  |               Healthy range              948 (19.0%)         |
  |               Overweight                 1,014 (20.3%)       |
  |               Obese                      1,303 (26.1%)       |
  |               Morbidly obese             291 ( 5.8%)         |
  |--------------------------------------------------------------|
  | eth5          White                      993 (19.9%)         |
  |               South Asian                1,005 (20.1%)       |
  |               Black                      1,012 (20.2%)       |
  |               Mixed                      988 (19.8%)         |
  |               Other                      1,002 (20.0%)       |
  +--------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 

. export delimited using ./output/tables/op_chars.csv
file ./output/tables/op_chars.csv saved

. * Rounding numbers in table to nearest 5
. describe

Contains data from /tmp/St00015.000005
  obs:            40                          
 vars:             7                          1 Jun 2023 08:53
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
factor          str18   %-18s                 Factor
level           str24   %-24s                 Level
Total           str19   %-19s                 Total
N_1             str5    %9s                   
m_1             str5    %9s                   
_columna_1      str11   %6s                   1 _columna_
_columnb_1      str11   %-11s                 1 _columnb_
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. destring _columna_1, gen(n) ignore(",") force
_columna_1: contains nonnumeric characters not specified in ignore()
_columna_1: character , removed; n generated as double
(2 missing values generated)

. destring _columnb_1, gen(percent) ignore("-" "%" "(" ")") force
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent generated as double
(2 missing values generated)

. gen rounded_n = round(n, 5)
(2 missing values generated)

. keep factor level rounded_n percent

. export delimited using ./output/tables/op_chars_rounded.csv
file ./output/tables/op_chars_rounded.csv saved

. restore

. * Tabulate characteristics by category of outpatient appointments for each ye
> ar
. forvalues i=2019/2021 {
  2.     preserve
  3.     table1_mc, vars(age_cat cat \ male cat \ urban_rural_bin cat \ region 
> cat \ imd cat \ smoking cat \ time_ra contn \ bmi_cat cat \ eth5 cat) by(op_a
> ppt_`i'_cat) clear
  4.     export delimited using ./output/tables/characteristics_strata`i'.csv
  5.     destring _columna_0, gen(n0) ignore(",") force
  6.     destring _columnb_0, gen(percent0) ignore("-" "%" "(" ")") force
  7.     destring _columna_1, gen(n1) ignore(",") force
  8.     destring _columnb_1, gen(percent1) ignore("-" "%" "(" ")") force
  9.     destring _columna_2, gen(n2) ignore(",") force
 10.     destring _columnb_2, gen(percent2) ignore("-" "%" "(" ")") force
 11.     gen rounded_n0 = round(n0, 5)
 12.     gen rounded_n1 = round(n1, 5)
 13.     gen rounded_n2 = round(n2, 5)
 14.     keep factor level rounded_n0 percent0 rounded_n1 percent1 rounded_n2 p
> ercent2
 15.     export delimited using ./output/tables/characteristics_strata`i'_round
> ed.csv
 16.     restore
 17. 
.     /* Tabulate characteristics by whether hospitalised with RA for each year
>     preserve
>     keep if ra_hosp_`i'==0
>     table1_mc, vars(age_cat cate \ male cate \ urban_rural_5 cate \ prescribe
> d_biologics cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat cate) cl
> ear
>     save `tempfile', replace
>     restore
>     preserve
>     keep if ra_hosp_`i'==1
>     table1_mc, vars(age_cat cate \ male cate \ urban_rural_5 cate \ prescribe
> d_biologics cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat cate) cl
> ear
>     append using `tempfile'
>     save `tempfile', replace
>     export delimited using ./output/tables/characteristics_ra_hosp_`i'.csv
>     restore*/
. }

  +-----------------------------------------------------+
  | factor        N_0   N_1     N_2   m_0   m_1     m_2 |
  |-----------------------------------------------------|
  | age_cat       385    19   3,401   106     4     960 |
  |-----------------------------------------------------|
  | male          491    23   4,361     0     0       0 |
  |-----------------------------------------------------|
  | Rural-Urban   491    23   4,361     0     0       0 |
  |-----------------------------------------------------|
  | region        491    23   4,361     0     0       0 |
  |-----------------------------------------------------|
  | imd           491    23   4,361     0     0       0 |
  |-----------------------------------------------------|
  | smoking       491    23   4,361     0     0       0 |
  |-----------------------------------------------------|
  | time_ra       208    10   1,931   283    13   2,430 |
  |-----------------------------------------------------|
  | bmi_cat       491    23   4,361     0     0       0 |
  |-----------------------------------------------------|
  | eth5          491    23   4,361     0     0       0 |
  +-----------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> ----------------------------------------+
  |                                          No appointments       1-2 per year
>           3 or more per year    p-value |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  |                                          N=491                 N=23        
>           N=4,361                       |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | age_cat       18 - 40 years              150 (39.0%)           8 (42.1%)   
>           1,248 (36.7%)          0.38   |
  |               41 - 60 years              121 (31.4%)           6 (31.6%)   
>           1,079 (31.7%)                 |
  |               61 - 80 years              99 (25.7%)            3 (15.8%)   
>           842 (24.8%)                   |
  |               >80 years                  15 ( 3.9%)            2 (10.5%)   
>           232 ( 6.8%)                   |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | male          Female                     246 (50.1%)           11 (47.8%)  
>           2,215 (50.8%)          0.92   |
  |               Male                       245 (49.9%)           12 (52.2%)  
>           2,146 (49.2%)                 |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | Rural-Urban   Rural                      242 (49.3%)           14 (60.9%)  
>           2,208 (50.6%)          0.52   |
  |               Urban                      249 (50.7%)           9 (39.1%)   
>           2,153 (49.4%)                 |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | region        East Midlands              56 (11.4%)            2 ( 8.7%)   
>           430 ( 9.9%)            0.56   |
  |               East of England            57 (11.6%)            4 (17.4%)   
>           411 ( 9.4%)                   |
  |               London                     103 (21.0%)           4 (17.4%)   
>           888 (20.4%)                   |
  |               North East                 39 ( 7.9%)            3 (13.0%)   
>           457 (10.5%)                   |
  |               North West                 47 ( 9.6%)            1 ( 4.3%)   
>           450 (10.3%)                   |
  |               South East                 95 (19.3%)            7 (30.4%)   
>           861 (19.7%)                   |
  |               West Midlands              41 ( 8.4%)            1 ( 4.3%)   
>           419 ( 9.6%)                   |
  |               Yorkshire and the Humber   53 (10.8%)            1 ( 4.3%)   
>           445 (10.2%)                   |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | imd           0                          26 ( 5.3%)            1 ( 4.3%)   
>           209 ( 4.8%)            0.17   |
  |               1                          84 (17.1%)            5 (21.7%)   
>           829 (19.0%)                   |
  |               2                          111 (22.6%)           2 ( 8.7%)   
>           818 (18.8%)                   |
  |               3                          93 (18.9%)            4 (17.4%)   
>           853 (19.6%)                   |
  |               4                          76 (15.5%)            4 (17.4%)   
>           867 (19.9%)                   |
  |               5                          101 (20.6%)           7 (30.4%)   
>           785 (18.0%)                   |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | smoking       Never smoked               46 ( 9.4%)            3 (13.0%)   
>           448 (10.3%)            0.62   |
  |               Current smoker             94 (19.1%)            1 ( 4.3%)   
>           869 (19.9%)                   |
  |               Ex-smoker                  76 (15.5%)            5 (21.7%)   
>           663 (15.2%)                   |
  |               Unknown                    275 (56.0%)           14 (60.9%)  
>           2,381 (54.6%)                 |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | time_ra                                  53.76249 (31.67636)   65.41164 (29
> .24984)   54.97426 (31.94772)    0.51   |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | bmi_cat       Missing                    100 (20.4%)           4 (17.4%)   
>           820 (18.8%)            0.52   |
  |               Underweight                45 ( 9.2%)            3 (13.0%)   
>           422 ( 9.7%)                   |
  |               Healthy range              102 (20.8%)           7 (30.4%)   
>           821 (18.8%)                   |
  |               Overweight                 87 (17.7%)            4 (17.4%)   
>           900 (20.6%)                   |
  |               Obese                      136 (27.7%)           4 (17.4%)   
>           1,133 (26.0%)                 |
  |               Morbidly obese             21 ( 4.3%)            1 ( 4.3%)   
>           265 ( 6.1%)                   |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | eth5          White                      106 (21.6%)           7 (30.4%)   
>           849 (19.5%)            0.29   |
  |               South Asian                102 (20.8%)           7 (30.4%)   
>           870 (19.9%)                   |
  |               Black                      94 (19.1%)            1 ( 4.3%)   
>           896 (20.5%)                   |
  |               Mixed                      103 (21.0%)           5 (21.7%)   
>           861 (19.7%)                   |
  |               Other                      86 (17.5%)            3 (13.0%)   
>           885 (20.3%)                   |
  +----------------------------------------------------------------------------
> ----------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file ./output/tables/characteristics_strata2019.csv saved
_columna_0: contains nonnumeric characters not specified in ignore(); n0 genera
> ted as double
(2 missing values generated)
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)
_columna_1: contains nonnumeric characters not specified in ignore(); n1 genera
> ted as double
(2 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters - space % ( ) removed; percent1 generated as double
(2 missing values generated)
_columna_2: contains nonnumeric characters not specified in ignore()
_columna_2: character , removed; n2 generated as double
(2 missing values generated)
_columnb_2: contains nonnumeric characters not specified in ignore()
_columnb_2: characters space % ( ) removed; percent2 generated as double
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
file ./output/tables/characteristics_strata2019_rounded.csv saved

  +-----------------------------------------------------+
  | factor        N_0   N_1     N_2   m_0   m_1     m_2 |
  |-----------------------------------------------------|
  | age_cat       268    13   2,376    77     4     676 |
  |-----------------------------------------------------|
  | male          345    17   3,052     0     0       0 |
  |-----------------------------------------------------|
  | Rural-Urban   345    17   3,052     0     0       0 |
  |-----------------------------------------------------|
  | region        345    17   3,052     0     0       0 |
  |-----------------------------------------------------|
  | imd           345    17   3,052     0     0       0 |
  |-----------------------------------------------------|
  | smoking       345    17   3,052     0     0       0 |
  |-----------------------------------------------------|
  | time_ra       141     8   1,371   204     9   1,681 |
  |-----------------------------------------------------|
  | bmi_cat       345    17   3,052     0     0       0 |
  |-----------------------------------------------------|
  | eth5          345    17   3,052     0     0       0 |
  +-----------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> ----------------------------------------+
  |                                          No appointments       1-2 per year
>           3 or more per year    p-value |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  |                                          N=345                 N=17        
>           N=3,052                       |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | age_cat       18 - 40 years              108 (40.3%)           4 (30.8%)   
>           894 (37.6%)            0.36   |
  |               41 - 60 years              78 (29.1%)            3 (23.1%)   
>           726 (30.6%)                   |
  |               61 - 80 years              65 (24.3%)            3 (23.1%)   
>           601 (25.3%)                   |
  |               >80 years                  17 ( 6.3%)            3 (23.1%)   
>           155 ( 6.5%)                   |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | male          Female                     176 (51.0%)           8 (47.1%)   
>           1,560 (51.1%)          0.95   |
  |               Male                       169 (49.0%)           9 (52.9%)   
>           1,492 (48.9%)                 |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | Rural-Urban   Rural                      170 (49.3%)           9 (52.9%)   
>           1,557 (51.0%)          0.82   |
  |               Urban                      175 (50.7%)           8 (47.1%)   
>           1,495 (49.0%)                 |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | region        East Midlands              36 (10.4%)            1 ( 5.9%)   
>           311 (10.2%)            0.82   |
  |               East of England            29 ( 8.4%)            1 ( 5.9%)   
>           295 ( 9.7%)                   |
  |               London                     79 (22.9%)            2 (11.8%)   
>           617 (20.2%)                   |
  |               North East                 26 ( 7.5%)            4 (23.5%)   
>           310 (10.2%)                   |
  |               North West                 35 (10.1%)            1 ( 5.9%)   
>           326 (10.7%)                   |
  |               South East                 71 (20.6%)            4 (23.5%)   
>           588 (19.3%)                   |
  |               West Midlands              32 ( 9.3%)            2 (11.8%)   
>           295 ( 9.7%)                   |
  |               Yorkshire and the Humber   37 (10.7%)            2 (11.8%)   
>           310 (10.2%)                   |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | imd           0                          15 ( 4.3%)            0 ( 0.0%)   
>           152 ( 5.0%)            0.97   |
  |               1                          67 (19.4%)            4 (23.5%)   
>           584 (19.1%)                   |
  |               2                          61 (17.7%)            3 (17.6%)   
>           578 (18.9%)                   |
  |               3                          60 (17.4%)            4 (23.5%)   
>           583 (19.1%)                   |
  |               4                          71 (20.6%)            3 (17.6%)   
>           596 (19.5%)                   |
  |               5                          71 (20.6%)            3 (17.6%)   
>           559 (18.3%)                   |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | smoking       Never smoked               32 ( 9.3%)            3 (17.6%)   
>           316 (10.4%)            0.22   |
  |               Current smoker             52 (15.1%)            3 (17.6%)   
>           619 (20.3%)                   |
  |               Ex-smoker                  52 (15.1%)            2 (11.8%)   
>           471 (15.4%)                   |
  |               Unknown                    209 (60.6%)           9 (52.9%)   
>           1,646 (53.9%)                 |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | time_ra                                  55.52053 (32.53932)   42.21903 (29
> .21667)   54.78845 (31.65751)    0.51   |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | bmi_cat       Missing                    63 (18.3%)            1 ( 5.9%)   
>           586 (19.2%)            0.29   |
  |               Underweight                31 ( 9.0%)            0 ( 0.0%)   
>           304 (10.0%)                   |
  |               Healthy range              69 (20.0%)            5 (29.4%)   
>           559 (18.3%)                   |
  |               Overweight                 79 (22.9%)            5 (29.4%)   
>           613 (20.1%)                   |
  |               Obese                      84 (24.3%)            3 (17.6%)   
>           802 (26.3%)                   |
  |               Morbidly obese             19 ( 5.5%)            3 (17.6%)   
>           188 ( 6.2%)                   |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | eth5          White                      72 (20.9%)            3 (17.6%)   
>           587 (19.2%)            0.60   |
  |               South Asian                72 (20.9%)            2 (11.8%)   
>           628 (20.6%)                   |
  |               Black                      64 (18.6%)            3 (17.6%)   
>           599 (19.6%)                   |
  |               Mixed                      74 (21.4%)            2 (11.8%)   
>           631 (20.7%)                   |
  |               Other                      63 (18.3%)            7 (41.2%)   
>           607 (19.9%)                   |
  +----------------------------------------------------------------------------
> ----------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file ./output/tables/characteristics_strata2020.csv saved
_columna_0: contains nonnumeric characters not specified in ignore(); n0 genera
> ted as double
(2 missing values generated)
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)
_columna_1: contains nonnumeric characters not specified in ignore(); n1 genera
> ted as double
(2 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters - space % ( ) removed; percent1 generated as double
(2 missing values generated)
_columna_2: contains nonnumeric characters not specified in ignore()
_columna_2: character , removed; n2 generated as double
(2 missing values generated)
_columnb_2: contains nonnumeric characters not specified in ignore()
_columnb_2: characters space % ( ) removed; percent2 generated as double
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
file ./output/tables/characteristics_strata2020_rounded.csv saved

  +-----------------------------------------------------+
  | factor        N_0   N_1     N_2   m_0   m_1     m_2 |
  |-----------------------------------------------------|
  | age_cat       172    11   1,612    46     1     452 |
  |-----------------------------------------------------|
  | male          218    12   2,064     0     0       0 |
  |-----------------------------------------------------|
  | Rural-Urban   218    12   2,064     0     0       0 |
  |-----------------------------------------------------|
  | region        218    12   2,064     0     0       0 |
  |-----------------------------------------------------|
  | imd           218    12   2,064     0     0       0 |
  |-----------------------------------------------------|
  | smoking       218    12   2,064     0     0       0 |
  |-----------------------------------------------------|
  | time_ra       102     6     917   116     6   1,147 |
  |-----------------------------------------------------|
  | bmi_cat       218    12   2,064     0     0       0 |
  |-----------------------------------------------------|
  | eth5          218    12   2,064     0     0       0 |
  +-----------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------------------------------------+
  |                                          No appointments       1-2 per year
>          3 or more per year   p-value |
  |----------------------------------------------------------------------------
> --------------------------------------|
  |                                          N=218                 N=12        
>          N=2,064                      |
  |----------------------------------------------------------------------------
> --------------------------------------|
  | age_cat       18 - 40 years              61 (35.5%)            3 (27.3%)   
>          633 (39.3%)           0.28   |
  |               41 - 60 years              57 (33.1%)            3 (27.3%)   
>          479 (29.7%)                  |
  |               61 - 80 years              37 (21.5%)            4 (36.4%)   
>          407 (25.2%)                  |
  |               >80 years                  17 ( 9.9%)            1 ( 9.1%)   
>          93 ( 5.8%)                   |
  |----------------------------------------------------------------------------
> --------------------------------------|
  | male          Female                     107 (49.1%)           7 (58.3%)   
>          1,045 (50.6%)         0.79   |
  |               Male                       111 (50.9%)           5 (41.7%)   
>          1,019 (49.4%)                |
  |----------------------------------------------------------------------------
> --------------------------------------|
  | Rural-Urban   Rural                      120 (55.0%)           8 (66.7%)   
>          1,066 (51.6%)         0.38   |
  |               Urban                      98 (45.0%)            4 (33.3%)   
>          998 (48.4%)                  |
  |----------------------------------------------------------------------------
> --------------------------------------|
  | region        East Midlands              26 (11.9%)            1 ( 8.3%)   
>          214 (10.4%)           0.56   |
  |               East of England            27 (12.4%)            3 (25.0%)   
>          183 ( 8.9%)                  |
  |               London                     45 (20.6%)            3 (25.0%)   
>          417 (20.2%)                  |
  |               North East                 25 (11.5%)            2 (16.7%)   
>          208 (10.1%)                  |
  |               North West                 17 ( 7.8%)            1 ( 8.3%)   
>          229 (11.1%)                  |
  |               South East                 40 (18.3%)            0 ( 0.0%)   
>          418 (20.3%)                  |
  |               West Midlands              18 ( 8.3%)            1 ( 8.3%)   
>          199 ( 9.6%)                  |
  |               Yorkshire and the Humber   20 ( 9.2%)            1 ( 8.3%)   
>          196 ( 9.5%)                  |
  |----------------------------------------------------------------------------
> --------------------------------------|
  | imd           0                          9 ( 4.1%)             1 ( 8.3%)   
>          101 ( 4.9%)           0.046  |
  |               1                          42 (19.3%)            0 ( 0.0%)   
>          397 (19.2%)                  |
  |               2                          31 (14.2%)            4 (33.3%)   
>          405 (19.6%)                  |
  |               3                          57 (26.1%)            1 ( 8.3%)   
>          379 (18.4%)                  |
  |               4                          44 (20.2%)            5 (41.7%)   
>          398 (19.3%)                  |
  |               5                          35 (16.1%)            1 ( 8.3%)   
>          384 (18.6%)                  |
  |----------------------------------------------------------------------------
> --------------------------------------|
  | smoking       Never smoked               19 ( 8.7%)            1 ( 8.3%)   
>          230 (11.1%)           0.88   |
  |               Current smoker             40 (18.3%)            2 (16.7%)   
>          399 (19.3%)                  |
  |               Ex-smoker                  34 (15.6%)            3 (25.0%)   
>          325 (15.7%)                  |
  |               Unknown                    125 (57.3%)           6 (50.0%)   
>          1,110 (53.8%)                |
  |----------------------------------------------------------------------------
> --------------------------------------|
  | time_ra                                  56.52959 (30.76309)   64.0397 (36.
> 23199)   54.6991 (31.42527)    0.66   |
  |----------------------------------------------------------------------------
> --------------------------------------|
  | bmi_cat       Missing                    43 (19.7%)            3 (25.0%)   
>          362 (17.5%)           0.77   |
  |               Underweight                25 (11.5%)            3 (25.0%)   
>          206 (10.0%)                  |
  |               Healthy range              36 (16.5%)            1 ( 8.3%)   
>          390 (18.9%)                  |
  |               Overweight                 43 (19.7%)            2 (16.7%)   
>          433 (21.0%)                  |
  |               Obese                      59 (27.1%)            3 (25.0%)   
>          540 (26.2%)                  |
  |               Morbidly obese             12 ( 5.5%)            0 ( 0.0%)   
>          133 ( 6.4%)                  |
  |----------------------------------------------------------------------------
> --------------------------------------|
  | eth5          White                      46 (21.1%)            0 ( 0.0%)   
>          394 (19.1%)           0.21   |
  |               South Asian                42 (19.3%)            2 (16.7%)   
>          442 (21.4%)                  |
  |               Black                      35 (16.1%)            2 (16.7%)   
>          387 (18.8%)                  |
  |               Mixed                      53 (24.3%)            2 (16.7%)   
>          429 (20.8%)                  |
  |               Other                      42 (19.3%)            6 (50.0%)   
>          412 (20.0%)                  |
  +----------------------------------------------------------------------------
> --------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file ./output/tables/characteristics_strata2021.csv saved
_columna_0: contains nonnumeric characters not specified in ignore(); n0 genera
> ted as double
(2 missing values generated)
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)
_columna_1: contains nonnumeric characters not specified in ignore(); n1 genera
> ted as double
(2 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters - space % ( ) removed; percent1 generated as double
(2 missing values generated)
_columna_2: contains nonnumeric characters not specified in ignore()
_columna_2: character , removed; n2 generated as double
(2 missing values generated)
_columnb_2: contains nonnumeric characters not specified in ignore()
_columnb_2: characters space % ( ) removed; percent2 generated as double
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
file ./output/tables/characteristics_strata2021_rounded.csv saved

. * Characteristics by whether prescribed specific drugs 
. * Weak opioids 
. preserve

. table1_mc, vars(age_cat cat \ male cat \ urban_rural_bin cat \ region cat \ i
> md cat) by(prescribed_weak_opioids) clear

  +-----------------------------------------+
  | factor          N_0     N_1   m_0   m_1 |
  |-----------------------------------------|
  | age_cat       1,879   2,024   563   534 |
  |-----------------------------------------|
  | male          2,442   2,558     0     0 |
  |-----------------------------------------|
  | Rural-Urban   2,442   2,558     0     0 |
  |-----------------------------------------|
  | region        2,442   2,558     0     0 |
  |-----------------------------------------|
  | imd           2,442   2,558     0     0 |
  +-----------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> ----------------------------------+
  |                                          prescribed_weak_opioids = 0   pres
> cribed_weak_opioids = 1   p-value |
  |----------------------------------------------------------------------------
> ----------------------------------|
  |                                          N=2,442                       N=2,
> 558                               |
  |----------------------------------------------------------------------------
> ----------------------------------|
  | age_cat       18 - 40 years              707 (37.6%)                   731 
> (36.1%)                    0.13   |
  |               41 - 60 years              561 (29.9%)                   674 
> (33.3%)                           |
  |               61 - 80 years              480 (25.5%)                   492 
> (24.3%)                           |
  |               >80 years                  131 ( 7.0%)                   127 
> ( 6.3%)                           |
  |----------------------------------------------------------------------------
> ----------------------------------|
  | male          Female                     1,234 (50.5%)                 1,31
> 2 (51.3%)                  0.59   |
  |               Male                       1,208 (49.5%)                 1,24
> 6 (48.7%)                         |
  |----------------------------------------------------------------------------
> ----------------------------------|
  | Rural-Urban   Rural                      1,221 (50.0%)                 1,30
> 1 (50.9%)                  0.54   |
  |               Urban                      1,221 (50.0%)                 1,25
> 7 (49.1%)                         |
  |----------------------------------------------------------------------------
> ----------------------------------|
  | region        East Midlands              234 ( 9.6%)                   260 
> (10.2%)                    0.70   |
  |               East of England            230 ( 9.4%)                   251 
> ( 9.8%)                           |
  |               London                     487 (19.9%)                   537 
> (21.0%)                           |
  |               North East                 257 (10.5%)                   252 
> ( 9.9%)                           |
  |               North West                 243 (10.0%)                   267 
> (10.4%)                           |
  |               South East                 507 (20.8%)                   487 
> (19.0%)                           |
  |               West Midlands              225 ( 9.2%)                   247 
> ( 9.7%)                           |
  |               Yorkshire and the Humber   259 (10.6%)                   257 
> (10.0%)                           |
  |----------------------------------------------------------------------------
> ----------------------------------|
  | imd           0                          119 ( 4.9%)                   124 
> ( 4.8%)                    0.31   |
  |               1                          468 (19.2%)                   477 
> (18.6%)                           |
  |               2                          445 (18.2%)                   512 
> (20.0%)                           |
  |               3                          470 (19.2%)                   491 
> (19.2%)                           |
  |               4                          505 (20.7%)                   473 
> (18.5%)                           |
  |               5                          435 (17.8%)                   481 
> (18.8%)                           |
  +----------------------------------------------------------------------------
> ----------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/drug_weak_op_chars.csv
file ./output/tables/drug_weak_op_chars.csv saved

. * Rounding numbers in table to nearest 5
. destring _columna_1, gen(n1) ignore(",") force
_columna_1: contains nonnumeric characters not specified in ignore()
_columna_1: character , removed; n1 generated as int
(2 missing values generated)

. destring _columna_0, gen(n0) ignore(",") force
_columna_0: contains nonnumeric characters not specified in ignore()
_columna_0: character , removed; n0 generated as int
(2 missing values generated)

. destring _columnb_1, gen(percent1) ignore("-" "%" "(" ")")  force
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent1 generated as double
(2 missing values generated)

. destring _columnb_0, gen(percent0) ignore("-" "%" "(" ")")  force
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)

. gen rounded_n1 = round(n1, 5)
(2 missing values generated)

. gen rounded_n0 = round(n0, 5)
(2 missing values generated)

. keep factor level rounded_n0 percent0 rounded_n1 percent1

. export delimited using ./output/tables/drug_weak_op_chars_rounded.csv
file ./output/tables/drug_weak_op_chars_rounded.csv saved

. restore

. 
. *Strong opioids 
. preserve

. table1_mc, vars(age_cat cat \ male cat \ urban_rural_bin cat \ region cat \ i
> md cat) by(prescribed_strong_opioids) clear

  +-----------------------------------------+
  | factor          N_0     N_1   m_0   m_1 |
  |-----------------------------------------|
  | age_cat       1,936   1,967   553   544 |
  |-----------------------------------------|
  | male          2,489   2,511     0     0 |
  |-----------------------------------------|
  | Rural-Urban   2,489   2,511     0     0 |
  |-----------------------------------------|
  | region        2,489   2,511     0     0 |
  |-----------------------------------------|
  | imd           2,489   2,511     0     0 |
  +-----------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------------------------------------+
  |                                          prescribed_strong_opioids = 0   pr
> escribed_strong_opioids = 1   p-value |
  |----------------------------------------------------------------------------
> --------------------------------------|
  |                                          N=2,489                         N=
> 2,511                                 |
  |----------------------------------------------------------------------------
> --------------------------------------|
  | age_cat       18 - 40 years              704 (36.4%)                     73
> 4 (37.3%)                      0.76   |
  |               41 - 60 years              627 (32.4%)                     60
> 8 (30.9%)                             |
  |               61 - 80 years              481 (24.8%)                     49
> 1 (25.0%)                             |
  |               >80 years                  124 ( 6.4%)                     13
> 4 ( 6.8%)                             |
  |----------------------------------------------------------------------------
> --------------------------------------|
  | male          Female                     1,246 (50.1%)                   1,
> 300 (51.8%)                    0.23   |
  |               Male                       1,243 (49.9%)                   1,
> 211 (48.2%)                           |
  |----------------------------------------------------------------------------
> --------------------------------------|
  | Rural-Urban   Rural                      1,257 (50.5%)                   1,
> 265 (50.4%)                    0.93   |
  |               Urban                      1,232 (49.5%)                   1,
> 246 (49.6%)                           |
  |----------------------------------------------------------------------------
> --------------------------------------|
  | region        East Midlands              252 (10.1%)                     24
> 2 ( 9.6%)                      0.25   |
  |               East of England            232 ( 9.3%)                     24
> 9 ( 9.9%)                             |
  |               London                     524 (21.1%)                     50
> 0 (19.9%)                             |
  |               North East                 253 (10.2%)                     25
> 6 (10.2%)                             |
  |               North West                 268 (10.8%)                     24
> 2 ( 9.6%)                             |
  |               South East                 480 (19.3%)                     51
> 4 (20.5%)                             |
  |               West Midlands              246 ( 9.9%)                     22
> 6 ( 9.0%)                             |
  |               Yorkshire and the Humber   234 ( 9.4%)                     28
> 2 (11.2%)                             |
  |----------------------------------------------------------------------------
> --------------------------------------|
  | imd           0                          131 ( 5.3%)                     11
> 2 ( 4.5%)                      0.60   |
  |               1                          459 (18.4%)                     48
> 6 (19.4%)                             |
  |               2                          465 (18.7%)                     49
> 2 (19.6%)                             |
  |               3                          490 (19.7%)                     47
> 1 (18.8%)                             |
  |               4                          494 (19.8%)                     48
> 4 (19.3%)                             |
  |               5                          450 (18.1%)                     46
> 6 (18.6%)                             |
  +----------------------------------------------------------------------------
> --------------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/drug_strong_op_chars.csv
file ./output/tables/drug_strong_op_chars.csv saved

. * Rounding numbers in table to nearest 5
. destring _columna_1, gen(n1) ignore(",") force
_columna_1: contains nonnumeric characters not specified in ignore()
_columna_1: character , removed; n1 generated as int
(2 missing values generated)

. destring _columna_0, gen(n0) ignore(",") force
_columna_0: contains nonnumeric characters not specified in ignore()
_columna_0: character , removed; n0 generated as int
(2 missing values generated)

. destring _columnb_1, gen(percent1) ignore("-" "%" "(" ")")  force
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent1 generated as double
(2 missing values generated)

. destring _columnb_0, gen(percent0) ignore("-" "%" "(" ")")  force
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)

. gen rounded_n1 = round(n1, 5)
(2 missing values generated)

. gen rounded_n0 = round(n0, 5)
(2 missing values generated)

. keep factor level rounded_n0 percent0 rounded_n1 percent1

. export delimited using ./output/tables/drug_strong_op_chars_rounded.csv
file ./output/tables/drug_strong_op_chars_rounded.csv saved

. restore

. 
. *GCs 
. preserve

. table1_mc, vars(age_cat cat \ male cat \ urban_rural_bin cat \ region cat \ i
> md cat) by(prescribed_gcs) clear

  +-----------------------------------------+
  | factor          N_0     N_1   m_0   m_1 |
  |-----------------------------------------|
  | age_cat       1,960   1,943   546   551 |
  |-----------------------------------------|
  | male          2,506   2,494     0     0 |
  |-----------------------------------------|
  | Rural-Urban   2,506   2,494     0     0 |
  |-----------------------------------------|
  | region        2,506   2,494     0     0 |
  |-----------------------------------------|
  | imd           2,506   2,494     0     0 |
  +-----------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> ----------------+
  |                                          prescribed_gcs = 0   prescribed_gc
> s = 1   p-value |
  |----------------------------------------------------------------------------
> ----------------|
  |                                          N=2,506              N=2,494      
>                 |
  |----------------------------------------------------------------------------
> ----------------|
  | age_cat       18 - 40 years              712 (36.3%)          726 (37.4%)  
>          0.28   |
  |               41 - 60 years              628 (32.0%)          607 (31.2%)  
>                 |
  |               61 - 80 years              477 (24.3%)          495 (25.5%)  
>                 |
  |               >80 years                  143 ( 7.3%)          115 ( 5.9%)  
>                 |
  |----------------------------------------------------------------------------
> ----------------|
  | male          Female                     1,236 (49.3%)        1,310 (52.5%)
>          0.023  |
  |               Male                       1,270 (50.7%)        1,184 (47.5%)
>                 |
  |----------------------------------------------------------------------------
> ----------------|
  | Rural-Urban   Rural                      1,245 (49.7%)        1,277 (51.2%)
>          0.28   |
  |               Urban                      1,261 (50.3%)        1,217 (48.8%)
>                 |
  |----------------------------------------------------------------------------
> ----------------|
  | region        East Midlands              250 (10.0%)          244 ( 9.8%)  
>          0.85   |
  |               East of England            230 ( 9.2%)          251 (10.1%)  
>                 |
  |               London                     501 (20.0%)          523 (21.0%)  
>                 |
  |               North East                 256 (10.2%)          253 (10.1%)  
>                 |
  |               North West                 264 (10.5%)          246 ( 9.9%)  
>                 |
  |               South East                 496 (19.8%)          498 (20.0%)  
>                 |
  |               West Midlands              248 ( 9.9%)          224 ( 9.0%)  
>                 |
  |               Yorkshire and the Humber   261 (10.4%)          255 (10.2%)  
>                 |
  |----------------------------------------------------------------------------
> ----------------|
  | imd           0                          119 ( 4.7%)          124 ( 5.0%)  
>          0.72   |
  |               1                          478 (19.1%)          467 (18.7%)  
>                 |
  |               2                          472 (18.8%)          485 (19.4%)  
>                 |
  |               3                          493 (19.7%)          468 (18.8%)  
>                 |
  |               4                          502 (20.0%)          476 (19.1%)  
>                 |
  |               5                          442 (17.6%)          474 (19.0%)  
>                 |
  +----------------------------------------------------------------------------
> ----------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/drug_gc_chars.csv
file ./output/tables/drug_gc_chars.csv saved

. * Rounding numbers in table to nearest 5
. destring _columna_1, gen(n1) ignore(",") force
_columna_1: contains nonnumeric characters not specified in ignore()
_columna_1: character , removed; n1 generated as int
(2 missing values generated)

. destring _columna_0, gen(n0) ignore(",") force
_columna_0: contains nonnumeric characters not specified in ignore()
_columna_0: character , removed; n0 generated as int
(2 missing values generated)

. destring _columnb_1, gen(percent1) ignore("-" "%" "(" ")")  force
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent1 generated as double
(2 missing values generated)

. destring _columnb_0, gen(percent0) ignore("-" "%" "(" ")")  force
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)

. gen rounded_n1 = round(n1, 5)
(2 missing values generated)

. gen rounded_n0 = round(n0, 5)
(2 missing values generated)

. keep factor level rounded_n0 percent0 rounded_n1 percent1

. export delimited using ./output/tables/drug_gc_chars_rounded.csv
file ./output/tables/drug_gc_chars_rounded.csv saved

. restore

. 
. * Tabulate characteristics by categories of differences in rheumatology outpa
> tient appointments for each year
. drop if region=="missing"
(0 observations deleted)

. tempfile tempfile

. forvalues i=2020/2021 {
  2.     * Same number or more appointments 
.     preserve
  3.     table1_mc, vars(age_cat cat \ male cat \ urban_rural_bin cat \ region 
> cat \ imd cat \ smoking cat \ time_ra contn \ bmi_cat cat \ eth5 cat) by(fewe
> r_appts_`i') clear
  4.     export delimited using ./output/tables/characteristics_fewer_appts_`i'
> .csv    
  5.     destring _columna_1, gen(n1) ignore(",") force
  6.     destring _columna_0, gen(n0) ignore(",") force
  7.     destring _columnb_1, gen(percent1) ignore("-" "%" "(" ")")  force
  8.     destring _columnb_0, gen(percent0) ignore("-" "%" "(" ")")  force
  9.     gen rounded_n1 = round(n1, 5)
 10.     gen rounded_n0 = round(n0, 5)
 11.     keep factor level rounded_n0 percent0 rounded_n1 percent1
 12.     export delimited using ./output/tables/characteristics_fewer_appts_`i'
> _rounded.csv
 13.     restore 
 14.     * No appointments
.     preserve 
 15.     table1_mc, vars(age_cat cat \ male cat \ urban_rural_bin cat \ region 
> cat \ imd cat \ smoking cat \ time_ra contn \ bmi_cat cat \ eth5 cat) by(no_a
> ppts_`i') clear
 16.     export delimited using ./output/tables/characteristics_no_appts_`i'.cs
> v    
 17.     destring _columna_1, gen(n1) ignore(",") force
 18.     destring _columna_0, gen(n0) ignore(",") force
 19.     destring _columnb_1, gen(percent1) ignore("-" "%" "(" ")")  force
 20.     destring _columnb_0, gen(percent0) ignore("-" "%" "(" ")")  force
 21.     gen rounded_n1 = round(n1, 5)
 22.     gen rounded_n0 = round(n0, 5)
 23.     keep factor level rounded_n0 percent0 rounded_n1 percent1
 24.     export delimited using ./output/tables/characteristics_no_appts_`i'_ro
> unded.csv
 25.     restore
 26.     * Logistic regression 
.     foreach var in urban_rural_bin i.imd ib3.region_n i.eth5 {
 27.         logit fewer_appts_`i' `var' ib1.age_cat male, or 
 28.         est sto m1 
 29.         parmest, label eform format(estimate p min95 max95) saving("./outp
> ut/tempdata/`var'_diff_rheum_`i'", replace) idstr("`var'_rheum_`i'")
 30.         }
 31.     logit fewer_appts_`i' ib1.age_cat male urban_rural_bin i.imd ib3.regio
> n_n i.eth5, or 
 32.     est sto m1
 33.     parmest, label eform format(estimate p min95 max95) saving("./output/t
> empdata/multi_diff_rheum_`i'", replace) idstr("multi_rheum_`i'")
 34.     }

  +-------------------------------------------+
  | factor          N_0     N_1     m_0   m_1 |
  |-------------------------------------------|
  | age_cat       1,475   1,159     435   316 |
  |-------------------------------------------|
  | male          1,910   1,475       0     0 |
  |-------------------------------------------|
  | Rural-Urban   1,910   1,475       0     0 |
  |-------------------------------------------|
  | region        1,910   1,475       0     0 |
  |-------------------------------------------|
  | imd           1,910   1,475       0     0 |
  |-------------------------------------------|
  | smoking       1,910   1,475       0     0 |
  |-------------------------------------------|
  | time_ra         863     644   1,047   831 |
  |-------------------------------------------|
  | bmi_cat       1,910   1,475       0     0 |
  |-------------------------------------------|
  | eth5          1,910   1,475       0     0 |
  +-------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------------------+
  |                                          fewer_appts_2020 = 0   fewer_appts
> _2020 = 1   p-value |
  |----------------------------------------------------------------------------
> --------------------|
  |                                          N=1,910                N=1,475    
>                     |
  |----------------------------------------------------------------------------
> --------------------|
  | age_cat       18 - 40 years              561 (38.0%)            438 (37.8%)
>              0.96   |
  |               41 - 60 years              444 (30.1%)            360 (31.1%)
>                     |
  |               61 - 80 years              372 (25.2%)            285 (24.6%)
>                     |
  |               >80 years                  98 ( 6.6%)             76 ( 6.6%) 
>                     |
  |----------------------------------------------------------------------------
> --------------------|
  | male          Female                     989 (51.8%)            739 (50.1%)
>              0.33   |
  |               Male                       921 (48.2%)            736 (49.9%)
>                     |
  |----------------------------------------------------------------------------
> --------------------|
  | Rural-Urban   Rural                      989 (51.8%)            730 (49.5%)
>              0.19   |
  |               Urban                      921 (48.2%)            745 (50.5%)
>                     |
  |----------------------------------------------------------------------------
> --------------------|
  | region        East Midlands              204 (10.7%)            140 ( 9.5%)
>              0.17   |
  |               East of England            198 (10.4%)            123 ( 8.3%)
>                     |
  |               London                     369 (19.3%)            325 (22.0%)
>                     |
  |               North East                 199 (10.4%)            139 ( 9.4%)
>                     |
  |               North West                 201 (10.5%)            158 (10.7%)
>                     |
  |               South East                 371 (19.4%)            288 (19.5%)
>                     |
  |               West Midlands              172 ( 9.0%)            153 (10.4%)
>                     |
  |               Yorkshire and the Humber   196 (10.3%)            149 (10.1%)
>                     |
  |----------------------------------------------------------------------------
> --------------------|
  | imd           0                          95 ( 5.0%)             71 ( 4.8%) 
>              0.79   |
  |               1                          374 (19.6%)            273 (18.5%)
>                     |
  |               2                          372 (19.5%)            267 (18.1%)
>                     |
  |               3                          353 (18.5%)            287 (19.5%)
>                     |
  |               4                          366 (19.2%)            298 (20.2%)
>                     |
  |               5                          350 (18.3%)            279 (18.9%)
>                     |
  |----------------------------------------------------------------------------
> --------------------|
  | smoking       Never smoked               186 ( 9.7%)            161 (10.9%)
>              0.16   |
  |               Current smoker             391 (20.5%)            279 (18.9%)
>                     |
  |               Ex-smoker                  276 (14.5%)            245 (16.6%)
>                     |
  |               Unknown                    1,057 (55.3%)          790 (53.6%)
>                     |
  |----------------------------------------------------------------------------
> --------------------|
  | time_ra                                  53.54996 (30.98732)    56.35513 (3
> 2.56212)     0.089  |
  |----------------------------------------------------------------------------
> --------------------|
  | bmi_cat       Missing                    383 (20.1%)            262 (17.8%)
>              0.14   |
  |               Underweight                190 ( 9.9%)            141 ( 9.6%)
>                     |
  |               Healthy range              343 (18.0%)            288 (19.5%)
>                     |
  |               Overweight                 398 (20.8%)            293 (19.9%)
>                     |
  |               Obese                      493 (25.8%)            385 (26.1%)
>                     |
  |               Morbidly obese             103 ( 5.4%)            106 ( 7.2%)
>                     |
  |----------------------------------------------------------------------------
> --------------------|
  | eth5          White                      356 (18.6%)            298 (20.2%)
>              0.66   |
  |               South Asian                396 (20.7%)            301 (20.4%)
>                     |
  |               Black                      386 (20.2%)            273 (18.5%)
>                     |
  |               Mixed                      395 (20.7%)            305 (20.7%)
>                     |
  |               Other                      377 (19.7%)            298 (20.2%)
>                     |
  +----------------------------------------------------------------------------
> --------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file ./output/tables/characteristics_fewer_appts_2020.csv saved
_columna_1: contains nonnumeric characters not specified in ignore(); n1 genera
> ted as double
(2 missing values generated)
_columna_0: contains nonnumeric characters not specified in ignore()
_columna_0: character , removed; n0 generated as double
(2 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent1 generated as double
(2 missing values generated)
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
file ./output/tables/characteristics_fewer_appts_2020_rounded.csv saved

  +-----------------------------------------+
  | factor          N_0   N_1     m_0   m_1 |
  |-----------------------------------------|
  | age_cat       3,880    23   1,091     6 |
  |-----------------------------------------|
  | male          4,971    29       0     0 |
  |-----------------------------------------|
  | Rural-Urban   4,971    29       0     0 |
  |-----------------------------------------|
  | region        4,971    29       0     0 |
  |-----------------------------------------|
  | imd           4,971    29       0     0 |
  |-----------------------------------------|
  | smoking       4,971    29       0     0 |
  |-----------------------------------------|
  | time_ra       2,189    13   2,782    16 |
  |-----------------------------------------|
  | bmi_cat       4,971    29       0     0 |
  |-----------------------------------------|
  | eth5          4,971    29       0     0 |
  +-----------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> -----------------+
  |                                          no_appts_2020 = 0    no_appts_2020
>  = 1     p-value |
  |----------------------------------------------------------------------------
> -----------------|
  |                                          N=4,971              N=29         
>                  |
  |----------------------------------------------------------------------------
> -----------------|
  | age_cat       18 - 40 years              1,431 (36.9%)        7 (30.4%)    
>           0.020  |
  |               41 - 60 years              1,232 (31.8%)        3 (13.0%)    
>                  |
  |               61 - 80 years              960 (24.7%)          12 (52.2%)   
>                  |
  |               >80 years                  257 ( 6.6%)          1 ( 4.3%)    
>                  |
  |----------------------------------------------------------------------------
> -----------------|
  | male          Female                     2,530 (50.9%)        16 (55.2%)   
>           0.65   |
  |               Male                       2,441 (49.1%)        13 (44.8%)   
>                  |
  |----------------------------------------------------------------------------
> -----------------|
  | Rural-Urban   Rural                      2,505 (50.4%)        17 (58.6%)   
>           0.38   |
  |               Urban                      2,466 (49.6%)        12 (41.4%)   
>                  |
  |----------------------------------------------------------------------------
> -----------------|
  | region        East Midlands              490 ( 9.9%)          4 (13.8%)    
>           0.85   |
  |               East of England            477 ( 9.6%)          4 (13.8%)    
>                  |
  |               London                     1,020 (20.5%)        4 (13.8%)    
>                  |
  |               North East                 507 (10.2%)          2 ( 6.9%)    
>                  |
  |               North West                 507 (10.2%)          3 (10.3%)    
>                  |
  |               South East                 990 (19.9%)          4 (13.8%)    
>                  |
  |               West Midlands              468 ( 9.4%)          4 (13.8%)    
>                  |
  |               Yorkshire and the Humber   512 (10.3%)          4 (13.8%)    
>                  |
  |----------------------------------------------------------------------------
> -----------------|
  | imd           0                          242 ( 4.9%)          1 ( 3.4%)    
>           0.67   |
  |               1                          937 (18.8%)          8 (27.6%)    
>                  |
  |               2                          954 (19.2%)          3 (10.3%)    
>                  |
  |               3                          954 (19.2%)          7 (24.1%)    
>                  |
  |               4                          972 (19.6%)          6 (20.7%)    
>                  |
  |               5                          912 (18.3%)          4 (13.8%)    
>                  |
  |----------------------------------------------------------------------------
> -----------------|
  | smoking       Never smoked               504 (10.1%)          4 (13.8%)    
>           0.79   |
  |               Current smoker             984 (19.8%)          4 (13.8%)    
>                  |
  |               Ex-smoker                  761 (15.3%)          4 (13.8%)    
>                  |
  |               Unknown                    2,722 (54.8%)        17 (58.6%)   
>                  |
  |----------------------------------------------------------------------------
> -----------------|
  | time_ra                                  54.85672 (31.9298)   59.59943 (36.
> 37941)    0.59   |
  |----------------------------------------------------------------------------
> -----------------|
  | bmi_cat       Missing                    957 (19.3%)          5 (17.2%)    
>           0.46   |
  |               Underweight                478 ( 9.6%)          4 (13.8%)    
>                  |
  |               Healthy range              946 (19.0%)          2 ( 6.9%)    
>                  |
  |               Overweight                 1,008 (20.3%)        6 (20.7%)    
>                  |
  |               Obese                      1,292 (26.0%)        11 (37.9%)   
>                  |
  |               Morbidly obese             290 ( 5.8%)          1 ( 3.4%)    
>                  |
  |----------------------------------------------------------------------------
> -----------------|
  | eth5          White                      985 (19.8%)          8 (27.6%)    
>           0.40   |
  |               South Asian                1,000 (20.1%)        5 (17.2%)    
>                  |
  |               Black                      1,005 (20.2%)        7 (24.1%)    
>                  |
  |               Mixed                      981 (19.7%)          7 (24.1%)    
>                  |
  |               Other                      1,000 (20.1%)        2 ( 6.9%)    
>                  |
  +----------------------------------------------------------------------------
> -----------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file ./output/tables/characteristics_no_appts_2020.csv saved
_columna_1: contains nonnumeric characters not specified in ignore(); n1 genera
> ted as double
(2 missing values generated)
_columna_0: contains nonnumeric characters not specified in ignore()
_columna_0: character , removed; n0 generated as double
(2 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent1 generated as double
(2 missing values generated)
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
file ./output/tables/characteristics_no_appts_2020_rounded.csv saved

Iteration 0:   log likelihood = -1806.7487  
Iteration 1:   log likelihood = -1805.7311  
Iteration 2:   log likelihood = -1805.7311  

Logistic regression                             Number of obs     =      2,634
                                                LR chi2(5)        =       2.04
                                                Prob > chi2       =     0.8442
Log likelihood = -1805.7311                     Pseudo R2         =     0.0006

------------------------------------------------------------------------------
fewer~s_2020 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
urban_rura~n |   1.100014   .0864334     1.21   0.225     .9430072    1.283161
             |
     age_cat |
18 - 40 y..  |   .9614029   .0917287    -0.41   0.680     .7974276    1.159097
61 - 80 y..  |   .9429082    .099954    -0.55   0.579     .7660144    1.160652
  >80 years  |   .9603644    .161898    -0.24   0.810     .6901456    1.336384
             |
        male |   1.041077   .0817935     0.51   0.608     .8924982    1.214391
       _cons |   .7590812   .0678585    -3.08   0.002     .6370809    .9044444
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/urban_rural_bin_diff_rheum_2020.dta not found)
file ./output/tempdata/urban_rural_bin_diff_rheum_2020.dta saved

Iteration 0:   log likelihood = -1806.7487  
Iteration 1:   log likelihood = -1805.2136  
Iteration 2:   log likelihood = -1805.2135  

Logistic regression                             Number of obs     =      2,634
                                                LR chi2(9)        =       3.07
                                                Prob > chi2       =     0.9614
Log likelihood = -1805.2135                     Pseudo R2         =     0.0008

------------------------------------------------------------------------------
fewer~s_2020 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         imd |
          1  |   1.078541   .2159992     0.38   0.706     .7283946    1.597006
          2  |   1.092285   .2184026     0.44   0.659     .7381388    1.616344
          3  |   1.208055   .2422743     0.94   0.346     .8154153    1.789758
          4  |   1.239636    .246386     1.08   0.280     .8396771    1.830106
          5  |    1.11904   .2244757     0.56   0.575     .7552617    1.658036
             |
     age_cat |
18 - 40 y..  |   .9646091   .0920851    -0.38   0.706     .8000047    1.163081
61 - 80 y..  |   .9456002   .1002739    -0.53   0.598     .7681462    1.164049
  >80 years  |   .9628623   .1624189    -0.22   0.822     .6918001    1.340132
             |
        male |   1.035679   .0814594     0.45   0.656     .8877189      1.2083
       _cons |   .6987726   .1333292    -1.88   0.060     .4807535    1.015662
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/i.imd_diff_rheum_2020 not found)
file ./output/tempdata/i.imd_diff_rheum_2020 saved

Iteration 0:   log likelihood = -1806.7487  
Iteration 1:   log likelihood = -1801.8778  
Iteration 2:   log likelihood = -1801.8771  
Iteration 3:   log likelihood = -1801.8771  

Logistic regression                             Number of obs     =      2,634
                                                LR chi2(11)       =       9.74
                                                Prob > chi2       =     0.5536
Log likelihood = -1801.8771                     Pseudo R2         =     0.0027

------------------------------------------------------------------------------
fewer~s_2020 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    region_n |
          1  |   .8175795   .1248396    -1.32   0.187      .606117    1.102817
          2  |    .698325    .109284    -2.29   0.022     .5138652    .9489993
          4  |   .8438892   .1288476    -1.11   0.266     .6256354    1.138281
          5  |   .8618791   .1261104    -1.02   0.310     .6469911    1.148139
          6  |   .9061143   .1126261    -0.79   0.428     .7102027    1.156069
          8  |   1.076051   .1629327     0.48   0.628     .7997355    1.447837
          9  |   .7977377   .1193868    -1.51   0.131     .5949385    1.069666
             |
     age_cat |
18 - 40 y..  |   .9573798   .0915098    -0.46   0.649     .7938224    1.154636
61 - 80 y..  |   .9404484   .0998705    -0.58   0.563     .7637337    1.158052
  >80 years  |   .9473533   .1602016    -0.32   0.749     .6800957    1.319635
             |
        male |   1.045763   .0823157     0.57   0.570     .8962564     1.22021
       _cons |   .8988248   .0998352    -0.96   0.337     .7229854    1.117431
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/ib3.region_n_diff_rheum_2020 not found)
file ./output/tempdata/ib3.region_n_diff_rheum_2020 saved

Iteration 0:   log likelihood = -1806.7487  
Iteration 1:   log likelihood = -1804.9461  
Iteration 2:   log likelihood =  -1804.946  

Logistic regression                             Number of obs     =      2,634
                                                LR chi2(8)        =       3.61
                                                Prob > chi2       =     0.8908
Log likelihood =  -1804.946                     Pseudo R2         =     0.0010

------------------------------------------------------------------------------
fewer~s_2020 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |    1.04527   .1291835     0.36   0.720     .8204075    1.331764
      Black  |   .8545985   .1081637    -1.24   0.214     .6668503    1.095206
      Mixed  |   1.005899   .1243888     0.05   0.962     .7893966    1.281779
      Other  |   .9828869   .1239727    -0.14   0.891     .7676098    1.258539
             |
     age_cat |
18 - 40 y..  |   .9591837   .0915769    -0.44   0.662     .7954893    1.156563
61 - 80 y..  |    .943256   .1000952    -0.55   0.582     .7661307    1.161332
  >80 years  |   .9508581   .1603678    -0.30   0.765     .6832121    1.323354
             |
        male |   1.039154   .0816968     0.49   0.625     .8907579    1.212272
       _cons |   .8162198   .0928869    -1.78   0.074     .6530393    1.020176
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/i.eth5_diff_rheum_2020 not found)
file ./output/tempdata/i.eth5_diff_rheum_2020 saved

Iteration 0:   log likelihood = -1806.7487  
Iteration 1:   log likelihood = -1798.2161  
Iteration 2:   log likelihood = -1798.2143  
Iteration 3:   log likelihood = -1798.2143  

Logistic regression                             Number of obs     =      2,634
                                                LR chi2(21)       =      17.07
                                                Prob > chi2       =     0.7069
Log likelihood = -1798.2143                     Pseudo R2         =     0.0047

------------------------------------------------------------------------------
fewer~s_2020 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     age_cat |
18 - 40 y..  |   .9547885    .091472    -0.48   0.629     .7913328    1.152007
61 - 80 y..  |   .9389642   .0999691    -0.59   0.554     .7621208    1.156843
  >80 years  |   .9509785   .1611177    -0.30   0.767     .6822721    1.325513
             |
        male |   1.042668   .0823155     0.53   0.597     .8931949    1.217155
urban_rura~n |   1.098189    .086786     1.19   0.236     .9406101    1.282167
             |
         imd |
          1  |   1.062369   .2136956     0.30   0.764     .7162357    1.575776
          2  |   1.069204   .2148453     0.33   0.739     .7211411     1.58526
          3  |   1.192906    .240101     0.88   0.381     .8040472    1.769828
          4  |   1.219294   .2432384     0.99   0.320     .8247101    1.802668
          5  |   1.099914   .2215789     0.47   0.636     .7411111    1.632429
             |
    region_n |
          1  |   .8209324   .1258966    -1.29   0.198     .6078114    1.108782
          2  |   .6859189    .107826    -2.40   0.016     .5040393    .9334286
          4  |   .8388899   .1285425    -1.15   0.252     .6212637     1.13275
          5  |   .8517229   .1253319    -1.09   0.275     .6383269    1.136458
          6  |    .900265   .1123078    -0.84   0.400     .7049905    1.149628
          8  |   1.066416   .1618916     0.42   0.672     .7919661    1.435974
          9  |   .7944615   .1192306    -1.53   0.125     .5920071    1.066151
             |
        eth5 |
South Asian  |   1.050119   .1303517     0.39   0.694     .8233382    1.339363
      Black  |   .8463898   .1077377    -1.31   0.190     .6595082    1.086227
      Mixed  |   1.008107   .1251058     0.07   0.948     .7904472    1.285703
      Other  |   .9801115   .1241165    -0.16   0.874     .7646867    1.256225
             |
       _cons |   .7906273   .1792708    -1.04   0.300     .5069512    1.233041
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/multi_diff_rheum_2020.dta not found)
file ./output/tempdata/multi_diff_rheum_2020.dta saved

  +---------------------------------------+
  | factor          N_0   N_1   m_0   m_1 |
  |---------------------------------------|
  | age_cat       1,017   757   293   198 |
  |---------------------------------------|
  | male          1,310   955     0     0 |
  |---------------------------------------|
  | Rural-Urban   1,310   955     0     0 |
  |---------------------------------------|
  | region        1,310   955     0     0 |
  |---------------------------------------|
  | imd           1,310   955     0     0 |
  |---------------------------------------|
  | smoking       1,310   955     0     0 |
  |---------------------------------------|
  | time_ra         579   429   731   526 |
  |---------------------------------------|
  | bmi_cat       1,310   955     0     0 |
  |---------------------------------------|
  | eth5          1,310   955     0     0 |
  +---------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------------------+
  |                                          fewer_appts_2021 = 0   fewer_appts
> _2021 = 1   p-value |
  |----------------------------------------------------------------------------
> --------------------|
  |                                          N=1,310                N=955      
>                     |
  |----------------------------------------------------------------------------
> --------------------|
  | age_cat       18 - 40 years              407 (40.0%)            280 (37.0%)
>              0.58   |
  |               41 - 60 years              302 (29.7%)            233 (30.8%)
>                     |
  |               61 - 80 years              245 (24.1%)            198 (26.2%)
>                     |
  |               >80 years                  63 ( 6.2%)             46 ( 6.1%) 
>                     |
  |----------------------------------------------------------------------------
> --------------------|
  | male          Female                     660 (50.4%)            487 (51.0%)
>              0.77   |
  |               Male                       650 (49.6%)            468 (49.0%)
>                     |
  |----------------------------------------------------------------------------
> --------------------|
  | Rural-Urban   Rural                      690 (52.7%)            488 (51.1%)
>              0.46   |
  |               Urban                      620 (47.3%)            467 (48.9%)
>                     |
  |----------------------------------------------------------------------------
> --------------------|
  | region        East Midlands              135 (10.3%)            104 (10.9%)
>              0.74   |
  |               East of England            121 ( 9.2%)            90 ( 9.4%) 
>                     |
  |               London                     257 (19.6%)            200 (20.9%)
>                     |
  |               North East                 132 (10.1%)            100 (10.5%)
>                     |
  |               North West                 154 (11.8%)            90 ( 9.4%) 
>                     |
  |               South East                 258 (19.7%)            192 (20.1%)
>                     |
  |               West Midlands              123 ( 9.4%)            94 ( 9.8%) 
>                     |
  |               Yorkshire and the Humber   130 ( 9.9%)            85 ( 8.9%) 
>                     |
  |----------------------------------------------------------------------------
> --------------------|
  | imd           0                          55 ( 4.2%)             55 ( 5.8%) 
>              0.39   |
  |               1                          244 (18.6%)            187 (19.6%)
>                     |
  |               2                          261 (19.9%)            173 (18.1%)
>                     |
  |               3                          242 (18.5%)            190 (19.9%)
>                     |
  |               4                          261 (19.9%)            182 (19.1%)
>                     |
  |               5                          247 (18.9%)            168 (17.6%)
>                     |
  |----------------------------------------------------------------------------
> --------------------|
  | smoking       Never smoked               144 (11.0%)            104 (10.9%)
>              0.89   |
  |               Current smoker             257 (19.6%)            179 (18.7%)
>                     |
  |               Ex-smoker                  201 (15.3%)            157 (16.4%)
>                     |
  |               Unknown                    708 (54.0%)            515 (53.9%)
>                     |
  |----------------------------------------------------------------------------
> --------------------|
  | time_ra                                  54.71114 (31.09664)    55.17491 (3
> 1.8617)      0.82   |
  |----------------------------------------------------------------------------
> --------------------|
  | bmi_cat       Missing                    231 (17.6%)            171 (17.9%)
>              0.37   |
  |               Underweight                135 (10.3%)            92 ( 9.6%) 
>                     |
  |               Healthy range              225 (17.2%)            197 (20.6%)
>                     |
  |               Overweight                 285 (21.8%)            189 (19.8%)
>                     |
  |               Obese                      352 (26.9%)            243 (25.4%)
>                     |
  |               Morbidly obese             82 ( 6.3%)             63 ( 6.6%) 
>                     |
  |----------------------------------------------------------------------------
> --------------------|
  | eth5          White                      266 (20.3%)            167 (17.5%)
>              0.13   |
  |               South Asian                287 (21.9%)            192 (20.1%)
>                     |
  |               Black                      240 (18.3%)            181 (19.0%)
>                     |
  |               Mixed                      274 (20.9%)            202 (21.2%)
>                     |
  |               Other                      243 (18.5%)            213 (22.3%)
>                     |
  +----------------------------------------------------------------------------
> --------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file ./output/tables/characteristics_fewer_appts_2021.csv saved
_columna_1: contains nonnumeric characters not specified in ignore(); n1 genera
> ted as double
(2 missing values generated)
_columna_0: contains nonnumeric characters not specified in ignore(); n0 genera
> ted as double
(2 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent1 generated as double
(2 missing values generated)
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
file ./output/tables/characteristics_fewer_appts_2021_rounded.csv saved

  +-----------------------------------------+
  | factor          N_0   N_1     m_0   m_1 |
  |-----------------------------------------|
  | age_cat       3,882    21   1,089     8 |
  |-----------------------------------------|
  | male          4,971    29       0     0 |
  |-----------------------------------------|
  | Rural-Urban   4,971    29       0     0 |
  |-----------------------------------------|
  | region        4,971    29       0     0 |
  |-----------------------------------------|
  | imd           4,971    29       0     0 |
  |-----------------------------------------|
  | smoking       4,971    29       0     0 |
  |-----------------------------------------|
  | time_ra       2,185    17   2,786    12 |
  |-----------------------------------------|
  | bmi_cat       4,971    29       0     0 |
  |-----------------------------------------|
  | eth5          4,971    29       0     0 |
  +-----------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> ------------------+
  |                                          no_appts_2021 = 0     no_appts_202
> 1 = 1     p-value |
  |----------------------------------------------------------------------------
> ------------------|
  |                                          N=4,971               N=29        
>                   |
  |----------------------------------------------------------------------------
> ------------------|
  | age_cat       18 - 40 years              1,428 (36.8%)         10 (47.6%)  
>            0.57   |
  |               41 - 60 years              1,231 (31.7%)         4 (19.0%)   
>                   |
  |               61 - 80 years              967 (24.9%)           5 (23.8%)   
>                   |
  |               >80 years                  256 ( 6.6%)           2 ( 9.5%)   
>                   |
  |----------------------------------------------------------------------------
> ------------------|
  | male          Female                     2,534 (51.0%)         12 (41.4%)  
>            0.30   |
  |               Male                       2,437 (49.0%)         17 (58.6%)  
>                   |
  |----------------------------------------------------------------------------
> ------------------|
  | Rural-Urban   Rural                      2,506 (50.4%)         16 (55.2%)  
>            0.61   |
  |               Urban                      2,465 (49.6%)         13 (44.8%)  
>                   |
  |----------------------------------------------------------------------------
> ------------------|
  | region        East Midlands              492 ( 9.9%)           2 ( 6.9%)   
>            0.83   |
  |               East of England            479 ( 9.6%)           2 ( 6.9%)   
>                   |
  |               London                     1,016 (20.4%)         8 (27.6%)   
>                   |
  |               North East                 506 (10.2%)           3 (10.3%)   
>                   |
  |               North West                 507 (10.2%)           3 (10.3%)   
>                   |
  |               South East                 986 (19.8%)           8 (27.6%)   
>                   |
  |               West Midlands              471 ( 9.5%)           1 ( 3.4%)   
>                   |
  |               Yorkshire and the Humber   514 (10.3%)           2 ( 6.9%)   
>                   |
  |----------------------------------------------------------------------------
> ------------------|
  | imd           0                          242 ( 4.9%)           1 ( 3.4%)   
>            0.86   |
  |               1                          937 (18.8%)           8 (27.6%)   
>                   |
  |               2                          951 (19.1%)           6 (20.7%)   
>                   |
  |               3                          956 (19.2%)           5 (17.2%)   
>                   |
  |               4                          974 (19.6%)           4 (13.8%)   
>                   |
  |               5                          911 (18.3%)           5 (17.2%)   
>                   |
  |----------------------------------------------------------------------------
> ------------------|
  | smoking       Never smoked               506 (10.2%)           2 ( 6.9%)   
>            0.87   |
  |               Current smoker             983 (19.8%)           5 (17.2%)   
>                   |
  |               Ex-smoker                  761 (15.3%)           4 (13.8%)   
>                   |
  |               Unknown                    2,721 (54.7%)         18 (62.1%)  
>                   |
  |----------------------------------------------------------------------------
> ------------------|
  | time_ra                                  54.87167 (31.97401)   56.56142 (29
> .61303)    0.83   |
  |----------------------------------------------------------------------------
> ------------------|
  | bmi_cat       Missing                    956 (19.2%)           6 (20.7%)   
>            0.12   |
  |               Underweight                475 ( 9.6%)           7 (24.1%)   
>                   |
  |               Healthy range              943 (19.0%)           5 (17.2%)   
>                   |
  |               Overweight                 1,010 (20.3%)         4 (13.8%)   
>                   |
  |               Obese                      1,296 (26.1%)         7 (24.1%)   
>                   |
  |               Morbidly obese             291 ( 5.9%)           0 ( 0.0%)   
>                   |
  |----------------------------------------------------------------------------
> ------------------|
  | eth5          White                      986 (19.8%)           7 (24.1%)   
>            0.50   |
  |               South Asian                998 (20.1%)           7 (24.1%)   
>                   |
  |               Black                      1,009 (20.3%)         3 (10.3%)   
>                   |
  |               Mixed                      980 (19.7%)           8 (27.6%)   
>                   |
  |               Other                      998 (20.1%)           4 (13.8%)   
>                   |
  +----------------------------------------------------------------------------
> ------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file ./output/tables/characteristics_no_appts_2021.csv saved
_columna_1: contains nonnumeric characters not specified in ignore(); n1 genera
> ted as double
(2 missing values generated)
_columna_0: contains nonnumeric characters not specified in ignore()
_columna_0: character , removed; n0 generated as double
(2 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent1 generated as double
(2 missing values generated)
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
file ./output/tables/characteristics_no_appts_2021_rounded.csv saved

Iteration 0:   log likelihood = -1210.5213  
Iteration 1:   log likelihood = -1209.1292  
Iteration 2:   log likelihood = -1209.1292  

Logistic regression                             Number of obs     =      1,774
                                                LR chi2(5)        =       2.78
                                                Prob > chi2       =     0.7332
Log likelihood = -1209.1292                     Pseudo R2         =     0.0012

------------------------------------------------------------------------------
fewer~s_2021 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
urban_rura~n |   .9783772   .0941357    -0.23   0.820     .8102275    1.181424
             |
     age_cat |
18 - 40 y..  |   .8923218   .1042133    -0.98   0.329     .7097585    1.121844
61 - 80 y..  |   1.050152   .1359206     0.38   0.705     .8148579     1.35339
  >80 years  |   .9468096   .2014714    -0.26   0.797     .6239297    1.436778
             |
        male |   .9183572   .0882765    -0.89   0.376     .7606597    1.108748
       _cons |   .8123878   .0888927    -1.90   0.058     .6555769    1.006707
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/urban_rural_bin_diff_rheum_2021.dta not found)
file ./output/tempdata/urban_rural_bin_diff_rheum_2021.dta saved

Iteration 0:   log likelihood = -1210.5213  
Iteration 1:   log likelihood = -1207.7288  
Iteration 2:   log likelihood = -1207.7285  
Iteration 3:   log likelihood = -1207.7285  

Logistic regression                             Number of obs     =      1,774
                                                LR chi2(9)        =       5.59
                                                Prob > chi2       =     0.7806
Log likelihood = -1207.7285                     Pseudo R2         =     0.0023

------------------------------------------------------------------------------
fewer~s_2021 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         imd |
          1  |   .7543661   .1833575    -1.16   0.246     .4684764    1.214721
          2  |   .6892036   .1664768    -1.54   0.123     .4292795    1.106509
          3  |   .7857765   .1909573    -0.99   0.321     .4880253     1.26519
          4  |   .7485098   .1803356    -1.20   0.229     .4667892    1.200257
          5  |    .704446   .1720534    -1.43   0.151     .4364664    1.136958
             |
     age_cat |
18 - 40 y..  |   .8959036    .104741    -0.94   0.347      .712437    1.126617
61 - 80 y..  |   1.051091   .1362653     0.38   0.701     .8152464    1.355163
  >80 years  |   .9471048   .2018017    -0.26   0.799     .6237789    1.438022
             |
        male |   .9219772   .0887901    -0.84   0.399     .7633893     1.11351
       _cons |   1.072729   .2476131     0.30   0.761     .6823565    1.686433
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/i.imd_diff_rheum_2021 not found)
file ./output/tempdata/i.imd_diff_rheum_2021 saved

Iteration 0:   log likelihood = -1210.5213  
Iteration 1:   log likelihood = -1206.5337  
Iteration 2:   log likelihood = -1206.5329  
Iteration 3:   log likelihood = -1206.5329  

Logistic regression                             Number of obs     =      1,774
                                                LR chi2(11)       =       7.98
                                                Prob > chi2       =     0.7154
Log likelihood = -1206.5329                     Pseudo R2         =     0.0033

------------------------------------------------------------------------------
fewer~s_2021 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    region_n |
          1  |   .8366901   .1569382    -0.95   0.342     .5793014    1.208439
          2  |   .9413514   .1789468    -0.32   0.751     .6485479    1.366349
          4  |   .9931569    .182226    -0.04   0.970     .6931672    1.422976
          5  |   .7542623   .1380532    -1.54   0.123     .5268976    1.079738
          6  |   .9714916   .1474804    -0.19   0.849     .7214723    1.308153
          8  |   1.105802   .2070589     0.54   0.591     .7661116    1.596111
          9  |   .8213568   .1540228    -1.05   0.294     .5687383    1.186182
             |
     age_cat |
18 - 40 y..  |   .8889059   .1040938    -1.01   0.315      .706606    1.118238
61 - 80 y..  |   1.046669   .1359386     0.35   0.725     .8114419    1.350085
  >80 years  |   .9390433   .2004734    -0.29   0.768     .6179669    1.426941
             |
        male |   .9168537    .088319    -0.90   0.368     .7591109    1.107375
       _cons |   .8651066   .1197173    -1.05   0.295     .6595937    1.134652
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/ib3.region_n_diff_rheum_2021 not found)
file ./output/tempdata/ib3.region_n_diff_rheum_2021 saved

Iteration 0:   log likelihood = -1210.5213  
Iteration 1:   log likelihood = -1207.5644  
Iteration 2:   log likelihood = -1207.5641  
Iteration 3:   log likelihood = -1207.5641  

Logistic regression                             Number of obs     =      1,774
                                                LR chi2(8)        =       5.91
                                                Prob > chi2       =     0.6568
Log likelihood = -1207.5641                     Pseudo R2         =     0.0024

------------------------------------------------------------------------------
fewer~s_2021 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.122681   .1695026     0.77   0.443     .8351062    1.509284
      Black  |   1.121007   .1755976     0.73   0.466     .8246577    1.523852
      Mixed  |   1.156128    .175525     0.96   0.339     .8585692    1.556814
      Other  |   1.316536   .2054046     1.76   0.078     .9696819     1.78746
             |
     age_cat |
18 - 40 y..  |   .8927634   .1043816    -0.97   0.332     .7099277    1.122687
61 - 80 y..  |   1.043049   .1352096     0.33   0.745     .8090295    1.344762
  >80 years  |    .951937    .202854    -0.23   0.817     .6269322    1.445426
             |
        male |   .9228029   .0888459    -0.83   0.404     .7641114    1.114452
       _cons |   .7054021    .099035    -2.49   0.013      .535713    .9288409
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/i.eth5_diff_rheum_2021 not found)
file ./output/tempdata/i.eth5_diff_rheum_2021 saved

Iteration 0:   log likelihood = -1210.5213  
Iteration 1:   log likelihood = -1203.2837  
Iteration 2:   log likelihood = -1203.2816  
Iteration 3:   log likelihood = -1203.2816  

Logistic regression                             Number of obs     =      1,774
                                                LR chi2(21)       =      14.48
                                                Prob > chi2       =     0.8481
Log likelihood = -1203.2816                     Pseudo R2         =     0.0060

------------------------------------------------------------------------------
fewer~s_2021 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     age_cat |
18 - 40 y..  |   .8927496   .1047851    -0.97   0.334     .7092857    1.123668
61 - 80 y..  |   1.039536   .1354799     0.30   0.766     .8052022    1.342068
  >80 years  |   .9393731   .2014556    -0.29   0.771      .617009     1.43016
             |
        male |   .9243995   .0893884    -0.81   0.416     .7648028      1.1173
urban_rura~n |   .9720496   .0942936    -0.29   0.770      .803744    1.175599
             |
         imd |
          1  |   .7546302   .1844458    -1.15   0.249     .4673954    1.218383
          2  |   .6741093   .1639835    -1.62   0.105      .418473    1.085909
          3  |   .7837575   .1913801    -1.00   0.318     .4856607    1.264825
          4  |   .7491544   .1815682    -1.19   0.233     .4658762    1.204681
          5  |   .7077864   .1739507    -1.41   0.160     .4372248    1.145776
             |
    region_n |
          1  |   .8323998    .157045    -0.97   0.331     .5750952    1.204826
          2  |   .9282805   .1775695    -0.39   0.697     .6380489    1.350531
          4  |   .9841394   .1816665    -0.09   0.931     .6853772    1.413135
          5  |   .7417511   .1369548    -1.62   0.106     .5165291    1.065177
          6  |   .9728171   .1484859    -0.18   0.857      .721287    1.312062
          8  |   1.115635   .2095344     0.58   0.560     .7720631    1.612099
          9  |   .8221145   .1546431    -1.04   0.298     .5686143     1.18863
             |
        eth5 |
South Asian  |   1.122633   .1701849     0.76   0.445     .8340659    1.511037
      Black  |    1.11354   .1755548     0.68   0.495     .8175419    1.516708
      Mixed  |   1.153659   .1758109     0.94   0.348     .8557743    1.555233
      Other  |   1.325281   .2076279     1.80   0.072     .9748838     1.80162
             |
       _cons |   1.035548   .2884094     0.13   0.900     .5999331    1.787465
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/multi_diff_rheum_2021.dta not found)
file ./output/tempdata/multi_diff_rheum_2021.dta saved

. * Put together 2020 and 2021 logistic regression results
. preserve 

. use "./output/tempdata/urban_rural_bin_diff_rheum_2020", clear 

. append using "./output/tempdata/i.imd_diff_rheum_2020"

. append using "./output/tempdata/ib3.region_n_diff_rheum_2020"

. append using "./output/tempdata/i.eth5_diff_rheum_2020"

. append using "./output/tempdata/multi_diff_rheum_2020"

. append using "./output/tempdata/urban_rural_bin_diff_rheum_2021"

. append using "./output/tempdata/i.imd_diff_rheum_2021"

. append using "./output/tempdata/ib3.region_n_diff_rheum_2021"

. append using "./output/tempdata/i.eth5_diff_rheum_2021"

. append using "./output/tempdata/multi_diff_rheum_2021"

. drop stderr z 

. export delimited using ./output/tables/logistic_diff_results.csv 
file ./output/tables/logistic_diff_results.csv saved

. restore

. 
. 
. * Tabulate characteristics by categories of differences in all outpatient app
> ointments for each year
. * When stratified there are small numbers with missing region therefore tabul
> ate only those without region missing
. drop if region=="missing"
(0 observations deleted)

. tempfile tempfile

. forvalues i=2020/2021 {
  2.     preserve
  3.     table1_mc, vars(age_cat cat \ male cat \ urban_rural_bin cat \ region 
> cat \ imd cat \ smoking cat \ time_ra contn \ bmi_cat cat \ eth5 cat) by(fewe
> r_appts_all_`i') clear
  4.     export delimited using ./output/tables/characteristics_fewer_appts_all
> _`i'.csv    
  5.     destring _columna_1, gen(n1) ignore(",") force
  6.     destring _columna_0, gen(n0) ignore(",") force
  7.     destring _columnb_1, gen(percent1) ignore("-" "%" "(" ")")  force
  8.     destring _columnb_0, gen(percent0) ignore("-" "%" "(" ")")  force
  9.     gen rounded_n1 = round(n1, 5)
 10.     gen rounded_n0 = round(n0, 5)
 11.     keep factor level rounded_n0 percent0 rounded_n1 percent1
 12.     export delimited using ./output/tables/characteristics_fewer_appts_all
> _`i'_rounded.csv
 13.     restore 
 14.     * No appointments 
.     preserve
 15.     table1_mc, vars(age_cat cat \ male cat \ urban_rural_bin cat \ region 
> cat \ imd cat \ smoking cat \ time_ra contn \ bmi_cat cat \ eth5 cat) by(no_a
> ppts_all_`i') clear
 16.     export delimited using ./output/tables/characteristics_no_appts_all_`i
> '.csv    
 17.     destring _columna_1, gen(n1) ignore(",") force
 18.     destring _columna_0, gen(n0) ignore(",") force
 19.     destring _columnb_1, gen(percent1) ignore("-" "%" "(" ")")  force
 20.     destring _columnb_0, gen(percent0) ignore("-" "%" "(" ")")  force
 21.     gen rounded_n1 = round(n1, 5)
 22.     gen rounded_n0 = round(n0, 5)
 23.     keep factor level rounded_n0 percent0 rounded_n1 percent1
 24.     export delimited using ./output/tables/characteristics_no_appts_all_`i
> '_rounded.csv
 25.     restore
 26.     * Logistic regression 
.     foreach var in urban_rural_bin i.imd i.region_n i.eth5 {
 27.         logit fewer_appts_all_`i' `var' ib1.age_cat male, or 
 28.         est sto m2
 29.         parmest, label eform format(estimate p min95 max95) saving("./outp
> ut/tempdata/`var'_diff_all_`i'", replace) idstr("`var'_all_`i'")
 30.         }
 31.     logit fewer_appts_all_`i' ib1.age_cat male urban_rural_bin i.imd i.reg
> ion_n i.eth5, or 
 32.     est sto m2
 33.     parmest, label eform format(estimate p min95 max95) saving("./output/t
> empdata/multi_diff_all_`i'", replace) idstr("multi_all_`i'")
 34.     }

  +-------------------------------------------+
  | factor          N_0     N_1     m_0   m_1 |
  |-------------------------------------------|
  | age_cat       1,471   1,158     439   314 |
  |-------------------------------------------|
  | male          1,910   1,472       0     0 |
  |-------------------------------------------|
  | Rural-Urban   1,910   1,472       0     0 |
  |-------------------------------------------|
  | region        1,910   1,472       0     0 |
  |-------------------------------------------|
  | imd           1,910   1,472       0     0 |
  |-------------------------------------------|
  | smoking       1,910   1,472       0     0 |
  |-------------------------------------------|
  | time_ra         850     654   1,060   818 |
  |-------------------------------------------|
  | bmi_cat       1,910   1,472       0     0 |
  |-------------------------------------------|
  | eth5          1,910   1,472       0     0 |
  +-------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> ----------------------------+
  |                                          fewer_appts_all_2020 = 0   fewer_a
> ppts_all_2020 = 1   p-value |
  |----------------------------------------------------------------------------
> ----------------------------|
  |                                          N=1,910                    N=1,472
>                             |
  |----------------------------------------------------------------------------
> ----------------------------|
  | age_cat       18 - 40 years              545 (37.0%)                454 (39
> .2%)                 0.70   |
  |               41 - 60 years              453 (30.8%)                344 (29
> .7%)                        |
  |               61 - 80 years              373 (25.4%)                288 (24
> .9%)                        |
  |               >80 years                  100 ( 6.8%)                72 ( 6.
> 2%)                         |
  |----------------------------------------------------------------------------
> ----------------------------|
  | male          Female                     972 (50.9%)                755 (51
> .3%)                 0.82   |
  |               Male                       938 (49.1%)                717 (48
> .7%)                        |
  |----------------------------------------------------------------------------
> ----------------------------|
  | Rural-Urban   Rural                      962 (50.4%)                758 (51
> .5%)                 0.52   |
  |               Urban                      948 (49.6%)                714 (48
> .5%)                        |
  |----------------------------------------------------------------------------
> ----------------------------|
  | region        East Midlands              202 (10.6%)                141 ( 9
> .6%)                 0.61   |
  |               East of England            194 (10.2%)                129 ( 8
> .8%)                        |
  |               London                     400 (20.9%)                291 (19
> .8%)                        |
  |               North East                 189 ( 9.9%)                146 ( 9
> .9%)                        |
  |               North West                 196 (10.3%)                164 (11
> .1%)                        |
  |               South East                 360 (18.8%)                301 (20
> .4%)                        |
  |               West Midlands              182 ( 9.5%)                143 ( 9
> .7%)                        |
  |               Yorkshire and the Humber   187 ( 9.8%)                157 (10
> .7%)                        |
  |----------------------------------------------------------------------------
> ----------------------------|
  | imd           0                          103 ( 5.4%)                63 ( 4.
> 3%)                  0.37   |
  |               1                          372 (19.5%)                279 (19
> .0%)                        |
  |               2                          341 (17.9%)                298 (20
> .2%)                        |
  |               3                          370 (19.4%)                269 (18
> .3%)                        |
  |               4                          369 (19.3%)                292 (19
> .8%)                        |
  |               5                          355 (18.6%)                271 (18
> .4%)                        |
  |----------------------------------------------------------------------------
> ----------------------------|
  | smoking       Never smoked               199 (10.4%)                151 (10
> .3%)                 0.97   |
  |               Current smoker             376 (19.7%)                293 (19
> .9%)                        |
  |               Ex-smoker                  290 (15.2%)                231 (15
> .7%)                        |
  |               Unknown                    1,045 (54.7%)              797 (54
> .1%)                        |
  |----------------------------------------------------------------------------
> ----------------------------|
  | time_ra                                  52.98632 (32.09148)        56.8920
> 6 (31.25381)         0.018  |
  |----------------------------------------------------------------------------
> ----------------------------|
  | bmi_cat       Missing                    366 (19.2%)                278 (18
> .9%)                 0.45   |
  |               Underweight                180 ( 9.4%)                154 (10
> .5%)                        |
  |               Healthy range              336 (17.6%)                292 (19
> .8%)                        |
  |               Overweight                 404 (21.2%)                288 (19
> .6%)                        |
  |               Obese                      503 (26.3%)                372 (25
> .3%)                        |
  |               Morbidly obese             121 ( 6.3%)                88 ( 6.
> 0%)                         |
  |----------------------------------------------------------------------------
> ----------------------------|
  | eth5          White                      378 (19.8%)                278 (18
> .9%)                 0.38   |
  |               South Asian                403 (21.1%)                293 (19
> .9%)                        |
  |               Black                      381 (19.9%)                276 (18
> .8%)                        |
  |               Mixed                      375 (19.6%)                324 (22
> .0%)                        |
  |               Other                      373 (19.5%)                301 (20
> .4%)                        |
  +----------------------------------------------------------------------------
> ----------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file ./output/tables/characteristics_fewer_appts_all_2020.csv saved
_columna_1: contains nonnumeric characters not specified in ignore(); n1 genera
> ted as double
(2 missing values generated)
_columna_0: contains nonnumeric characters not specified in ignore()
_columna_0: character , removed; n0 generated as double
(2 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent1 generated as double
(2 missing values generated)
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
file ./output/tables/characteristics_fewer_appts_all_2020_rounded.csv saved

  +-----------------------------------------+
  | factor          N_0   N_1     m_0   m_1 |
  |-----------------------------------------|
  | age_cat       3,875    28   1,093     4 |
  |-----------------------------------------|
  | male          4,968    32       0     0 |
  |-----------------------------------------|
  | Rural-Urban   4,968    32       0     0 |
  |-----------------------------------------|
  | region        4,968    32       0     0 |
  |-----------------------------------------|
  | imd           4,968    32       0     0 |
  |-----------------------------------------|
  | smoking       4,968    32       0     0 |
  |-----------------------------------------|
  | time_ra       2,186    16   2,782    16 |
  |-----------------------------------------|
  | bmi_cat       4,968    32       0     0 |
  |-----------------------------------------|
  | eth5          4,968    32       0     0 |
  +-----------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> ----------------------+
  |                                          no_appts_all_2020 = 0   no_appts_a
> ll_2020 = 1   p-value |
  |----------------------------------------------------------------------------
> ----------------------|
  |                                          N=4,968                 N=32      
>                       |
  |----------------------------------------------------------------------------
> ----------------------|
  | age_cat       18 - 40 years              1,431 (36.9%)           7 (25.0%) 
>                0.55   |
  |               41 - 60 years              1,225 (31.6%)           10 (35.7%)
>                       |
  |               61 - 80 years              964 (24.9%)             8 (28.6%) 
>                       |
  |               >80 years                  255 ( 6.6%)             3 (10.7%) 
>                       |
  |----------------------------------------------------------------------------
> ----------------------|
  | male          Female                     2,529 (50.9%)           17 (53.1%)
>                0.80   |
  |               Male                       2,439 (49.1%)           15 (46.9%)
>                       |
  |----------------------------------------------------------------------------
> ----------------------|
  | Rural-Urban   Rural                      2,506 (50.4%)           16 (50.0%)
>                0.96   |
  |               Urban                      2,462 (49.6%)           16 (50.0%)
>                       |
  |----------------------------------------------------------------------------
> ----------------------|
  | region        East Midlands              489 ( 9.8%)             5 (15.6%) 
>                0.42   |
  |               East of England            479 ( 9.6%)             2 ( 6.2%) 
>                       |
  |               London                     1,017 (20.5%)           7 (21.9%) 
>                       |
  |               North East                 504 (10.1%)             5 (15.6%) 
>                       |
  |               North West                 508 (10.2%)             2 ( 6.2%) 
>                       |
  |               South East                 992 (20.0%)             2 ( 6.2%) 
>                       |
  |               West Midlands              468 ( 9.4%)             4 (12.5%) 
>                       |
  |               Yorkshire and the Humber   511 (10.3%)             5 (15.6%) 
>                       |
  |----------------------------------------------------------------------------
> ----------------------|
  | imd           0                          242 ( 4.9%)             1 ( 3.1%) 
>                0.48   |
  |               1                          941 (18.9%)             4 (12.5%) 
>                       |
  |               2                          954 (19.2%)             3 ( 9.4%) 
>                       |
  |               3                          953 (19.2%)             8 (25.0%) 
>                       |
  |               4                          969 (19.5%)             9 (28.1%) 
>                       |
  |               5                          909 (18.3%)             7 (21.9%) 
>                       |
  |----------------------------------------------------------------------------
> ----------------------|
  | smoking       Never smoked               507 (10.2%)             1 ( 3.1%) 
>                0.37   |
  |               Current smoker             983 (19.8%)             5 (15.6%) 
>                       |
  |               Ex-smoker                  761 (15.3%)             4 (12.5%) 
>                       |
  |               Unknown                    2,717 (54.7%)           22 (68.8%)
>                       |
  |----------------------------------------------------------------------------
> ----------------------|
  | time_ra                                  54.81282 (31.99102)     64.70842 (
> 24.66449)      0.22   |
  |----------------------------------------------------------------------------
> ----------------------|
  | bmi_cat       Missing                    956 (19.2%)             6 (18.8%) 
>                0.28   |
  |               Underweight                481 ( 9.7%)             1 ( 3.1%) 
>                       |
  |               Healthy range              943 (19.0%)             5 (15.6%) 
>                       |
  |               Overweight                 1,009 (20.3%)           5 (15.6%) 
>                       |
  |               Obese                      1,289 (25.9%)           14 (43.8%)
>                       |
  |               Morbidly obese             290 ( 5.8%)             1 ( 3.1%) 
>                       |
  |----------------------------------------------------------------------------
> ----------------------|
  | eth5          White                      987 (19.9%)             6 (18.8%) 
>                0.51   |
  |               South Asian                999 (20.1%)             6 (18.8%) 
>                       |
  |               Black                      1,003 (20.2%)           9 (28.1%) 
>                       |
  |               Mixed                      980 (19.7%)             8 (25.0%) 
>                       |
  |               Other                      999 (20.1%)             3 ( 9.4%) 
>                       |
  +----------------------------------------------------------------------------
> ----------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file ./output/tables/characteristics_no_appts_all_2020.csv saved
_columna_1: contains nonnumeric characters not specified in ignore(); n1 genera
> ted as double
(2 missing values generated)
_columna_0: contains nonnumeric characters not specified in ignore()
_columna_0: character , removed; n0 generated as double
(2 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent1 generated as double
(2 missing values generated)
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
file ./output/tables/characteristics_no_appts_all_2020_rounded.csv saved

Iteration 0:   log likelihood = -1803.6073  
Iteration 1:   log likelihood = -1801.4337  
Iteration 2:   log likelihood = -1801.4337  

Logistic regression                             Number of obs     =      2,629
                                                LR chi2(5)        =       4.35
                                                Prob > chi2       =     0.5006
Log likelihood = -1801.4337                     Pseudo R2         =     0.0012

------------------------------------------------------------------------------
fewer~l_2020 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
urban_rura~n |   .9143345   .0719547    -1.14   0.255     .7836438    1.066821
             |
     age_cat |
18 - 40 y..  |   1.099722   .1052788     0.99   0.321     .9115816    1.326693
61 - 80 y..  |   1.020113   .1083628     0.19   0.851     .8283773    1.256227
  >80 years  |   .9440729    .160896    -0.34   0.736     .6759854     1.31848
             |
        male |   .9038849   .0711239    -1.28   0.199     .7747022    1.054609
       _cons |   .8323213   .0744982    -2.05   0.040     .6983979    .9919256
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/urban_rural_bin_diff_all_2020.dta not found)
file ./output/tempdata/urban_rural_bin_diff_all_2020.dta saved

Iteration 0:   log likelihood = -1803.6073  
Iteration 1:   log likelihood = -1798.7504  
Iteration 2:   log likelihood = -1798.7499  
Iteration 3:   log likelihood = -1798.7499  

Logistic regression                             Number of obs     =      2,629
                                                LR chi2(9)        =       9.71
                                                Prob > chi2       =     0.3741
Log likelihood = -1798.7499                     Pseudo R2         =     0.0027

------------------------------------------------------------------------------
fewer~l_2020 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         imd |
          1  |    1.25707   .2526726     1.14   0.255     .8477483    1.864026
          2  |   1.467968   .2947587     1.91   0.056     .9903771    2.175867
          3  |   1.135391   .2294952     0.63   0.530         .764    1.687321
          4  |   1.217485   .2437713     0.98   0.326     .8223027    1.802585
          5  |   1.146355    .231569     0.68   0.499     .7715645      1.7032
             |
     age_cat |
18 - 40 y..  |     1.0934   .1048036     0.93   0.352     .9061299    1.319373
61 - 80 y..  |     1.0207   .1085512     0.19   0.847     .8286537    1.257255
  >80 years  |   .9458064   .1614303    -0.33   0.744     .6768916    1.321555
             |
        male |   .9011946   .0710641    -1.32   0.187     .7721411    1.051818
       _cons |   .6506692   .1248816    -2.24   0.025     .4466743    .9478281
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/i.imd_diff_all_2020 not found)
file ./output/tempdata/i.imd_diff_all_2020 saved

Iteration 0:   log likelihood = -1803.6073  
Iteration 1:   log likelihood = -1800.4129  
Iteration 2:   log likelihood = -1800.4126  
Iteration 3:   log likelihood = -1800.4126  

Logistic regression                             Number of obs     =      2,629
                                                LR chi2(11)       =       6.39
                                                Prob > chi2       =     0.8462
Log likelihood = -1800.4126                     Pseudo R2         =     0.0018

------------------------------------------------------------------------------
fewer~l_2020 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    region_n |
          2  |    .951612   .1722406    -0.27   0.784     .6674111    1.356833
          3  |   1.111143   .1706248     0.69   0.493      .822359    1.501339
          4  |   1.085877   .1942265     0.46   0.645     .7647681    1.541813
          5  |   1.124005   .1945675     0.68   0.499     .8006145    1.578021
          6  |   1.203927   .1866618     1.20   0.231     .8884369    1.631451
          8  |   1.159443   .2066344     0.83   0.406     .8176157     1.64418
          9  |   1.178486   .2066634     0.94   0.349     .8357087    1.661859
             |
     age_cat |
18 - 40 y..  |   1.094126   .1048166     0.94   0.348     .9068238    1.320116
61 - 80 y..  |   1.015563    .107957     0.15   0.884     .8245591    1.250811
  >80 years  |    .937344   .1600372    -0.38   0.705     .6707634    1.309871
             |
        male |   .9070867   .0714386    -1.24   0.216     .7773409    1.058488
       _cons |     .71811   .1035936    -2.30   0.022     .5412498    .9527615
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/i.region_n_diff_all_2020 not found)
file ./output/tempdata/i.region_n_diff_all_2020 saved

Iteration 0:   log likelihood = -1803.6073  
Iteration 1:   log likelihood = -1801.4231  
Iteration 2:   log likelihood =  -1801.423  

Logistic regression                             Number of obs     =      2,629
                                                LR chi2(8)        =       4.37
                                                Prob > chi2       =     0.8224
Log likelihood =  -1801.423                     Pseudo R2         =     0.0012

------------------------------------------------------------------------------
fewer~l_2020 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.054144   .1309556     0.42   0.671     .8263345    1.344758
      Black  |    1.08098   .1365289     0.62   0.538     .8439374    1.384604
      Mixed  |   1.087475   .1348888     0.68   0.499     .8527813    1.386759
      Other  |   1.151277   .1455024     1.11   0.265     .8986736    1.474883
             |
     age_cat |
18 - 40 y..  |   1.099107   .1052427     0.99   0.324     .9110344    1.326004
61 - 80 y..  |   1.016166   .1080013     0.15   0.880     .8250807    1.251506
  >80 years  |   .9493958   .1618563    -0.30   0.761     .6797223     1.32606
             |
        male |   .9074093   .0714293    -1.23   0.217     .7776757    1.058786
       _cons |   .7411826   .0846742    -2.62   0.009     .5924916    .9271888
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/i.eth5_diff_all_2020 not found)
file ./output/tempdata/i.eth5_diff_all_2020 saved

Iteration 0:   log likelihood = -1803.6073  
Iteration 1:   log likelihood = -1795.8727  
Iteration 2:   log likelihood = -1795.8716  
Iteration 3:   log likelihood = -1795.8716  

Logistic regression                             Number of obs     =      2,629
                                                LR chi2(21)       =      15.47
                                                Prob > chi2       =     0.7986
Log likelihood = -1795.8716                     Pseudo R2         =     0.0043

------------------------------------------------------------------------------
fewer~l_2020 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     age_cat |
18 - 40 y..  |     1.0914   .1048062     0.91   0.362     .9041571     1.31742
61 - 80 y..  |   1.016554   .1083395     0.15   0.878     .8249233    1.252701
  >80 years  |   .9342805   .1600183    -0.40   0.691     .6678643    1.306972
             |
        male |   .9045389   .0714917    -1.27   0.204     .7747313    1.056096
urban_rura~n |   .9196006   .0727241    -1.06   0.289     .7875612    1.073777
             |
         imd |
          1  |   1.247833   .2514827     1.10   0.272     .8406381    1.852268
          2  |   1.460266   .2940475     1.88   0.060     .9840775     2.16688
          3  |    1.13309   .2294658     0.62   0.537     .7618772    1.685172
          4  |   1.212399   .2432346     0.96   0.337     .8182301    1.796453
          5  |   1.140734   .2310399     0.65   0.516     .7669821    1.696616
             |
    region_n |
          2  |   .9555266    .174229    -0.25   0.803     .6683997    1.365996
          3  |   1.095847   .1690413     0.59   0.553      .809929      1.4827
          4  |   1.079244    .193908     0.42   0.671     .7588989    1.534812
          5  |   1.128273   .1961885     0.69   0.488      .802424    1.586443
          6  |   1.204129   .1874723     1.19   0.233     .8874588    1.633795
          8  |   1.158583   .2073638     0.82   0.411     .8157906    1.645416
          9  |   1.163503   .2046905     0.86   0.389     .8241739     1.64254
             |
        eth5 |
South Asian  |   1.044613   .1302916     0.35   0.726     .8180643      1.3339
      Black  |   1.083264   .1375654     0.63   0.529     .8445768    1.389408
      Mixed  |   1.079752   .1343538     0.62   0.537      .846075    1.377968
      Other  |   1.157659   .1468227     1.15   0.248     .9028695    1.484349
             |
       _cons |   .5747578   .1412211    -2.25   0.024     .3550913    .9303143
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/multi_diff_all_2020.dta not found)
file ./output/tempdata/multi_diff_all_2020.dta saved

  +-----------------------------------------+
  | factor          N_0     N_1   m_0   m_1 |
  |-----------------------------------------|
  | age_cat         984     797   285   209 |
  |-----------------------------------------|
  | male          1,269   1,006     0     0 |
  |-----------------------------------------|
  | Rural-Urban   1,269   1,006     0     0 |
  |-----------------------------------------|
  | region        1,269   1,006     0     0 |
  |-----------------------------------------|
  | imd           1,269   1,006     0     0 |
  |-----------------------------------------|
  | smoking       1,269   1,006     0     0 |
  |-----------------------------------------|
  | time_ra         569     449   700   557 |
  |-----------------------------------------|
  | bmi_cat       1,269   1,006     0     0 |
  |-----------------------------------------|
  | eth5          1,269   1,006     0     0 |
  +-----------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> ----------------------------+
  |                                          fewer_appts_all_2021 = 0   fewer_a
> ppts_all_2021 = 1   p-value |
  |----------------------------------------------------------------------------
> ----------------------------|
  |                                          N=1,269                    N=1,006
>                             |
  |----------------------------------------------------------------------------
> ----------------------------|
  | age_cat       18 - 40 years              390 (39.6%)                302 (37
> .9%)                 0.64   |
  |               41 - 60 years              287 (29.2%)                249 (31
> .2%)                        |
  |               61 - 80 years              242 (24.6%)                201 (25
> .2%)                        |
  |               >80 years                  65 ( 6.6%)                 45 ( 5.
> 6%)                         |
  |----------------------------------------------------------------------------
> ----------------------------|
  | male          Female                     639 (50.4%)                512 (50
> .9%)                 0.80   |
  |               Male                       630 (49.6%)                494 (49
> .1%)                        |
  |----------------------------------------------------------------------------
> ----------------------------|
  | Rural-Urban   Rural                      673 (53.0%)                511 (50
> .8%)                 0.29   |
  |               Urban                      596 (47.0%)                495 (49
> .2%)                        |
  |----------------------------------------------------------------------------
> ----------------------------|
  | region        East Midlands              143 (11.3%)                95 ( 9.
> 4%)                  0.20   |
  |               East of England            128 (10.1%)                83 ( 8.
> 3%)                         |
  |               London                     250 (19.7%)                210 (20
> .9%)                        |
  |               North East                 134 (10.6%)                101 (10
> .0%)                        |
  |               North West                 137 (10.8%)                108 (10
> .7%)                        |
  |               South East                 254 (20.0%)                199 (19
> .8%)                        |
  |               West Midlands              104 ( 8.2%)                113 (11
> .2%)                        |
  |               Yorkshire and the Humber   119 ( 9.4%)                97 ( 9.
> 6%)                         |
  |----------------------------------------------------------------------------
> ----------------------------|
  | imd           0                          58 ( 4.6%)                 52 ( 5.
> 2%)                  0.56   |
  |               1                          243 (19.1%)                190 (18
> .9%)                        |
  |               2                          228 (18.0%)                206 (20
> .5%)                        |
  |               3                          240 (18.9%)                194 (19
> .3%)                        |
  |               4                          256 (20.2%)                190 (18
> .9%)                        |
  |               5                          244 (19.2%)                174 (17
> .3%)                        |
  |----------------------------------------------------------------------------
> ----------------------------|
  | smoking       Never smoked               136 (10.7%)                114 (11
> .3%)                 0.86   |
  |               Current smoker             251 (19.8%)                189 (18
> .8%)                        |
  |               Ex-smoker                  194 (15.3%)                162 (16
> .1%)                        |
  |               Unknown                    688 (54.2%)                541 (53
> .8%)                        |
  |----------------------------------------------------------------------------
> ----------------------------|
  | time_ra                                  53.79543 (32.07122)        56.2839
> 5 (30.47527)         0.21   |
  |----------------------------------------------------------------------------
> ----------------------------|
  | bmi_cat       Missing                    237 (18.7%)                164 (16
> .3%)                 0.29   |
  |               Underweight                116 ( 9.1%)                117 (11
> .6%)                        |
  |               Healthy range              238 (18.8%)                187 (18
> .6%)                        |
  |               Overweight                 260 (20.5%)                214 (21
> .3%)                        |
  |               Obese                      342 (27.0%)                257 (25
> .5%)                        |
  |               Morbidly obese             76 ( 6.0%)                 67 ( 6.
> 7%)                         |
  |----------------------------------------------------------------------------
> ----------------------------|
  | eth5          White                      242 (19.1%)                194 (19
> .3%)                 0.92   |
  |               South Asian                276 (21.7%)                206 (20
> .5%)                        |
  |               Black                      237 (18.7%)                182 (18
> .1%)                        |
  |               Mixed                      263 (20.7%)                218 (21
> .7%)                        |
  |               Other                      251 (19.8%)                206 (20
> .5%)                        |
  +----------------------------------------------------------------------------
> ----------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file ./output/tables/characteristics_fewer_appts_all_2021.csv saved
_columna_1: contains nonnumeric characters not specified in ignore(); n1 genera
> ted as double
(2 missing values generated)
_columna_0: contains nonnumeric characters not specified in ignore(); n0 genera
> ted as double
(2 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent1 generated as double
(2 missing values generated)
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
file ./output/tables/characteristics_fewer_appts_all_2021_rounded.csv saved

  +-----------------------------------------+
  | factor          N_0   N_1     m_0   m_1 |
  |-----------------------------------------|
  | age_cat       3,889    14   1,092     5 |
  |-----------------------------------------|
  | male          4,981    19       0     0 |
  |-----------------------------------------|
  | Rural-Urban   4,981    19       0     0 |
  |-----------------------------------------|
  | region        4,981    19       0     0 |
  |-----------------------------------------|
  | imd           4,981    19       0     0 |
  |-----------------------------------------|
  | smoking       4,981    19       0     0 |
  |-----------------------------------------|
  | time_ra       2,195     7   2,786    12 |
  |-----------------------------------------|
  | bmi_cat       4,981    19       0     0 |
  |-----------------------------------------|
  | eth5          4,981    19       0     0 |
  +-----------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> ----------------------+
  |                                          no_appts_all_2021 = 0   no_appts_a
> ll_2021 = 1   p-value |
  |----------------------------------------------------------------------------
> ----------------------|
  |                                          N=4,981                 N=19      
>                       |
  |----------------------------------------------------------------------------
> ----------------------|
  | age_cat       18 - 40 years              1,433 (36.8%)           5 (35.7%) 
>                0.77   |
  |               41 - 60 years              1,232 (31.7%)           3 (21.4%) 
>                       |
  |               61 - 80 years              967 (24.9%)             5 (35.7%) 
>                       |
  |               >80 years                  257 ( 6.6%)             1 ( 7.1%) 
>                       |
  |----------------------------------------------------------------------------
> ----------------------|
  | male          Female                     2,538 (51.0%)           8 (42.1%) 
>                0.44   |
  |               Male                       2,443 (49.0%)           11 (57.9%)
>                       |
  |----------------------------------------------------------------------------
> ----------------------|
  | Rural-Urban   Rural                      2,512 (50.4%)           10 (52.6%)
>                0.85   |
  |               Urban                      2,469 (49.6%)           9 (47.4%) 
>                       |
  |----------------------------------------------------------------------------
> ----------------------|
  | region        East Midlands              491 ( 9.9%)             3 (15.8%) 
>                0.76   |
  |               East of England            479 ( 9.6%)             2 (10.5%) 
>                       |
  |               London                     1,019 (20.5%)           5 (26.3%) 
>                       |
  |               North East                 509 (10.2%)             0 ( 0.0%) 
>                       |
  |               North West                 508 (10.2%)             2 (10.5%) 
>                       |
  |               South East                 989 (19.9%)             5 (26.3%) 
>                       |
  |               West Midlands              471 ( 9.5%)             1 ( 5.3%) 
>                       |
  |               Yorkshire and the Humber   515 (10.3%)             1 ( 5.3%) 
>                       |
  |----------------------------------------------------------------------------
> ----------------------|
  | imd           0                          242 ( 4.9%)             1 ( 5.3%) 
>                0.31   |
  |               1                          939 (18.9%)             6 (31.6%) 
>                       |
  |               2                          951 (19.1%)             6 (31.6%) 
>                       |
  |               3                          958 (19.2%)             3 (15.8%) 
>                       |
  |               4                          977 (19.6%)             1 ( 5.3%) 
>                       |
  |               5                          914 (18.3%)             2 (10.5%) 
>                       |
  |----------------------------------------------------------------------------
> ----------------------|
  | smoking       Never smoked               508 (10.2%)             0 ( 0.0%) 
>                0.057  |
  |               Current smoker             987 (19.8%)             1 ( 5.3%) 
>                       |
  |               Ex-smoker                  759 (15.2%)             6 (31.6%) 
>                       |
  |               Unknown                    2,727 (54.7%)           12 (63.2%)
>                       |
  |----------------------------------------------------------------------------
> ----------------------|
  | time_ra                                  54.86465 (31.96089)     61.17767 (
> 30.05307)      0.60   |
  |----------------------------------------------------------------------------
> ----------------------|
  | bmi_cat       Missing                    955 (19.2%)             7 (36.8%) 
>                0.34   |
  |               Underweight                481 ( 9.7%)             1 ( 5.3%) 
>                       |
  |               Healthy range              946 (19.0%)             2 (10.5%) 
>                       |
  |               Overweight                 1,010 (20.3%)           4 (21.1%) 
>                       |
  |               Obese                      1,300 (26.1%)           3 (15.8%) 
>                       |
  |               Morbidly obese             289 ( 5.8%)             2 (10.5%) 
>                       |
  |----------------------------------------------------------------------------
> ----------------------|
  | eth5          White                      989 (19.9%)             4 (21.1%) 
>                0.95   |
  |               South Asian                1,001 (20.1%)           4 (21.1%) 
>                       |
  |               Black                      1,007 (20.2%)           5 (26.3%) 
>                       |
  |               Mixed                      985 (19.8%)             3 (15.8%) 
>                       |
  |               Other                      999 (20.1%)             3 (15.8%) 
>                       |
  +----------------------------------------------------------------------------
> ----------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file ./output/tables/characteristics_no_appts_all_2021.csv saved
_columna_1: contains nonnumeric characters not specified in ignore(); n1 genera
> ted as double
(2 missing values generated)
_columna_0: contains nonnumeric characters not specified in ignore()
_columna_0: character , removed; n0 generated as double
(2 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent1 generated as double
(2 missing values generated)
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
file ./output/tables/characteristics_no_appts_all_2021_rounded.csv saved

Iteration 0:   log likelihood = -1224.6598  
Iteration 1:   log likelihood = -1223.6085  
Iteration 2:   log likelihood = -1223.6084  

Logistic regression                             Number of obs     =      1,781
                                                LR chi2(5)        =       2.10
                                                Prob > chi2       =     0.8348
Log likelihood = -1223.6084                     Pseudo R2         =     0.0009

------------------------------------------------------------------------------
fewer~l_2021 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
urban_rura~n |   1.061522   .1013672     0.63   0.532      .880331    1.280007
             |
     age_cat |
18 - 40 y..  |   .8925148   .1032392    -0.98   0.326     .7114674    1.119633
61 - 80 y..  |   .9567038   .1233597    -0.34   0.731     .7430559    1.231781
  >80 years  |   .8007983   .1701784    -1.05   0.296     .5279995    1.214543
             |
        male |   1.009791   .0963608     0.10   0.919     .8375374    1.217471
       _cons |    .838968   .0911554    -1.62   0.106     .6780486    1.038078
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/urban_rural_bin_diff_all_2021.dta not found)
file ./output/tempdata/urban_rural_bin_diff_all_2021.dta saved

Iteration 0:   log likelihood = -1224.6598  
Iteration 1:   log likelihood =   -1218.85  
Iteration 2:   log likelihood = -1218.8495  
Iteration 3:   log likelihood = -1218.8495  

Logistic regression                             Number of obs     =      1,781
                                                LR chi2(9)        =      11.62
                                                Prob > chi2       =     0.2356
Log likelihood = -1218.8495                     Pseudo R2         =     0.0047

------------------------------------------------------------------------------
fewer~l_2021 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         imd |
          1  |   .7773764   .1887234    -1.04   0.300     .4830427    1.251057
          2  |   .9772938   .2352218    -0.10   0.924     .6097505    1.566384
          3  |   .7377338   .1793479    -1.25   0.211     .4581072    1.188043
          4  |   .6734528   .1622713    -1.64   0.101     .4199586     1.07996
          5  |   .6647864   .1623045    -1.67   0.094     .4119697    1.072751
             |
     age_cat |
18 - 40 y..  |   .8890439   .1031753    -1.01   0.311     .7081733     1.11611
61 - 80 y..  |   .9721294   .1257919    -0.22   0.827     .7543625    1.252761
  >80 years  |    .797591    .170009    -1.06   0.289     .5252233    1.211202
             |
        male |   1.011774   .0969162     0.12   0.903     .8385872    1.220727
       _cons |   1.116053   .2574569     0.48   0.634     .7101094     1.75406
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/i.imd_diff_all_2021 not found)
file ./output/tempdata/i.imd_diff_all_2021 saved

Iteration 0:   log likelihood = -1224.6598  
Iteration 1:   log likelihood =  -1219.672  
Iteration 2:   log likelihood = -1219.6714  
Iteration 3:   log likelihood = -1219.6714  

Logistic regression                             Number of obs     =      1,781
                                                LR chi2(11)       =       9.98
                                                Prob > chi2       =     0.5325
Log likelihood = -1219.6714                     Pseudo R2         =     0.0041

------------------------------------------------------------------------------
fewer~l_2021 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    region_n |
          2  |   1.070834   .2367159     0.31   0.757     .6943168    1.651531
          3  |   1.432849    .268089     1.92   0.055     .9929766    2.067579
          4  |   1.220259   .2609468     0.93   0.352     .8024661    1.855571
          5  |   1.136592   .2406025     0.60   0.545     .7506128     1.72105
          6  |    1.32511    .248333     1.50   0.133     .9177662    1.913251
          8  |   1.615469   .3504851     2.21   0.027     1.055907    2.471563
          9  |   1.217968   .2626717     0.91   0.361     .7981096      1.8587
             |
     age_cat |
18 - 40 y..  |   .8843972   .1026708    -1.06   0.290     .7044177    1.110362
61 - 80 y..  |   .9474989   .1227135    -0.42   0.677      .735084    1.221295
  >80 years  |   .7860745   .1677167    -1.13   0.259     .5174299    1.194197
             |
        male |   1.009556   .0966368     0.10   0.921     .8368573    1.217893
       _cons |   .6871871   .1195947    -2.16   0.031     .4885804    .9665271
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/i.region_n_diff_all_2021 not found)
file ./output/tempdata/i.region_n_diff_all_2021 saved

Iteration 0:   log likelihood = -1224.6598  
Iteration 1:   log likelihood = -1223.5394  
Iteration 2:   log likelihood = -1223.5394  

Logistic regression                             Number of obs     =      1,781
                                                LR chi2(8)        =       2.24
                                                Prob > chi2       =     0.9727
Log likelihood = -1223.5394                     Pseudo R2         =     0.0009

------------------------------------------------------------------------------
fewer~l_2021 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .9337285   .1389294    -0.46   0.645      .697542    1.249887
      Black  |    .973826   .1503086    -0.17   0.864     .7196141    1.317841
      Mixed  |   1.014241   .1514216     0.09   0.925     .7569382    1.359007
      Other  |   1.028182   .1586351     0.18   0.857     .7598726    1.391231
             |
     age_cat |
18 - 40 y..  |   .8927022   .1032919    -0.98   0.327     .7115685    1.119945
61 - 80 y..  |   .9572874   .1235195    -0.34   0.735     .7433805    1.232746
  >80 years  |   .7996754   .1700197    -1.05   0.293     .5271558    1.213077
             |
        male |   1.007729   .0962241     0.08   0.936     .8357292    1.215127
       _cons |    .874241   .1207299    -0.97   0.330     .6669341    1.145986
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/i.eth5_diff_all_2021 not found)
file ./output/tempdata/i.eth5_diff_all_2021 saved

Iteration 0:   log likelihood = -1224.6598  
Iteration 1:   log likelihood = -1214.4611  
Iteration 2:   log likelihood = -1214.4588  
Iteration 3:   log likelihood = -1214.4588  

Logistic regression                             Number of obs     =      1,781
                                                LR chi2(21)       =      20.40
                                                Prob > chi2       =     0.4959
Log likelihood = -1214.4588                     Pseudo R2         =     0.0083

------------------------------------------------------------------------------
fewer~l_2021 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     age_cat |
18 - 40 y..  |   .8822454   .1027996    -1.08   0.282      .702113    1.108592
61 - 80 y..  |   .9615805   .1250658    -0.30   0.763     .7452055    1.240781
  >80 years  |   .7913008   .1698096    -1.09   0.275       .51961    1.205052
             |
        male |   1.013047   .0974676     0.13   0.893     .8389451    1.223279
urban_rura~n |   1.073851   .1036219     0.74   0.460     .8888059    1.297422
             |
         imd |
          1  |    .758422   .1851971    -1.13   0.257     .4699571     1.22395
          2  |   .9430325   .2286385    -0.24   0.809     .5863442    1.516703
          3  |    .723269   .1767244    -1.33   0.185     .4480394    1.167571
          4  |   .6557985    .158999    -1.74   0.082     .4077517    1.054739
          5  |   .6502084   .1597784    -1.75   0.080     .4016829    1.052499
             |
    region_n |
          2  |   1.021912   .2279441     0.10   0.923     .6600057    1.582266
          3  |   1.387805   .2615577     1.74   0.082     .9591875    2.007951
          4  |   1.197096   .2574737     0.84   0.403     .7853276    1.824765
          5  |   1.131035   .2409682     0.58   0.563     .7449493    1.717218
          6  |   1.302175   .2453285     1.40   0.161     .9001268      1.8838
          8  |   1.574217   .3434197     2.08   0.038     1.026532    2.414107
          9  |   1.200651   .2604335     0.84   0.399     .7848427    1.836755
             |
        eth5 |
South Asian  |   .9281653   .1390362    -0.50   0.619     .6920191    1.244895
      Black  |   .9607985   .1496303    -0.26   0.797     .7080602     1.30375
      Mixed  |   .9912269   .1489752    -0.06   0.953     .7383169    1.330771
      Other  |   1.024836    .159198     0.16   0.875     .7558383    1.389569
             |
       _cons |   .9157397   .2691682    -0.30   0.765     .5147233    1.629184
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/multi_diff_all_2021.dta not found)
file ./output/tempdata/multi_diff_all_2021.dta saved

. * Put together 2020 and 2021 logistic regression results
. use "./output/tempdata/urban_rural_bin_diff_all_2020", clear 

. append using "./output/tempdata/i.imd_diff_all_2020"

. append using "./output/tempdata/i.region_n_diff_all_2020"

. append using "./output/tempdata/i.eth5_diff_all_2020"

. append using "./output/tempdata/multi_diff_all_2020"

. append using "./output/tempdata/urban_rural_bin_diff_all_2021"

. append using "./output/tempdata/i.imd_diff_all_2021"

. append using "./output/tempdata/i.region_n_diff_all_2021"

. append using "./output/tempdata/i.eth5_diff_all_2021"

. append using "./output/tempdata/multi_diff_all_2021"

. drop stderr z 

. export delimited using ./output/tables/logistic_diff_all_results.csv
file ./output/tables/logistic_diff_all_results.csv saved

. 
.     
. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/outpatients.log
  log type:  text
 closed on:   1 Jun 2023, 08:53:54
-------------------------------------------------------------------------------
