
. 
. cap mkdir ./output/tables/

. 
. * Import data
. import delimited using ./output/input.csv
(44 vars, 10,000 obs)

. * Check data
. count if age==. 
  0

. count if age<18 
  2,045

. count if age>110 & age!=.
  0

. sum age, d

                             age
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            4              0
10%            8              0       Obs              10,000
25%           21              0       Sum of Wgt.      10,000

50%           40                      Mean            40.6401
                        Largest       Std. Dev.      23.67519
75%           59            105
90%           73            106       Variance       560.5148
95%           79            106       Skewness       .1234175
99%           89            108       Kurtosis        2.06528

. count if sex==""
  0

. tab sex

        sex |      Freq.     Percent        Cum.
------------+-----------------------------------
          F |      4,954       49.54       49.54
          M |      4,957       49.57       99.11
          U |         89        0.89      100.00
------------+-----------------------------------
      Total |     10,000      100.00

. * Checking RA algorithm variables
. * Checking type of DMARD that meets inclusion
. foreach dmard in metho leflu sulfa hydrox {
  2.     gen `dmard'_multi = (`dmard'_count>=2)
  3.     tab `dmard'_multi if has_dmards==1, m
  4. }

metho_multi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        849       16.98       16.98
          1 |      4,151       83.02      100.00
------------+-----------------------------------
      Total |      5,000      100.00

leflu_multi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        771       15.42       15.42
          1 |      4,229       84.58      100.00
------------+-----------------------------------
      Total |      5,000      100.00

sulfa_multi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        776       15.52       15.52
          1 |      4,224       84.48      100.00
------------+-----------------------------------
      Total |      5,000      100.00

hydrox_mult |
          i |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        756       15.12       15.12
          1 |      4,244       84.88      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. gen dmard_multi = (metho_multi==1 | leflu_multi==1 | sulfa_multi==1 | hydrox_
> multi==1)

. tab dmard_multi has_alt_dmard_diag

dmard_mult |  has_alt_dmard_diag
         i |         0          1 |     Total
-----------+----------------------+----------
         0 |         3          4 |         7 
         1 |     4,997      4,996 |     9,993 
-----------+----------------------+----------
     Total |     5,000      5,000 |    10,000 

. sum number_ra_codes

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
number_ra_~s |     10,000      2.4999    1.035619          0          6

. di "Number where no DMARDs but does have multiple RA codes and no alt diag"
Number where no DMARDs but does have multiple RA codes and no alt diag

. count if has_dmards==0 & number_ra_codes>=2 & alt_diag!=1
  2,068

. tab has_ra, m

     has_ra |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,000       50.00       50.00
          1 |      5,000       50.00      100.00
------------+-----------------------------------
      Total |     10,000      100.00

. keep if has_ra
(5,000 observations deleted)

. * Time since first RA code
. gen first_ra_codeA = date(first_ra_code, "YMD")
(2,766 missing values generated)

. format first_ra_codeA %dD/N/CY

. gen time_ra = (date("01Mar2019", "DMY") - first_ra_codeA)/365.25
(2,766 missing values generated)

. sum time_ra, d

                           time_ra
-------------------------------------------------------------
      Percentiles      Smallest
 1%     1.015743      -.0520192
 5%     5.399042              0
10%     10.34086       .0793977       Obs               2,234
25%     26.69405       .1314168       Sum of Wgt.       2,234

50%     53.02806                      Mean           54.24187
                        Largest       Std. Dev.      32.12725
75%     82.14374       109.9493
90%       99.269       109.9713       Variance        1032.16
95%     105.1663        109.974       Skewness       .0519785
99%     109.1855       109.9959       Kurtosis       1.797811

. sum number_ra_codes, d

                       number_ra_codes
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            2                      Mean             2.4906
                        Largest       Std. Dev.      1.030206
75%            3              6
90%            4              6       Variance       1.061324
95%            4              6       Skewness       .0493792
99%            5              6       Kurtosis        2.87681

. sum metho_count, d

                         metho_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            3                      Mean             2.5134
                        Largest       Std. Dev.      1.034038
75%            3              6
90%            4              6       Variance       1.069234
95%            4              6       Skewness       .0162608
99%            5              6       Kurtosis       2.865568

. sum sulfa_count, d 

                         sulfa_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            3                      Mean             2.5172
                        Largest       Std. Dev.      1.041692
75%            3              6
90%            4              6       Variance       1.085121
95%            4              6       Skewness       .0562058
99%            5              6       Kurtosis         3.0003

. sum leflu_count, d 

                         leflu_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            2                      Mean             2.4818
                        Largest       Std. Dev.        1.0499
75%            3              6
90%            4              6       Variance       1.102289
95%            4              6       Skewness       .0309686
99%            5              6       Kurtosis       2.944549

. sum hydrox_count, d 

                        hydrox_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            2                      Mean             2.5026
                        Largest       Std. Dev.      1.027134
75%            3              6
90%            4              6       Variance       1.055004
95%            4              6       Skewness       .0373141
99%            5              7       Kurtosis       3.003119

. 
. sum outpatient*, d

                    outpatient_appt_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               5,000
25%            5              0       Sum of Wgt.       5,000

50%            7                      Mean             6.7128
                        Largest       Std. Dev.      2.965615
75%            9             14
90%           10             14       Variance       8.794875
95%           11             14       Skewness      -.8471822
99%           12             14       Kurtosis       3.411528

                    outpatient_appt_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            2              0       Obs               5,000
25%            6              0       Sum of Wgt.       5,000

50%            7                      Mean             6.8002
                        Largest       Std. Dev.      2.927865
75%            9             14
90%           10             14       Variance       8.572394
95%           11             15       Skewness      -.8618035
99%           12             17       Kurtosis         3.5756

                    outpatient_appt_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               5,000
25%            6              0       Sum of Wgt.       5,000

50%            7                      Mean              6.775
                        Largest       Std. Dev.      2.959751
75%            9             14
90%           10             14       Variance       8.760127
95%           11             14       Skewness      -.8546023
99%           12             15       Kurtosis       3.498769

                   outpatient_medium_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               2,499
25%            2              1       Sum of Wgt.       2,499

50%            4                      Mean            11.9908
                        Largest       Std. Dev.      26.09184
75%            7             98
90%            8             98       Variance       680.7841
95%           98             98       Skewness       2.965527
99%           98             98       Kurtosis       9.894789

                   outpatient_medium_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               2,474
25%            2              1       Sum of Wgt.       2,474

50%            5                      Mean           13.18795
                        Largest       Std. Dev.        27.834
75%            7             98
90%            8             98       Variance       774.7317
95%           98             98       Skewness       2.696892
99%           98             98       Kurtosis       8.348923

                   outpatient_medium_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               2,536
25%            2              1       Sum of Wgt.       2,536

50%            5                      Mean            13.8679
                        Largest       Std. Dev.      28.77724
75%            7             98
90%           98             98       Variance       828.1297
95%           98             98       Skewness       2.561223
99%           98             98       Kurtosis       7.627466

. 
. forvalues i=2019/2021 {
  2.     sum ra_hosp_beddays_`i' if ra_hosp_`i'>0, d 
  3. }

                    ra_hosp_beddays_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               4,886
25%            2              0       Sum of Wgt.       4,886

50%            2                      Mean           2.472575
                        Largest       Std. Dev.      1.020749
75%            3              5
90%            4              5       Variance       1.041929
95%            4              6       Skewness       .0037288
99%            5              6       Kurtosis       2.875158

                    ra_hosp_beddays_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               4,893
25%            2              0       Sum of Wgt.       4,893

50%            2                      Mean            2.47803
                        Largest       Std. Dev.      1.031286
75%            3              6
90%            4              6       Variance        1.06355
95%            4              6       Skewness        .002442
99%            5              6       Kurtosis       2.862932

                    ra_hosp_beddays_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               4,886
25%            2              0       Sum of Wgt.       4,886

50%            2                      Mean           2.501228
                        Largest       Std. Dev.      1.047636
75%            3              6
90%            4              6       Variance       1.097542
95%            4              6       Skewness        .067259
99%            5              6       Kurtosis       2.957115

. 
. 
. * How many people are not on DMARDs and have no RA appointments?
. 
. * Format variables
. *re-order ethnicity
.  gen eth5=1 if ethnicity==1
(3,965 missing values generated)

.  replace eth5=2 if ethnicity==3
(980 real changes made)

.  replace eth5=3 if ethnicity==4
(1,044 real changes made)

.  replace eth5=4 if ethnicity==2
(1,010 real changes made)

.  replace eth5=5 if ethnicity==5
(931 real changes made)

.  replace eth5=. if ethnicity==.
(0 real changes made)

. 
.  label define eth5                      1 "White"                            
>            ///
>                                                         2 "South Asian"      
>                    ///                                             
>                                                         3 "Black"            
>                            ///
>                                                         4 "Mixed"            
>                            ///
>                                                         5 "Other"            
>                            

.                                         
. 
. label values eth5 eth5

. safetab eth5, m
5

       eth5 |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |      1,035       20.70       20.70
South Asian |        980       19.60       40.30
      Black |      1,044       20.88       61.18
      Mixed |      1,010       20.20       81.38
      Other |        931       18.62      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. 
. * formatting gender
. gen male=(sex=="M")

. replace male = 0 if sex == "F"
(0 real changes made)

. label define male 0"Female" 1"Male"

. label values male male

. safetab male, miss
5

       male |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |      2,522       50.44       50.44
       Male |      2,478       49.56      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. 
. *create a 4 category rural urban variable 
. generate urban_rural_5=.
(5,000 missing values generated)

. la var urban_rural_5 "Rural Urban in five categories"

. replace urban_rural_5=1 if urban_rural==1
(631 real changes made)

. replace urban_rural_5=2 if urban_rural==2
(646 real changes made)

. replace urban_rural_5=3 if urban_rural==3|urban_rural==4
(1,227 real changes made)

. replace urban_rural_5=4 if urban_rural==5|urban_rural==6
(1,258 real changes made)

. replace urban_rural_5=5 if urban_rural==7|urban_rural==8
(1,238 real changes made)

. label define urban_rural_5 1 "Urban major conurbation" 2 "Urban minor conurba
> tion" 3 "Urban city and town" 4 "Rural town and fringe" 5 "Rural village and 
> dispersed"

. label values urban_rural_5 urban_rural_5

. safetab urban_rural_5, miss
14

        Rural Urban in five |
                 categories |      Freq.     Percent        Cum.
----------------------------+-----------------------------------
    Urban major conurbation |        631       12.62       12.62
    Urban minor conurbation |        646       12.92       25.54
        Urban city and town |      1,227       24.54       50.08
      Rural town and fringe |      1,258       25.16       75.24
Rural village and dispersed |      1,238       24.76      100.00
----------------------------+-----------------------------------
                      Total |      5,000      100.00

. 
. *generate a binary rural urban (with missing assigned to urban)
. generate urban_rural_bin=.
(5,000 missing values generated)

. replace urban_rural_bin=1 if urban_rural<=4|urban_rural==.
(2,504 real changes made)

. replace urban_rural_bin=0 if urban_rural>4 & urban_rural!=.
(2,496 real changes made)

. label define urban_rural_bin 0 "Rural" 1 "Urban"

. label values urban_rural_bin urban_rural_bin

. safetab urban_rural_bin urban_rural, miss
28

urban_rura |                      urban_rural
     l_bin |         1          2          3          4          5 |     Total
-----------+-------------------------------------------------------+----------
     Rural |         0          0          0          0        640 |     2,496 
     Urban |       631        646        630        597          0 |     2,504 
-----------+-------------------------------------------------------+----------
     Total |       631        646        630        597        640 |     5,000 


urban_rura |           urban_rural
     l_bin |         6          7          8 |     Total
-----------+---------------------------------+----------
     Rural |       618        621        617 |     2,496 
     Urban |         0          0          0 |     2,504 
-----------+---------------------------------+----------
     Total |       618        621        617 |     5,000 

. label var urban_rural_bin "Rural-Urban"

. 
. * Define age categories
. * Create age categories
. egen age_cat = cut(age), at(18, 40, 60, 80, 120) icodes
(1003 missing values generated)

. label define age 0 "18 - 40 years" 1 "41 - 60 years" 2 "61 - 80 years" 3 ">80
>  years"

. label values age_cat age

. safetab age_cat, miss
8

      age_cat |      Freq.     Percent        Cum.
--------------+-----------------------------------
18 - 40 years |      1,453       29.06       29.06
41 - 60 years |      1,327       26.54       55.60
61 - 80 years |        972       19.44       75.04
    >80 years |        245        4.90       79.94
            . |      1,003       20.06      100.00
--------------+-----------------------------------
        Total |      5,000      100.00

. 
. * Smoking status
. gen smoking = 0 if smoking_status=="N"
(4,532 missing values generated)

. replace smoking = 1 if smoking_status=="S"
(1,024 real changes made)

. replace smoking = 2 if smoking_status=="E"
(791 real changes made)

. replace smoking = 3 if smoking==.
(2,717 real changes made)

. 
. label define smok 1 "Current smoker" 2 "Ex-smoker" 0 "Never smoked" 3 "Unknow
> n"

. label values smoking smok

. 
. * BMI categories
. egen bmi_cat = cut(bmi), at(0, 1, 18.5, 24.9, 29.9, 39.9, 100) icodes
(1 missing value generated)

. bys bmi_cat: sum bmi

-------------------------------------------------------------------------------
-> bmi_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |      1,013           0           0          0          0

-------------------------------------------------------------------------------
-> bmi_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        457    14.49192    3.281877   1.616627   18.49911

-------------------------------------------------------------------------------
-> bmi_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        881    22.10388    1.778099   18.50015   24.89964

-------------------------------------------------------------------------------
-> bmi_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |      1,033     27.3651    1.403495   24.92169   29.89374

-------------------------------------------------------------------------------
-> bmi_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |      1,367    34.04916     2.71393    29.9001   39.89167

-------------------------------------------------------------------------------
-> bmi_cat = 5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        248    43.80339    3.307144   39.91663   54.58952

-------------------------------------------------------------------------------
-> bmi_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |          1   -2.689052           .  -2.689052  -2.689052


. label define bmi 0 "Missing" 1 "Underweight" 2 "Healthy range" 3 "Overweight"
>  4 "Obese" 5 "Morbidly obese"

. label values bmi_cat bmi

. 
. * Determine if still in follow-up for each year
. * Format dates
. gen died_fuA = date(died_fu, "YMD")
(2,543 missing values generated)

. gen dereg_dateA = date(dereg_date, "YMD")
(2,505 missing values generated)

. gen end_fu = date("`j'-03-31", "YMD")
(5,000 missing values generated)

. gen end_date = min(died_fuA, dereg_dateA, end_fu)
(1,286 missing values generated)

. drop end_fu

. sum end_date

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    end_date |      3,714    22432.79    288.5958      21976      22995

. di "Number where end date prior to follow-up start"
Number where end date prior to follow-up start

. count if end_date<date("2019-04-01", "YMD")
  0

. * determine range of dates for outpatient appointments to determine which sho
> uld be dropped
. gen end_2020 = end_date<date("2020-03-31", "YMD")

. gen end_2021 = end_date<date("2021-03-31", "YMD") 

. gen end_2022 = end_date<date("2022-03-31", "YMD") 

. tab end_2020

   end_2020 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,846       96.92       96.92
          1 |        154        3.08      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. tab end_2021

   end_2021 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,315       66.30       66.30
          1 |      1,685       33.70      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. tab end_2022

   end_2022 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,996       39.92       39.92
          1 |      3,004       60.08      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. 
. * Set outpatient appointment count to missing if end prior to the end of the 
> year 
. forvalues i=2019/2021 {
  2.     local j=`i'+1
  3.     di `j'
  4.     gen op_appt_`i'_orig = outpatient_appt_`i'
  5.     replace outpatient_appt_`i'=. if end_`j'
  6.     gen op_medium_`i'_orig = outpatient_medium_`i'
  7.     replace outpatient_medium_`i'=. if end_`j'
  8. }
2020
(154 real changes made, 154 to missing)
(2,501 missing values generated)
(79 real changes made, 79 to missing)
2021
(1,685 real changes made, 1,685 to missing)
(2,526 missing values generated)
(812 real changes made, 812 to missing)
2022
(3,004 real changes made, 3,004 to missing)
(2,464 missing values generated)
(1,521 real changes made, 1,521 to missing)

. 
. * Categorise number of outpatient appointments
. label define appt 0 "No appointments" 1 "1-2 per year" 2 "3 or more per year"
>  

. forvalues i=2019/2021 {
  2.     egen op_appt_`i'_cat = cut(outpatient_appt_`i'), at(0, 1, 3, 1000) ico
> des
  3.     * Check all categorised
.     bys op_appt_`i'_cat: sum outpatient_appt_`i'
  4.     label values op_appt_`i'_cat appt
  5.     * Same for orginal variables
.     egen op_appt_`i'_orig_cat = cut(op_appt_`i'_orig), at(0, 1, 3, 1000) icod
> es
  6.     * Check all categorised
.     bys op_appt_`i'_orig_cat: sum op_appt_`i'_orig
  7.     label values op_appt_`i'_orig_cat appt
  8.     }
(154 missing values generated)

-------------------------------------------------------------------------------
-> op_appt_2019_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2019 |        493           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_2019_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2019 |         24    1.958333    .2041241          1          2

-------------------------------------------------------------------------------
-> op_appt_2019_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2019 |      4,329    7.512128    1.985019          3         14

-------------------------------------------------------------------------------
-> op_appt_2019_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2019 |          0


-------------------------------------------------------------------------------
-> op_appt_2019_orig_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
op_ap~9_orig |        512           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_2019_orig_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
op_ap~9_orig |         24    1.958333    .2041241          1          2

-------------------------------------------------------------------------------
-> op_appt_2019_orig_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
op_ap~9_orig |      4,464    7.508289    1.981637          3         14

(1685 missing values generated)

-------------------------------------------------------------------------------
-> op_appt_2020_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2020 |        319           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_2020_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2020 |         20         1.7    .4701623          1          2

-------------------------------------------------------------------------------
-> op_appt_2020_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2020 |      2,976    7.548051     1.99218          3         17

-------------------------------------------------------------------------------
-> op_appt_2020_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2020 |          0


-------------------------------------------------------------------------------
-> op_appt_2020_orig_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
op_ap~0_orig |        479           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_2020_orig_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
op_ap~0_orig |         26    1.730769    .4523443          1          2

-------------------------------------------------------------------------------
-> op_appt_2020_orig_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
op_ap~0_orig |      4,495    7.554171    1.971908          3         17

(3004 missing values generated)

-------------------------------------------------------------------------------
-> op_appt_2021_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2021 |        219           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_2021_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2021 |         10         1.9    .3162278          1          2

-------------------------------------------------------------------------------
-> op_appt_2021_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2021 |      1,767    7.569327    1.967352          3         14

-------------------------------------------------------------------------------
-> op_appt_2021_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2021 |          0


-------------------------------------------------------------------------------
-> op_appt_2021_orig_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
op_ap~1_orig |        501           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_2021_orig_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
op_ap~1_orig |         21    1.857143    .3585686          1          2

-------------------------------------------------------------------------------
-> op_appt_2021_orig_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
op_ap~1_orig |      4,478    7.556052    1.980102          3         15


. 
. * Calculate difference compared to 2019
. gen diff_op_2020 = outpatient_appt_2020 - outpatient_appt_2019
(1,685 missing values generated)

. gen diff_op_2021 = outpatient_appt_2021 - outpatient_appt_2020
(3,004 missing values generated)

. sum diff_op_2020 diff_op_2021, d

                        diff_op_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%          -10            -13
 5%           -7            -13
10%           -5            -12       Obs               3,315
25%           -2            -12       Sum of Wgt.       3,315

50%            0                      Mean           .1016591
                        Largest       Std. Dev.      4.208748
75%            2             13
90%            6             13       Variance       17.71356
95%            7             13       Skewness       .0272945
99%           10             14       Kurtosis       3.292158

                        diff_op_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%          -10            -12
 5%           -8            -12
10%           -6            -11       Obs               1,996
25%           -3            -11       Sum of Wgt.       1,996

50%            0                      Mean          -.1007014
                        Largest       Std. Dev.      4.232513
75%            2             11
90%            5             12       Variance       17.91416
95%            7             13       Skewness      -.0777913
99%           10             13       Kurtosis       3.216771

. * Categorise difference
. egen diff_op_cat_2020 = cut(diff_op_2020), at(-100, 0, 1, 100) icodes
(1685 missing values generated)

. egen diff_op_cat_2021 = cut(diff_op_2021), at(-100, 0, 1, 100) icodes
(3004 missing values generated)

. label define op_cat 0 "No appointments both years" 1 "Fewer appointments" 2 "
> Same number of appointments" 3 "More appointments"

. forvalues i=2020/2021 {
  2.     tab diff_op_cat_`i' op_appt_`i'_cat
  3.     * Update categories to include category of those with no appointments 
> in both years
.     replace diff_op_cat_`i' = diff_op_cat_`i' + 1
  4.     tab diff_op_cat_`i'
  5.     replace diff_op_cat_`i' = 0 if diff_op_cat_`i'==2 & op_appt_`i'_cat==0
  6.     tab diff_op_cat_`i'
  7.     label values diff_op_cat_`i' op_cat
  8. }

diff_op_ca |         op_appt_2020_cat
    t_2020 | No appoin  1-2 per y  3 or more |     Total
-----------+---------------------------------+----------
         0 |       285         17      1,104 |     1,406 
         1 |        34          0        390 |       424 
         2 |         0          3      1,482 |     1,485 
-----------+---------------------------------+----------
     Total |       319         20      2,976 |     3,315 
(3,315 real changes made)

diff_op_cat |
      _2020 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,406       42.41       42.41
          2 |        424       12.79       55.20
          3 |      1,485       44.80      100.00
------------+-----------------------------------
      Total |      3,315      100.00
(34 real changes made)

diff_op_cat |
      _2020 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         34        1.03        1.03
          1 |      1,406       42.41       43.44
          2 |        390       11.76       55.20
          3 |      1,485       44.80      100.00
------------+-----------------------------------
      Total |      3,315      100.00

diff_op_ca |         op_appt_2021_cat
    t_2021 | No appoin  1-2 per y  3 or more |     Total
-----------+---------------------------------+----------
         0 |       199         10        668 |       877 
         1 |        20          0        214 |       234 
         2 |         0          0        885 |       885 
-----------+---------------------------------+----------
     Total |       219         10      1,767 |     1,996 
(1,996 real changes made)

diff_op_cat |
      _2021 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        877       43.94       43.94
          2 |        234       11.72       55.66
          3 |        885       44.34      100.00
------------+-----------------------------------
      Total |      1,996      100.00
(20 real changes made)

diff_op_cat |
      _2021 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         20        1.00        1.00
          1 |        877       43.94       44.94
          2 |        214       10.72       55.66
          3 |        885       44.34      100.00
------------+-----------------------------------
      Total |      1,996      100.00

. 
. bys diff_op_cat_2020: sum diff_op_2020

-------------------------------------------------------------------------------
-> diff_op_cat_2020 = No appointments both years

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
diff_op_2020 |         34           0           0          0          0

-------------------------------------------------------------------------------
-> diff_op_cat_2020 = Fewer appointments

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
diff_op_2020 |      1,406   -3.633001    2.606129        -13         -1

-------------------------------------------------------------------------------
-> diff_op_cat_2020 = Same number of appointments

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
diff_op_2020 |        390           0           0          0          0

-------------------------------------------------------------------------------
-> diff_op_cat_2020 = More appointments

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
diff_op_2020 |      1,485    3.666667    2.681674          1         14

-------------------------------------------------------------------------------
-> diff_op_cat_2020 = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
diff_op_2020 |          0


. sum ra_hosp*, d

                        ra_hosp_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            3                      Mean             2.5232
                        Largest       Std. Dev.      1.050182
75%            3              6
90%            4              6       Variance       1.102882
95%            4              6       Skewness       .0283641
99%            5              6       Kurtosis       2.889874

                        ra_hosp_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            2                      Mean             2.5016
                        Largest       Std. Dev.      1.027525
75%            3              6
90%            4              6       Variance       1.055809
95%            4              6       Skewness       .0499132
99%            5              6       Kurtosis       2.953046

                        ra_hosp_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            3                      Mean             2.5232
                        Largest       Std. Dev.      1.044643
75%            3              6
90%            4              6       Variance        1.09128
95%            4              6       Skewness       .0311055
99%            5              6       Kurtosis       2.947278

                    ra_hosp_beddays_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            2                      Mean             2.4708
                        Largest       Std. Dev.      1.022035
75%            3              5
90%            4              5       Variance       1.044556
95%            4              6       Skewness       .0136891
99%            5              6       Kurtosis       2.871343

                    ra_hosp_beddays_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            2                      Mean             2.4778
                        Largest       Std. Dev.      1.032144
75%            3              6
90%            4              6       Variance        1.06532
95%            4              6       Skewness       -.005461
99%            5              6       Kurtosis       2.860424

                    ra_hosp_beddays_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            2                      Mean              2.504
                        Largest       Std. Dev.      1.045085
75%            3              6
90%            4              6       Variance       1.092202
95%            4              6       Skewness       .0603768
99%            5              6       Kurtosis       2.959919

. 
. preserve

. * Tabulate number of appointments per year of those with whole year available
. table1_mc, vars(op_appt_2019_cat cate \ op_appt_2020_cat cate \ op_appt_2021_
> cat cate \ diff_op_2020 conts \ diff_op_2021 conts \ diff_op_cat_2020 cate \ 
> diff_op_cat_2021 cate) clear

  +----------------------------------+
  | factor               N_1     m_1 |
  |----------------------------------|
  | op_appt_2019_cat   4,846     154 |
  |----------------------------------|
  | op_appt_2020_cat   3,315   1,685 |
  |----------------------------------|
  | op_appt_2021_cat   1,996   3,004 |
  |----------------------------------|
  | diff_op_2020       3,315   1,685 |
  |----------------------------------|
  | diff_op_2021       1,996   3,004 |
  |----------------------------------|
  | diff_op_cat_2020   3,315   1,685 |
  |----------------------------------|
  | diff_op_cat_2021   1,996   3,004 |
  +----------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------+
  |                                                  Total         |
  |----------------------------------------------------------------|
  |                                                  N=5,000       |
  |----------------------------------------------------------------|
  | op_appt_2019_cat   No appointments               493 (10.2%)   |
  |                    1-2 per year                  24 ( 0.5%)    |
  |                    3 or more per year            4,329 (89.3%) |
  |----------------------------------------------------------------|
  | op_appt_2020_cat   No appointments               319 ( 9.6%)   |
  |                    1-2 per year                  20 ( 0.6%)    |
  |                    3 or more per year            2,976 (89.8%) |
  |----------------------------------------------------------------|
  | op_appt_2021_cat   No appointments               219 (11.0%)   |
  |                    1-2 per year                  10 ( 0.5%)    |
  |                    3 or more per year            1,767 (88.5%) |
  |----------------------------------------------------------------|
  | diff_op_2020                                     0 (-2-2)      |
  |----------------------------------------------------------------|
  | diff_op_2021                                     0 (-3-2)      |
  |----------------------------------------------------------------|
  | diff_op_cat_2020   No appointments both years    34 ( 1.0%)    |
  |                    Fewer appointments            1,406 (42.4%) |
  |                    Same number of appointments   390 (11.8%)   |
  |                    More appointments             1,485 (44.8%) |
  |----------------------------------------------------------------|
  | diff_op_cat_2021   No appointments both years    20 ( 1.0%)    |
  |                    Fewer appointments            877 (43.9%)   |
  |                    Same number of appointments   214 (10.7%)   |
  |                    More appointments             885 (44.3%)   |
  +----------------------------------------------------------------+
Data are presented as median (IQR) for continuous measures, and n (%) for categ
> orical measures.
 

. export delimited using ./output/tables/op_appt_yrs.csv
file ./output/tables/op_appt_yrs.csv saved

. restore 

. preserve

. * Tabulate number of appointments per year
. table1_mc, vars(op_appt_2019_orig_cat cate \ op_appt_2020_orig_cat cate \ op_
> appt_2021_orig_cat cate) clear

  +-------------------------------------+
  | factor                    N_1   m_1 |
  |-------------------------------------|
  | op_appt_2019_orig_cat   5,000     0 |
  |-------------------------------------|
  | op_appt_2020_orig_cat   5,000     0 |
  |-------------------------------------|
  | op_appt_2021_orig_cat   5,000     0 |
  +-------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +------------------------------------------------------------+
  |                                              Total         |
  |------------------------------------------------------------|
  |                                              N=5,000       |
  |------------------------------------------------------------|
  | op_appt_2019_orig_cat   No appointments      512 (10.2%)   |
  |                         1-2 per year         24 ( 0.5%)    |
  |                         3 or more per year   4,464 (89.3%) |
  |------------------------------------------------------------|
  | op_appt_2020_orig_cat   No appointments      479 ( 9.6%)   |
  |                         1-2 per year         26 ( 0.5%)    |
  |                         3 or more per year   4,495 (89.9%) |
  |------------------------------------------------------------|
  | op_appt_2021_orig_cat   No appointments      501 (10.0%)   |
  |                         1-2 per year         21 ( 0.4%)    |
  |                         3 or more per year   4,478 (89.6%) |
  +------------------------------------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/op_appt_orig_yrs.csv
file ./output/tables/op_appt_orig_yrs.csv saved

. restore 

. /*preserve
> *Tabulate number of appointments per year
> table1_mc, vars(ra_hosp_2019 cate \ ra_hosp_2020 cate \ ra_hosp_2021 cate) cl
> ear
> export delimited using ./output/tables/ra_hosp.csv
> restore */
. * Tabulate overall characteristics 
. preserve

. table1_mc, vars(age_cat cate \ male cate \ urban_rural_5 cate \ prescribed_bi
> ologics cate \ imd cate \  smoking cate \ time_ra contn \ bmi_cat cate) clear

  +------------------------------------------------+
  | factor                             N_1     m_1 |
  |------------------------------------------------|
  | age_cat                          3,997   1,003 |
  |------------------------------------------------|
  | male                             5,000       0 |
  |------------------------------------------------|
  | Rural Urban in five categories   5,000       0 |
  |------------------------------------------------|
  | prescribed_biologics             5,000       0 |
  |------------------------------------------------|
  | imd                              5,000       0 |
  |------------------------------------------------|
  | smoking                          5,000       0 |
  |------------------------------------------------|
  | time_ra                          2,234   2,766 |
  |------------------------------------------------|
  | bmi_cat                          4,999       1 |
  +------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=5,000     
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 1,453 (36.4%
> )       |
  |                                  41 - 60 years                 1,327 (33.2%
> )       |
  |                                  61 - 80 years                 972 (24.3%) 
>         |
  |                                  >80 years                     245 ( 6.1%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        2,522 (50.4%
> )       |
  |                                  Male                          2,478 (49.6%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       631 (12.6%) 
>         |
  |                                  Urban minor conurbation       646 (12.9%) 
>         |
  |                                  Urban city and town           1,227 (24.5%
> )       |
  |                                  Rural town and fringe         1,258 (25.2%
> )       |
  |                                  Rural village and dispersed   1,238 (24.8%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             2,496 (49.9%
> )       |
  |                                  1                             2,504 (50.1%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             237 ( 4.7%) 
>         |
  |                                  1                             922 (18.4%) 
>         |
  |                                  2                             964 (19.3%) 
>         |
  |                                  3                             953 (19.1%) 
>         |
  |                                  4                             977 (19.5%) 
>         |
  |                                  5                             947 (18.9%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  468 ( 9.4%) 
>         |
  |                                  Current smoker                1,024 (20.5%
> )       |
  |                                  Ex-smoker                     791 (15.8%) 
>         |
  |                                  Unknown                       2,717 (54.3%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        54.24187 (32
> .12725) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       1,013 (20.3%
> )       |
  |                                  Underweight                   457 ( 9.1%) 
>         |
  |                                  Healthy range                 881 (17.6%) 
>         |
  |                                  Overweight                    1,033 (20.7%
> )       |
  |                                  Obese                         1,367 (27.3%
> )       |
  |                                  Morbidly obese                248 ( 5.0%) 
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 

. export delimited using ./output/tables/op_chars.csv
file ./output/tables/op_chars.csv saved

. restore

. * Tabulate characteristics by category of outpatient appointments for each ye
> ar
. tempfile tempfile

. forvalues i=2019/2021 {
  2.     preserve
  3.     keep if op_appt_`i'_cat==0
  4.     table1_mc, vars(age_cat cate \ male cate \ urban_rural_5 cate \ prescr
> ibed_biologics cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat cate)
>  clear
  5.     save `tempfile', replace
  6.     restore
  7.     forvalues j=1/2 {
  8.         preserve
  9.         keep if op_appt_`i'_cat==`j'
 10.         table1_mc, vars(age_cat cate \ male cate \ urban_rural_5 cate \ pr
> escribed_biologics cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat c
> ate) clear
 11.         append using `tempfile'
 12.         save `tempfile', replace
 13.         if `j'==2 {
 14.             export delimited using ./output/tables/characteristics_strata`
> i'.csv
 15.         }
 16.         restore
 17.     }
 18.    
.     * Tabulate characteristics by whether hospitalised with RA for each year
.     preserve
 19.     keep if ra_hosp_`i'==0
 20.     table1_mc, vars(age_cat cate \ male cate \ urban_rural_5 cate \ prescr
> ibed_biologics cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat cate)
>  clear
 21.     save `tempfile', replace
 22.     restore
 23.     preserve
 24.     keep if ra_hosp_`i'==1
 25.     table1_mc, vars(age_cat cate \ male cate \ urban_rural_5 cate \ prescr
> ibed_biologics cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat cate)
>  clear
 26.     append using `tempfile'
 27.     save `tempfile', replace
 28.     export delimited using ./output/tables/characteristics_ra_hosp_`i'.csv
 29.     restore
 30.     }
(4,507 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                          393   100 |
  |--------------------------------------------|
  | male                             493     0 |
  |--------------------------------------------|
  | Rural Urban in five categories   493     0 |
  |--------------------------------------------|
  | prescribed_biologics             493     0 |
  |--------------------------------------------|
  | imd                              493     0 |
  |--------------------------------------------|
  | smoking                          493     0 |
  |--------------------------------------------|
  | time_ra                          222   271 |
  |--------------------------------------------|
  | bmi_cat                          493     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=493       
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 133 (33.8%) 
>         |
  |                                  41 - 60 years                 132 (33.6%) 
>         |
  |                                  61 - 80 years                 99 (25.2%)  
>         |
  |                                  >80 years                     29 ( 7.4%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        248 (50.3%) 
>         |
  |                                  Male                          245 (49.7%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       57 (11.6%)  
>         |
  |                                  Urban minor conurbation       68 (13.8%)  
>         |
  |                                  Urban city and town           110 (22.3%) 
>         |
  |                                  Rural town and fringe         140 (28.4%) 
>         |
  |                                  Rural village and dispersed   118 (23.9%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             248 (50.3%) 
>         |
  |                                  1                             245 (49.7%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             20 ( 4.1%)  
>         |
  |                                  1                             84 (17.0%)  
>         |
  |                                  2                             107 (21.7%) 
>         |
  |                                  3                             100 (20.3%) 
>         |
  |                                  4                             86 (17.4%)  
>         |
  |                                  5                             96 (19.5%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  60 (12.2%)  
>         |
  |                                  Current smoker                97 (19.7%)  
>         |
  |                                  Ex-smoker                     87 (17.6%)  
>         |
  |                                  Unknown                       249 (50.5%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        55.83794 (32
> .29805) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       84 (17.0%)  
>         |
  |                                  Underweight                   48 ( 9.7%)  
>         |
  |                                  Healthy range                 93 (18.9%)  
>         |
  |                                  Overweight                    107 (21.7%) 
>         |
  |                                  Obese                         137 (27.8%) 
>         |
  |                                  Morbidly obese                24 ( 4.9%)  
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
(note: file /tmp/St00011.000004 not found)
file /tmp/St00011.000004 saved
(4,976 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                           17     7 |
  |--------------------------------------------|
  | male                              24     0 |
  |--------------------------------------------|
  | Rural Urban in five categories    24     0 |
  |--------------------------------------------|
  | prescribed_biologics              24     0 |
  |--------------------------------------------|
  | imd                               24     0 |
  |--------------------------------------------|
  | smoking                           24     0 |
  |--------------------------------------------|
  | time_ra                           11    13 |
  |--------------------------------------------|
  | bmi_cat                           24     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=24        
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 5 (29%)     
>         |
  |                                  41 - 60 years                 6 (35%)     
>         |
  |                                  61 - 80 years                 6 (35%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        16 (67%)    
>         |
  |                                  Male                          8 (33%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       3 (12%)     
>         |
  |                                  Urban minor conurbation       4 (17%)     
>         |
  |                                  Urban city and town           8 (33%)     
>         |
  |                                  Rural town and fringe         4 (17%)     
>         |
  |                                  Rural village and dispersed   5 (21%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             10 (42%)    
>         |
  |                                  1                             14 (58%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             1 ( 4%)     
>         |
  |                                  1                             6 (25%)     
>         |
  |                                  2                             8 (33%)     
>         |
  |                                  3                             2 ( 8%)     
>         |
  |                                  4                             3 (12%)     
>         |
  |                                  5                             4 (17%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  3 (12%)     
>         |
  |                                  Current smoker                4 (17%)     
>         |
  |                                  Ex-smoker                     5 (21%)     
>         |
  |                                  Unknown                       12 (50%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        48.47514 (31
> .48024) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       4 (17%)     
>         |
  |                                  Underweight                   2 ( 8%)     
>         |
  |                                  Healthy range                 4 (17%)     
>         |
  |                                  Overweight                    6 (25%)     
>         |
  |                                  Obese                         5 (21%)     
>         |
  |                                  Morbidly obese                3 (12%)     
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000004 saved
(671 observations deleted)

  +------------------------------------------------+
  | factor                             N_1     m_1 |
  |------------------------------------------------|
  | age_cat                          3,455     874 |
  |------------------------------------------------|
  | male                             4,329       0 |
  |------------------------------------------------|
  | Rural Urban in five categories   4,329       0 |
  |------------------------------------------------|
  | prescribed_biologics             4,329       0 |
  |------------------------------------------------|
  | imd                              4,329       0 |
  |------------------------------------------------|
  | smoking                          4,329       0 |
  |------------------------------------------------|
  | time_ra                          1,934   2,395 |
  |------------------------------------------------|
  | bmi_cat                          4,328       1 |
  +------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=4,329     
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 1,276 (36.9%
> )       |
  |                                  41 - 60 years                 1,145 (33.1%
> )       |
  |                                  61 - 80 years                 825 (23.9%) 
>         |
  |                                  >80 years                     209 ( 6.0%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        2,183 (50.4%
> )       |
  |                                  Male                          2,146 (49.6%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       554 (12.8%) 
>         |
  |                                  Urban minor conurbation       557 (12.9%) 
>         |
  |                                  Urban city and town           1,072 (24.8%
> )       |
  |                                  Rural town and fringe         1,074 (24.8%
> )       |
  |                                  Rural village and dispersed   1,072 (24.8%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             2,168 (50.1%
> )       |
  |                                  1                             2,161 (49.9%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             208 ( 4.8%) 
>         |
  |                                  1                             810 (18.7%) 
>         |
  |                                  2                             817 (18.9%) 
>         |
  |                                  3                             824 (19.0%) 
>         |
  |                                  4                             860 (19.9%) 
>         |
  |                                  5                             810 (18.7%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  393 ( 9.1%) 
>         |
  |                                  Current smoker                897 (20.7%) 
>         |
  |                                  Ex-smoker                     669 (15.5%) 
>         |
  |                                  Unknown                       2,370 (54.7%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        53.98475 (32
> .20507) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       898 (20.7%) 
>         |
  |                                  Underweight                   387 ( 8.9%) 
>         |
  |                                  Healthy range                 759 (17.5%) 
>         |
  |                                  Overweight                    883 (20.4%) 
>         |
  |                                  Obese                         1,186 (27.4%
> )       |
  |                                  Morbidly obese                215 ( 5.0%) 
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000004 saved
file ./output/tables/characteristics_strata2019.csv saved
(4,886 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                           91    23 |
  |--------------------------------------------|
  | male                             114     0 |
  |--------------------------------------------|
  | Rural Urban in five categories   114     0 |
  |--------------------------------------------|
  | prescribed_biologics             114     0 |
  |--------------------------------------------|
  | imd                              114     0 |
  |--------------------------------------------|
  | smoking                          114     0 |
  |--------------------------------------------|
  | time_ra                           43    71 |
  |--------------------------------------------|
  | bmi_cat                          114     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=114       
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 31 (34%)    
>         |
  |                                  41 - 60 years                 33 (36%)    
>         |
  |                                  61 - 80 years                 17 (19%)    
>         |
  |                                  >80 years                     10 (11%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        52 (45.6%)  
>         |
  |                                  Male                          62 (54.4%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       10 ( 8.8%)  
>         |
  |                                  Urban minor conurbation       16 (14.0%)  
>         |
  |                                  Urban city and town           24 (21.1%)  
>         |
  |                                  Rural town and fringe         39 (34.2%)  
>         |
  |                                  Rural village and dispersed   25 (21.9%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             54 (47.4%)  
>         |
  |                                  1                             60 (52.6%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             10 ( 8.8%)  
>         |
  |                                  1                             23 (20.2%)  
>         |
  |                                  2                             19 (16.7%)  
>         |
  |                                  3                             18 (15.8%)  
>         |
  |                                  4                             23 (20.2%)  
>         |
  |                                  5                             21 (18.4%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  9 ( 7.9%)   
>         |
  |                                  Current smoker                18 (15.8%)  
>         |
  |                                  Ex-smoker                     23 (20.2%)  
>         |
  |                                  Unknown                       64 (56.1%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        52.35452 (32
> .17175) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       24 (21.1%)  
>         |
  |                                  Underweight                   10 ( 8.8%)  
>         |
  |                                  Healthy range                 25 (21.9%)  
>         |
  |                                  Overweight                    18 (15.8%)  
>         |
  |                                  Obese                         33 (28.9%)  
>         |
  |                                  Morbidly obese                4 ( 3.5%)   
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000004 saved
(4,324 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                          537   139 |
  |--------------------------------------------|
  | male                             676     0 |
  |--------------------------------------------|
  | Rural Urban in five categories   676     0 |
  |--------------------------------------------|
  | prescribed_biologics             676     0 |
  |--------------------------------------------|
  | imd                              676     0 |
  |--------------------------------------------|
  | smoking                          676     0 |
  |--------------------------------------------|
  | time_ra                          302   374 |
  |--------------------------------------------|
  | bmi_cat                          676     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=676       
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 204 (38.0%) 
>         |
  |                                  41 - 60 years                 175 (32.6%) 
>         |
  |                                  61 - 80 years                 128 (23.8%) 
>         |
  |                                  >80 years                     30 ( 5.6%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        322 (47.6%) 
>         |
  |                                  Male                          354 (52.4%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       89 (13.2%)  
>         |
  |                                  Urban minor conurbation       77 (11.4%)  
>         |
  |                                  Urban city and town           179 (26.5%) 
>         |
  |                                  Rural town and fringe         165 (24.4%) 
>         |
  |                                  Rural village and dispersed   166 (24.6%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             316 (46.7%) 
>         |
  |                                  1                             360 (53.3%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             28 ( 4.1%)  
>         |
  |                                  1                             131 (19.4%) 
>         |
  |                                  2                             121 (17.9%) 
>         |
  |                                  3                             145 (21.4%) 
>         |
  |                                  4                             120 (17.8%) 
>         |
  |                                  5                             131 (19.4%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  66 ( 9.8%)  
>         |
  |                                  Current smoker                129 (19.1%) 
>         |
  |                                  Ex-smoker                     110 (16.3%) 
>         |
  |                                  Unknown                       371 (54.9%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        54.73965 (32
> .09419) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       122 (18.0%) 
>         |
  |                                  Underweight                   61 ( 9.0%)  
>         |
  |                                  Healthy range                 119 (17.6%) 
>         |
  |                                  Overweight                    149 (22.0%) 
>         |
  |                                  Obese                         183 (27.1%) 
>         |
  |                                  Morbidly obese                42 ( 6.2%)  
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000004 saved
file ./output/tables/characteristics_ra_hosp_2019.csv saved
(4,681 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                          253    66 |
  |--------------------------------------------|
  | male                             319     0 |
  |--------------------------------------------|
  | Rural Urban in five categories   319     0 |
  |--------------------------------------------|
  | prescribed_biologics             319     0 |
  |--------------------------------------------|
  | imd                              319     0 |
  |--------------------------------------------|
  | smoking                          319     0 |
  |--------------------------------------------|
  | time_ra                          140   179 |
  |--------------------------------------------|
  | bmi_cat                          319     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=319       
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 85 (33.6%)  
>         |
  |                                  41 - 60 years                 91 (36.0%)  
>         |
  |                                  61 - 80 years                 64 (25.3%)  
>         |
  |                                  >80 years                     13 ( 5.1%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        153 (48.0%) 
>         |
  |                                  Male                          166 (52.0%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       48 (15.0%)  
>         |
  |                                  Urban minor conurbation       37 (11.6%)  
>         |
  |                                  Urban city and town           88 (27.6%)  
>         |
  |                                  Rural town and fringe         79 (24.8%)  
>         |
  |                                  Rural village and dispersed   67 (21.0%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             148 (46.4%) 
>         |
  |                                  1                             171 (53.6%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             10 ( 3.1%)  
>         |
  |                                  1                             69 (21.6%)  
>         |
  |                                  2                             69 (21.6%)  
>         |
  |                                  3                             60 (18.8%)  
>         |
  |                                  4                             55 (17.2%)  
>         |
  |                                  5                             56 (17.6%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  32 (10.0%)  
>         |
  |                                  Current smoker                58 (18.2%)  
>         |
  |                                  Ex-smoker                     48 (15.0%)  
>         |
  |                                  Unknown                       181 (56.7%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        51.79059 (31
> .45862) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       62 (19.4%)  
>         |
  |                                  Underweight                   34 (10.7%)  
>         |
  |                                  Healthy range                 53 (16.6%)  
>         |
  |                                  Overweight                    58 (18.2%)  
>         |
  |                                  Obese                         93 (29.2%)  
>         |
  |                                  Morbidly obese                19 ( 6.0%)  
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000004 saved
(4,980 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                           15     5 |
  |--------------------------------------------|
  | male                              20     0 |
  |--------------------------------------------|
  | Rural Urban in five categories    20     0 |
  |--------------------------------------------|
  | prescribed_biologics              20     0 |
  |--------------------------------------------|
  | imd                               20     0 |
  |--------------------------------------------|
  | smoking                           20     0 |
  |--------------------------------------------|
  | time_ra                           12     8 |
  |--------------------------------------------|
  | bmi_cat                           20     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=20        
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 4 (27%)     
>         |
  |                                  41 - 60 years                 6 (40%)     
>         |
  |                                  61 - 80 years                 4 (27%)     
>         |
  |                                  >80 years                     1 ( 7%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        9 (45%)     
>         |
  |                                  Male                          11 (55%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       4 (20%)     
>         |
  |                                  Urban minor conurbation       1 ( 5%)     
>         |
  |                                  Urban city and town           6 (30%)     
>         |
  |                                  Rural town and fringe         3 (15%)     
>         |
  |                                  Rural village and dispersed   6 (30%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             7 (35%)     
>         |
  |                                  1                             13 (65%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             1 ( 5%)     
>         |
  |                                  1                             4 (20%)     
>         |
  |                                  2                             5 (25%)     
>         |
  |                                  3                             3 (15%)     
>         |
  |                                  4                             3 (15%)     
>         |
  |                                  5                             4 (20%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  4 (20%)     
>         |
  |                                  Current smoker                3 (15%)     
>         |
  |                                  Ex-smoker                     2 (10%)     
>         |
  |                                  Unknown                       11 (55%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        50.61693 (37
> .20114) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       4 (20%)     
>         |
  |                                  Healthy range                 2 (10%)     
>         |
  |                                  Overweight                    6 (30%)     
>         |
  |                                  Obese                         8 (40%)     
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000004 saved
(2,024 observations deleted)

  +------------------------------------------------+
  | factor                             N_1     m_1 |
  |------------------------------------------------|
  | age_cat                          2,391     585 |
  |------------------------------------------------|
  | male                             2,976       0 |
  |------------------------------------------------|
  | Rural Urban in five categories   2,976       0 |
  |------------------------------------------------|
  | prescribed_biologics             2,976       0 |
  |------------------------------------------------|
  | imd                              2,976       0 |
  |------------------------------------------------|
  | smoking                          2,976       0 |
  |------------------------------------------------|
  | time_ra                          1,313   1,663 |
  |------------------------------------------------|
  | bmi_cat                          2,976       0 |
  +------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=2,976     
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 896 (37.5%) 
>         |
  |                                  41 - 60 years                 769 (32.2%) 
>         |
  |                                  61 - 80 years                 577 (24.1%) 
>         |
  |                                  >80 years                     149 ( 6.2%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        1,537 (51.6%
> )       |
  |                                  Male                          1,439 (48.4%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       375 (12.6%) 
>         |
  |                                  Urban minor conurbation       395 (13.3%) 
>         |
  |                                  Urban city and town           725 (24.4%) 
>         |
  |                                  Rural town and fringe         763 (25.6%) 
>         |
  |                                  Rural village and dispersed   718 (24.1%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             1,490 (50.1%
> )       |
  |                                  1                             1,486 (49.9%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             136 ( 4.6%) 
>         |
  |                                  1                             557 (18.7%) 
>         |
  |                                  2                             547 (18.4%) 
>         |
  |                                  3                             560 (18.8%) 
>         |
  |                                  4                             602 (20.2%) 
>         |
  |                                  5                             574 (19.3%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  269 ( 9.0%) 
>         |
  |                                  Current smoker                648 (21.8%) 
>         |
  |                                  Ex-smoker                     467 (15.7%) 
>         |
  |                                  Unknown                       1,592 (53.5%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        54.03145 (32
> .47834) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       613 (20.6%) 
>         |
  |                                  Underweight                   270 ( 9.1%) 
>         |
  |                                  Healthy range                 537 (18.0%) 
>         |
  |                                  Overweight                    606 (20.4%) 
>         |
  |                                  Obese                         800 (26.9%) 
>         |
  |                                  Morbidly obese                150 ( 5.0%) 
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000004 saved
file ./output/tables/characteristics_strata2020.csv saved
(4,893 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                           91    16 |
  |--------------------------------------------|
  | male                             107     0 |
  |--------------------------------------------|
  | Rural Urban in five categories   107     0 |
  |--------------------------------------------|
  | prescribed_biologics             107     0 |
  |--------------------------------------------|
  | imd                              107     0 |
  |--------------------------------------------|
  | smoking                          107     0 |
  |--------------------------------------------|
  | time_ra                           55    52 |
  |--------------------------------------------|
  | bmi_cat                          107     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=107       
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 44 (48%)    
>         |
  |                                  41 - 60 years                 28 (31%)    
>         |
  |                                  61 - 80 years                 12 (13%)    
>         |
  |                                  >80 years                     7 ( 8%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        51 (47.7%)  
>         |
  |                                  Male                          56 (52.3%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       13 (12.1%)  
>         |
  |                                  Urban minor conurbation       18 (16.8%)  
>         |
  |                                  Urban city and town           26 (24.3%)  
>         |
  |                                  Rural town and fringe         25 (23.4%)  
>         |
  |                                  Rural village and dispersed   25 (23.4%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             50 (46.7%)  
>         |
  |                                  1                             57 (53.3%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             5 ( 4.7%)   
>         |
  |                                  1                             19 (17.8%)  
>         |
  |                                  2                             19 (17.8%)  
>         |
  |                                  3                             20 (18.7%)  
>         |
  |                                  4                             26 (24.3%)  
>         |
  |                                  5                             18 (16.8%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  13 (12.1%)  
>         |
  |                                  Current smoker                26 (24.3%)  
>         |
  |                                  Ex-smoker                     17 (15.9%)  
>         |
  |                                  Unknown                       51 (47.7%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        60.48759 (35
> .17287) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       25 (23.4%)  
>         |
  |                                  Underweight                   5 ( 4.7%)   
>         |
  |                                  Healthy range                 21 (19.6%)  
>         |
  |                                  Overweight                    24 (22.4%)  
>         |
  |                                  Obese                         27 (25.2%)  
>         |
  |                                  Morbidly obese                5 ( 4.7%)   
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000004 saved
(4,333 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                          527   140 |
  |--------------------------------------------|
  | male                             667     0 |
  |--------------------------------------------|
  | Rural Urban in five categories   667     0 |
  |--------------------------------------------|
  | prescribed_biologics             667     0 |
  |--------------------------------------------|
  | imd                              667     0 |
  |--------------------------------------------|
  | smoking                          667     0 |
  |--------------------------------------------|
  | time_ra                          309   358 |
  |--------------------------------------------|
  | bmi_cat                          667     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=667       
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 194 (36.8%) 
>         |
  |                                  41 - 60 years                 160 (30.4%) 
>         |
  |                                  61 - 80 years                 141 (26.8%) 
>         |
  |                                  >80 years                     32 ( 6.1%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        339 (50.8%) 
>         |
  |                                  Male                          328 (49.2%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       102 (15.3%) 
>         |
  |                                  Urban minor conurbation       81 (12.1%)  
>         |
  |                                  Urban city and town           154 (23.1%) 
>         |
  |                                  Rural town and fringe         150 (22.5%) 
>         |
  |                                  Rural village and dispersed   180 (27.0%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             316 (47.4%) 
>         |
  |                                  1                             351 (52.6%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             22 ( 3.3%)  
>         |
  |                                  1                             123 (18.4%) 
>         |
  |                                  2                             135 (20.2%) 
>         |
  |                                  3                             117 (17.5%) 
>         |
  |                                  4                             136 (20.4%) 
>         |
  |                                  5                             134 (20.1%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  61 ( 9.1%)  
>         |
  |                                  Current smoker                131 (19.6%) 
>         |
  |                                  Ex-smoker                     104 (15.6%) 
>         |
  |                                  Unknown                       371 (55.6%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        52.83835 (31
> .36021) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       124 (18.6%) 
>         |
  |                                  Underweight                   63 ( 9.4%)  
>         |
  |                                  Healthy range                 122 (18.3%) 
>         |
  |                                  Overweight                    134 (20.1%) 
>         |
  |                                  Obese                         188 (28.2%) 
>         |
  |                                  Morbidly obese                36 ( 5.4%)  
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000004 saved
file ./output/tables/characteristics_ra_hosp_2020.csv saved
(4,781 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                          184    35 |
  |--------------------------------------------|
  | male                             219     0 |
  |--------------------------------------------|
  | Rural Urban in five categories   219     0 |
  |--------------------------------------------|
  | prescribed_biologics             219     0 |
  |--------------------------------------------|
  | imd                              219     0 |
  |--------------------------------------------|
  | smoking                          219     0 |
  |--------------------------------------------|
  | time_ra                           90   129 |
  |--------------------------------------------|
  | bmi_cat                          219     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=219       
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 59 (32.1%)  
>         |
  |                                  41 - 60 years                 64 (34.8%)  
>         |
  |                                  61 - 80 years                 52 (28.3%)  
>         |
  |                                  >80 years                     9 ( 4.9%)   
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        107 (48.9%) 
>         |
  |                                  Male                          112 (51.1%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       31 (14.2%)  
>         |
  |                                  Urban minor conurbation       29 (13.2%)  
>         |
  |                                  Urban city and town           49 (22.4%)  
>         |
  |                                  Rural town and fringe         54 (24.7%)  
>         |
  |                                  Rural village and dispersed   56 (25.6%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             116 (53.0%) 
>         |
  |                                  1                             103 (47.0%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             12 ( 5.5%)  
>         |
  |                                  1                             38 (17.4%)  
>         |
  |                                  2                             44 (20.1%)  
>         |
  |                                  3                             37 (16.9%)  
>         |
  |                                  4                             45 (20.5%)  
>         |
  |                                  5                             43 (19.6%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  18 ( 8.2%)  
>         |
  |                                  Current smoker                56 (25.6%)  
>         |
  |                                  Ex-smoker                     39 (17.8%)  
>         |
  |                                  Unknown                       106 (48.4%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        52.71738 (31
> .98901) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       47 (21.5%)  
>         |
  |                                  Underweight                   31 (14.2%)  
>         |
  |                                  Healthy range                 37 (16.9%)  
>         |
  |                                  Overweight                    38 (17.4%)  
>         |
  |                                  Obese                         53 (24.2%)  
>         |
  |                                  Morbidly obese                13 ( 5.9%)  
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000004 saved
(4,990 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                           10     0 |
  |--------------------------------------------|
  | male                              10     0 |
  |--------------------------------------------|
  | Rural Urban in five categories    10     0 |
  |--------------------------------------------|
  | prescribed_biologics              10     0 |
  |--------------------------------------------|
  | imd                               10     0 |
  |--------------------------------------------|
  | smoking                           10     0 |
  |--------------------------------------------|
  | time_ra                            3     7 |
  |--------------------------------------------|
  | bmi_cat                           10     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=10        
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 4 (40%)     
>         |
  |                                  41 - 60 years                 1 (10%)     
>         |
  |                                  61 - 80 years                 5 (50%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        3 (30%)     
>         |
  |                                  Male                          7 (70%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       2 (20%)     
>         |
  |                                  Urban minor conurbation       1 (10%)     
>         |
  |                                  Rural town and fringe         3 (30%)     
>         |
  |                                  Rural village and dispersed   4 (40%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             4 (40%)     
>         |
  |                                  1                             6 (60%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             3 (30%)     
>         |
  |                                  2                             5 (50%)     
>         |
  |                                  3                             1 (10%)     
>         |
  |                                  4                             1 (10%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  2 (20%)     
>         |
  |                                  Current smoker                3 (30%)     
>         |
  |                                  Ex-smoker                     2 (20%)     
>         |
  |                                  Unknown                       3 (30%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        50.25781 (15
> .81225) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       3 (30%)     
>         |
  |                                  Healthy range                 2 (20%)     
>         |
  |                                  Overweight                    1 (10%)     
>         |
  |                                  Obese                         3 (30%)     
>         |
  |                                  Morbidly obese                1 (10%)     
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000004 saved
(3,233 observations deleted)

  +----------------------------------------------+
  | factor                             N_1   m_1 |
  |----------------------------------------------|
  | age_cat                          1,407   360 |
  |----------------------------------------------|
  | male                             1,767     0 |
  |----------------------------------------------|
  | Rural Urban in five categories   1,767     0 |
  |----------------------------------------------|
  | prescribed_biologics             1,767     0 |
  |----------------------------------------------|
  | imd                              1,767     0 |
  |----------------------------------------------|
  | smoking                          1,767     0 |
  |----------------------------------------------|
  | time_ra                            771   996 |
  |----------------------------------------------|
  | bmi_cat                          1,767     0 |
  +----------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=1,767     
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 541 (38.5%) 
>         |
  |                                  41 - 60 years                 458 (32.6%) 
>         |
  |                                  61 - 80 years                 327 (23.2%) 
>         |
  |                                  >80 years                     81 ( 5.8%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        910 (51.5%) 
>         |
  |                                  Male                          857 (48.5%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       211 (11.9%) 
>         |
  |                                  Urban minor conurbation       233 (13.2%) 
>         |
  |                                  Urban city and town           474 (26.8%) 
>         |
  |                                  Rural town and fringe         432 (24.4%) 
>         |
  |                                  Rural village and dispersed   417 (23.6%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             868 (49.1%) 
>         |
  |                                  1                             899 (50.9%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             64 ( 3.6%)  
>         |
  |                                  1                             343 (19.4%) 
>         |
  |                                  2                             320 (18.1%) 
>         |
  |                                  3                             339 (19.2%) 
>         |
  |                                  4                             350 (19.8%) 
>         |
  |                                  5                             351 (19.9%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  150 ( 8.5%) 
>         |
  |                                  Current smoker                368 (20.8%) 
>         |
  |                                  Ex-smoker                     267 (15.1%) 
>         |
  |                                  Unknown                       982 (55.6%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        54.68369 (32
> .74492) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       388 (22.0%) 
>         |
  |                                  Underweight                   170 ( 9.6%) 
>         |
  |                                  Healthy range                 312 (17.7%) 
>         |
  |                                  Overweight                    335 (19.0%) 
>         |
  |                                  Obese                         474 (26.8%) 
>         |
  |                                  Morbidly obese                88 ( 5.0%)  
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000004 saved
file ./output/tables/characteristics_strata2021.csv saved
(4,886 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                           90    24 |
  |--------------------------------------------|
  | male                             114     0 |
  |--------------------------------------------|
  | Rural Urban in five categories   114     0 |
  |--------------------------------------------|
  | prescribed_biologics             114     0 |
  |--------------------------------------------|
  | imd                              114     0 |
  |--------------------------------------------|
  | smoking                          114     0 |
  |--------------------------------------------|
  | time_ra                           52    62 |
  |--------------------------------------------|
  | bmi_cat                          114     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=114       
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 31 (34%)    
>         |
  |                                  41 - 60 years                 27 (30%)    
>         |
  |                                  61 - 80 years                 28 (31%)    
>         |
  |                                  >80 years                     4 ( 4%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        61 (53.5%)  
>         |
  |                                  Male                          53 (46.5%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       16 (14.0%)  
>         |
  |                                  Urban minor conurbation       13 (11.4%)  
>         |
  |                                  Urban city and town           23 (20.2%)  
>         |
  |                                  Rural town and fringe         30 (26.3%)  
>         |
  |                                  Rural village and dispersed   32 (28.1%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             62 (54.4%)  
>         |
  |                                  1                             52 (45.6%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             7 ( 6.1%)   
>         |
  |                                  1                             30 (26.3%)  
>         |
  |                                  2                             22 (19.3%)  
>         |
  |                                  3                             19 (16.7%)  
>         |
  |                                  4                             19 (16.7%)  
>         |
  |                                  5                             17 (14.9%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  6 ( 5.3%)   
>         |
  |                                  Current smoker                18 (15.8%)  
>         |
  |                                  Ex-smoker                     19 (16.7%)  
>         |
  |                                  Unknown                       71 (62.3%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        51.04181 (32
> .67717) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       23 (20.2%)  
>         |
  |                                  Underweight                   13 (11.4%)  
>         |
  |                                  Healthy range                 13 (11.4%)  
>         |
  |                                  Overweight                    28 (24.6%)  
>         |
  |                                  Obese                         30 (26.3%)  
>         |
  |                                  Morbidly obese                7 ( 6.1%)   
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000004 saved
(4,335 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                          539   126 |
  |--------------------------------------------|
  | male                             665     0 |
  |--------------------------------------------|
  | Rural Urban in five categories   665     0 |
  |--------------------------------------------|
  | prescribed_biologics             665     0 |
  |--------------------------------------------|
  | imd                              665     0 |
  |--------------------------------------------|
  | smoking                          665     0 |
  |--------------------------------------------|
  | time_ra                          270   395 |
  |--------------------------------------------|
  | bmi_cat                          665     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=665       
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 191 (35.4%) 
>         |
  |                                  41 - 60 years                 174 (32.3%) 
>         |
  |                                  61 - 80 years                 133 (24.7%) 
>         |
  |                                  >80 years                     41 ( 7.6%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        329 (49.5%) 
>         |
  |                                  Male                          336 (50.5%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       78 (11.7%)  
>         |
  |                                  Urban minor conurbation       89 (13.4%)  
>         |
  |                                  Urban city and town           168 (25.3%) 
>         |
  |                                  Rural town and fringe         164 (24.7%) 
>         |
  |                                  Rural village and dispersed   166 (25.0%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             338 (50.8%) 
>         |
  |                                  1                             327 (49.2%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             26 ( 3.9%)  
>         |
  |                                  1                             133 (20.0%) 
>         |
  |                                  2                             134 (20.2%) 
>         |
  |                                  3                             118 (17.7%) 
>         |
  |                                  4                             129 (19.4%) 
>         |
  |                                  5                             125 (18.8%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  77 (11.6%)  
>         |
  |                                  Current smoker                148 (22.3%) 
>         |
  |                                  Ex-smoker                     117 (17.6%) 
>         |
  |                                  Unknown                       323 (48.6%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        53.63832 (31
> .55233) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       146 (22.0%) 
>         |
  |                                  Underweight                   68 (10.2%)  
>         |
  |                                  Healthy range                 101 (15.2%) 
>         |
  |                                  Overweight                    136 (20.5%) 
>         |
  |                                  Obese                         183 (27.5%) 
>         |
  |                                  Morbidly obese                31 ( 4.7%)  
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000004 saved
file ./output/tables/characteristics_ra_hosp_2021.csv saved

. 
. * Tabulate characteristics by categories of differences in outpatient appoint
> ments for each year
. tempfile tempfile

. forvalues i=2020/2021 {
  2.     preserve
  3.     keep if diff_op_cat_`i'==0
  4.     table1_mc, vars(age_cat cate \ male cate \ urban_rural_5 cate \ prescr
> ibed_biologics cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat cate)
>  clear
  5.     save `tempfile', replace
  6.     restore
  7.     forvalues j=1/3 {
  8.         preserve
  9.         keep if diff_op_cat_`i'==`j'
 10.         table1_mc, vars(age_cat cate \ male cate \ urban_rural_5 cate \ pr
> escribed_biologics cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat c
> ate) clear
 11.         append using `tempfile'
 12.         save `tempfile', replace
 13.         if `j'==3 {
 14.             export delimited using ./output/tables/characteristics_diff_st
> rata`i'.csv
 15.             }
 16.         restore
 17.         }
 18.     }
(4,966 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                           23    11 |
  |--------------------------------------------|
  | male                              34     0 |
  |--------------------------------------------|
  | Rural Urban in five categories    34     0 |
  |--------------------------------------------|
  | prescribed_biologics              34     0 |
  |--------------------------------------------|
  | imd                               34     0 |
  |--------------------------------------------|
  | smoking                           34     0 |
  |--------------------------------------------|
  | time_ra                           13    21 |
  |--------------------------------------------|
  | bmi_cat                           34     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=34        
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 7 (30%)     
>         |
  |                                  41 - 60 years                 8 (35%)     
>         |
  |                                  61 - 80 years                 5 (22%)     
>         |
  |                                  >80 years                     3 (13%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        12 (35%)    
>         |
  |                                  Male                          22 (65%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       5 (15%)     
>         |
  |                                  Urban minor conurbation       1 ( 3%)     
>         |
  |                                  Urban city and town           12 (35%)    
>         |
  |                                  Rural town and fringe         14 (41%)    
>         |
  |                                  Rural village and dispersed   2 ( 6%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             13 (38%)    
>         |
  |                                  1                             21 (62%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             1 ( 3%)     
>         |
  |                                  1                             6 (18%)     
>         |
  |                                  2                             8 (24%)     
>         |
  |                                  3                             9 (26%)     
>         |
  |                                  4                             2 ( 6%)     
>         |
  |                                  5                             8 (24%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  3 ( 9%)     
>         |
  |                                  Current smoker                4 (12%)     
>         |
  |                                  Ex-smoker                     3 ( 9%)     
>         |
  |                                  Unknown                       24 (71%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        50.01043 (35
> .43225) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       4 (12%)     
>         |
  |                                  Underweight                   5 (15%)     
>         |
  |                                  Healthy range                 6 (18%)     
>         |
  |                                  Overweight                    7 (21%)     
>         |
  |                                  Obese                         12 (35%)    
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
(note: file /tmp/St00011.00000k not found)
file /tmp/St00011.00000k saved
(3,594 observations deleted)

  +----------------------------------------------+
  | factor                             N_1   m_1 |
  |----------------------------------------------|
  | age_cat                          1,139   267 |
  |----------------------------------------------|
  | male                             1,406     0 |
  |----------------------------------------------|
  | Rural Urban in five categories   1,406     0 |
  |----------------------------------------------|
  | prescribed_biologics             1,406     0 |
  |----------------------------------------------|
  | imd                              1,406     0 |
  |----------------------------------------------|
  | smoking                          1,406     0 |
  |----------------------------------------------|
  | time_ra                            624   782 |
  |----------------------------------------------|
  | bmi_cat                          1,406     0 |
  +----------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=1,406     
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 430 (37.8%) 
>         |
  |                                  41 - 60 years                 365 (32.0%) 
>         |
  |                                  61 - 80 years                 279 (24.5%) 
>         |
  |                                  >80 years                     65 ( 5.7%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        720 (51.2%) 
>         |
  |                                  Male                          686 (48.8%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       188 (13.4%) 
>         |
  |                                  Urban minor conurbation       182 (12.9%) 
>         |
  |                                  Urban city and town           337 (24.0%) 
>         |
  |                                  Rural town and fringe         360 (25.6%) 
>         |
  |                                  Rural village and dispersed   339 (24.1%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             681 (48.4%) 
>         |
  |                                  1                             725 (51.6%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             65 ( 4.6%)  
>         |
  |                                  1                             280 (19.9%) 
>         |
  |                                  2                             259 (18.4%) 
>         |
  |                                  3                             268 (19.1%) 
>         |
  |                                  4                             267 (19.0%) 
>         |
  |                                  5                             267 (19.0%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  133 ( 9.5%) 
>         |
  |                                  Current smoker                300 (21.3%) 
>         |
  |                                  Ex-smoker                     232 (16.5%) 
>         |
  |                                  Unknown                       741 (52.7%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        53.57105 (32
> .30034) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       280 (19.9%) 
>         |
  |                                  Underweight                   123 ( 8.7%) 
>         |
  |                                  Healthy range                 251 (17.9%) 
>         |
  |                                  Overweight                    280 (19.9%) 
>         |
  |                                  Obese                         394 (28.0%) 
>         |
  |                                  Morbidly obese                78 ( 5.5%)  
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.00000k saved
(4,610 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                          305    85 |
  |--------------------------------------------|
  | male                             390     0 |
  |--------------------------------------------|
  | Rural Urban in five categories   390     0 |
  |--------------------------------------------|
  | prescribed_biologics             390     0 |
  |--------------------------------------------|
  | imd                              390     0 |
  |--------------------------------------------|
  | smoking                          390     0 |
  |--------------------------------------------|
  | time_ra                          176   214 |
  |--------------------------------------------|
  | bmi_cat                          390     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=390       
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 114 (37.4%) 
>         |
  |                                  41 - 60 years                 109 (35.7%) 
>         |
  |                                  61 - 80 years                 64 (21.0%)  
>         |
  |                                  >80 years                     18 ( 5.9%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        188 (48.2%) 
>         |
  |                                  Male                          202 (51.8%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       51 (13.1%)  
>         |
  |                                  Urban minor conurbation       57 (14.6%)  
>         |
  |                                  Urban city and town           97 (24.9%)  
>         |
  |                                  Rural town and fringe         85 (21.8%)  
>         |
  |                                  Rural village and dispersed   100 (25.6%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             200 (51.3%) 
>         |
  |                                  1                             190 (48.7%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             14 ( 3.6%)  
>         |
  |                                  1                             63 (16.2%)  
>         |
  |                                  2                             77 (19.7%)  
>         |
  |                                  3                             75 (19.2%)  
>         |
  |                                  4                             93 (23.8%)  
>         |
  |                                  5                             68 (17.4%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  29 ( 7.4%)  
>         |
  |                                  Current smoker                72 (18.5%)  
>         |
  |                                  Ex-smoker                     56 (14.4%)  
>         |
  |                                  Unknown                       233 (59.7%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        52.50299 (33
> .61229) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       81 (20.8%)  
>         |
  |                                  Underweight                   34 ( 8.7%)  
>         |
  |                                  Healthy range                 76 (19.5%)  
>         |
  |                                  Overweight                    75 (19.2%)  
>         |
  |                                  Obese                         105 (26.9%) 
>         |
  |                                  Morbidly obese                19 ( 4.9%)  
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.00000k saved
(3,515 observations deleted)

  +----------------------------------------------+
  | factor                             N_1   m_1 |
  |----------------------------------------------|
  | age_cat                          1,192   293 |
  |----------------------------------------------|
  | male                             1,485     0 |
  |----------------------------------------------|
  | Rural Urban in five categories   1,485     0 |
  |----------------------------------------------|
  | prescribed_biologics             1,485     0 |
  |----------------------------------------------|
  | imd                              1,485     0 |
  |----------------------------------------------|
  | smoking                          1,485     0 |
  |----------------------------------------------|
  | time_ra                            652   833 |
  |----------------------------------------------|
  | bmi_cat                          1,485     0 |
  +----------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=1,485     
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 434 (36.4%) 
>         |
  |                                  41 - 60 years                 384 (32.2%) 
>         |
  |                                  61 - 80 years                 297 (24.9%) 
>         |
  |                                  >80 years                     77 ( 6.5%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        779 (52.5%) 
>         |
  |                                  Male                          706 (47.5%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       183 (12.3%) 
>         |
  |                                  Urban minor conurbation       193 (13.0%) 
>         |
  |                                  Urban city and town           373 (25.1%) 
>         |
  |                                  Rural town and fringe         386 (26.0%) 
>         |
  |                                  Rural village and dispersed   350 (23.6%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             751 (50.6%) 
>         |
  |                                  1                             734 (49.4%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             67 ( 4.5%)  
>         |
  |                                  1                             281 (18.9%) 
>         |
  |                                  2                             277 (18.7%) 
>         |
  |                                  3                             271 (18.2%) 
>         |
  |                                  4                             298 (20.1%) 
>         |
  |                                  5                             291 (19.6%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  140 ( 9.4%) 
>         |
  |                                  Current smoker                333 (22.4%) 
>         |
  |                                  Ex-smoker                     226 (15.2%) 
>         |
  |                                  Unknown                       786 (52.9%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        54.42084 (32
> .17574) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       314 (21.1%) 
>         |
  |                                  Underweight                   142 ( 9.6%) 
>         |
  |                                  Healthy range                 259 (17.4%) 
>         |
  |                                  Overweight                    308 (20.7%) 
>         |
  |                                  Obese                         390 (26.3%) 
>         |
  |                                  Morbidly obese                72 ( 4.8%)  
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.00000k saved
file ./output/tables/characteristics_diff_strata2020.csv saved
(4,980 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                           17     3 |
  |--------------------------------------------|
  | male                              20     0 |
  |--------------------------------------------|
  | Rural Urban in five categories    20     0 |
  |--------------------------------------------|
  | prescribed_biologics              20     0 |
  |--------------------------------------------|
  | imd                               20     0 |
  |--------------------------------------------|
  | smoking                           20     0 |
  |--------------------------------------------|
  | time_ra                           11     9 |
  |--------------------------------------------|
  | bmi_cat                           20     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=20        
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 6 (35%)     
>         |
  |                                  41 - 60 years                 7 (41%)     
>         |
  |                                  61 - 80 years                 3 (18%)     
>         |
  |                                  >80 years                     1 ( 6%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        9 (45%)     
>         |
  |                                  Male                          11 (55%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       2 (10%)     
>         |
  |                                  Urban minor conurbation       3 (15%)     
>         |
  |                                  Urban city and town           3 (15%)     
>         |
  |                                  Rural town and fringe         5 (25%)     
>         |
  |                                  Rural village and dispersed   7 (35%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             11 (55%)    
>         |
  |                                  1                             9 (45%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              1                             3 (15%)     
>         |
  |                                  2                             7 (35%)     
>         |
  |                                  3                             3 (15%)     
>         |
  |                                  4                             4 (20%)     
>         |
  |                                  5                             3 (15%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  1 ( 5%)     
>         |
  |                                  Current smoker                2 (10%)     
>         |
  |                                  Ex-smoker                     3 (15%)     
>         |
  |                                  Unknown                       14 (70%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        54.91034 (31
> .34716) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       1 ( 5%)     
>         |
  |                                  Underweight                   3 (15%)     
>         |
  |                                  Healthy range                 2 (10%)     
>         |
  |                                  Overweight                    5 (25%)     
>         |
  |                                  Obese                         6 (30%)     
>         |
  |                                  Morbidly obese                3 (15%)     
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.00000k saved
(4,123 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                          712   165 |
  |--------------------------------------------|
  | male                             877     0 |
  |--------------------------------------------|
  | Rural Urban in five categories   877     0 |
  |--------------------------------------------|
  | prescribed_biologics             877     0 |
  |--------------------------------------------|
  | imd                              877     0 |
  |--------------------------------------------|
  | smoking                          877     0 |
  |--------------------------------------------|
  | time_ra                          369   508 |
  |--------------------------------------------|
  | bmi_cat                          877     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> -------+
  |                                                                Total       
>        |
  |----------------------------------------------------------------------------
> -------|
  |                                                                N=877       
>        |
  |----------------------------------------------------------------------------
> -------|
  | age_cat                          18 - 40 years                 268 (37.6%) 
>        |
  |                                  41 - 60 years                 223 (31.3%) 
>        |
  |                                  61 - 80 years                 181 (25.4%) 
>        |
  |                                  >80 years                     40 ( 5.6%)  
>        |
  |----------------------------------------------------------------------------
> -------|
  | male                             Female                        435 (49.6%) 
>        |
  |                                  Male                          442 (50.4%) 
>        |
  |----------------------------------------------------------------------------
> -------|
  | Rural Urban in five categories   Urban major conurbation       111 (12.7%) 
>        |
  |                                  Urban minor conurbation       122 (13.9%) 
>        |
  |                                  Urban city and town           222 (25.3%) 
>        |
  |                                  Rural town and fringe         216 (24.6%) 
>        |
  |                                  Rural village and dispersed   206 (23.5%) 
>        |
  |----------------------------------------------------------------------------
> -------|
  | prescribed_biologics             0                             443 (50.5%) 
>        |
  |                                  1                             434 (49.5%) 
>        |
  |----------------------------------------------------------------------------
> -------|
  | imd                              0                             38 ( 4.3%)  
>        |
  |                                  1                             174 (19.8%) 
>        |
  |                                  2                             164 (18.7%) 
>        |
  |                                  3                             173 (19.7%) 
>        |
  |                                  4                             177 (20.2%) 
>        |
  |                                  5                             151 (17.2%) 
>        |
  |----------------------------------------------------------------------------
> -------|
  | smoking                          Never smoked                  78 ( 8.9%)  
>        |
  |                                  Current smoker                182 (20.8%) 
>        |
  |                                  Ex-smoker                     142 (16.2%) 
>        |
  |                                  Unknown                       475 (54.2%) 
>        |
  |----------------------------------------------------------------------------
> -------|
  | time_ra                                                        54.4039 (32.
> 40955) |
  |----------------------------------------------------------------------------
> -------|
  | bmi_cat                          Missing                       184 (21.0%) 
>        |
  |                                  Underweight                   86 ( 9.8%)  
>        |
  |                                  Healthy range                 156 (17.8%) 
>        |
  |                                  Overweight                    184 (21.0%) 
>        |
  |                                  Obese                         218 (24.9%) 
>        |
  |                                  Morbidly obese                49 ( 5.6%)  
>        |
  +----------------------------------------------------------------------------
> -------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
(note: variable Total was str18, now str19 to accommodate using data's
       values)
file /tmp/St00011.00000k saved
(4,786 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                          173    41 |
  |--------------------------------------------|
  | male                             214     0 |
  |--------------------------------------------|
  | Rural Urban in five categories   214     0 |
  |--------------------------------------------|
  | prescribed_biologics             214     0 |
  |--------------------------------------------|
  | imd                              214     0 |
  |--------------------------------------------|
  | smoking                          214     0 |
  |--------------------------------------------|
  | time_ra                           96   118 |
  |--------------------------------------------|
  | bmi_cat                          214     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=214       
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 56 (32.4%)  
>         |
  |                                  41 - 60 years                 69 (39.9%)  
>         |
  |                                  61 - 80 years                 40 (23.1%)  
>         |
  |                                  >80 years                     8 ( 4.6%)   
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        111 (51.9%) 
>         |
  |                                  Male                          103 (48.1%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       25 (11.7%)  
>         |
  |                                  Urban minor conurbation       25 (11.7%)  
>         |
  |                                  Urban city and town           59 (27.6%)  
>         |
  |                                  Rural town and fringe         48 (22.4%)  
>         |
  |                                  Rural village and dispersed   57 (26.6%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             112 (52.3%) 
>         |
  |                                  1                             102 (47.7%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             11 ( 5.1%)  
>         |
  |                                  1                             30 (14.0%)  
>         |
  |                                  2                             34 (15.9%)  
>         |
  |                                  3                             41 (19.2%)  
>         |
  |                                  4                             44 (20.6%)  
>         |
  |                                  5                             54 (25.2%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  20 ( 9.3%)  
>         |
  |                                  Current smoker                50 (23.4%)  
>         |
  |                                  Ex-smoker                     34 (15.9%)  
>         |
  |                                  Unknown                       110 (51.4%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        58.94014 (32
> .55698) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       45 (21.0%)  
>         |
  |                                  Underweight                   28 (13.1%)  
>         |
  |                                  Healthy range                 45 (21.0%)  
>         |
  |                                  Overweight                    28 (13.1%)  
>         |
  |                                  Obese                         57 (26.6%)  
>         |
  |                                  Morbidly obese                11 ( 5.1%)  
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.00000k saved
(4,115 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                          699   186 |
  |--------------------------------------------|
  | male                             885     0 |
  |--------------------------------------------|
  | Rural Urban in five categories   885     0 |
  |--------------------------------------------|
  | prescribed_biologics             885     0 |
  |--------------------------------------------|
  | imd                              885     0 |
  |--------------------------------------------|
  | smoking                          885     0 |
  |--------------------------------------------|
  | time_ra                          388   497 |
  |--------------------------------------------|
  | bmi_cat                          885     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=885       
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 274 (39.2%) 
>         |
  |                                  41 - 60 years                 224 (32.0%) 
>         |
  |                                  61 - 80 years                 160 (22.9%) 
>         |
  |                                  >80 years                     41 ( 5.9%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        465 (52.5%) 
>         |
  |                                  Male                          420 (47.5%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       106 (12.0%) 
>         |
  |                                  Urban minor conurbation       113 (12.8%) 
>         |
  |                                  Urban city and town           239 (27.0%) 
>         |
  |                                  Rural town and fringe         220 (24.9%) 
>         |
  |                                  Rural village and dispersed   207 (23.4%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             422 (47.7%) 
>         |
  |                                  1                             463 (52.3%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             30 ( 3.4%)  
>         |
  |                                  1                             174 (19.7%) 
>         |
  |                                  2                             164 (18.5%) 
>         |
  |                                  3                             160 (18.1%) 
>         |
  |                                  4                             171 (19.3%) 
>         |
  |                                  5                             186 (21.0%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  71 ( 8.0%)  
>         |
  |                                  Current smoker                193 (21.8%) 
>         |
  |                                  Ex-smoker                     129 (14.6%) 
>         |
  |                                  Unknown                       492 (55.6%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        53.39988 (32
> .86992) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       208 (23.5%) 
>         |
  |                                  Underweight                   84 ( 9.5%)  
>         |
  |                                  Healthy range                 148 (16.7%) 
>         |
  |                                  Overweight                    157 (17.7%) 
>         |
  |                                  Obese                         249 (28.1%) 
>         |
  |                                  Morbidly obese                39 ( 4.4%)  
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.00000k saved
file ./output/tables/characteristics_diff_strata2021.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/outpatients.log
  log type:  text
 closed on:   5 Jan 2023, 17:26:55
-------------------------------------------------------------------------------
