
. 
. cap mkdir ./output/tables

. * Import data
. import delimited using ./output/input.csv
(42 vars, 1,000 obs)

. * Check data
. count if age==. 
  0

. count if age<18 
  206

. count if age>110 & age!=.
  0

. sum age, d

                             age
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            4              0
10%            8              0       Obs               1,000
25%           21              0       Sum of Wgt.       1,000

50%           39                      Mean             40.438
                        Largest       Std. Dev.      23.60036
75%           59             92
90%         72.5             93       Variance       556.9771
95%           79             94       Skewness       .1117404
99%         88.5             95       Kurtosis       2.020732

. count if sex==""
  0

. tab sex

        sex |      Freq.     Percent        Cum.
------------+-----------------------------------
          F |        507       50.70       50.70
          M |        484       48.40       99.10
          U |          9        0.90      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. sum household, d

                          household
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               1,000
25%            2              0       Sum of Wgt.       1,000

50%            3                      Mean              2.519
                        Largest       Std. Dev.      1.023077
75%            3              5
90%            4              5       Variance       1.046686
95%            4              5       Skewness       .0497007
99%            5              6       Kurtosis       2.837303

. tab care_home_type

care_home_t |
        ype |      Freq.     Percent        Cum.
------------+-----------------------------------
         PC |         51        5.16        5.16
         PN |         42        4.25        9.41
         PR |        853       86.34       95.75
         PS |         42        4.25      100.00
------------+-----------------------------------
      Total |        988      100.00

. * Checking RA algorithm variables
. * Checking type of DMARD that meets inclusion
. foreach dmard in metho leflu sulfa hydrox {
  2.     gen `dmard'_multi = (`dmard'_count>=2)
  3.     tab `dmard'_multi if has_dmards==1, m
  4. }

metho_multi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         91       18.20       18.20
          1 |        409       81.80      100.00
------------+-----------------------------------
      Total |        500      100.00

leflu_multi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         63       12.60       12.60
          1 |        437       87.40      100.00
------------+-----------------------------------
      Total |        500      100.00

sulfa_multi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         76       15.20       15.20
          1 |        424       84.80      100.00
------------+-----------------------------------
      Total |        500      100.00

hydrox_mult |
          i |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         80       16.00       16.00
          1 |        420       84.00      100.00
------------+-----------------------------------
      Total |        500      100.00

. gen dmard_multi = (metho_multi==1 | leflu_multi==1 | sulfa_multi==1 | hydrox_
> multi==1)

. tab dmard_multi has_alt_dmard_diag

dmard_mult |  has_alt_dmard_diag
         i |         0          1 |     Total
-----------+----------------------+----------
         1 |       500        500 |     1,000 
-----------+----------------------+----------
     Total |       500        500 |     1,000 

. sum number_ra_codes

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
number_ra_~s |      1,000       2.503    1.064483          0          6

. di "Number where no DMARDs but does have multiple RA codes and no alt diag"
Number where no DMARDs but does have multiple RA codes and no alt diag

. count if has_dmards==0 & number_ra_codes>=2 & alt_diag!=1
  213

. tab has_ra, m

     has_ra |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        500       50.00       50.00
          1 |        500       50.00      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. * Time since first RA code
. gen first_ra_codeA = date(first_ra_code, "YMD")
(547 missing values generated)

. format first_ra_codeA %dD/N/CY

. gen time_ra = (date("01Mar2018", "DMY") - first_ra_codeA)/365.25
(547 missing values generated)

. sum time_ra, d

                           time_ra
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .4161533       .0574949
 5%     5.232033       .2436687
10%     9.442847       .3203285       Obs                 453
25%     26.60096       .3312799       Sum of Wgt.         453

50%     51.90691                      Mean           53.60275
                        Largest       Std. Dev.      31.91657
75%     80.59412       108.0876
90%      98.8857       108.1862       Variance       1018.668
95%     104.7173       108.7639       Skewness       .0374896
99%     108.0329       108.7885       Kurtosis       1.809154

. sum number_ra_codes, d

                       number_ra_codes
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               1,000
25%            2              0       Sum of Wgt.       1,000

50%            3                      Mean              2.503
                        Largest       Std. Dev.      1.064483
75%            3              5
90%            4              5       Variance       1.133124
95%            4              6       Skewness       .0145818
99%            5              6       Kurtosis       3.099124

. sum metho_count, d

                         metho_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               1,000
25%            2              0       Sum of Wgt.       1,000

50%            3                      Mean              2.493
                        Largest       Std. Dev.      1.034902
75%            3              5
90%            4              5       Variance       1.071022
95%            4              6       Skewness        .018721
99%            5              6       Kurtosis       2.935692

. sum sulfa_count, d 

                         sulfa_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               1,000
25%            2              0       Sum of Wgt.       1,000

50%            2                      Mean              2.438
                        Largest       Std. Dev.      1.020391
75%            3              5
90%            4              5       Variance       1.041197
95%            4              5       Skewness       .0690092
99%            5              5       Kurtosis       2.974006

. sum leflu_count, d 

                         leflu_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               1,000
25%            2              0       Sum of Wgt.       1,000

50%            2                      Mean               2.53
                        Largest       Std. Dev.      1.016924
75%            3              5
90%            4              5       Variance       1.034134
95%            4              5       Skewness       .1128451
99%            5              5       Kurtosis       2.888329

. sum hydrox_count, d 

                        hydrox_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               1,000
25%            2              0       Sum of Wgt.       1,000

50%          2.5                      Mean              2.481
                        Largest       Std. Dev.      1.024055
75%            3              5
90%            4              5       Variance       1.048688
95%            4              5       Skewness      -.0298682
99%            5              6       Kurtosis       2.745026

. 
. sum outpatient*, d

                    outpatient_appt_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            1              0       Obs               1,000
25%            5              0       Sum of Wgt.       1,000

50%            7                      Mean              6.724
                        Largest       Std. Dev.      2.958137
75%            9             13
90%           10             13       Variance       8.750575
95%           11             13       Skewness      -.8359615
99%           12             15       Kurtosis        3.44654

                    outpatient_appt_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%           .5              0       Obs               1,000
25%            6              0       Sum of Wgt.       1,000

50%            7                      Mean              6.753
                        Largest       Std. Dev.      2.938133
75%            9             12
90%           10             13       Variance       8.632624
95%           11             13       Skewness      -.9117814
99%           12             13       Kurtosis       3.520003

                    outpatient_appt_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%           .5              0       Obs               1,000
25%            6              0       Sum of Wgt.       1,000

50%            7                      Mean              6.708
                        Largest       Std. Dev.      2.965051
75%            9             13
90%           10             13       Variance       8.791528
95%           11             13       Skewness      -.8317669
99%           12             13       Kurtosis       3.422002

                   outpatient_medium_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs                 500
25%            2              1       Sum of Wgt.         500

50%            5                      Mean             16.202
                        Largest       Std. Dev.      31.45409
75%            7             98
90%           98             98       Variance       989.3599
95%           98             98       Skewness        2.20326
99%           98             98       Kurtosis       5.900952

                   outpatient_medium_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs                 500
25%            2              1       Sum of Wgt.         500

50%            4                      Mean             12.306
                        Largest       Std. Dev.       26.7426
75%            7             98
90%            8             98       Variance       715.1667
95%           98             98       Skewness       2.870593
99%           98             98       Kurtosis       9.328006

                   outpatient_medium_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs                 500
25%            2              1       Sum of Wgt.         500

50%            4                      Mean             12.406
                        Largest       Std. Dev.      26.71255
75%            7             98
90%            8             98       Variance       713.5603
95%           98             98       Skewness       2.870113
99%           98             98       Kurtosis       9.326477

. 
. keep if has_ra
(500 observations deleted)

. 
. * How many people are not on DMARDs and have no RA appointments?
. 
. 
. * Format variables
. *re-order ethnicity
.  gen eth5=1 if ethnicity==1
(392 missing values generated)

.  replace eth5=2 if ethnicity==3
(103 real changes made)

.  replace eth5=3 if ethnicity==4
(91 real changes made)

.  replace eth5=4 if ethnicity==2
(94 real changes made)

.  replace eth5=5 if ethnicity==5
(104 real changes made)

.  replace eth5=. if ethnicity==.
(0 real changes made)

. 
.  label define eth5                      1 "White"                            
>            ///
>                                                         2 "South Asian"      
>                    ///                                             
>                                                         3 "Black"            
>                            ///
>                                                         4 "Mixed"            
>                            ///
>                                                         5 "Other"            
>                            

.                                         
. 
. label values eth5 eth5

. safetab eth5, m
5

       eth5 |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |        108       21.60       21.60
South Asian |        103       20.60       42.20
      Black |         91       18.20       60.40
      Mixed |         94       18.80       79.20
      Other |        104       20.80      100.00
------------+-----------------------------------
      Total |        500      100.00

. 
. * formatting gender
. gen male=(sex=="M")

. replace male = 0 if sex == "F"
(0 real changes made)

. label define male 0"Female" 1"Male"

. label values male male

. safetab male, miss
5

       male |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |        238       47.60       47.60
       Male |        262       52.40      100.00
------------+-----------------------------------
      Total |        500      100.00

. 
. * Make region numeric
. generate region2=.
(500 missing values generated)

. replace region2=0 if region=="East"
(0 real changes made)

. replace region2=1 if region=="East Midlands"
(50 real changes made)

. replace region2=2 if region=="London"
(97 real changes made)

. replace region2=3 if region=="North East"
(52 real changes made)

. replace region2=4 if region=="North West"
(56 real changes made)

. replace region2=5 if region=="South East"
(91 real changes made)

. replace region2=6 if region=="South West"
(0 real changes made)

. replace region2=7 if region=="West Midlands"
(54 real changes made)

. replace region2=8 if region=="Yorkshire and The Humber"
(0 real changes made)

. drop region

. rename region2 region

. label var region "region of England"

. label define region 0 "East" 1 "East Midlands"  2 "London" 3 "North East" 4 "
> North West" 5 "South East" 6 "South West" 7 "West Midlands" 8 "Yorkshire and 
> The Humber"

. label values region region

. safetab region, miss
7

       region of England |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
           East Midlands |         50       10.00       10.00
                  London |         97       19.40       29.40
              North East |         52       10.40       39.80
              North West |         56       11.20       51.00
              South East |         91       18.20       69.20
           West Midlands |         54       10.80       80.00
                       . |        100       20.00      100.00
-------------------------+-----------------------------------
                   Total |        500      100.00

. 
. *create a 4 category rural urban variable 
. generate urban_rural_5=.
(500 missing values generated)

. la var urban_rural_5 "Rural Urban in five categories"

. replace urban_rural_5=1 if urban_rural==1
(46 real changes made)

. replace urban_rural_5=2 if urban_rural==2
(65 real changes made)

. replace urban_rural_5=3 if urban_rural==3|urban_rural==4
(145 real changes made)

. replace urban_rural_5=4 if urban_rural==5|urban_rural==6
(107 real changes made)

. replace urban_rural_5=5 if urban_rural==7|urban_rural==8
(137 real changes made)

. label define urban_rural_5 1 "Urban major conurbation" 2 "Urban minor conurba
> tion" 3 "Urban city and town" 4 "Rural town and fringe" 5 "Rural village and 
> dispersed"

. label values urban_rural_5 urban_rural_5

. safetab urban_rural_5, miss
14

        Rural Urban in five |
                 categories |      Freq.     Percent        Cum.
----------------------------+-----------------------------------
    Urban major conurbation |         46        9.20        9.20
    Urban minor conurbation |         65       13.00       22.20
        Urban city and town |        145       29.00       51.20
      Rural town and fringe |        107       21.40       72.60
Rural village and dispersed |        137       27.40      100.00
----------------------------+-----------------------------------
                      Total |        500      100.00

. 
. *generate a binary rural urban (with missing assigned to urban)
. generate urban_rural_bin=.
(500 missing values generated)

. replace urban_rural_bin=1 if urban_rural<=4|urban_rural==.
(256 real changes made)

. replace urban_rural_bin=0 if urban_rural>4 & urban_rural!=.
(244 real changes made)

. label define urban_rural_bin 0 "Rural" 1 "Urban"

. label values urban_rural_bin urban_rural_bin

. safetab urban_rural_bin urban_rural, miss
28

urban_rura |                      urban_rural
     l_bin |         1          2          3          4          5 |     Total
-----------+-------------------------------------------------------+----------
     Rural |         0          0          0          0         60 |       244 
     Urban |        46         65         79         66          0 |       256 
-----------+-------------------------------------------------------+----------
     Total |        46         65         79         66         60 |       500 


urban_rura |           urban_rural
     l_bin |         6          7          8 |     Total
-----------+---------------------------------+----------
     Rural |        47         77         60 |       244 
     Urban |         0          0          0 |       256 
-----------+---------------------------------+----------
     Total |        47         77         60 |       500 

. label var urban_rural_bin "Rural-Urban"

. 
. * Define age categories
. * Create age categories
. egen age_cat = cut(age), at(18, 40, 60, 80, 120) icodes
(96 missing values generated)

. label define age 0 "18 - 40 years" 1 "41 - 60 years" 2 "61 - 80 years" 3 ">80
>  years"

. label values age_cat age

. safetab age_cat, miss
8

      age_cat |      Freq.     Percent        Cum.
--------------+-----------------------------------
18 - 40 years |        163       32.60       32.60
41 - 60 years |        115       23.00       55.60
61 - 80 years |         99       19.80       75.40
    >80 years |         27        5.40       80.80
            . |         96       19.20      100.00
--------------+-----------------------------------
        Total |        500      100.00

. 
. * Flag if in a care-home
.     gen care_home=care_home_type!="PR"

. 
. * Smoking status
. gen smoking = 0 if smoking_status=="N"
(450 missing values generated)

. replace smoking = 1 if smoking_status=="S"
(93 real changes made)

. replace smoking = 2 if smoking_status=="E"
(70 real changes made)

. replace smoking = 3 if smoking==.
(287 real changes made)

. 
. label define smok 1 "Current smoker" 2 "Ex-smoker" 0 "Never smoked" 3 "Unknow
> n"

. label values smoking smok

. 
. * BMI categories
. egen bmi_cat = cut(bmi), at(0, 1, 18.5, 24.9, 29.9, 39.9, 100) icodes

. bys bmi_cat: sum bmi

-------------------------------------------------------------------------------
-> bmi_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        100           0           0          0          0

-------------------------------------------------------------------------------
-> bmi_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |         41    13.24565     4.46843   2.330219   18.44133

-------------------------------------------------------------------------------
-> bmi_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |         91    21.99801    1.819637   18.67142   24.89525

-------------------------------------------------------------------------------
-> bmi_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |         95    27.62238    1.425133   24.99022   29.89761

-------------------------------------------------------------------------------
-> bmi_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        144    33.75182    2.791798   29.97552   39.88956

-------------------------------------------------------------------------------
-> bmi_cat = 5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |         29      43.691    3.680864   40.02542    53.5712


. label define bmi 0 "Missing" 1 "Underweight" 2 "Healthy range" 3 "Overweight"
>  4 "Obese" 5 "Morbidly obese"

. label values bmi_cat bmi

. 
. * Categorise number of outpatient appointments
. label define appt 0 "No appointments" 1 "1-2 per year" 2 "3-6 per year" 3 "7-
> 12 per year" 4 "More than 12 per year"

. forvalues i=2019/2021 {
  2.     egen op_appt_`i'_cat = cut(outpatient_appt_`i'), at(0, 1, 3, 7, 13, 10
> 00) icodes
  3.     label values op_appt_`i'_cat appt
  4.     }

. preserve

. * Tabulate number of appointments per year
. table1_mc, vars(op_appt_2019_cat cate \ op_appt_2020_cat cate \ op_appt_2021_
> cat cate) clear

  +------------------------------+
  | factor             N_1   m_1 |
  |------------------------------|
  | op_appt_2019_cat   500     0 |
  |------------------------------|
  | op_appt_2020_cat   500     0 |
  |------------------------------|
  | op_appt_2021_cat   500     0 |
  +------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------------+
  |                                            Total       |
  |--------------------------------------------------------|
  |                                            N=500       |
  |--------------------------------------------------------|
  | op_appt_2019_cat   No appointments         49 ( 9.8%)  |
  |                    1-2 per year            3 ( 0.6%)   |
  |                    3-6 per year            128 (25.6%) |
  |                    7-12 per year           315 (63.0%) |
  |                    More than 12 per year   5 ( 1.0%)   |
  |--------------------------------------------------------|
  | op_appt_2020_cat   No appointments         55 (11.0%)  |
  |                    1-2 per year            5 ( 1.0%)   |
  |                    3-6 per year            131 (26.2%) |
  |                    7-12 per year           307 (61.4%) |
  |                    More than 12 per year   2 ( 0.4%)   |
  |--------------------------------------------------------|
  | op_appt_2021_cat   No appointments         38 ( 7.6%)  |
  |                    1-2 per year            6 ( 1.2%)   |
  |                    3-6 per year            141 (28.2%) |
  |                    7-12 per year           311 (62.2%) |
  |                    More than 12 per year   4 ( 0.8%)   |
  +--------------------------------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/op_appt_yrs.csv
file ./output/tables/op_appt_yrs.csv saved

. restore 

. * Tabulate overall characteristics 
. preserve

. table1_mc, vars(age_cat cate \ male cate \ region cate \ urban_rural_5 cate \
>  prescribed_biologics cate \ imd cate \ care_home cate \ smoking cate \ time_
> ra contn \ bmi_cat cate) clear

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                          404    96 |
  |--------------------------------------------|
  | male                             500     0 |
  |--------------------------------------------|
  | region of England                400   100 |
  |--------------------------------------------|
  | Rural Urban in five categories   500     0 |
  |--------------------------------------------|
  | prescribed_biologics             500     0 |
  |--------------------------------------------|
  | imd                              500     0 |
  |--------------------------------------------|
  | care_home                        500     0 |
  |--------------------------------------------|
  | smoking                          500     0 |
  |--------------------------------------------|
  | time_ra                          218   282 |
  |--------------------------------------------|
  | bmi_cat                          500     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=500       
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 163 (40.3%) 
>         |
  |                                  41 - 60 years                 115 (28.5%) 
>         |
  |                                  61 - 80 years                 99 (24.5%)  
>         |
  |                                  >80 years                     27 ( 6.7%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        238 (47.6%) 
>         |
  |                                  Male                          262 (52.4%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | region of England                East Midlands                 50 (12.5%)  
>         |
  |                                  London                        97 (24.2%)  
>         |
  |                                  North East                    52 (13.0%)  
>         |
  |                                  North West                    56 (14.0%)  
>         |
  |                                  South East                    91 (22.8%)  
>         |
  |                                  West Midlands                 54 (13.5%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       46 ( 9.2%)  
>         |
  |                                  Urban minor conurbation       65 (13.0%)  
>         |
  |                                  Urban city and town           145 (29.0%) 
>         |
  |                                  Rural town and fringe         107 (21.4%) 
>         |
  |                                  Rural village and dispersed   137 (27.4%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             234 (46.8%) 
>         |
  |                                  1                             266 (53.2%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             24 ( 4.8%)  
>         |
  |                                  1                             97 (19.4%)  
>         |
  |                                  2                             100 (20.0%) 
>         |
  |                                  3                             86 (17.2%)  
>         |
  |                                  4                             92 (18.4%)  
>         |
  |                                  5                             101 (20.2%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | care_home                        0                             421 (84.2%) 
>         |
  |                                  1                             79 (15.8%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  50 (10.0%)  
>         |
  |                                  Current smoker                93 (18.6%)  
>         |
  |                                  Ex-smoker                     70 (14.0%)  
>         |
  |                                  Unknown                       287 (57.4%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        53.31992 (31
> .53425) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       100 (20.0%) 
>         |
  |                                  Underweight                   41 ( 8.2%)  
>         |
  |                                  Healthy range                 91 (18.2%)  
>         |
  |                                  Overweight                    95 (19.0%)  
>         |
  |                                  Obese                         144 (28.8%) 
>         |
  |                                  Morbidly obese                29 ( 5.8%)  
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 

. export delimited using ./output/tables/op_chars.csv
file ./output/tables/op_chars.csv saved

. restore

. * Tabulate characteristics by category of outpatient appointments for each ye
> ar
. tempfile tempfile

. forvalues i=2019/2021 {
  2.     preserve
  3.     keep if op_appt_`i'_cat==0
  4.     table1_mc, vars(age_cat cate \ male cate \ region cate \ urban_rural_5
>  cate \ prescribed_biologics cate \ imd cate \ care_home cate \ smoking cate 
> \ time_ra contn \ bmi_cat cate) clear
  5.     save `tempfile', replace
  6.     restore
  7.     forvalues j=1/4 {
  8.         preserve
  9.         keep if op_appt_`i'_cat==`j'
 10.         table1_mc, vars(age_cat cate \ male cate \ region cate \ urban_rur
> al_5 cate \ prescribed_biologics cate \ imd cate \ care_home cate \ smoking c
> ate \ time_ra contn \ bmi_cat cate) clear
 11.         append using `tempfile'
 12.         save `tempfile', replace
 13.         if `j'==2 {
 14.             export delimited using ./output/tables/characteristics_strata`
> i'.csv
 15.         }
 16.         restore
 17.         }
 18.     * Tabulate characteristics by whether hospitalised with RA for each ye
> ar
.     preserve
 19.     keep if ra_hosp_`i'==1
 20.     table1_mc, vars(age_cat cate \ male cate \ region cate \ urban_rural_5
>  cate \ prescribed_biologics cate \ imd cate \ care_home cate \ smoking cate 
> \ time_ra contn \ bmi_cat cate) clear
 21.     export delimited using ./output/tables/characteristics_ra_hosp_`i'.csv
 22.     restore
 23.     }
(451 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                           39    10 |
  |--------------------------------------------|
  | male                              49     0 |
  |--------------------------------------------|
  | region of England                 39    10 |
  |--------------------------------------------|
  | Rural Urban in five categories    49     0 |
  |--------------------------------------------|
  | prescribed_biologics              49     0 |
  |--------------------------------------------|
  | imd                               49     0 |
  |--------------------------------------------|
  | care_home                         49     0 |
  |--------------------------------------------|
  | smoking                           49     0 |
  |--------------------------------------------|
  | time_ra                           22    27 |
  |--------------------------------------------|
  | bmi_cat                           49     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=49        
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 19 (49%)    
>         |
  |                                  41 - 60 years                 5 (13%)     
>         |
  |                                  61 - 80 years                 13 (33%)    
>         |
  |                                  >80 years                     2 ( 5%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        23 (47%)    
>         |
  |                                  Male                          26 (53%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | region of England                East Midlands                 4 (10%)     
>         |
  |                                  London                        10 (26%)    
>         |
  |                                  North East                    6 (15%)     
>         |
  |                                  North West                    7 (18%)     
>         |
  |                                  South East                    9 (23%)     
>         |
  |                                  West Midlands                 3 ( 8%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       6 (12%)     
>         |
  |                                  Urban minor conurbation       8 (16%)     
>         |
  |                                  Urban city and town           18 (37%)    
>         |
  |                                  Rural town and fringe         9 (18%)     
>         |
  |                                  Rural village and dispersed   8 (16%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             21 (43%)    
>         |
  |                                  1                             28 (57%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              1                             9 (18%)     
>         |
  |                                  2                             8 (16%)     
>         |
  |                                  3                             11 (22%)    
>         |
  |                                  4                             8 (16%)     
>         |
  |                                  5                             13 (27%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | care_home                        0                             40 (82%)    
>         |
  |                                  1                             9 (18%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  5 (10%)     
>         |
  |                                  Current smoker                6 (12%)     
>         |
  |                                  Ex-smoker                     4 ( 8%)     
>         |
  |                                  Unknown                       34 (69%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        51.43327 (34
> .43248) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       12 (24%)    
>         |
  |                                  Underweight                   4 ( 8%)     
>         |
  |                                  Healthy range                 11 (22%)    
>         |
  |                                  Overweight                    10 (20%)    
>         |
  |                                  Obese                         12 (24%)    
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
(note: file /tmp/St00011.000003 not found)
file /tmp/St00011.000003 saved
(497 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                            1     2 |
  |--------------------------------------------|
  | male                               3     0 |
  |--------------------------------------------|
  | region of England                  3     0 |
  |--------------------------------------------|
  | Rural Urban in five categories     3     0 |
  |--------------------------------------------|
  | prescribed_biologics               3     0 |
  |--------------------------------------------|
  | imd                                3     0 |
  |--------------------------------------------|
  | care_home                          3     0 |
  |--------------------------------------------|
  | smoking                            3     0 |
  |--------------------------------------------|
  | time_ra                            2     1 |
  |--------------------------------------------|
  | bmi_cat                            3     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=3         
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 1 (100%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        1 (33%)     
>         |
  |                                  Male                          2 (67%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | region of England                East Midlands                 1 (33%)     
>         |
  |                                  North West                    1 (33%)     
>         |
  |                                  West Midlands                 1 (33%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban city and town           1 (33%)     
>         |
  |                                  Rural village and dispersed   2 (67%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             2 (67%)     
>         |
  |                                  1                             1 (33%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              4                             1 (33%)     
>         |
  |                                  5                             2 (67%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | care_home                        0                             3 (100%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Ex-smoker                     1 (33%)     
>         |
  |                                  Unknown                       2 (67%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        70.67625 (3.
> 858353) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Healthy range                 1 (33%)     
>         |
  |                                  Obese                         1 (33%)     
>         |
  |                                  Morbidly obese                1 (33%)     
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000003 saved
(372 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                          107    21 |
  |--------------------------------------------|
  | male                             128     0 |
  |--------------------------------------------|
  | region of England                104    24 |
  |--------------------------------------------|
  | Rural Urban in five categories   128     0 |
  |--------------------------------------------|
  | prescribed_biologics             128     0 |
  |--------------------------------------------|
  | imd                              128     0 |
  |--------------------------------------------|
  | care_home                        128     0 |
  |--------------------------------------------|
  | smoking                          128     0 |
  |--------------------------------------------|
  | time_ra                           65    63 |
  |--------------------------------------------|
  | bmi_cat                          128     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=128       
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 46 (43.0%)  
>         |
  |                                  41 - 60 years                 34 (31.8%)  
>         |
  |                                  61 - 80 years                 22 (20.6%)  
>         |
  |                                  >80 years                     5 ( 4.7%)   
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        56 (43.8%)  
>         |
  |                                  Male                          72 (56.2%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | region of England                East Midlands                 13 (12.5%)  
>         |
  |                                  London                        22 (21.2%)  
>         |
  |                                  North East                    15 (14.4%)  
>         |
  |                                  North West                    15 (14.4%)  
>         |
  |                                  South East                    23 (22.1%)  
>         |
  |                                  West Midlands                 16 (15.4%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       13 (10.2%)  
>         |
  |                                  Urban minor conurbation       18 (14.1%)  
>         |
  |                                  Urban city and town           34 (26.6%)  
>         |
  |                                  Rural town and fringe         30 (23.4%)  
>         |
  |                                  Rural village and dispersed   33 (25.8%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             65 (50.8%)  
>         |
  |                                  1                             63 (49.2%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             9 ( 7.0%)   
>         |
  |                                  1                             19 (14.8%)  
>         |
  |                                  2                             25 (19.5%)  
>         |
  |                                  3                             23 (18.0%)  
>         |
  |                                  4                             27 (21.1%)  
>         |
  |                                  5                             25 (19.5%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | care_home                        0                             104 (81.2%) 
>         |
  |                                  1                             24 (18.8%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  11 ( 8.6%)  
>         |
  |                                  Current smoker                26 (20.3%)  
>         |
  |                                  Ex-smoker                     21 (16.4%)  
>         |
  |                                  Unknown                       70 (54.7%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        55.78847 (35
> .33551) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       23 (18.0%)  
>         |
  |                                  Underweight                   10 ( 7.8%)  
>         |
  |                                  Healthy range                 21 (16.4%)  
>         |
  |                                  Overweight                    24 (18.8%)  
>         |
  |                                  Obese                         39 (30.5%)  
>         |
  |                                  Morbidly obese                11 ( 8.6%)  
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000003 saved
file ./output/tables/characteristics_strata2019.csv saved
(185 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                          254    61 |
  |--------------------------------------------|
  | male                             315     0 |
  |--------------------------------------------|
  | region of England                249    66 |
  |--------------------------------------------|
  | Rural Urban in five categories   315     0 |
  |--------------------------------------------|
  | prescribed_biologics             315     0 |
  |--------------------------------------------|
  | imd                              315     0 |
  |--------------------------------------------|
  | care_home                        315     0 |
  |--------------------------------------------|
  | smoking                          315     0 |
  |--------------------------------------------|
  | time_ra                          127   188 |
  |--------------------------------------------|
  | bmi_cat                          315     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=315       
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 97 (38.2%)  
>         |
  |                                  41 - 60 years                 76 (29.9%)  
>         |
  |                                  61 - 80 years                 62 (24.4%)  
>         |
  |                                  >80 years                     19 ( 7.5%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        156 (49.5%) 
>         |
  |                                  Male                          159 (50.5%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | region of England                East Midlands                 31 (12.4%)  
>         |
  |                                  London                        64 (25.7%)  
>         |
  |                                  North East                    30 (12.0%)  
>         |
  |                                  North West                    32 (12.9%)  
>         |
  |                                  South East                    58 (23.3%)  
>         |
  |                                  West Midlands                 34 (13.7%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       27 ( 8.6%)  
>         |
  |                                  Urban minor conurbation       37 (11.7%)  
>         |
  |                                  Urban city and town           92 (29.2%)  
>         |
  |                                  Rural town and fringe         66 (21.0%)  
>         |
  |                                  Rural village and dispersed   93 (29.5%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             143 (45.4%) 
>         |
  |                                  1                             172 (54.6%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             15 ( 4.8%)  
>         |
  |                                  1                             68 (21.6%)  
>         |
  |                                  2                             66 (21.0%)  
>         |
  |                                  3                             52 (16.5%)  
>         |
  |                                  4                             54 (17.1%)  
>         |
  |                                  5                             60 (19.0%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | care_home                        0                             270 (85.7%) 
>         |
  |                                  1                             45 (14.3%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  34 (10.8%)  
>         |
  |                                  Current smoker                60 (19.0%)  
>         |
  |                                  Ex-smoker                     44 (14.0%)  
>         |
  |                                  Unknown                       177 (56.2%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        52.24138 (29
> .49295) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       65 (20.6%)  
>         |
  |                                  Underweight                   23 ( 7.3%)  
>         |
  |                                  Healthy range                 58 (18.4%)  
>         |
  |                                  Overweight                    61 (19.4%)  
>         |
  |                                  Obese                         91 (28.9%)  
>         |
  |                                  Morbidly obese                17 ( 5.4%)  
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000003 saved
(495 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                            3     2 |
  |--------------------------------------------|
  | male                               5     0 |
  |--------------------------------------------|
  | region of England                  5     0 |
  |--------------------------------------------|
  | Rural Urban in five categories     5     0 |
  |--------------------------------------------|
  | prescribed_biologics               5     0 |
  |--------------------------------------------|
  | imd                                5     0 |
  |--------------------------------------------|
  | care_home                          5     0 |
  |--------------------------------------------|
  | smoking                            5     0 |
  |--------------------------------------------|
  | time_ra                            2     3 |
  |--------------------------------------------|
  | bmi_cat                            5     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=5         
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          61 - 80 years                 2 (67%)     
>         |
  |                                  >80 years                     1 (33%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        2 (40%)     
>         |
  |                                  Male                          3 (60%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | region of England                East Midlands                 1 (20%)     
>         |
  |                                  London                        1 (20%)     
>         |
  |                                  North East                    1 (20%)     
>         |
  |                                  North West                    1 (20%)     
>         |
  |                                  South East                    1 (20%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban minor conurbation       2 (40%)     
>         |
  |                                  Rural town and fringe         2 (40%)     
>         |
  |                                  Rural village and dispersed   1 (20%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             3 (60%)     
>         |
  |                                  1                             2 (40%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              1                             1 (20%)     
>         |
  |                                  2                             1 (20%)     
>         |
  |                                  4                             2 (40%)     
>         |
  |                                  5                             1 (20%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | care_home                        0                             4 (80%)     
>         |
  |                                  1                             1 (20%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Current smoker                1 (20%)     
>         |
  |                                  Unknown                       4 (80%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        44.97604 (1.
> 016374) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Underweight                   4 (80%)     
>         |
  |                                  Obese                         1 (20%)     
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000003 saved
(416 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                           72    12 |
  |--------------------------------------------|
  | male                              84     0 |
  |--------------------------------------------|
  | region of England                 64    20 |
  |--------------------------------------------|
  | Rural Urban in five categories    84     0 |
  |--------------------------------------------|
  | prescribed_biologics              84     0 |
  |--------------------------------------------|
  | imd                               84     0 |
  |--------------------------------------------|
  | care_home                         84     0 |
  |--------------------------------------------|
  | smoking                           84     0 |
  |--------------------------------------------|
  | time_ra                           36    48 |
  |--------------------------------------------|
  | bmi_cat                           84     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> -------+
  |                                                                Total       
>        |
  |----------------------------------------------------------------------------
> -------|
  |                                                                N=84        
>        |
  |----------------------------------------------------------------------------
> -------|
  | age_cat                          18 - 40 years                 21 (29%)    
>        |
  |                                  41 - 60 years                 24 (33%)    
>        |
  |                                  61 - 80 years                 23 (32%)    
>        |
  |                                  >80 years                     4 ( 6%)     
>        |
  |----------------------------------------------------------------------------
> -------|
  | male                             Female                        38 (45%)    
>        |
  |                                  Male                          46 (55%)    
>        |
  |----------------------------------------------------------------------------
> -------|
  | region of England                East Midlands                 9 (14%)     
>        |
  |                                  London                        13 (20%)    
>        |
  |                                  North East                    10 (16%)    
>        |
  |                                  North West                    13 (20%)    
>        |
  |                                  South East                    12 (19%)    
>        |
  |                                  West Midlands                 7 (11%)     
>        |
  |----------------------------------------------------------------------------
> -------|
  | Rural Urban in five categories   Urban major conurbation       6 ( 7%)     
>        |
  |                                  Urban minor conurbation       9 (11%)     
>        |
  |                                  Urban city and town           29 (35%)    
>        |
  |                                  Rural town and fringe         20 (24%)    
>        |
  |                                  Rural village and dispersed   20 (24%)    
>        |
  |----------------------------------------------------------------------------
> -------|
  | prescribed_biologics             0                             42 (50%)    
>        |
  |                                  1                             42 (50%)    
>        |
  |----------------------------------------------------------------------------
> -------|
  | imd                              0                             2 ( 2%)     
>        |
  |                                  1                             16 (19%)    
>        |
  |                                  2                             14 (17%)    
>        |
  |                                  3                             16 (19%)    
>        |
  |                                  4                             20 (24%)    
>        |
  |                                  5                             16 (19%)    
>        |
  |----------------------------------------------------------------------------
> -------|
  | care_home                        0                             71 (85%)    
>        |
  |                                  1                             13 (15%)    
>        |
  |----------------------------------------------------------------------------
> -------|
  | smoking                          Never smoked                  7 ( 8%)     
>        |
  |                                  Current smoker                15 (18%)    
>        |
  |                                  Ex-smoker                     5 ( 6%)     
>        |
  |                                  Unknown                       57 (68%)    
>        |
  |----------------------------------------------------------------------------
> -------|
  | time_ra                                                        50.17271 (34
> .2829) |
  |----------------------------------------------------------------------------
> -------|
  | bmi_cat                          Missing                       18 (21%)    
>        |
  |                                  Underweight                   2 ( 2%)     
>        |
  |                                  Healthy range                 15 (18%)    
>        |
  |                                  Overweight                    17 (20%)    
>        |
  |                                  Obese                         27 (32%)    
>        |
  |                                  Morbidly obese                5 ( 6%)     
>        |
  +----------------------------------------------------------------------------
> -------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file ./output/tables/characteristics_ra_hosp_2019.csv saved
(445 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                           45    10 |
  |--------------------------------------------|
  | male                              55     0 |
  |--------------------------------------------|
  | region of England                 46     9 |
  |--------------------------------------------|
  | Rural Urban in five categories    55     0 |
  |--------------------------------------------|
  | prescribed_biologics              55     0 |
  |--------------------------------------------|
  | imd                               55     0 |
  |--------------------------------------------|
  | care_home                         55     0 |
  |--------------------------------------------|
  | smoking                           55     0 |
  |--------------------------------------------|
  | time_ra                           22    33 |
  |--------------------------------------------|
  | bmi_cat                           55     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> -------+
  |                                                                Total       
>        |
  |----------------------------------------------------------------------------
> -------|
  |                                                                N=55        
>        |
  |----------------------------------------------------------------------------
> -------|
  | age_cat                          18 - 40 years                 18 (40%)    
>        |
  |                                  41 - 60 years                 13 (29%)    
>        |
  |                                  61 - 80 years                 11 (24%)    
>        |
  |                                  >80 years                     3 ( 7%)     
>        |
  |----------------------------------------------------------------------------
> -------|
  | male                             Female                        29 (53%)    
>        |
  |                                  Male                          26 (47%)    
>        |
  |----------------------------------------------------------------------------
> -------|
  | region of England                East Midlands                 4 ( 9%)     
>        |
  |                                  London                        12 (26%)    
>        |
  |                                  North East                    6 (13%)     
>        |
  |                                  North West                    5 (11%)     
>        |
  |                                  South East                    11 (24%)    
>        |
  |                                  West Midlands                 8 (17%)     
>        |
  |----------------------------------------------------------------------------
> -------|
  | Rural Urban in five categories   Urban major conurbation       5 ( 9%)     
>        |
  |                                  Urban minor conurbation       8 (15%)     
>        |
  |                                  Urban city and town           18 (33%)    
>        |
  |                                  Rural town and fringe         11 (20%)    
>        |
  |                                  Rural village and dispersed   13 (24%)    
>        |
  |----------------------------------------------------------------------------
> -------|
  | prescribed_biologics             0                             24 (44%)    
>        |
  |                                  1                             31 (56%)    
>        |
  |----------------------------------------------------------------------------
> -------|
  | imd                              0                             4 ( 7%)     
>        |
  |                                  1                             8 (15%)     
>        |
  |                                  2                             15 (27%)    
>        |
  |                                  3                             8 (15%)     
>        |
  |                                  4                             11 (20%)    
>        |
  |                                  5                             9 (16%)     
>        |
  |----------------------------------------------------------------------------
> -------|
  | care_home                        0                             48 (87%)    
>        |
  |                                  1                             7 (13%)     
>        |
  |----------------------------------------------------------------------------
> -------|
  | smoking                          Never smoked                  2 ( 4%)     
>        |
  |                                  Current smoker                20 (36%)    
>        |
  |                                  Ex-smoker                     5 ( 9%)     
>        |
  |                                  Unknown                       28 (51%)    
>        |
  |----------------------------------------------------------------------------
> -------|
  | time_ra                                                        54.06533 (29
> .0741) |
  |----------------------------------------------------------------------------
> -------|
  | bmi_cat                          Missing                       7 (13%)     
>        |
  |                                  Underweight                   8 (15%)     
>        |
  |                                  Healthy range                 11 (20%)    
>        |
  |                                  Overweight                    9 (16%)     
>        |
  |                                  Obese                         19 (35%)    
>        |
  |                                  Morbidly obese                1 ( 2%)     
>        |
  +----------------------------------------------------------------------------
> -------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000003 saved
(495 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                            5     0 |
  |--------------------------------------------|
  | male                               5     0 |
  |--------------------------------------------|
  | region of England                  4     1 |
  |--------------------------------------------|
  | Rural Urban in five categories     5     0 |
  |--------------------------------------------|
  | prescribed_biologics               5     0 |
  |--------------------------------------------|
  | imd                                5     0 |
  |--------------------------------------------|
  | care_home                          5     0 |
  |--------------------------------------------|
  | smoking                            5     0 |
  |--------------------------------------------|
  | time_ra                            0     5 |
  |--------------------------------------------|
  | bmi_cat                            5     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +-------------------------------------------------------------------------+
  |                                                                Total    |
  |-------------------------------------------------------------------------|
  |                                                                N=5      |
  |-------------------------------------------------------------------------|
  | age_cat                          18 - 40 years                 2 (40%)  |
  |                                  41 - 60 years                 2 (40%)  |
  |                                  61 - 80 years                 1 (20%)  |
  |-------------------------------------------------------------------------|
  | male                             Female                        4 (80%)  |
  |                                  Male                          1 (20%)  |
  |-------------------------------------------------------------------------|
  | region of England                East Midlands                 1 (25%)  |
  |                                  London                        1 (25%)  |
  |                                  North East                    1 (25%)  |
  |                                  North West                    1 (25%)  |
  |-------------------------------------------------------------------------|
  | Rural Urban in five categories   Urban city and town           3 (60%)  |
  |                                  Rural village and dispersed   2 (40%)  |
  |-------------------------------------------------------------------------|
  | prescribed_biologics             0                             1 (20%)  |
  |                                  1                             4 (80%)  |
  |-------------------------------------------------------------------------|
  | imd                              2                             1 (20%)  |
  |                                  3                             1 (20%)  |
  |                                  5                             3 (60%)  |
  |-------------------------------------------------------------------------|
  | care_home                        0                             5 (100%) |
  |-------------------------------------------------------------------------|
  | smoking                          Never smoked                  3 (60%)  |
  |                                  Current smoker                1 (20%)  |
  |                                  Unknown                       1 (20%)  |
  |-------------------------------------------------------------------------|
  | time_ra                                                                 |
  |-------------------------------------------------------------------------|
  | bmi_cat                          Missing                       1 (20%)  |
  |                                  Healthy range                 1 (20%)  |
  |                                  Overweight                    3 (60%)  |
  +-------------------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
(note: variable Total was str8, now str18 to accommodate using data's values)
file /tmp/St00011.000003 saved
(369 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                           96    35 |
  |--------------------------------------------|
  | male                             131     0 |
  |--------------------------------------------|
  | region of England                109    22 |
  |--------------------------------------------|
  | Rural Urban in five categories   131     0 |
  |--------------------------------------------|
  | prescribed_biologics             131     0 |
  |--------------------------------------------|
  | imd                              131     0 |
  |--------------------------------------------|
  | care_home                        131     0 |
  |--------------------------------------------|
  | smoking                          131     0 |
  |--------------------------------------------|
  | time_ra                           59    72 |
  |--------------------------------------------|
  | bmi_cat                          131     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=131       
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 38 (40%)    
>         |
  |                                  41 - 60 years                 27 (28%)    
>         |
  |                                  61 - 80 years                 26 (27%)    
>         |
  |                                  >80 years                     5 ( 5%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        61 (46.6%)  
>         |
  |                                  Male                          70 (53.4%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | region of England                East Midlands                 14 (12.8%)  
>         |
  |                                  London                        22 (20.2%)  
>         |
  |                                  North East                    16 (14.7%)  
>         |
  |                                  North West                    17 (15.6%)  
>         |
  |                                  South East                    22 (20.2%)  
>         |
  |                                  West Midlands                 18 (16.5%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       10 ( 7.6%)  
>         |
  |                                  Urban minor conurbation       15 (11.5%)  
>         |
  |                                  Urban city and town           40 (30.5%)  
>         |
  |                                  Rural town and fringe         34 (26.0%)  
>         |
  |                                  Rural village and dispersed   32 (24.4%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             64 (48.9%)  
>         |
  |                                  1                             67 (51.1%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             4 ( 3.1%)   
>         |
  |                                  1                             22 (16.8%)  
>         |
  |                                  2                             30 (22.9%)  
>         |
  |                                  3                             22 (16.8%)  
>         |
  |                                  4                             26 (19.8%)  
>         |
  |                                  5                             27 (20.6%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | care_home                        0                             111 (84.7%) 
>         |
  |                                  1                             20 (15.3%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  15 (11.5%)  
>         |
  |                                  Current smoker                21 (16.0%)  
>         |
  |                                  Ex-smoker                     21 (16.0%)  
>         |
  |                                  Unknown                       74 (56.5%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        55.24199 (30
> .91004) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       19 (14.5%)  
>         |
  |                                  Underweight                   12 ( 9.2%)  
>         |
  |                                  Healthy range                 27 (20.6%)  
>         |
  |                                  Overweight                    29 (22.1%)  
>         |
  |                                  Obese                         34 (26.0%)  
>         |
  |                                  Morbidly obese                10 ( 7.6%)  
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000003 saved
file ./output/tables/characteristics_strata2020.csv saved
(193 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                          256    51 |
  |--------------------------------------------|
  | male                             307     0 |
  |--------------------------------------------|
  | region of England                240    67 |
  |--------------------------------------------|
  | Rural Urban in five categories   307     0 |
  |--------------------------------------------|
  | prescribed_biologics             307     0 |
  |--------------------------------------------|
  | imd                              307     0 |
  |--------------------------------------------|
  | care_home                        307     0 |
  |--------------------------------------------|
  | smoking                          307     0 |
  |--------------------------------------------|
  | time_ra                          137   170 |
  |--------------------------------------------|
  | bmi_cat                          307     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> -------+
  |                                                                Total       
>        |
  |----------------------------------------------------------------------------
> -------|
  |                                                                N=307       
>        |
  |----------------------------------------------------------------------------
> -------|
  | age_cat                          18 - 40 years                 104 (40.6%) 
>        |
  |                                  41 - 60 years                 73 (28.5%)  
>        |
  |                                  61 - 80 years                 61 (23.8%)  
>        |
  |                                  >80 years                     18 ( 7.0%)  
>        |
  |----------------------------------------------------------------------------
> -------|
  | male                             Female                        143 (46.6%) 
>        |
  |                                  Male                          164 (53.4%) 
>        |
  |----------------------------------------------------------------------------
> -------|
  | region of England                East Midlands                 31 (12.9%)  
>        |
  |                                  London                        61 (25.4%)  
>        |
  |                                  North East                    29 (12.1%)  
>        |
  |                                  North West                    33 (13.8%)  
>        |
  |                                  South East                    58 (24.2%)  
>        |
  |                                  West Midlands                 28 (11.7%)  
>        |
  |----------------------------------------------------------------------------
> -------|
  | Rural Urban in five categories   Urban major conurbation       31 (10.1%)  
>        |
  |                                  Urban minor conurbation       42 (13.7%)  
>        |
  |                                  Urban city and town           84 (27.4%)  
>        |
  |                                  Rural town and fringe         60 (19.5%)  
>        |
  |                                  Rural village and dispersed   90 (29.3%)  
>        |
  |----------------------------------------------------------------------------
> -------|
  | prescribed_biologics             0                             144 (46.9%) 
>        |
  |                                  1                             163 (53.1%) 
>        |
  |----------------------------------------------------------------------------
> -------|
  | imd                              0                             16 ( 5.2%)  
>        |
  |                                  1                             67 (21.8%)  
>        |
  |                                  2                             54 (17.6%)  
>        |
  |                                  3                             55 (17.9%)  
>        |
  |                                  4                             54 (17.6%)  
>        |
  |                                  5                             61 (19.9%)  
>        |
  |----------------------------------------------------------------------------
> -------|
  | care_home                        0                             255 (83.1%) 
>        |
  |                                  1                             52 (16.9%)  
>        |
  |----------------------------------------------------------------------------
> -------|
  | smoking                          Never smoked                  30 ( 9.8%)  
>        |
  |                                  Current smoker                51 (16.6%)  
>        |
  |                                  Ex-smoker                     44 (14.3%)  
>        |
  |                                  Unknown                       182 (59.3%) 
>        |
  |----------------------------------------------------------------------------
> -------|
  | time_ra                                                        52.37247 (32
> .3432) |
  |----------------------------------------------------------------------------
> -------|
  | bmi_cat                          Missing                       73 (23.8%)  
>        |
  |                                  Underweight                   21 ( 6.8%)  
>        |
  |                                  Healthy range                 51 (16.6%)  
>        |
  |                                  Overweight                    54 (17.6%)  
>        |
  |                                  Obese                         90 (29.3%)  
>        |
  |                                  Morbidly obese                18 ( 5.9%)  
>        |
  +----------------------------------------------------------------------------
> -------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
(note: variable Total was str18, now str19 to accommodate using data's
       values)
file /tmp/St00011.000003 saved
(498 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                            2     0 |
  |--------------------------------------------|
  | male                               2     0 |
  |--------------------------------------------|
  | region of England                  1     1 |
  |--------------------------------------------|
  | Rural Urban in five categories     2     0 |
  |--------------------------------------------|
  | prescribed_biologics               2     0 |
  |--------------------------------------------|
  | imd                                2     0 |
  |--------------------------------------------|
  | care_home                          2     0 |
  |--------------------------------------------|
  | smoking                            2     0 |
  |--------------------------------------------|
  | time_ra                            0     2 |
  |--------------------------------------------|
  | bmi_cat                            2     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +-------------------------------------------------------------------+
  |                                                          Total    |
  |-------------------------------------------------------------------|
  |                                                          N=2      |
  |-------------------------------------------------------------------|
  | age_cat                          18 - 40 years           1 (50%)  |
  |                                  >80 years               1 (50%)  |
  |-------------------------------------------------------------------|
  | male                             Female                  1 (50%)  |
  |                                  Male                    1 (50%)  |
  |-------------------------------------------------------------------|
  | region of England                London                  1 (100%) |
  |-------------------------------------------------------------------|
  | Rural Urban in five categories   Rural town and fringe   2 (100%) |
  |-------------------------------------------------------------------|
  | prescribed_biologics             0                       1 (50%)  |
  |                                  1                       1 (50%)  |
  |-------------------------------------------------------------------|
  | imd                              4                       1 (50%)  |
  |                                  5                       1 (50%)  |
  |-------------------------------------------------------------------|
  | care_home                        0                       2 (100%) |
  |-------------------------------------------------------------------|
  | smoking                          Unknown                 2 (100%) |
  |-------------------------------------------------------------------|
  | time_ra                                                           |
  |-------------------------------------------------------------------|
  | bmi_cat                          Healthy range           1 (50%)  |
  |                                  Obese                   1 (50%)  |
  +-------------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
(note: variable level was str21, now str27 to accommodate using data's
       values)
(note: variable Total was str8, now str19 to accommodate using data's values)
file /tmp/St00011.000003 saved
(432 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                           59     9 |
  |--------------------------------------------|
  | male                              68     0 |
  |--------------------------------------------|
  | region of England                 56    12 |
  |--------------------------------------------|
  | Rural Urban in five categories    68     0 |
  |--------------------------------------------|
  | prescribed_biologics              68     0 |
  |--------------------------------------------|
  | imd                               68     0 |
  |--------------------------------------------|
  | care_home                         68     0 |
  |--------------------------------------------|
  | smoking                           68     0 |
  |--------------------------------------------|
  | time_ra                           33    35 |
  |--------------------------------------------|
  | bmi_cat                           68     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=68        
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 25 (42%)    
>         |
  |                                  41 - 60 years                 16 (27%)    
>         |
  |                                  61 - 80 years                 14 (24%)    
>         |
  |                                  >80 years                     4 ( 7%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        35 (51%)    
>         |
  |                                  Male                          33 (49%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | region of England                East Midlands                 5 ( 9%)     
>         |
  |                                  London                        15 (27%)    
>         |
  |                                  North East                    7 (12%)     
>         |
  |                                  North West                    7 (12%)     
>         |
  |                                  South East                    12 (21%)    
>         |
  |                                  West Midlands                 10 (18%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       4 ( 6%)     
>         |
  |                                  Urban minor conurbation       8 (12%)     
>         |
  |                                  Urban city and town           16 (24%)    
>         |
  |                                  Rural town and fringe         17 (25%)    
>         |
  |                                  Rural village and dispersed   23 (34%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             30 (44%)    
>         |
  |                                  1                             38 (56%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             4 ( 6%)     
>         |
  |                                  1                             9 (13%)     
>         |
  |                                  2                             15 (22%)    
>         |
  |                                  3                             14 (21%)    
>         |
  |                                  4                             14 (21%)    
>         |
  |                                  5                             12 (18%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | care_home                        0                             61 (90%)    
>         |
  |                                  1                             7 (10%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  2 ( 3%)     
>         |
  |                                  Current smoker                18 (26%)    
>         |
  |                                  Ex-smoker                     7 (10%)     
>         |
  |                                  Unknown                       41 (60%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        57.36013 (31
> .04377) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       10 (15%)    
>         |
  |                                  Underweight                   6 ( 9%)     
>         |
  |                                  Healthy range                 12 (18%)    
>         |
  |                                  Overweight                    15 (22%)    
>         |
  |                                  Obese                         20 (29%)    
>         |
  |                                  Morbidly obese                5 ( 7%)     
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file ./output/tables/characteristics_ra_hosp_2020.csv saved
(462 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                           30     8 |
  |--------------------------------------------|
  | male                              38     0 |
  |--------------------------------------------|
  | region of England                 32     6 |
  |--------------------------------------------|
  | Rural Urban in five categories    38     0 |
  |--------------------------------------------|
  | prescribed_biologics              38     0 |
  |--------------------------------------------|
  | imd                               38     0 |
  |--------------------------------------------|
  | care_home                         38     0 |
  |--------------------------------------------|
  | smoking                           38     0 |
  |--------------------------------------------|
  | time_ra                           21    17 |
  |--------------------------------------------|
  | bmi_cat                           38     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=38        
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 12 (40%)    
>         |
  |                                  41 - 60 years                 10 (33%)    
>         |
  |                                  61 - 80 years                 6 (20%)     
>         |
  |                                  >80 years                     2 ( 7%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        15 (39%)    
>         |
  |                                  Male                          23 (61%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | region of England                East Midlands                 3 ( 9%)     
>         |
  |                                  London                        10 (31%)    
>         |
  |                                  North East                    3 ( 9%)     
>         |
  |                                  North West                    5 (16%)     
>         |
  |                                  South East                    7 (22%)     
>         |
  |                                  West Midlands                 4 (12%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       5 (13%)     
>         |
  |                                  Urban minor conurbation       3 ( 8%)     
>         |
  |                                  Urban city and town           9 (24%)     
>         |
  |                                  Rural town and fringe         9 (24%)     
>         |
  |                                  Rural village and dispersed   12 (32%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             19 (50%)    
>         |
  |                                  1                             19 (50%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             1 ( 3%)     
>         |
  |                                  1                             9 (24%)     
>         |
  |                                  2                             6 (16%)     
>         |
  |                                  3                             9 (24%)     
>         |
  |                                  4                             8 (21%)     
>         |
  |                                  5                             5 (13%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | care_home                        0                             31 (82%)    
>         |
  |                                  1                             7 (18%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  3 ( 8%)     
>         |
  |                                  Current smoker                7 (18%)     
>         |
  |                                  Ex-smoker                     5 (13%)     
>         |
  |                                  Unknown                       23 (61%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        52.82735 (22
> .95017) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       8 (21%)     
>         |
  |                                  Underweight                   1 ( 3%)     
>         |
  |                                  Healthy range                 7 (18%)     
>         |
  |                                  Overweight                    8 (21%)     
>         |
  |                                  Obese                         13 (34%)    
>         |
  |                                  Morbidly obese                1 ( 3%)     
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000003 saved
(494 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                            4     2 |
  |--------------------------------------------|
  | male                               6     0 |
  |--------------------------------------------|
  | region of England                  4     2 |
  |--------------------------------------------|
  | Rural Urban in five categories     6     0 |
  |--------------------------------------------|
  | prescribed_biologics               6     0 |
  |--------------------------------------------|
  | imd                                6     0 |
  |--------------------------------------------|
  | care_home                          6     0 |
  |--------------------------------------------|
  | smoking                            6     0 |
  |--------------------------------------------|
  | time_ra                            2     4 |
  |--------------------------------------------|
  | bmi_cat                            6     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=6         
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 4 (100%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        3 (50%)     
>         |
  |                                  Male                          3 (50%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | region of England                London                        1 (25%)     
>         |
  |                                  South East                    3 (75%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban city and town           2 (33%)     
>         |
  |                                  Rural town and fringe         1 (17%)     
>         |
  |                                  Rural village and dispersed   3 (50%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             3 (50%)     
>         |
  |                                  1                             3 (50%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              1                             1 (17%)     
>         |
  |                                  2                             1 (17%)     
>         |
  |                                  4                             3 (50%)     
>         |
  |                                  5                             1 (17%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | care_home                        0                             5 (83%)     
>         |
  |                                  1                             1 (17%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  1 (17%)     
>         |
  |                                  Ex-smoker                     2 (33%)     
>         |
  |                                  Unknown                       3 (50%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        80.53799 (25
> .11124) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Healthy range                 1 (17%)     
>         |
  |                                  Overweight                    3 (50%)     
>         |
  |                                  Obese                         2 (33%)     
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000003 saved
(359 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                          117    24 |
  |--------------------------------------------|
  | male                             141     0 |
  |--------------------------------------------|
  | region of England                117    24 |
  |--------------------------------------------|
  | Rural Urban in five categories   141     0 |
  |--------------------------------------------|
  | prescribed_biologics             141     0 |
  |--------------------------------------------|
  | imd                              141     0 |
  |--------------------------------------------|
  | care_home                        141     0 |
  |--------------------------------------------|
  | smoking                          141     0 |
  |--------------------------------------------|
  | time_ra                           57    84 |
  |--------------------------------------------|
  | bmi_cat                          141     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=141       
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 51 (43.6%)  
>         |
  |                                  41 - 60 years                 30 (25.6%)  
>         |
  |                                  61 - 80 years                 24 (20.5%)  
>         |
  |                                  >80 years                     12 (10.3%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        67 (47.5%)  
>         |
  |                                  Male                          74 (52.5%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | region of England                East Midlands                 13 (11.1%)  
>         |
  |                                  London                        27 (23.1%)  
>         |
  |                                  North East                    18 (15.4%)  
>         |
  |                                  North West                    12 (10.3%)  
>         |
  |                                  South East                    30 (25.6%)  
>         |
  |                                  West Midlands                 17 (14.5%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       13 ( 9.2%)  
>         |
  |                                  Urban minor conurbation       22 (15.6%)  
>         |
  |                                  Urban city and town           38 (27.0%)  
>         |
  |                                  Rural town and fringe         31 (22.0%)  
>         |
  |                                  Rural village and dispersed   37 (26.2%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             66 (46.8%)  
>         |
  |                                  1                             75 (53.2%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             6 ( 4.3%)   
>         |
  |                                  1                             30 (21.3%)  
>         |
  |                                  2                             29 (20.6%)  
>         |
  |                                  3                             22 (15.6%)  
>         |
  |                                  4                             25 (17.7%)  
>         |
  |                                  5                             29 (20.6%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | care_home                        0                             122 (86.5%) 
>         |
  |                                  1                             19 (13.5%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  15 (10.6%)  
>         |
  |                                  Current smoker                32 (22.7%)  
>         |
  |                                  Ex-smoker                     16 (11.3%)  
>         |
  |                                  Unknown                       78 (55.3%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        58.93406 (34
> .17219) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       28 (19.9%)  
>         |
  |                                  Underweight                   14 ( 9.9%)  
>         |
  |                                  Healthy range                 30 (21.3%)  
>         |
  |                                  Overweight                    25 (17.7%)  
>         |
  |                                  Obese                         30 (21.3%)  
>         |
  |                                  Morbidly obese                14 ( 9.9%)  
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000003 saved
file ./output/tables/characteristics_strata2021.csv saved
(189 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                          251    60 |
  |--------------------------------------------|
  | male                             311     0 |
  |--------------------------------------------|
  | region of England                243    68 |
  |--------------------------------------------|
  | Rural Urban in five categories   311     0 |
  |--------------------------------------------|
  | prescribed_biologics             311     0 |
  |--------------------------------------------|
  | imd                              311     0 |
  |--------------------------------------------|
  | care_home                        311     0 |
  |--------------------------------------------|
  | smoking                          311     0 |
  |--------------------------------------------|
  | time_ra                          138   173 |
  |--------------------------------------------|
  | bmi_cat                          311     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=311       
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 95 (37.8%)  
>         |
  |                                  41 - 60 years                 75 (29.9%)  
>         |
  |                                  61 - 80 years                 68 (27.1%)  
>         |
  |                                  >80 years                     13 ( 5.2%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        150 (48.2%) 
>         |
  |                                  Male                          161 (51.8%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | region of England                East Midlands                 33 (13.6%)  
>         |
  |                                  London                        59 (24.3%)  
>         |
  |                                  North East                    31 (12.8%)  
>         |
  |                                  North West                    37 (15.2%)  
>         |
  |                                  South East                    50 (20.6%)  
>         |
  |                                  West Midlands                 33 (13.6%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       27 ( 8.7%)  
>         |
  |                                  Urban minor conurbation       39 (12.5%)  
>         |
  |                                  Urban city and town           96 (30.9%)  
>         |
  |                                  Rural town and fringe         65 (20.9%)  
>         |
  |                                  Rural village and dispersed   84 (27.0%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             145 (46.6%) 
>         |
  |                                  1                             166 (53.4%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             17 ( 5.5%)  
>         |
  |                                  1                             56 (18.0%)  
>         |
  |                                  2                             62 (19.9%)  
>         |
  |                                  3                             55 (17.7%)  
>         |
  |                                  4                             55 (17.7%)  
>         |
  |                                  5                             66 (21.2%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | care_home                        0                             259 (83.3%) 
>         |
  |                                  1                             52 (16.7%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  31 (10.0%)  
>         |
  |                                  Current smoker                53 (17.0%)  
>         |
  |                                  Ex-smoker                     47 (15.1%)  
>         |
  |                                  Unknown                       180 (57.9%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        50.68153 (31
> .38932) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       62 (19.9%)  
>         |
  |                                  Underweight                   26 ( 8.4%)  
>         |
  |                                  Healthy range                 52 (16.7%)  
>         |
  |                                  Overweight                    59 (19.0%)  
>         |
  |                                  Obese                         98 (31.5%)  
>         |
  |                                  Morbidly obese                14 ( 4.5%)  
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000003 saved
(496 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                            2     2 |
  |--------------------------------------------|
  | male                               4     0 |
  |--------------------------------------------|
  | region of England                  4     0 |
  |--------------------------------------------|
  | Rural Urban in five categories     4     0 |
  |--------------------------------------------|
  | prescribed_biologics               4     0 |
  |--------------------------------------------|
  | imd                                4     0 |
  |--------------------------------------------|
  | care_home                          4     0 |
  |--------------------------------------------|
  | smoking                            4     0 |
  |--------------------------------------------|
  | time_ra                            0     4 |
  |--------------------------------------------|
  | bmi_cat                            4     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +-------------------------------------------------------------------------+
  |                                                                Total    |
  |-------------------------------------------------------------------------|
  |                                                                N=4      |
  |-------------------------------------------------------------------------|
  | age_cat                          18 - 40 years                 1 (50%)  |
  |                                  61 - 80 years                 1 (50%)  |
  |-------------------------------------------------------------------------|
  | male                             Female                        3 (75%)  |
  |                                  Male                          1 (25%)  |
  |-------------------------------------------------------------------------|
  | region of England                East Midlands                 1 (25%)  |
  |                                  North West                    2 (50%)  |
  |                                  South East                    1 (25%)  |
  |-------------------------------------------------------------------------|
  | Rural Urban in five categories   Urban major conurbation       1 (25%)  |
  |                                  Urban minor conurbation       1 (25%)  |
  |                                  Rural town and fringe         1 (25%)  |
  |                                  Rural village and dispersed   1 (25%)  |
  |-------------------------------------------------------------------------|
  | prescribed_biologics             0                             1 (25%)  |
  |                                  1                             3 (75%)  |
  |-------------------------------------------------------------------------|
  | imd                              1                             1 (25%)  |
  |                                  2                             2 (50%)  |
  |                                  4                             1 (25%)  |
  |-------------------------------------------------------------------------|
  | care_home                        0                             4 (100%) |
  |-------------------------------------------------------------------------|
  | smoking                          Current smoker                1 (25%)  |
  |                                  Unknown                       3 (75%)  |
  |-------------------------------------------------------------------------|
  | time_ra                                                                 |
  |-------------------------------------------------------------------------|
  | bmi_cat                          Missing                       2 (50%)  |
  |                                  Healthy range                 1 (25%)  |
  |                                  Obese                         1 (25%)  |
  +-------------------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
(note: variable Total was str8, now str19 to accommodate using data's values)
file /tmp/St00011.000003 saved
(442 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                           41    17 |
  |--------------------------------------------|
  | male                              58     0 |
  |--------------------------------------------|
  | region of England                 46    12 |
  |--------------------------------------------|
  | Rural Urban in five categories    58     0 |
  |--------------------------------------------|
  | prescribed_biologics              58     0 |
  |--------------------------------------------|
  | imd                               58     0 |
  |--------------------------------------------|
  | care_home                         58     0 |
  |--------------------------------------------|
  | smoking                           58     0 |
  |--------------------------------------------|
  | time_ra                           24    34 |
  |--------------------------------------------|
  | bmi_cat                           58     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=58        
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 12 (29%)    
>         |
  |                                  41 - 60 years                 11 (27%)    
>         |
  |                                  61 - 80 years                 15 (37%)    
>         |
  |                                  >80 years                     3 ( 7%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        26 (45%)    
>         |
  |                                  Male                          32 (55%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | region of England                East Midlands                 4 ( 9%)     
>         |
  |                                  London                        8 (17%)     
>         |
  |                                  North East                    9 (20%)     
>         |
  |                                  North West                    8 (17%)     
>         |
  |                                  South East                    12 (26%)    
>         |
  |                                  West Midlands                 5 (11%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       4 ( 7%)     
>         |
  |                                  Urban minor conurbation       5 ( 9%)     
>         |
  |                                  Urban city and town           19 (33%)    
>         |
  |                                  Rural town and fringe         10 (17%)    
>         |
  |                                  Rural village and dispersed   20 (34%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             26 (45%)    
>         |
  |                                  1                             32 (55%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             2 ( 3%)     
>         |
  |                                  1                             10 (17%)    
>         |
  |                                  2                             9 (16%)     
>         |
  |                                  3                             12 (21%)    
>         |
  |                                  4                             9 (16%)     
>         |
  |                                  5                             16 (28%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | care_home                        0                             48 (83%)    
>         |
  |                                  1                             10 (17%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  7 (12%)     
>         |
  |                                  Current smoker                13 (22%)    
>         |
  |                                  Ex-smoker                     8 (14%)     
>         |
  |                                  Unknown                       30 (52%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        57.51563 (31
> .96278) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       12 (21%)    
>         |
  |                                  Underweight                   3 ( 5%)     
>         |
  |                                  Healthy range                 13 (22%)    
>         |
  |                                  Overweight                    11 (19%)    
>         |
  |                                  Obese                         18 (31%)    
>         |
  |                                  Morbidly obese                1 ( 2%)     
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file ./output/tables/characteristics_ra_hosp_2021.csv saved

. preserve

.     keep if ra_hosp_2018==1
(437 observations deleted)

.     table1_mc, vars(age_cat cate \ male cate \ region cate \ urban_rural_5 ca
> te \ prescribed_biologics cate \ imd cate \ care_home cate \ smoking cate \ t
> ime_ra contn \ bmi_cat cate) clear

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                           53    10 |
  |--------------------------------------------|
  | male                              63     0 |
  |--------------------------------------------|
  | region of England                 52    11 |
  |--------------------------------------------|
  | Rural Urban in five categories    63     0 |
  |--------------------------------------------|
  | prescribed_biologics              63     0 |
  |--------------------------------------------|
  | imd                               63     0 |
  |--------------------------------------------|
  | care_home                         63     0 |
  |--------------------------------------------|
  | smoking                           63     0 |
  |--------------------------------------------|
  | time_ra                           26    37 |
  |--------------------------------------------|
  | bmi_cat                           63     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=63        
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 20 (38%)    
>         |
  |                                  41 - 60 years                 17 (32%)    
>         |
  |                                  61 - 80 years                 12 (23%)    
>         |
  |                                  >80 years                     4 ( 8%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        27 (43%)    
>         |
  |                                  Male                          36 (57%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | region of England                East Midlands                 14 (27%)    
>         |
  |                                  London                        9 (17%)     
>         |
  |                                  North East                    7 (13%)     
>         |
  |                                  North West                    6 (12%)     
>         |
  |                                  South East                    5 (10%)     
>         |
  |                                  West Midlands                 11 (21%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       8 (13%)     
>         |
  |                                  Urban minor conurbation       8 (13%)     
>         |
  |                                  Urban city and town           19 (30%)    
>         |
  |                                  Rural town and fringe         10 (16%)    
>         |
  |                                  Rural village and dispersed   18 (29%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             22 (35%)    
>         |
  |                                  1                             41 (65%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             4 ( 6%)     
>         |
  |                                  1                             12 (19%)    
>         |
  |                                  2                             15 (24%)    
>         |
  |                                  3                             7 (11%)     
>         |
  |                                  4                             13 (21%)    
>         |
  |                                  5                             12 (19%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | care_home                        0                             57 (90%)    
>         |
  |                                  1                             6 (10%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  12 (19%)    
>         |
  |                                  Current smoker                10 (16%)    
>         |
  |                                  Ex-smoker                     7 (11%)     
>         |
  |                                  Unknown                       34 (54%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        56.33507 (34
> .47215) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       12 (19%)    
>         |
  |                                  Underweight                   7 (11%)     
>         |
  |                                  Healthy range                 7 (11%)     
>         |
  |                                  Overweight                    10 (16%)    
>         |
  |                                  Obese                         22 (35%)    
>         |
  |                                  Morbidly obese                5 ( 8%)     
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 

.     export delimited using ./output/tables/characteristics_ra_hosp_2018.csv
file ./output/tables/characteristics_ra_hosp_2018.csv saved

.     restore

. log close
      name:  <unnamed>
       log:  /workspace/logs/outpatients.log
  log type:  text
 closed on:   2 Sep 2022, 07:51:21
-------------------------------------------------------------------------------
