
. 
. cap mkdir ./output/tables/

. cap mkdir ./output/tempdata

. 
. * Import data
. import delimited using ./output/input.csv
(54 vars, 10,000 obs)

. * Check data
. count if age==. 
  0

. count if age<18 
  2,106

. count if age>110 & age!=.
  0

. sum age, d

                             age
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            4              0
10%            8              0       Obs              10,000
25%           21              0       Sum of Wgt.      10,000

50%           40                      Mean            40.3826
                        Largest       Std. Dev.      23.77317
75%           59            103
90%           73            104       Variance       565.1637
95%           79            108       Skewness       .1377814
99%           89            108       Kurtosis       2.045401

. count if sex==""
  0

. tab sex

        sex |      Freq.     Percent        Cum.
------------+-----------------------------------
          F |      4,968       49.68       49.68
          M |      4,950       49.50       99.18
          U |         82        0.82      100.00
------------+-----------------------------------
      Total |     10,000      100.00

. * Checking RA algorithm variables
. * Checking type of DMARD that meets inclusion
. foreach dmard in metho leflu sulfa hydrox {
  2.     gen `dmard'_multi = (`dmard'_count>=2)
  3.     tab `dmard'_multi if has_dmards==1, m
  4. }

metho_multi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        794       15.88       15.88
          1 |      4,206       84.12      100.00
------------+-----------------------------------
      Total |      5,000      100.00

leflu_multi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        818       16.36       16.36
          1 |      4,182       83.64      100.00
------------+-----------------------------------
      Total |      5,000      100.00

sulfa_multi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        781       15.62       15.62
          1 |      4,219       84.38      100.00
------------+-----------------------------------
      Total |      5,000      100.00

hydrox_mult |
          i |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        809       16.18       16.18
          1 |      4,191       83.82      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. gen dmard_multi = (metho_multi==1 | leflu_multi==1 | sulfa_multi==1 | hydrox_
> multi==1)

. tab dmard_multi has_alt_dmard_diag

dmard_mult |  has_alt_dmard_diag
         i |         0          1 |     Total
-----------+----------------------+----------
         0 |         4          2 |         6 
         1 |     4,996      4,998 |     9,994 
-----------+----------------------+----------
     Total |     5,000      5,000 |    10,000 

. sum number_ra_codes

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
number_ra_~s |     10,000      2.5033    1.038411          0          6

. di "Number where no DMARDs but does have multiple RA codes and no alt diag"
Number where no DMARDs but does have multiple RA codes and no alt diag

. count if has_dmards==0 & number_ra_codes>=2 & alt_diag!=1
  2,122

. tab has_ra, m

     has_ra |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,000       50.00       50.00
          1 |      5,000       50.00      100.00
------------+-----------------------------------
      Total |     10,000      100.00

. keep if has_ra
(5,000 observations deleted)

. * Time since first RA code
. gen first_ra_codeA = date(first_ra_code, "YMD")
(2,746 missing values generated)

. format first_ra_codeA %dD/N/CY

. gen time_ra = (date("01Mar2019", "DMY") - first_ra_codeA)/365.25
(2,746 missing values generated)

. sum time_ra, d

                           time_ra
-------------------------------------------------------------
      Percentiles      Smallest
 1%     1.295003      -.0383299
 5%     6.143737      -.0164271
10%     11.48255      -.0164271       Obs               2,254
25%     27.68789        .019165       Sum of Wgt.       2,254

50%     55.17591                      Mean           55.36372
                        Largest       Std. Dev.      31.60848
75%       83.436       109.8508
90%      98.5462       109.8672       Variance       999.0962
95%      103.718       109.9439       Skewness      -.0253542
99%     109.0157       109.9439       Kurtosis       1.786186

. sum number_ra_codes, d

                       number_ra_codes
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            2                      Mean             2.5072
                        Largest       Std. Dev.      1.032745
75%            3              6
90%            4              6       Variance       1.066561
95%            4              6       Skewness       .0673534
99%            5              6       Kurtosis       2.843934

. sum metho_count, d

                         metho_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            3                      Mean             2.5154
                        Largest       Std. Dev.      1.023119
75%            3              6
90%            4              6       Variance       1.046772
95%            4              6       Skewness       .0615468
99%            5              6       Kurtosis        2.90493

. sum sulfa_count, d 

                         sulfa_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            2                      Mean             2.4982
                        Largest       Std. Dev.      1.022451
75%            3              6
90%            4              6       Variance       1.045406
95%            4              6       Skewness       .0632574
99%            5              6       Kurtosis       2.940736

. sum leflu_count, d 

                         leflu_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            3                      Mean             2.5096
                        Largest       Std. Dev.      1.032144
75%            3              6
90%            4              6       Variance       1.065321
95%            4              6       Skewness       .0485101
99%            5              7       Kurtosis       2.991625

. sum hydrox_count, d 

                        hydrox_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            2                      Mean             2.4918
                        Largest       Std. Dev.      1.035252
75%            3              6
90%            4              6       Variance       1.071747
95%            4              6       Skewness       .0522092
99%            5              6       Kurtosis       2.939922

. 
. sum outpatient*, d

                    outpatient_appt_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            2              0       Obs               5,000
25%            6              0       Sum of Wgt.       5,000

50%            7                      Mean             6.7332
                        Largest       Std. Dev.      2.933281
75%            9             13
90%           10             14       Variance       8.604139
95%           11             14       Skewness      -.8588885
99%           12             14       Kurtosis       3.472042

                    outpatient_appt_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               5,000
25%            6              0       Sum of Wgt.       5,000

50%            7                      Mean             6.7204
                        Largest       Std. Dev.      2.954381
75%            9             14
90%           10             14       Variance        8.72837
95%           11             14       Skewness      -.8871281
99%           12             15       Kurtosis       3.447576

                    outpatient_appt_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            2              0       Obs               5,000
25%            6              0       Sum of Wgt.       5,000

50%            7                      Mean             6.7742
                        Largest       Std. Dev.      2.938119
75%            9             13
90%           10             13       Variance       8.632541
95%           11             14       Skewness      -.8818083
99%           12             14       Kurtosis       3.489405

                   outpatient_medium_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               2,484
25%            2              1       Sum of Wgt.       2,484

50%            4                      Mean           13.27899
                        Largest       Std. Dev.       28.2496
75%            7             98
90%            8             98       Variance       798.0401
95%           98             98       Skewness       2.644713
99%           98             98       Kurtosis       8.065284

                   outpatient_medium_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               2,526
25%            2              1       Sum of Wgt.       2,526

50%            5                      Mean           13.73713
                        Largest       Std. Dev.      28.57855
75%            7             98
90%           98             98       Variance       816.7333
95%           98             98       Skewness       2.589031
99%           98             98       Kurtosis       7.771118

                   outpatient_medium_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               2,493
25%            2              1       Sum of Wgt.       2,493

50%            5                      Mean           13.74047
                        Largest       Std. Dev.      28.60153
75%            7             98
90%           98             98       Variance       818.0478
95%           98             98       Skewness       2.586237
99%           98             98       Kurtosis       7.756729

                  outpatient_appt_all_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               5,000
25%            6              0       Sum of Wgt.       5,000

50%            7                      Mean             6.7242
                        Largest       Std. Dev.      2.962953
75%            9             13
90%           10             13       Variance        8.77909
95%           11             13       Skewness      -.8706605
99%           12             14       Kurtosis       3.443204

                  outpatient_appt_all_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               5,000
25%            6              0       Sum of Wgt.       5,000

50%            7                      Mean             6.7076
                        Largest       Std. Dev.      2.967265
75%            9             14
90%           10             14       Variance       8.804663
95%           11             14       Skewness      -.8408435
99%           12             15       Kurtosis        3.44579

                  outpatient_appt_all_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            2              0       Obs               5,000
25%            6              0       Sum of Wgt.       5,000

50%            7                      Mean              6.753
                        Largest       Std. Dev.      2.916452
75%            9             14
90%           10             14       Variance       8.505692
95%           11             14       Skewness      -.8800061
99%           12             14       Kurtosis       3.553387

. 
. forvalues i=2019/2021 {
  2.     sum ra_hosp_beddays_`i' if ra_hosp_`i'>0, d 
  3. }

                    ra_hosp_beddays_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               4,886
25%            2              0       Sum of Wgt.       4,886

50%            3                      Mean           2.523537
                        Largest       Std. Dev.      1.047568
75%            3              6
90%            4              6       Variance       1.097399
95%            4              6       Skewness      -.0029988
99%            5              7       Kurtosis       2.919576

                    ra_hosp_beddays_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               4,886
25%            2              0       Sum of Wgt.       4,886

50%            2                      Mean           2.479124
                        Largest       Std. Dev.      1.059863
75%            3              6
90%            4              6       Variance        1.12331
95%            4              6       Skewness       .0547192
99%            5              6       Kurtosis       2.846063

                    ra_hosp_beddays_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               4,872
25%            2              0       Sum of Wgt.       4,872

50%            3                      Mean           2.504516
                        Largest       Std. Dev.      1.041522
75%            3              6
90%            4              6       Variance       1.084767
95%            4              6       Skewness       .0321512
99%            5              6       Kurtosis       2.894214

. 
. 
. * How many people are not on DMARDs and have no RA appointments?
. 
. * Format variables
. *re-order ethnicity
.  gen eth5=1 if ethnicity==1
(3,976 missing values generated)

.  replace eth5=2 if ethnicity==3
(1,020 real changes made)

.  replace eth5=3 if ethnicity==4
(975 real changes made)

.  replace eth5=4 if ethnicity==2
(989 real changes made)

.  replace eth5=5 if ethnicity==5
(992 real changes made)

.  replace eth5=6 if ethnicity==0
(0 real changes made)

. 
.  label define eth5                      1 "White"                            
>            ///
>                                                         2 "South Asian"      
>                    ///                                             
>                                                         3 "Black"            
>                            ///
>                                                         4 "Mixed"            
>                            ///
>                                                         5 "Other"            
>        ///
>                             6 "Missing"                                 

.                                         
. 
. label values eth5 eth5

. safetab eth5, m
5

       eth5 |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |      1,024       20.48       20.48
South Asian |      1,020       20.40       40.88
      Black |        975       19.50       60.38
      Mixed |        989       19.78       80.16
      Other |        992       19.84      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. 
. * formatting gender
. gen male=(sex=="M")

. replace male = 0 if sex == "F"
(0 real changes made)

. label define male 0"Female" 1"Male"

. label values male male

. safetab male, miss
5

       male |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |      2,509       50.18       50.18
       Male |      2,491       49.82      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. 
. *create a 4 category rural urban variable 
. generate urban_rural_5=.
(5,000 missing values generated)

. la var urban_rural_5 "Rural Urban in five categories"

. replace urban_rural_5=1 if urban_rural==1
(627 real changes made)

. replace urban_rural_5=2 if urban_rural==2
(636 real changes made)

. replace urban_rural_5=3 if urban_rural==3|urban_rural==4
(1,236 real changes made)

. replace urban_rural_5=4 if urban_rural==5|urban_rural==6
(1,233 real changes made)

. replace urban_rural_5=5 if urban_rural==7|urban_rural==8
(1,268 real changes made)

. label define urban_rural_5 1 "Urban major conurbation" 2 "Urban minor conurba
> tion" 3 "Urban city and town" 4 "Rural town and fringe" 5 "Rural village and 
> dispersed"

. label values urban_rural_5 urban_rural_5

. safetab urban_rural_5, miss
14

        Rural Urban in five |
                 categories |      Freq.     Percent        Cum.
----------------------------+-----------------------------------
    Urban major conurbation |        627       12.54       12.54
    Urban minor conurbation |        636       12.72       25.26
        Urban city and town |      1,236       24.72       49.98
      Rural town and fringe |      1,233       24.66       74.64
Rural village and dispersed |      1,268       25.36      100.00
----------------------------+-----------------------------------
                      Total |      5,000      100.00

. 
. *generate a binary rural urban (with missing assigned to urban)
. generate urban_rural_bin=.
(5,000 missing values generated)

. replace urban_rural_bin=1 if urban_rural<=4|urban_rural==.
(2,499 real changes made)

. replace urban_rural_bin=0 if urban_rural>4 & urban_rural!=.
(2,501 real changes made)

. label define urban_rural_bin 0 "Rural" 1 "Urban"

. label values urban_rural_bin urban_rural_bin

. safetab urban_rural_bin urban_rural, miss
28

urban_rura |                      urban_rural
     l_bin |         1          2          3          4          5 |     Total
-----------+-------------------------------------------------------+----------
     Rural |         0          0          0          0        629 |     2,501 
     Urban |       627        636        635        601          0 |     2,499 
-----------+-------------------------------------------------------+----------
     Total |       627        636        635        601        629 |     5,000 


urban_rura |           urban_rural
     l_bin |         6          7          8 |     Total
-----------+---------------------------------+----------
     Rural |       604        605        663 |     2,501 
     Urban |         0          0          0 |     2,499 
-----------+---------------------------------+----------
     Total |       604        605        663 |     5,000 

. label var urban_rural_bin "Rural-Urban"

. 
. * Make missing category for region
. replace region = "missing" if region==""
(0 real changes made)

. * Make numeric region variable 
. gen region_n = 1 if region=="East Midlands"
(4,515 missing values generated)

. replace region_n = 2 if region=="East of England"
(491 real changes made)

. replace region_n = 3 if region=="London"
(988 real changes made)

. replace region_n = 4 if region=="North East"
(506 real changes made)

. replace region_n = 5 if region=="North West"
(519 real changes made)

. replace region_n = 6 if region=="South East"
(1,000 real changes made)

. replace region_n = 7 if region=="South West"
(0 real changes made)

. replace region_n = 8 if region=="West Midlands"
(502 real changes made)

. replace region_n = 9 if region=="Yorkshire and the Humber"
(509 real changes made)

. tab region*, m 

                      |                  region_n
               region |         1          2          3          4 |     Total
----------------------+--------------------------------------------+----------
        East Midlands |       485          0          0          0 |       485 
      East of England |         0        491          0          0 |       491 
               London |         0          0        988          0 |       988 
           North East |         0          0          0        506 |       506 
           North West |         0          0          0          0 |       519 
           South East |         0          0          0          0 |     1,000 
        West Midlands |         0          0          0          0 |       502 
Yorkshire and the H.. |         0          0          0          0 |       509 
----------------------+--------------------------------------------+----------
                Total |       485        491        988        506 |     5,000 


                      |                  region_n
               region |         5          6          8          9 |     Total
----------------------+--------------------------------------------+----------
        East Midlands |         0          0          0          0 |       485 
      East of England |         0          0          0          0 |       491 
               London |         0          0          0          0 |       988 
           North East |         0          0          0          0 |       506 
           North West |       519          0          0          0 |       519 
           South East |         0      1,000          0          0 |     1,000 
        West Midlands |         0          0        502          0 |       502 
Yorkshire and the H.. |         0          0          0        509 |       509 
----------------------+--------------------------------------------+----------
                Total |       519      1,000        502        509 |     5,000 

. 
. * Define age categories
. * Create age categories
. egen age_cat = cut(age), at(18, 40, 60, 80, 120) icodes
(1073 missing values generated)

. label define age 0 "18 - 40 years" 1 "41 - 60 years" 2 "61 - 80 years" 3 ">80
>  years"

. label values age_cat age

. safetab age_cat, miss
8

      age_cat |      Freq.     Percent        Cum.
--------------+-----------------------------------
18 - 40 years |      1,423       28.46       28.46
41 - 60 years |      1,279       25.58       54.04
61 - 80 years |        962       19.24       73.28
    >80 years |        263        5.26       78.54
            . |      1,073       21.46      100.00
--------------+-----------------------------------
        Total |      5,000      100.00

. 
. * Smoking status
. gen smoking = 0 if smoking_status=="N"
(4,494 missing values generated)

. replace smoking = 1 if smoking_status=="S"
(996 real changes made)

. replace smoking = 2 if smoking_status=="E"
(784 real changes made)

. replace smoking = 3 if smoking==.
(2,714 real changes made)

. 
. label define smok 1 "Current smoker" 2 "Ex-smoker" 0 "Never smoked" 3 "Unknow
> n"

. label values smoking smok

. 
. * BMI categories
. egen bmi_cat = cut(bmi), at(0, 1, 18.5, 24.9, 29.9, 39.9, 100) icodes
(1 missing value generated)

. bys bmi_cat: sum bmi

-------------------------------------------------------------------------------
-> bmi_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |      1,008           0           0          0          0

-------------------------------------------------------------------------------
-> bmi_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        466    14.90973    3.171873   3.792555   18.48394

-------------------------------------------------------------------------------
-> bmi_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        914     22.0272    1.829278   18.50423   24.89146

-------------------------------------------------------------------------------
-> bmi_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        968    27.33716    1.422361   24.91101   29.89399

-------------------------------------------------------------------------------
-> bmi_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |      1,387    34.04492     2.65998   29.90162   39.86244

-------------------------------------------------------------------------------
-> bmi_cat = 5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        256    43.37262    2.766644   39.90857   54.91833

-------------------------------------------------------------------------------
-> bmi_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |          1   -3.161769           .  -3.161769  -3.161769


. * add missing . to zero category
. replace bmi_cat = 0 if bmi_cat==. 
(1 real change made)

. label define bmi 0 "Missing" 1 "Underweight" 2 "Healthy range" 3 "Overweight"
>  4 "Obese" 5 "Morbidly obese"

. label values bmi_cat bmi

. 
. * Determine if still in follow-up for each year
. * Format dates
. gen died_fuA = date(died_fu, "YMD")
(2,501 missing values generated)

. gen dereg_dateA = date(dereg_date, "YMD")
(2,514 missing values generated)

. gen end_fu = date("`j'-03-31", "YMD")
(5,000 missing values generated)

. gen end_date = min(died_fuA, dereg_dateA, end_fu)
(1,262 missing values generated)

. drop end_fu

. sum end_date

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    end_date |      3,738    22498.76      331.21      21976      23156

. di "Number where end date prior to follow-up start"
Number where end date prior to follow-up start

. count if end_date<date("2019-04-01", "YMD")
  0

. * determine range of dates for outpatient appointments to determine which sho
> uld be dropped
. gen end_2020 = end_date<date("2020-03-31", "YMD")

. gen end_2021 = end_date<date("2021-03-31", "YMD") 

. gen end_2022 = end_date<date("2022-03-31", "YMD") 

. tab end_2020

   end_2020 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,893       97.86       97.86
          1 |        107        2.14      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. tab end_2021

   end_2021 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,472       69.44       69.44
          1 |      1,528       30.56      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. tab end_2022

   end_2022 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,285       45.70       45.70
          1 |      2,715       54.30      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. 
. * Set outpatient appointment count to missing if end prior to the end of the 
> year 
. forvalues i=2019/2021 {
  2.     local j=`i'+1
  3.     di `j'
  4.     gen op_appt_`i'_orig = outpatient_appt_`i'
  5.     replace outpatient_appt_`i'=. if end_`j'
  6.     gen op_medium_`i'_orig = outpatient_medium_`i'
  7.     replace outpatient_medium_`i'=. if end_`j'
  8.     gen op_appt_all_`i'_orig = outpatient_appt_all_`i'
  9.     replace outpatient_appt_all_`i'=. if end_`j'
 10. }
2020
(107 real changes made, 107 to missing)
(2,516 missing values generated)
(58 real changes made, 58 to missing)
(107 real changes made, 107 to missing)
2021
(1,528 real changes made, 1,528 to missing)
(2,474 missing values generated)
(800 real changes made, 800 to missing)
(1,528 real changes made, 1,528 to missing)
2022
(2,715 real changes made, 2,715 to missing)
(2,507 missing values generated)
(1,359 real changes made, 1,359 to missing)
(2,715 real changes made, 2,715 to missing)

. 
. * Categorise number of outpatient appointments
. label define appt 0 "No appointments" 1 "1-2 per year" 2 "3 or more per year"
>  

. forvalues i=2019/2021 {
  2.     * Rheumatology outpatient appointments
.     egen op_appt_`i'_cat = cut(outpatient_appt_`i'), at(0, 1, 3, 1000) icodes
  3.     * Check all categorised
.     bys op_appt_`i'_cat: sum outpatient_appt_`i'
  4.     label values op_appt_`i'_cat appt
  5.     * Same for orginal variables
.     egen op_appt_`i'_orig_cat = cut(op_appt_`i'_orig), at(0, 1, 3, 1000) icod
> es
  6.     * Check all categorised
.     bys op_appt_`i'_orig_cat: sum op_appt_`i'_orig
  7.     label values op_appt_`i'_orig_cat appt
  8.     }
(107 missing values generated)

-------------------------------------------------------------------------------
-> op_appt_2019_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2019 |        475           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_2019_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2019 |         36    1.833333    .3779645          1          2

-------------------------------------------------------------------------------
-> op_appt_2019_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2019 |      4,382    7.515062     1.96793          3         14

-------------------------------------------------------------------------------
-> op_appt_2019_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2019 |          0


-------------------------------------------------------------------------------
-> op_appt_2019_orig_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2019_orig |        488           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_2019_orig_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2019_orig |         37    1.837838    .3736839          1          2

-------------------------------------------------------------------------------
-> op_appt_2019_orig_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2019_orig |      4,475    7.507933    1.967009          3         14

(1528 missing values generated)

-------------------------------------------------------------------------------
-> op_appt_2020_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2020 |        357           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_2020_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2020 |         19    1.736842    .4524139          1          2

-------------------------------------------------------------------------------
-> op_appt_2020_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2020 |      3,096    7.519703    1.950502          3         15

-------------------------------------------------------------------------------
-> op_appt_2020_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2020 |          0


-------------------------------------------------------------------------------
-> op_appt_2020_orig_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2020_orig |        513           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_2020_orig_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2020_orig |         27    1.777778    .4236593          1          2

-------------------------------------------------------------------------------
-> op_appt_2020_orig_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2020_orig |      4,460    7.523318     1.94823          3         15

(2715 missing values generated)

-------------------------------------------------------------------------------
-> op_appt_2021_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2021 |        227           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_2021_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2021 |         15         1.6    .5070926          1          2

-------------------------------------------------------------------------------
-> op_appt_2021_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2021 |      2,043    7.508566    1.948479          3         14

-------------------------------------------------------------------------------
-> op_appt_2021_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2021 |          0


-------------------------------------------------------------------------------
-> op_appt_2021_orig_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2021_orig |        488           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_2021_orig_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2021_orig |         29    1.724138    .4548588          1          2

-------------------------------------------------------------------------------
-> op_appt_2021_orig_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2021_orig |      4,483    7.544278    1.967834          3         14


. 
. * Calculate difference in rheumatology appointments compared to 2019
. gen diff_op_2020 = outpatient_appt_2020 - outpatient_appt_2019
(1,528 missing values generated)

. gen diff_op_2021 = outpatient_appt_2021 - outpatient_appt_2019
(2,715 missing values generated)

. sum diff_op_2020 diff_op_2021, d

                        diff_op_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%          -10            -13
 5%           -7            -13
10%           -6            -13       Obs               3,472
25%           -2            -12       Sum of Wgt.       3,472

50%            0                      Mean          -.0279378
                        Largest       Std. Dev.      4.160227
75%            2             12
90%            5             12       Variance       17.30749
95%            7             12       Skewness      -.0338069
99%           10             12       Kurtosis       3.174399

                        diff_op_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%          -10            -13
 5%           -7            -12
10%           -5            -12       Obs               2,285
25%           -2            -11       Sum of Wgt.       2,285

50%            0                      Mean          -.0052516
                        Largest       Std. Dev.      4.148932
75%            2             12
90%            5             13       Variance       17.21363
95%            7             13       Skewness      -.0254507
99%           10             13       Kurtosis       3.243611

. 
. * Identify people with no appointments in either year flag them and set diffe
> rence to missing
. forvalues i=2020/2021 {
  2.     gen no_appts_`i' = diff_op_`i'==0 & op_appt_`i'_cat==0
  3.     tab no_appts_`i' op_appt_`i'_cat
  4.     replace diff_op_`i'=. if no_appts_`i'==1
  5. }

no_appts_2 |         op_appt_2020_cat
       020 | No appoin  1-2 per y  3 or more |     Total
-----------+---------------------------------+----------
         0 |       321         19      3,096 |     3,436 
         1 |        36          0          0 |        36 
-----------+---------------------------------+----------
     Total |       357         19      3,096 |     3,472 
(36 real changes made, 36 to missing)

no_appts_2 |         op_appt_2021_cat
       021 | No appoin  1-2 per y  3 or more |     Total
-----------+---------------------------------+----------
         0 |       211         15      2,043 |     2,269 
         1 |        16          0          0 |        16 
-----------+---------------------------------+----------
     Total |       227         15      2,043 |     2,285 
(16 real changes made, 16 to missing)

. 
. * Identify of people with appointments whether they had fewer appointments 
. forvalues i=2020/2021 {
  2.     gen fewer_appts_`i' = (diff_op_`i' < 0) if diff_op_`i'!=.
  3.     tab fewer_appts_`i' no_appts_`i'
  4. }
(1,564 missing values generated)

           | no_appts_2
fewer_appt |    020
    s_2020 |         0 |     Total
-----------+-----------+----------
         0 |     1,925 |     1,925 
         1 |     1,511 |     1,511 
-----------+-----------+----------
     Total |     3,436 |     3,436 
(2,731 missing values generated)

           | no_appts_2
fewer_appt |    021
    s_2021 |         0 |     Total
-----------+-----------+----------
         0 |     1,291 |     1,291 
         1 |       978 |       978 
-----------+-----------+----------
     Total |     2,269 |     2,269 

. 
. * Categorise number of outpatient appointments (all specialties)
. label define appt_all 0 "No appointments" 1 "1-2 per year" 2 "3-5 per year" 3
>  "6 or more per year"

. forvalues i=2019/2021 {
  2.     sum outpatient_appt_all_`i', d
  3.     egen op_appt_all_`i'_cat = cut(outpatient_appt_all_`i'), at(0, 1, 3, 6
> , 1000) icodes
  4.     * Check all categorised
.     bys op_appt_all_`i'_cat: sum outpatient_appt_all_`i'
  5.     label values op_appt_all_`i'_cat appt_all
  6.     * Same for orginal variables
.     egen op_appt_all_`i'_orig_cat = cut(op_appt_all_`i'_orig), at(0, 1, 3, 6,
>  1000) icodes
  7.     * Check all categorised
.     bys op_appt_all_`i'_orig_cat: sum op_appt_all_`i'_orig
  8.     label values op_appt_all_`i'_orig_cat appt_all
  9.     }

                  outpatient_appt_all_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               4,893
25%            6              0       Sum of Wgt.       4,893

50%            7                      Mean           6.724504
                        Largest       Std. Dev.      2.959754
75%            9             13
90%           10             13       Variance       8.760146
95%           11             13       Skewness      -.8684238
99%           12             14       Kurtosis       3.448342
(107 missing values generated)

-------------------------------------------------------------------------------
-> op_appt_all_2019_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2019 |        501           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_all_2019_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2019 |         32       1.875    .3360108          1          2

-------------------------------------------------------------------------------
-> op_appt_all_2019_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2019 |        657     4.51446    .6650149          3          5

-------------------------------------------------------------------------------
-> op_appt_all_2019_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2019 |      3,703    8.068323    1.581371          6         14

-------------------------------------------------------------------------------
-> op_appt_all_2019_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2019 |          0


-------------------------------------------------------------------------------
-> op_appt_all_2019_orig_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2019_orig |        514           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_all_2019_orig_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2019_orig |         34    1.882353     .327035          1          2

-------------------------------------------------------------------------------
-> op_appt_all_2019_orig_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2019_orig |        667    4.517241    .6627721          3          5

-------------------------------------------------------------------------------
-> op_appt_all_2019_orig_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2019_orig |      3,785    8.069749    1.580436          6         14


                  outpatient_appt_all_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               3,472
25%            5              0       Sum of Wgt.       3,472

50%            7                      Mean            6.65985
                        Largest       Std. Dev.      2.985284
75%            9             14
90%           10             14       Variance       8.911923
95%           11             14       Skewness      -.8197704
99%           12             15       Kurtosis       3.390351
(1528 missing values generated)

-------------------------------------------------------------------------------
-> op_appt_all_2020_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2020 |        367           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_all_2020_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2020 |         23    1.826087    .3875534          1          2

-------------------------------------------------------------------------------
-> op_appt_all_2020_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2020 |        486    4.502058    .6818682          3          5

-------------------------------------------------------------------------------
-> op_appt_all_2020_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2020 |      2,596    8.048151    1.597563          6         15

-------------------------------------------------------------------------------
-> op_appt_all_2020_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2020 |          0


-------------------------------------------------------------------------------
-> op_appt_all_2020_orig_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2020_orig |        513           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_all_2020_orig_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2020_orig |         34    1.794118    .4104256          1          2

-------------------------------------------------------------------------------
-> op_appt_all_2020_orig_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2020_orig |        685    4.521168    .6742367          3          5

-------------------------------------------------------------------------------
-> op_appt_all_2020_orig_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2020_orig |      3,768    8.062633    1.596653          6         15


                  outpatient_appt_all_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               2,285
25%            5              0       Sum of Wgt.       2,285

50%            7                      Mean           6.623632
                        Largest       Std. Dev.      2.960505
75%            9             13
90%           10             14       Variance        8.76459
95%           10             14       Skewness      -.8710588
99%           12             14       Kurtosis       3.412919
(2715 missing values generated)

-------------------------------------------------------------------------------
-> op_appt_all_2021_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2021 |        247           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_all_2021_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2021 |         11           2           0          2          2

-------------------------------------------------------------------------------
-> op_appt_all_2021_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2021 |        318    4.474843    .6862754          3          5

-------------------------------------------------------------------------------
-> op_appt_all_2021_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2021 |      1,709    8.010532    1.538311          6         14

-------------------------------------------------------------------------------
-> op_appt_all_2021_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2021 |          0


-------------------------------------------------------------------------------
-> op_appt_all_2021_orig_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2021_orig |        487           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_all_2021_orig_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2021_orig |         27    1.888889    .3202563          1          2

-------------------------------------------------------------------------------
-> op_appt_all_2021_orig_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2021_orig |        675    4.474074    .6915088          3          5

-------------------------------------------------------------------------------
-> op_appt_all_2021_orig_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2021_orig |      3,811    8.054054    1.569966          6         14


. 
. * Calculate difference in all outpatient appointments compared to 2019
. gen diff_op_all_2020 = outpatient_appt_all_2020 - outpatient_appt_all_2019
(1,528 missing values generated)

. gen diff_op_all_2021 = outpatient_appt_all_2021 - outpatient_appt_all_2019
(2,715 missing values generated)

. sum diff_op_all_2020 diff_op_all_2021, d

                      diff_op_all_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%          -10            -13
 5%           -8            -13
10%           -6            -13       Obs               3,472
25%           -2            -12       Sum of Wgt.       3,472

50%            0                      Mean          -.0385945
                        Largest       Std. Dev.      4.233219
75%            2             13
90%            6             13       Variance       17.92015
95%            7             13       Skewness       .0028716
99%           10             13       Kurtosis       3.218774

                      diff_op_all_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%          -10            -13
 5%           -8            -12
10%           -6            -11       Obs               2,285
25%           -2            -11       Sum of Wgt.       2,285

50%            0                      Mean          -.0827133
                        Largest       Std. Dev.      4.237238
75%            2             11
90%            5             11       Variance       17.95419
95%            7             12       Skewness      -.0035352
99%           10             12       Kurtosis       3.066747

. 
. * Identify people with no appointments in either year flag them and set diffe
> rence to missing
. forvalues i=2020/2021 {
  2.     gen no_appts_all_`i' = diff_op_all_`i'==0 & op_appt_all_`i'_cat==0
  3.     tab no_appts_all_`i' op_appt_all_`i'_cat
  4.     replace diff_op_all_`i'=. if no_appts_all_`i'==1
  5.     }

no_appts_a |            op_appt_all_2020_cat
   ll_2020 | No appoin  1-2 per y  3-5 per y  6 or more |     Total
-----------+--------------------------------------------+----------
         0 |       333         23        486      2,596 |     3,438 
         1 |        34          0          0          0 |        34 
-----------+--------------------------------------------+----------
     Total |       367         23        486      2,596 |     3,472 
(34 real changes made, 34 to missing)

no_appts_a |            op_appt_all_2021_cat
   ll_2021 | No appoin  1-2 per y  3-5 per y  6 or more |     Total
-----------+--------------------------------------------+----------
         0 |       226         11        318      1,709 |     2,264 
         1 |        21          0          0          0 |        21 
-----------+--------------------------------------------+----------
     Total |       247         11        318      1,709 |     2,285 
(21 real changes made, 21 to missing)

. 
. * Identify of people with appointments whether they had fewer appointments 
. forvalues i=2020/2021 {
  2.     gen fewer_appts_all_`i' = (diff_op_all_`i' < 0) if diff_op_all_`i'!=.
  3. }
(1,562 missing values generated)
(2,736 missing values generated)

. 
. preserve

. * Tabulate number of rheumatology appointments per year of those with whole y
> ear available
. table1_mc, vars(op_appt_2019_cat cate \ op_appt_2020_cat cate \ op_appt_2021_
> cat cate \ no_appts_2020 cate \ no_appts_2021 cate \ fewer_appts_2020 cate \ 
> fewer_appts_2021 cate) clear

  +----------------------------------+
  | factor               N_1     m_1 |
  |----------------------------------|
  | op_appt_2019_cat   4,893     107 |
  |----------------------------------|
  | op_appt_2020_cat   3,472   1,528 |
  |----------------------------------|
  | op_appt_2021_cat   2,285   2,715 |
  |----------------------------------|
  | no_appts_2020      5,000       0 |
  |----------------------------------|
  | no_appts_2021      5,000       0 |
  |----------------------------------|
  | fewer_appts_2020   3,436   1,564 |
  |----------------------------------|
  | fewer_appts_2021   2,269   2,731 |
  +----------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +-------------------------------------------------------+
  |                                         Total         |
  |-------------------------------------------------------|
  |                                         N=5,000       |
  |-------------------------------------------------------|
  | op_appt_2019_cat   No appointments      475 ( 9.7%)   |
  |                    1-2 per year         36 ( 0.7%)    |
  |                    3 or more per year   4,382 (89.6%) |
  |-------------------------------------------------------|
  | op_appt_2020_cat   No appointments      357 (10.3%)   |
  |                    1-2 per year         19 ( 0.5%)    |
  |                    3 or more per year   3,096 (89.2%) |
  |-------------------------------------------------------|
  | op_appt_2021_cat   No appointments      227 ( 9.9%)   |
  |                    1-2 per year         15 ( 0.7%)    |
  |                    3 or more per year   2,043 (89.4%) |
  |-------------------------------------------------------|
  | no_appts_2020      0                    4,964 (99.3%) |
  |                    1                    36 ( 0.7%)    |
  |-------------------------------------------------------|
  | no_appts_2021      0                    4,984 (99.7%) |
  |                    1                    16 ( 0.3%)    |
  |-------------------------------------------------------|
  | fewer_appts_2020   0                    1,925 (56.0%) |
  |                    1                    1,511 (44.0%) |
  |-------------------------------------------------------|
  | fewer_appts_2021   0                    1,291 (56.9%) |
  |                    1                    978 (43.1%)   |
  +-------------------------------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/op_appt_yrs.csv
file ./output/tables/op_appt_yrs.csv saved

. * Rounding numbers in table to nearest 5
. describe

Contains data from /tmp/St00015.000002
  obs:            19                          
 vars:             7                          31 May 2023 15:51
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
factor          str16   %-16s                 Factor
level           str18   %-18s                 Level
Total           str13   %-13s                 Total
N_1             str5    %9s                   
m_1             str5    %9s                   
_columna_1      str11   %6s                   1 _columna_
_columnb_1      str11   %-11s                 1 _columnb_
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. destring _columna_1, gen(n) ignore(",") force
_columna_1: contains nonnumeric characters not specified in ignore()
_columna_1: character , removed; n generated as int
(2 missing values generated)

. destring _columnb_1, gen(percent) ignore("-" "%" "(" ")") force
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent generated as double
(2 missing values generated)

. gen rounded_n = round(n, 5)
(2 missing values generated)

. keep factor level rounded_n percent

. export delimited using ./output/tables/op_appt_yrs_rounded.csv
file ./output/tables/op_appt_yrs_rounded.csv saved

. restore 

. preserve

. * Tabulate number of rheumatology appointments per year (includes people who 
> end follow-up during year)
. table1_mc, vars(op_appt_2019_orig_cat cate \ op_appt_2020_orig_cat cate \ op_
> appt_2021_orig_cat cate) clear

  +-------------------------------------+
  | factor                    N_1   m_1 |
  |-------------------------------------|
  | op_appt_2019_orig_cat   5,000     0 |
  |-------------------------------------|
  | op_appt_2020_orig_cat   5,000     0 |
  |-------------------------------------|
  | op_appt_2021_orig_cat   5,000     0 |
  +-------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +------------------------------------------------------------+
  |                                              Total         |
  |------------------------------------------------------------|
  |                                              N=5,000       |
  |------------------------------------------------------------|
  | op_appt_2019_orig_cat   No appointments      488 ( 9.8%)   |
  |                         1-2 per year         37 ( 0.7%)    |
  |                         3 or more per year   4,475 (89.5%) |
  |------------------------------------------------------------|
  | op_appt_2020_orig_cat   No appointments      513 (10.3%)   |
  |                         1-2 per year         27 ( 0.5%)    |
  |                         3 or more per year   4,460 (89.2%) |
  |------------------------------------------------------------|
  | op_appt_2021_orig_cat   No appointments      488 ( 9.8%)   |
  |                         1-2 per year         29 ( 0.6%)    |
  |                         3 or more per year   4,483 (89.7%) |
  +------------------------------------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/op_appt_orig_yrs.csv
file ./output/tables/op_appt_orig_yrs.csv saved

. restore 

. preserve

. * Tabulate number of all outpatient appointments per year of those with whole
>  year available
. table1_mc, vars(op_appt_all_2019_cat cate \ op_appt_all_2020_cat cate \ op_ap
> pt_all_2021_cat cate \ no_appts_all_2020 cate \ no_appts_all_2021 cate \ fewe
> r_appts_all_2020 cate \ fewer_appts_all_2021 cate) clear

  +--------------------------------------+
  | factor                   N_1     m_1 |
  |--------------------------------------|
  | op_appt_all_2019_cat   4,893     107 |
  |--------------------------------------|
  | op_appt_all_2020_cat   3,472   1,528 |
  |--------------------------------------|
  | op_appt_all_2021_cat   2,285   2,715 |
  |--------------------------------------|
  | no_appts_all_2020      5,000       0 |
  |--------------------------------------|
  | no_appts_all_2021      5,000       0 |
  |--------------------------------------|
  | fewer_appts_all_2020   3,438   1,562 |
  |--------------------------------------|
  | fewer_appts_all_2021   2,264   2,736 |
  +--------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +-----------------------------------------------------------+
  |                                             Total         |
  |-----------------------------------------------------------|
  |                                             N=5,000       |
  |-----------------------------------------------------------|
  | op_appt_all_2019_cat   No appointments      501 (10.2%)   |
  |                        1-2 per year         32 ( 0.7%)    |
  |                        3-5 per year         657 (13.4%)   |
  |                        6 or more per year   3,703 (75.7%) |
  |-----------------------------------------------------------|
  | op_appt_all_2020_cat   No appointments      367 (10.6%)   |
  |                        1-2 per year         23 ( 0.7%)    |
  |                        3-5 per year         486 (14.0%)   |
  |                        6 or more per year   2,596 (74.8%) |
  |-----------------------------------------------------------|
  | op_appt_all_2021_cat   No appointments      247 (10.8%)   |
  |                        1-2 per year         11 ( 0.5%)    |
  |                        3-5 per year         318 (13.9%)   |
  |                        6 or more per year   1,709 (74.8%) |
  |-----------------------------------------------------------|
  | no_appts_all_2020      0                    4,966 (99.3%) |
  |                        1                    34 ( 0.7%)    |
  |-----------------------------------------------------------|
  | no_appts_all_2021      0                    4,979 (99.6%) |
  |                        1                    21 ( 0.4%)    |
  |-----------------------------------------------------------|
  | fewer_appts_all_2020   0                    1,908 (55.5%) |
  |                        1                    1,530 (44.5%) |
  |-----------------------------------------------------------|
  | fewer_appts_all_2021   0                    1,250 (55.2%) |
  |                        1                    1,014 (44.8%) |
  +-----------------------------------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/op_appt_all_yrs.csv
file ./output/tables/op_appt_all_yrs.csv saved

. restore 

. * Tabulate overall characteristics 
. preserve

. table1_mc, vars(age_cat cate \ male cate \ urban_rural_bin cate \ region cate
>  \ imd cate \  smoking cate \ time_ra contn \ bmi_cat cate \ eth5 cate) clear

  +-----------------------------+
  | factor          N_1     m_1 |
  |-----------------------------|
  | age_cat       3,927   1,073 |
  |-----------------------------|
  | male          5,000       0 |
  |-----------------------------|
  | Rural-Urban   5,000       0 |
  |-----------------------------|
  | region        5,000       0 |
  |-----------------------------|
  | imd           5,000       0 |
  |-----------------------------|
  | smoking       5,000       0 |
  |-----------------------------|
  | time_ra       2,254   2,746 |
  |-----------------------------|
  | bmi_cat       5,000       0 |
  |-----------------------------|
  | eth5          5,000       0 |
  +-----------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------------------+
  |                                          Total               |
  |--------------------------------------------------------------|
  |                                          N=5,000             |
  |--------------------------------------------------------------|
  | age_cat       18 - 40 years              1,423 (36.2%)       |
  |               41 - 60 years              1,279 (32.6%)       |
  |               61 - 80 years              962 (24.5%)         |
  |               >80 years                  263 ( 6.7%)         |
  |--------------------------------------------------------------|
  | male          Female                     2,509 (50.2%)       |
  |               Male                       2,491 (49.8%)       |
  |--------------------------------------------------------------|
  | Rural-Urban   Rural                      2,501 (50.0%)       |
  |               Urban                      2,499 (50.0%)       |
  |--------------------------------------------------------------|
  | region        East Midlands              485 ( 9.7%)         |
  |               East of England            491 ( 9.8%)         |
  |               London                     988 (19.8%)         |
  |               North East                 506 (10.1%)         |
  |               North West                 519 (10.4%)         |
  |               South East                 1,000 (20.0%)       |
  |               West Midlands              502 (10.0%)         |
  |               Yorkshire and the Humber   509 (10.2%)         |
  |--------------------------------------------------------------|
  | imd           0                          252 ( 5.0%)         |
  |               1                          955 (19.1%)         |
  |               2                          955 (19.1%)         |
  |               3                          969 (19.4%)         |
  |               4                          931 (18.6%)         |
  |               5                          938 (18.8%)         |
  |--------------------------------------------------------------|
  | smoking       Never smoked               506 (10.1%)         |
  |               Current smoker             996 (19.9%)         |
  |               Ex-smoker                  784 (15.7%)         |
  |               Unknown                    2,714 (54.3%)       |
  |--------------------------------------------------------------|
  | time_ra                                  55.36372 (31.60848) |
  |--------------------------------------------------------------|
  | bmi_cat       Missing                    1,009 (20.2%)       |
  |               Underweight                466 ( 9.3%)         |
  |               Healthy range              914 (18.3%)         |
  |               Overweight                 968 (19.4%)         |
  |               Obese                      1,387 (27.7%)       |
  |               Morbidly obese             256 ( 5.1%)         |
  |--------------------------------------------------------------|
  | eth5          White                      1,024 (20.5%)       |
  |               South Asian                1,020 (20.4%)       |
  |               Black                      975 (19.5%)         |
  |               Mixed                      989 (19.8%)         |
  |               Other                      992 (19.8%)         |
  +--------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 

. export delimited using ./output/tables/op_chars.csv
file ./output/tables/op_chars.csv saved

. * Rounding numbers in table to nearest 5
. describe

Contains data from /tmp/St00015.000005
  obs:            40                          
 vars:             7                          31 May 2023 15:51
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
factor          str18   %-18s                 Factor
level           str24   %-24s                 Level
Total           str19   %-19s                 Total
N_1             str5    %9s                   
m_1             str5    %9s                   
_columna_1      str11   %6s                   1 _columna_
_columnb_1      str11   %-11s                 1 _columnb_
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. destring _columna_1, gen(n) ignore(",") force
_columna_1: contains nonnumeric characters not specified in ignore()
_columna_1: character , removed; n generated as double
(2 missing values generated)

. destring _columnb_1, gen(percent) ignore("-" "%" "(" ")") force
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent generated as double
(2 missing values generated)

. gen rounded_n = round(n, 5)
(2 missing values generated)

. keep factor level rounded_n percent

. export delimited using ./output/tables/op_chars_rounded.csv
file ./output/tables/op_chars_rounded.csv saved

. restore

. * Tabulate characteristics by category of outpatient appointments for each ye
> ar
. forvalues i=2019/2021 {
  2.     preserve
  3.     table1_mc, vars(age_cat cat \ male cat \ urban_rural_bin cat \ region 
> cat \ imd cat \ smoking cat \ time_ra contn \ bmi_cat cat \ eth5 cat) by(op_a
> ppt_`i'_cat) clear
  4.     export delimited using ./output/tables/characteristics_strata`i'.csv
  5.     destring _columna_0, gen(n0) ignore(",") force
  6.     destring _columnb_0, gen(percent0) ignore("-" "%" "(" ")") force
  7.     destring _columna_1, gen(n1) ignore(",") force
  8.     destring _columnb_1, gen(percent1) ignore("-" "%" "(" ")") force
  9.     destring _columna_2, gen(n2) ignore(",") force
 10.     destring _columnb_2, gen(percent2) ignore("-" "%" "(" ")") force
 11.     gen rounded_n0 = round(n0, 5)
 12.     gen rounded_n1 = round(n1, 5)
 13.     gen rounded_n2 = round(n2, 5)
 14.     keep factor level rounded_n0 percent0 rounded_n1 percent1 rounded_n2 p
> ercent2
 15.     export delimited using ./output/tables/characteristics_strata`i'_round
> ed.csv
 16.     restore
 17. 
.     /* Tabulate characteristics by whether hospitalised with RA for each year
>     preserve
>     keep if ra_hosp_`i'==0
>     table1_mc, vars(age_cat cate \ male cate \ urban_rural_5 cate \ prescribe
> d_biologics cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat cate) cl
> ear
>     save `tempfile', replace
>     restore
>     preserve
>     keep if ra_hosp_`i'==1
>     table1_mc, vars(age_cat cate \ male cate \ urban_rural_5 cate \ prescribe
> d_biologics cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat cate) cl
> ear
>     append using `tempfile'
>     save `tempfile', replace
>     export delimited using ./output/tables/characteristics_ra_hosp_`i'.csv
>     restore*/
. }

  +-----------------------------------------------------+
  | factor        N_0   N_1     N_2   m_0   m_1     m_2 |
  |-----------------------------------------------------|
  | age_cat       377    27   3,440    98     9     942 |
  |-----------------------------------------------------|
  | male          475    36   4,382     0     0       0 |
  |-----------------------------------------------------|
  | Rural-Urban   475    36   4,382     0     0       0 |
  |-----------------------------------------------------|
  | region        475    36   4,382     0     0       0 |
  |-----------------------------------------------------|
  | imd           475    36   4,382     0     0       0 |
  |-----------------------------------------------------|
  | smoking       475    36   4,382     0     0       0 |
  |-----------------------------------------------------|
  | time_ra       204    19   1,981   271    17   2,401 |
  |-----------------------------------------------------|
  | bmi_cat       475    36   4,382     0     0       0 |
  |-----------------------------------------------------|
  | eth5          475    36   4,382     0     0       0 |
  +-----------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> ----------------------------------------+
  |                                          No appointments       1-2 per year
>           3 or more per year    p-value |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  |                                          N=475                 N=36        
>           N=4,382                       |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | age_cat       18 - 40 years              128 (34.0%)           11 (40.7%)  
>           1,249 (36.3%)          0.46   |
  |               41 - 60 years              138 (36.6%)           5 (18.5%)   
>           1,115 (32.4%)                 |
  |               61 - 80 years              85 (22.5%)            9 (33.3%)   
>           843 (24.5%)                   |
  |               >80 years                  26 ( 6.9%)            2 ( 7.4%)   
>           233 ( 6.8%)                   |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | male          Female                     229 (48.2%)           15 (41.7%)  
>           2,216 (50.6%)          0.36   |
  |               Male                       246 (51.8%)           21 (58.3%)  
>           2,166 (49.4%)                 |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | Rural-Urban   Rural                      245 (51.6%)           22 (61.1%)  
>           2,180 (49.7%)          0.31   |
  |               Urban                      230 (48.4%)           14 (38.9%)  
>           2,202 (50.3%)                 |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | region        East Midlands              49 (10.3%)            1 ( 2.8%)   
>           426 ( 9.7%)            0.36   |
  |               East of England            39 ( 8.2%)            4 (11.1%)   
>           435 ( 9.9%)                   |
  |               London                     89 (18.7%)            4 (11.1%)   
>           884 (20.2%)                   |
  |               North East                 58 (12.2%)            1 ( 2.8%)   
>           433 ( 9.9%)                   |
  |               North West                 55 (11.6%)            4 (11.1%)   
>           451 (10.3%)                   |
  |               South East                 91 (19.2%)            10 (27.8%)  
>           872 (19.9%)                   |
  |               West Midlands              48 (10.1%)            7 (19.4%)   
>           434 ( 9.9%)                   |
  |               Yorkshire and the Humber   46 ( 9.7%)            5 (13.9%)   
>           447 (10.2%)                   |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | imd           0                          21 ( 4.4%)            3 ( 8.3%)   
>           222 ( 5.1%)            0.63   |
  |               1                          91 (19.2%)            9 (25.0%)   
>           836 (19.1%)                   |
  |               2                          94 (19.8%)            11 (30.6%)  
>           828 (18.9%)                   |
  |               3                          87 (18.3%)            5 (13.9%)   
>           855 (19.5%)                   |
  |               4                          87 (18.3%)            4 (11.1%)   
>           818 (18.7%)                   |
  |               5                          95 (20.0%)            4 (11.1%)   
>           823 (18.8%)                   |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | smoking       Never smoked               45 ( 9.5%)            5 (13.9%)   
>           444 (10.1%)            0.072  |
  |               Current smoker             103 (21.7%)           7 (19.4%)   
>           864 (19.7%)                   |
  |               Ex-smoker                  73 (15.4%)            12 (33.3%)  
>           689 (15.7%)                   |
  |               Unknown                    254 (53.5%)           12 (33.3%)  
>           2,385 (54.4%)                 |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | time_ra                                  57.35047 (30.77057)   51.66742 (31
> .42741)   55.26799 (31.70133)    0.58   |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | bmi_cat       Missing                    102 (21.5%)           5 (13.9%)   
>           880 (20.1%)            0.35   |
  |               Underweight                39 ( 8.2%)            3 ( 8.3%)   
>           409 ( 9.3%)                   |
  |               Healthy range              102 (21.5%)           6 (16.7%)   
>           786 (17.9%)                   |
  |               Overweight                 96 (20.2%)            11 (30.6%)  
>           843 (19.2%)                   |
  |               Obese                      119 (25.1%)           9 (25.0%)   
>           1,236 (28.2%)                 |
  |               Morbidly obese             17 ( 3.6%)            2 ( 5.6%)   
>           228 ( 5.2%)                   |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | eth5          White                      110 (23.2%)           5 (13.9%)   
>           887 (20.2%)            0.31   |
  |               South Asian                83 (17.5%)            5 (13.9%)   
>           910 (20.8%)                   |
  |               Black                      88 (18.5%)            9 (25.0%)   
>           858 (19.6%)                   |
  |               Mixed                      89 (18.7%)            7 (19.4%)   
>           873 (19.9%)                   |
  |               Other                      105 (22.1%)           10 (27.8%)  
>           854 (19.5%)                   |
  +----------------------------------------------------------------------------
> ----------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file ./output/tables/characteristics_strata2019.csv saved
_columna_0: contains nonnumeric characters not specified in ignore(); n0 genera
> ted as double
(2 missing values generated)
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)
_columna_1: contains nonnumeric characters not specified in ignore(); n1 genera
> ted as double
(2 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters - space % ( ) removed; percent1 generated as double
(2 missing values generated)
_columna_2: contains nonnumeric characters not specified in ignore()
_columna_2: character , removed; n2 generated as double
(2 missing values generated)
_columnb_2: contains nonnumeric characters not specified in ignore()
_columnb_2: characters space % ( ) removed; percent2 generated as double
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
file ./output/tables/characteristics_strata2019_rounded.csv saved

  +-----------------------------------------------------+
  | factor        N_0   N_1     N_2   m_0   m_1     m_2 |
  |-----------------------------------------------------|
  | age_cat       282    13   2,433    75     6     663 |
  |-----------------------------------------------------|
  | male          357    19   3,096     0     0       0 |
  |-----------------------------------------------------|
  | Rural-Urban   357    19   3,096     0     0       0 |
  |-----------------------------------------------------|
  | region        357    19   3,096     0     0       0 |
  |-----------------------------------------------------|
  | imd           357    19   3,096     0     0       0 |
  |-----------------------------------------------------|
  | smoking       357    19   3,096     0     0       0 |
  |-----------------------------------------------------|
  | time_ra       156     7   1,378   201    12   1,718 |
  |-----------------------------------------------------|
  | bmi_cat       357    19   3,096     0     0       0 |
  |-----------------------------------------------------|
  | eth5          357    19   3,096     0     0       0 |
  +-----------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> ----------------------------------------+
  |                                          No appointments       1-2 per year
>           3 or more per year    p-value |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  |                                          N=357                 N=19        
>           N=3,096                       |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | age_cat       18 - 40 years              94 (33.3%)            5 (38.5%)   
>           876 (36.0%)            0.11   |
  |               41 - 60 years              104 (36.9%)           4 (30.8%)   
>           773 (31.8%)                   |
  |               61 - 80 years              64 (22.7%)            1 ( 7.7%)   
>           625 (25.7%)                   |
  |               >80 years                  20 ( 7.1%)            3 (23.1%)   
>           159 ( 6.5%)                   |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | male          Female                     185 (51.8%)           9 (47.4%)   
>           1,546 (49.9%)          0.77   |
  |               Male                       172 (48.2%)           10 (52.6%)  
>           1,550 (50.1%)                 |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | Rural-Urban   Rural                      188 (52.7%)           11 (57.9%)  
>           1,547 (50.0%)          0.50   |
  |               Urban                      169 (47.3%)           8 (42.1%)   
>           1,549 (50.0%)                 |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | region        East Midlands              40 (11.2%)            2 (10.5%)   
>           296 ( 9.6%)            0.95   |
  |               East of England            29 ( 8.1%)            2 (10.5%)   
>           313 (10.1%)                   |
  |               London                     73 (20.4%)            6 (31.6%)   
>           605 (19.5%)                   |
  |               North East                 35 ( 9.8%)            1 ( 5.3%)   
>           323 (10.4%)                   |
  |               North West                 44 (12.3%)            1 ( 5.3%)   
>           326 (10.5%)                   |
  |               South East                 72 (20.2%)            3 (15.8%)   
>           624 (20.2%)                   |
  |               West Midlands              33 ( 9.2%)            2 (10.5%)   
>           304 ( 9.8%)                   |
  |               Yorkshire and the Humber   31 ( 8.7%)            2 (10.5%)   
>           305 ( 9.9%)                   |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | imd           0                          27 ( 7.6%)            0 ( 0.0%)   
>           147 ( 4.7%)            0.060  |
  |               1                          87 (24.4%)            3 (15.8%)   
>           569 (18.4%)                   |
  |               2                          61 (17.1%)            5 (26.3%)   
>           610 (19.7%)                   |
  |               3                          69 (19.3%)            5 (26.3%)   
>           598 (19.3%)                   |
  |               4                          56 (15.7%)            3 (15.8%)   
>           580 (18.7%)                   |
  |               5                          57 (16.0%)            3 (15.8%)   
>           592 (19.1%)                   |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | smoking       Never smoked               35 ( 9.8%)            2 (10.5%)   
>           314 (10.1%)            0.93   |
  |               Current smoker             68 (19.0%)            3 (15.8%)   
>           613 (19.8%)                   |
  |               Ex-smoker                  56 (15.7%)            5 (26.3%)   
>           509 (16.4%)                   |
  |               Unknown                    198 (55.5%)           9 (47.4%)   
>           1,660 (53.6%)                 |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | time_ra                                  52.61044 (32.35316)   49.88364 (38
> .44257)   56.13582 (30.90046)    0.36   |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | bmi_cat       Missing                    78 (21.8%)            2 (10.5%)   
>           628 (20.3%)            0.72   |
  |               Underweight                27 ( 7.6%)            1 ( 5.3%)   
>           296 ( 9.6%)                   |
  |               Healthy range              66 (18.5%)            3 (15.8%)   
>           564 (18.2%)                   |
  |               Overweight                 72 (20.2%)            5 (26.3%)   
>           588 (19.0%)                   |
  |               Obese                      92 (25.8%)            8 (42.1%)   
>           854 (27.6%)                   |
  |               Morbidly obese             22 ( 6.2%)            0 ( 0.0%)   
>           166 ( 5.4%)                   |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | eth5          White                      83 (23.2%)            3 (15.8%)   
>           653 (21.1%)            0.19   |
  |               South Asian                77 (21.6%)            6 (31.6%)   
>           626 (20.2%)                   |
  |               Black                      53 (14.8%)            2 (10.5%)   
>           584 (18.9%)                   |
  |               Mixed                      67 (18.8%)            7 (36.8%)   
>           609 (19.7%)                   |
  |               Other                      77 (21.6%)            1 ( 5.3%)   
>           624 (20.2%)                   |
  +----------------------------------------------------------------------------
> ----------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file ./output/tables/characteristics_strata2020.csv saved
_columna_0: contains nonnumeric characters not specified in ignore(); n0 genera
> ted as double
(2 missing values generated)
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)
_columna_1: contains nonnumeric characters not specified in ignore(); n1 genera
> ted as double
(2 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters - space % ( ) removed; percent1 generated as double
(2 missing values generated)
_columna_2: contains nonnumeric characters not specified in ignore()
_columna_2: character , removed; n2 generated as double
(2 missing values generated)
_columnb_2: contains nonnumeric characters not specified in ignore()
_columnb_2: characters space % ( ) removed; percent2 generated as double
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
file ./output/tables/characteristics_strata2020_rounded.csv saved

  +-----------------------------------------------------+
  | factor        N_0   N_1     N_2   m_0   m_1     m_2 |
  |-----------------------------------------------------|
  | age_cat       185    13   1,588    42     2     455 |
  |-----------------------------------------------------|
  | male          227    15   2,043     0     0       0 |
  |-----------------------------------------------------|
  | Rural-Urban   227    15   2,043     0     0       0 |
  |-----------------------------------------------------|
  | region        227    15   2,043     0     0       0 |
  |-----------------------------------------------------|
  | imd           227    15   2,043     0     0       0 |
  |-----------------------------------------------------|
  | smoking       227    15   2,043     0     0       0 |
  |-----------------------------------------------------|
  | time_ra       104     9     903   123     6   1,140 |
  |-----------------------------------------------------|
  | bmi_cat       227    15   2,043     0     0       0 |
  |-----------------------------------------------------|
  | eth5          227    15   2,043     0     0       0 |
  +-----------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> ----------------------------------------+
  |                                          No appointments       1-2 per year
>           3 or more per year    p-value |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  |                                          N=227                 N=15        
>           N=2,043                       |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | age_cat       18 - 40 years              63 (34.1%)            3 (23.1%)   
>           577 (36.3%)            0.63   |
  |               41 - 60 years              61 (33.0%)            7 (53.8%)   
>           511 (32.2%)                   |
  |               61 - 80 years              51 (27.6%)            3 (23.1%)   
>           397 (25.0%)                   |
  |               >80 years                  10 ( 5.4%)            0 ( 0.0%)   
>           103 ( 6.5%)                   |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | male          Female                     115 (50.7%)           7 (46.7%)   
>           1,035 (50.7%)          0.95   |
  |               Male                       112 (49.3%)           8 (53.3%)   
>           1,008 (49.3%)                 |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | Rural-Urban   Rural                      120 (52.9%)           8 (53.3%)   
>           1,015 (49.7%)          0.64   |
  |               Urban                      107 (47.1%)           7 (46.7%)   
>           1,028 (50.3%)                 |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | region        East Midlands              22 ( 9.7%)            0 ( 0.0%)   
>           200 ( 9.8%)            0.91   |
  |               East of England            25 (11.0%)            2 (13.3%)   
>           199 ( 9.7%)                   |
  |               London                     46 (20.3%)            3 (20.0%)   
>           412 (20.2%)                   |
  |               North East                 27 (11.9%)            0 ( 0.0%)   
>           205 (10.0%)                   |
  |               North West                 25 (11.0%)            2 (13.3%)   
>           211 (10.3%)                   |
  |               South East                 40 (17.6%)            3 (20.0%)   
>           417 (20.4%)                   |
  |               West Midlands              22 ( 9.7%)            3 (20.0%)   
>           192 ( 9.4%)                   |
  |               Yorkshire and the Humber   20 ( 8.8%)            2 (13.3%)   
>           207 (10.1%)                   |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | imd           0                          9 ( 4.0%)             0 ( 0.0%)   
>           108 ( 5.3%)            0.67   |
  |               1                          40 (17.6%)            4 (26.7%)   
>           390 (19.1%)                   |
  |               2                          54 (23.8%)            3 (20.0%)   
>           389 (19.0%)                   |
  |               3                          48 (21.1%)            4 (26.7%)   
>           375 (18.4%)                   |
  |               4                          38 (16.7%)            2 (13.3%)   
>           393 (19.2%)                   |
  |               5                          38 (16.7%)            2 (13.3%)   
>           388 (19.0%)                   |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | smoking       Never smoked               21 ( 9.3%)            0 ( 0.0%)   
>           205 (10.0%)            0.48   |
  |               Current smoker             51 (22.5%)            2 (13.3%)   
>           409 (20.0%)                   |
  |               Ex-smoker                  37 (16.3%)            1 ( 6.7%)   
>           334 (16.3%)                   |
  |               Unknown                    118 (52.0%)           12 (80.0%)  
>           1,095 (53.6%)                 |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | time_ra                                  62.82975 (30.89256)   49.42216 (31
> .42183)   54.68908 (31.23313)    0.036  |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | bmi_cat       Missing                    53 (23.3%)            3 (20.0%)   
>           409 (20.0%)            0.39   |
  |               Underweight                14 ( 6.2%)            3 (20.0%)   
>           191 ( 9.3%)                   |
  |               Healthy range              45 (19.8%)            2 (13.3%)   
>           374 (18.3%)                   |
  |               Overweight                 48 (21.1%)            2 (13.3%)   
>           387 (18.9%)                   |
  |               Obese                      59 (26.0%)            5 (33.3%)   
>           552 (27.0%)                   |
  |               Morbidly obese             8 ( 3.5%)             0 ( 0.0%)   
>           130 ( 6.4%)                   |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | eth5          White                      51 (22.5%)            5 (33.3%)   
>           418 (20.5%)            0.40   |
  |               South Asian                39 (17.2%)            1 ( 6.7%)   
>           442 (21.6%)                   |
  |               Black                      37 (16.3%)            2 (13.3%)   
>           375 (18.4%)                   |
  |               Mixed                      51 (22.5%)            2 (13.3%)   
>           398 (19.5%)                   |
  |               Other                      49 (21.6%)            5 (33.3%)   
>           410 (20.1%)                   |
  +----------------------------------------------------------------------------
> ----------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file ./output/tables/characteristics_strata2021.csv saved
_columna_0: contains nonnumeric characters not specified in ignore(); n0 genera
> ted as double
(2 missing values generated)
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)
_columna_1: contains nonnumeric characters not specified in ignore(); n1 genera
> ted as double
(2 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters - space % ( ) removed; percent1 generated as double
(2 missing values generated)
_columna_2: contains nonnumeric characters not specified in ignore()
_columna_2: character , removed; n2 generated as double
(2 missing values generated)
_columnb_2: contains nonnumeric characters not specified in ignore()
_columnb_2: characters space % ( ) removed; percent2 generated as double
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
file ./output/tables/characteristics_strata2021_rounded.csv saved

. * Characteristics by whether prescribed specific drugs 
. * Weak opioids 
. preserve

. table1_mc, vars(age_cat cat \ male cat \ urban_rural_bin cat \ region cat \ i
> md cat) by(prescribed_weak_opioids) clear

  +-----------------------------------------+
  | factor          N_0     N_1   m_0   m_1 |
  |-----------------------------------------|
  | age_cat       1,965   1,962   512   561 |
  |-----------------------------------------|
  | male          2,477   2,523     0     0 |
  |-----------------------------------------|
  | Rural-Urban   2,477   2,523     0     0 |
  |-----------------------------------------|
  | region        2,477   2,523     0     0 |
  |-----------------------------------------|
  | imd           2,477   2,523     0     0 |
  +-----------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> ----------------------------------+
  |                                          prescribed_weak_opioids = 0   pres
> cribed_weak_opioids = 1   p-value |
  |----------------------------------------------------------------------------
> ----------------------------------|
  |                                          N=2,477                       N=2,
> 523                               |
  |----------------------------------------------------------------------------
> ----------------------------------|
  | age_cat       18 - 40 years              705 (35.9%)                   718 
> (36.6%)                    0.80   |
  |               41 - 60 years              642 (32.7%)                   637 
> (32.5%)                           |
  |               61 - 80 years              479 (24.4%)                   483 
> (24.6%)                           |
  |               >80 years                  139 ( 7.1%)                   124 
> ( 6.3%)                           |
  |----------------------------------------------------------------------------
> ----------------------------------|
  | male          Female                     1,204 (48.6%)                 1,30
> 5 (51.7%)                  0.028  |
  |               Male                       1,273 (51.4%)                 1,21
> 8 (48.3%)                         |
  |----------------------------------------------------------------------------
> ----------------------------------|
  | Rural-Urban   Rural                      1,241 (50.1%)                 1,26
> 0 (49.9%)                  0.91   |
  |               Urban                      1,236 (49.9%)                 1,26
> 3 (50.1%)                         |
  |----------------------------------------------------------------------------
> ----------------------------------|
  | region        East Midlands              226 ( 9.1%)                   259 
> (10.3%)                    0.20   |
  |               East of England            250 (10.1%)                   241 
> ( 9.6%)                           |
  |               London                     485 (19.6%)                   503 
> (19.9%)                           |
  |               North East                 271 (10.9%)                   235 
> ( 9.3%)                           |
  |               North West                 257 (10.4%)                   262 
> (10.4%)                           |
  |               South East                 476 (19.2%)                   524 
> (20.8%)                           |
  |               West Midlands              242 ( 9.8%)                   260 
> (10.3%)                           |
  |               Yorkshire and the Humber   270 (10.9%)                   239 
> ( 9.5%)                           |
  |----------------------------------------------------------------------------
> ----------------------------------|
  | imd           0                          127 ( 5.1%)                   125 
> ( 5.0%)                    0.84   |
  |               1                          456 (18.4%)                   499 
> (19.8%)                           |
  |               2                          483 (19.5%)                   472 
> (18.7%)                           |
  |               3                          488 (19.7%)                   481 
> (19.1%)                           |
  |               4                          457 (18.4%)                   474 
> (18.8%)                           |
  |               5                          466 (18.8%)                   472 
> (18.7%)                           |
  +----------------------------------------------------------------------------
> ----------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/drug_weak_op_chars.csv
file ./output/tables/drug_weak_op_chars.csv saved

. * Rounding numbers in table to nearest 5
. destring _columna_1, gen(n1) ignore(",") force
_columna_1: contains nonnumeric characters not specified in ignore()
_columna_1: character , removed; n1 generated as int
(2 missing values generated)

. destring _columna_0, gen(n0) ignore(",") force
_columna_0: contains nonnumeric characters not specified in ignore()
_columna_0: character , removed; n0 generated as int
(2 missing values generated)

. destring _columnb_1, gen(percent1) ignore("-" "%" "(" ")")  force
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent1 generated as double
(2 missing values generated)

. destring _columnb_0, gen(percent0) ignore("-" "%" "(" ")")  force
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)

. gen rounded_n1 = round(n1, 5)
(2 missing values generated)

. gen rounded_n0 = round(n0, 5)
(2 missing values generated)

. keep factor level rounded_n0 percent0 rounded_n1 percent1

. export delimited using ./output/tables/drug_weak_op_chars_rounded.csv
file ./output/tables/drug_weak_op_chars_rounded.csv saved

. restore

. 
. *Strong opioids 
. preserve

. table1_mc, vars(age_cat cat \ male cat \ urban_rural_bin cat \ region cat \ i
> md cat) by(prescribed_strong_opioids) clear

  +-----------------------------------------+
  | factor          N_0     N_1   m_0   m_1 |
  |-----------------------------------------|
  | age_cat       2,001   1,926   553   520 |
  |-----------------------------------------|
  | male          2,554   2,446     0     0 |
  |-----------------------------------------|
  | Rural-Urban   2,554   2,446     0     0 |
  |-----------------------------------------|
  | region        2,554   2,446     0     0 |
  |-----------------------------------------|
  | imd           2,554   2,446     0     0 |
  +-----------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------------------------------------+
  |                                          prescribed_strong_opioids = 0   pr
> escribed_strong_opioids = 1   p-value |
  |----------------------------------------------------------------------------
> --------------------------------------|
  |                                          N=2,554                         N=
> 2,446                                 |
  |----------------------------------------------------------------------------
> --------------------------------------|
  | age_cat       18 - 40 years              753 (37.6%)                     67
> 0 (34.8%)                      0.33   |
  |               41 - 60 years              638 (31.9%)                     64
> 1 (33.3%)                             |
  |               61 - 80 years              479 (23.9%)                     48
> 3 (25.1%)                             |
  |               >80 years                  131 ( 6.5%)                     13
> 2 ( 6.9%)                             |
  |----------------------------------------------------------------------------
> --------------------------------------|
  | male          Female                     1,293 (50.6%)                   1,
> 216 (49.7%)                    0.52   |
  |               Male                       1,261 (49.4%)                   1,
> 230 (50.3%)                           |
  |----------------------------------------------------------------------------
> --------------------------------------|
  | Rural-Urban   Rural                      1,293 (50.6%)                   1,
> 208 (49.4%)                    0.38   |
  |               Urban                      1,261 (49.4%)                   1,
> 238 (50.6%)                           |
  |----------------------------------------------------------------------------
> --------------------------------------|
  | region        East Midlands              261 (10.2%)                     22
> 4 ( 9.2%)                      0.83   |
  |               East of England            254 ( 9.9%)                     23
> 7 ( 9.7%)                             |
  |               London                     489 (19.1%)                     49
> 9 (20.4%)                             |
  |               North East                 261 (10.2%)                     24
> 5 (10.0%)                             |
  |               North West                 260 (10.2%)                     25
> 9 (10.6%)                             |
  |               South East                 506 (19.8%)                     49
> 4 (20.2%)                             |
  |               West Midlands              254 ( 9.9%)                     24
> 8 (10.1%)                             |
  |               Yorkshire and the Humber   269 (10.5%)                     24
> 0 ( 9.8%)                             |
  |----------------------------------------------------------------------------
> --------------------------------------|
  | imd           0                          125 ( 4.9%)                     12
> 7 ( 5.2%)                      0.18   |
  |               1                          480 (18.8%)                     47
> 5 (19.4%)                             |
  |               2                          492 (19.3%)                     46
> 3 (18.9%)                             |
  |               3                          483 (18.9%)                     48
> 6 (19.9%)                             |
  |               4                          511 (20.0%)                     42
> 0 (17.2%)                             |
  |               5                          463 (18.1%)                     47
> 5 (19.4%)                             |
  +----------------------------------------------------------------------------
> --------------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/drug_strong_op_chars.csv
file ./output/tables/drug_strong_op_chars.csv saved

. * Rounding numbers in table to nearest 5
. destring _columna_1, gen(n1) ignore(",") force
_columna_1: contains nonnumeric characters not specified in ignore()
_columna_1: character , removed; n1 generated as int
(2 missing values generated)

. destring _columna_0, gen(n0) ignore(",") force
_columna_0: contains nonnumeric characters not specified in ignore()
_columna_0: character , removed; n0 generated as int
(2 missing values generated)

. destring _columnb_1, gen(percent1) ignore("-" "%" "(" ")")  force
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent1 generated as double
(2 missing values generated)

. destring _columnb_0, gen(percent0) ignore("-" "%" "(" ")")  force
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)

. gen rounded_n1 = round(n1, 5)
(2 missing values generated)

. gen rounded_n0 = round(n0, 5)
(2 missing values generated)

. keep factor level rounded_n0 percent0 rounded_n1 percent1

. export delimited using ./output/tables/drug_strong_op_chars_rounded.csv
file ./output/tables/drug_strong_op_chars_rounded.csv saved

. restore

. 
. *GCs 
. preserve

. table1_mc, vars(age_cat cat \ male cat \ urban_rural_bin cat \ region cat \ i
> md cat) by(prescribed_gcs) clear

  +-----------------------------------------+
  | factor          N_0     N_1   m_0   m_1 |
  |-----------------------------------------|
  | age_cat       1,939   1,988   539   534 |
  |-----------------------------------------|
  | male          2,478   2,522     0     0 |
  |-----------------------------------------|
  | Rural-Urban   2,478   2,522     0     0 |
  |-----------------------------------------|
  | region        2,478   2,522     0     0 |
  |-----------------------------------------|
  | imd           2,478   2,522     0     0 |
  +-----------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> ----------------+
  |                                          prescribed_gcs = 0   prescribed_gc
> s = 1   p-value |
  |----------------------------------------------------------------------------
> ----------------|
  |                                          N=2,478              N=2,522      
>                 |
  |----------------------------------------------------------------------------
> ----------------|
  | age_cat       18 - 40 years              701 (36.2%)          722 (36.3%)  
>          0.93   |
  |               41 - 60 years              628 (32.4%)          651 (32.7%)  
>                 |
  |               61 - 80 years              483 (24.9%)          479 (24.1%)  
>                 |
  |               >80 years                  127 ( 6.5%)          136 ( 6.8%)  
>                 |
  |----------------------------------------------------------------------------
> ----------------|
  | male          Female                     1,235 (49.8%)        1,274 (50.5%)
>          0.63   |
  |               Male                       1,243 (50.2%)        1,248 (49.5%)
>                 |
  |----------------------------------------------------------------------------
> ----------------|
  | Rural-Urban   Rural                      1,248 (50.4%)        1,253 (49.7%)
>          0.63   |
  |               Urban                      1,230 (49.6%)        1,269 (50.3%)
>                 |
  |----------------------------------------------------------------------------
> ----------------|
  | region        East Midlands              253 (10.2%)          232 ( 9.2%)  
>          0.64   |
  |               East of England            249 (10.0%)          242 ( 9.6%)  
>                 |
  |               London                     470 (19.0%)          518 (20.5%)  
>                 |
  |               North East                 245 ( 9.9%)          261 (10.3%)  
>                 |
  |               North West                 248 (10.0%)          271 (10.7%)  
>                 |
  |               South East                 497 (20.1%)          503 (19.9%)  
>                 |
  |               West Midlands              260 (10.5%)          242 ( 9.6%)  
>                 |
  |               Yorkshire and the Humber   256 (10.3%)          253 (10.0%)  
>                 |
  |----------------------------------------------------------------------------
> ----------------|
  | imd           0                          125 ( 5.0%)          127 ( 5.0%)  
>          0.42   |
  |               1                          483 (19.5%)          472 (18.7%)  
>                 |
  |               2                          449 (18.1%)          506 (20.1%)  
>                 |
  |               3                          472 (19.0%)          497 (19.7%)  
>                 |
  |               4                          482 (19.5%)          449 (17.8%)  
>                 |
  |               5                          467 (18.8%)          471 (18.7%)  
>                 |
  +----------------------------------------------------------------------------
> ----------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/drug_gc_chars.csv
file ./output/tables/drug_gc_chars.csv saved

. * Rounding numbers in table to nearest 5
. destring _columna_1, gen(n1) ignore(",") force
_columna_1: contains nonnumeric characters not specified in ignore()
_columna_1: character , removed; n1 generated as int
(2 missing values generated)

. destring _columna_0, gen(n0) ignore(",") force
_columna_0: contains nonnumeric characters not specified in ignore()
_columna_0: character , removed; n0 generated as int
(2 missing values generated)

. destring _columnb_1, gen(percent1) ignore("-" "%" "(" ")")  force
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent1 generated as double
(2 missing values generated)

. destring _columnb_0, gen(percent0) ignore("-" "%" "(" ")")  force
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)

. gen rounded_n1 = round(n1, 5)
(2 missing values generated)

. gen rounded_n0 = round(n0, 5)
(2 missing values generated)

. keep factor level rounded_n0 percent0 rounded_n1 percent1

. export delimited using ./output/tables/drug_gc_chars_rounded.csv
file ./output/tables/drug_gc_chars_rounded.csv saved

. restore

. 
. * Tabulate characteristics by categories of differences in rheumatology outpa
> tient appointments for each year
. drop if region=="missing"
(0 observations deleted)

. tempfile tempfile

. forvalues i=2020/2021 {
  2.     * Same number or more appointments 
.     preserve
  3.     table1_mc, vars(age_cat cat \ male cat \ urban_rural_bin cat \ region 
> cat \ imd cat \ smoking cat \ time_ra contn \ bmi_cat cat \ eth5 cat) by(fewe
> r_appts_`i') clear
  4.     export delimited using ./output/tables/characteristics_fewer_appts_`i'
> .csv    
  5.     destring _columna_1, gen(n1) ignore(",") force
  6.     destring _columna_0, gen(n0) ignore(",") force
  7.     destring _columnb_1, gen(percent1) ignore("-" "%" "(" ")")  force
  8.     destring _columnb_0, gen(percent0) ignore("-" "%" "(" ")")  force
  9.     gen rounded_n1 = round(n1, 5)
 10.     gen rounded_n0 = round(n0, 5)
 11.     keep factor level rounded_n0 percent0 rounded_n1 percent1
 12.     export delimited using ./output/tables/characteristics_fewer_appts_`i'
> _rounded.csv
 13.     restore 
 14.     * No appointments
.     preserve 
 15.     table1_mc, vars(age_cat cat \ male cat \ urban_rural_bin cat \ region 
> cat \ imd cat \ smoking cat \ time_ra contn \ bmi_cat cat \ eth5 cat) by(no_a
> ppts_`i') clear
 16.     export delimited using ./output/tables/characteristics_no_appts_`i'.cs
> v    
 17.     destring _columna_1, gen(n1) ignore(",") force
 18.     destring _columna_0, gen(n0) ignore(",") force
 19.     destring _columnb_1, gen(percent1) ignore("-" "%" "(" ")")  force
 20.     destring _columnb_0, gen(percent0) ignore("-" "%" "(" ")")  force
 21.     gen rounded_n1 = round(n1, 5)
 22.     gen rounded_n0 = round(n0, 5)
 23.     keep factor level rounded_n0 percent0 rounded_n1 percent1
 24.     export delimited using ./output/tables/characteristics_no_appts_`i'_ro
> unded.csv
 25.     restore
 26.     * Logistic regression 
.     foreach var in urban_rural_bin i.imd ib3.region_n i.eth5 {
 27.         logit fewer_appts_`i' `var' ib1.age_cat male, or 
 28.         est sto m1 
 29.         parmest, label eform format(estimate p min95 max95) saving("./outp
> ut/tempdata/`var'_diff_rheum_`i'", replace) idstr("`var'_rheum_`i'")
 30.         }
 31.     logit fewer_appts_`i' ib1.age_cat male urban_rural_bin i.imd ib3.regio
> n_n i.eth5, or 
 32.     est sto m1
 33.     parmest, label eform format(estimate p min95 max95) saving("./output/t
> empdata/multi_diff_rheum_`i'", replace) idstr("multi_rheum_`i'")
 34.     }

  +-------------------------------------------+
  | factor          N_0     N_1     m_0   m_1 |
  |-------------------------------------------|
  | age_cat       1,525   1,178     400   333 |
  |-------------------------------------------|
  | male          1,925   1,511       0     0 |
  |-------------------------------------------|
  | Rural-Urban   1,925   1,511       0     0 |
  |-------------------------------------------|
  | region        1,925   1,511       0     0 |
  |-------------------------------------------|
  | imd           1,925   1,511       0     0 |
  |-------------------------------------------|
  | smoking       1,925   1,511       0     0 |
  |-------------------------------------------|
  | time_ra         848     677   1,077   834 |
  |-------------------------------------------|
  | bmi_cat       1,925   1,511       0     0 |
  |-------------------------------------------|
  | eth5          1,925   1,511       0     0 |
  +-------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------------------+
  |                                          fewer_appts_2020 = 0   fewer_appts
> _2020 = 1   p-value |
  |----------------------------------------------------------------------------
> --------------------|
  |                                          N=1,925                N=1,511    
>                     |
  |----------------------------------------------------------------------------
> --------------------|
  | age_cat       18 - 40 years              557 (36.5%)            413 (35.1%)
>              0.51   |
  |               41 - 60 years              474 (31.1%)            395 (33.5%)
>                     |
  |               61 - 80 years              387 (25.4%)            297 (25.2%)
>                     |
  |               >80 years                  107 ( 7.0%)            73 ( 6.2%) 
>                     |
  |----------------------------------------------------------------------------
> --------------------|
  | male          Female                     949 (49.3%)            777 (51.4%)
>              0.22   |
  |               Male                       976 (50.7%)            734 (48.6%)
>                     |
  |----------------------------------------------------------------------------
> --------------------|
  | Rural-Urban   Rural                      960 (49.9%)            764 (50.6%)
>              0.69   |
  |               Urban                      965 (50.1%)            747 (49.4%)
>                     |
  |----------------------------------------------------------------------------
> --------------------|
  | region        East Midlands              175 ( 9.1%)            157 (10.4%)
>              0.12   |
  |               East of England            214 (11.1%)            126 ( 8.3%)
>                     |
  |               London                     381 (19.8%)            299 (19.8%)
>                     |
  |               North East                 197 (10.2%)            156 (10.3%)
>                     |
  |               North West                 194 (10.1%)            171 (11.3%)
>                     |
  |               South East                 398 (20.7%)            296 (19.6%)
>                     |
  |               West Midlands              189 ( 9.8%)            147 ( 9.7%)
>                     |
  |               Yorkshire and the Humber   177 ( 9.2%)            159 (10.5%)
>                     |
  |----------------------------------------------------------------------------
> --------------------|
  | imd           0                          89 ( 4.6%)             80 ( 5.3%) 
>              0.64   |
  |               1                          365 (19.0%)            284 (18.8%)
>                     |
  |               2                          374 (19.4%)            299 (19.8%)
>                     |
  |               3                          366 (19.0%)            303 (20.1%)
>                     |
  |               4                          372 (19.3%)            260 (17.2%)
>                     |
  |               5                          359 (18.6%)            285 (18.9%)
>                     |
  |----------------------------------------------------------------------------
> --------------------|
  | smoking       Never smoked               210 (10.9%)            139 ( 9.2%)
>              0.38   |
  |               Current smoker             379 (19.7%)            296 (19.6%)
>                     |
  |               Ex-smoker                  307 (15.9%)            256 (16.9%)
>                     |
  |               Unknown                    1,029 (53.5%)          820 (54.3%)
>                     |
  |----------------------------------------------------------------------------
> --------------------|
  | time_ra                                  56.94975 (30.91908)    54.05056 (3
> 1.26467)     0.070  |
  |----------------------------------------------------------------------------
> --------------------|
  | bmi_cat       Missing                    398 (20.7%)            298 (19.7%)
>              0.22   |
  |               Underweight                190 ( 9.9%)            129 ( 8.5%)
>                     |
  |               Healthy range              348 (18.1%)            279 (18.5%)
>                     |
  |               Overweight                 362 (18.8%)            298 (19.7%)
>                     |
  |               Obese                      537 (27.9%)            411 (27.2%)
>                     |
  |               Morbidly obese             90 ( 4.7%)             96 ( 6.4%) 
>                     |
  |----------------------------------------------------------------------------
> --------------------|
  | eth5          White                      424 (22.0%)            306 (20.3%)
>              0.20   |
  |               South Asian                366 (19.0%)            336 (22.2%)
>                     |
  |               Black                      356 (18.5%)            276 (18.3%)
>                     |
  |               Mixed                      387 (20.1%)            290 (19.2%)
>                     |
  |               Other                      392 (20.4%)            303 (20.1%)
>                     |
  +----------------------------------------------------------------------------
> --------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file ./output/tables/characteristics_fewer_appts_2020.csv saved
_columna_1: contains nonnumeric characters not specified in ignore(); n1 genera
> ted as double
(2 missing values generated)
_columna_0: contains nonnumeric characters not specified in ignore()
_columna_0: character , removed; n0 generated as double
(2 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent1 generated as double
(2 missing values generated)
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
file ./output/tables/characteristics_fewer_appts_2020_rounded.csv saved

  +-----------------------------------------+
  | factor          N_0   N_1     m_0   m_1 |
  |-----------------------------------------|
  | age_cat       3,902    25   1,062    11 |
  |-----------------------------------------|
  | male          4,964    36       0     0 |
  |-----------------------------------------|
  | Rural-Urban   4,964    36       0     0 |
  |-----------------------------------------|
  | region        4,964    36       0     0 |
  |-----------------------------------------|
  | imd           4,964    36       0     0 |
  |-----------------------------------------|
  | smoking       4,964    36       0     0 |
  |-----------------------------------------|
  | time_ra       2,238    16   2,726    20 |
  |-----------------------------------------|
  | bmi_cat       4,964    36       0     0 |
  |-----------------------------------------|
  | eth5          4,964    36       0     0 |
  +-----------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> ------------------+
  |                                          no_appts_2020 = 0     no_appts_202
> 0 = 1     p-value |
  |----------------------------------------------------------------------------
> ------------------|
  |                                          N=4,964               N=36        
>                   |
  |----------------------------------------------------------------------------
> ------------------|
  | age_cat       18 - 40 years              1,418 (36.3%)         5 (20.0%)   
>            0.29   |
  |               41 - 60 years              1,267 (32.5%)         12 (48.0%)  
>                   |
  |               61 - 80 years              956 (24.5%)           6 (24.0%)   
>                   |
  |               >80 years                  261 ( 6.7%)           2 ( 8.0%)   
>                   |
  |----------------------------------------------------------------------------
> ------------------|
  | male          Female                     2,495 (50.3%)         14 (38.9%)  
>            0.17   |
  |               Male                       2,469 (49.7%)         22 (61.1%)  
>                   |
  |----------------------------------------------------------------------------
> ------------------|
  | Rural-Urban   Rural                      2,479 (49.9%)         22 (61.1%)  
>            0.18   |
  |               Urban                      2,485 (50.1%)         14 (38.9%)  
>                   |
  |----------------------------------------------------------------------------
> ------------------|
  | region        East Midlands              479 ( 9.6%)           6 (16.7%)   
>            0.36   |
  |               East of England            487 ( 9.8%)           4 (11.1%)   
>                   |
  |               London                     984 (19.8%)           4 (11.1%)   
>                   |
  |               North East                 500 (10.1%)           6 (16.7%)   
>                   |
  |               North West                 513 (10.3%)           6 (16.7%)   
>                   |
  |               South East                 995 (20.0%)           5 (13.9%)   
>                   |
  |               West Midlands              499 (10.1%)           3 ( 8.3%)   
>                   |
  |               Yorkshire and the Humber   507 (10.2%)           2 ( 5.6%)   
>                   |
  |----------------------------------------------------------------------------
> ------------------|
  | imd           0                          247 ( 5.0%)           5 (13.9%)   
>            0.038  |
  |               1                          945 (19.0%)           10 (27.8%)  
>                   |
  |               2                          952 (19.2%)           3 ( 8.3%)   
>                   |
  |               3                          966 (19.5%)           3 ( 8.3%)   
>                   |
  |               4                          924 (18.6%)           7 (19.4%)   
>                   |
  |               5                          930 (18.7%)           8 (22.2%)   
>                   |
  |----------------------------------------------------------------------------
> ------------------|
  | smoking       Never smoked               504 (10.2%)           2 ( 5.6%)   
>            0.64   |
  |               Current smoker             987 (19.9%)           9 (25.0%)   
>                   |
  |               Ex-smoker                  777 (15.7%)           7 (19.4%)   
>                   |
  |               Unknown                    2,696 (54.3%)         18 (50.0%)  
>                   |
  |----------------------------------------------------------------------------
> ------------------|
  | time_ra                                  55.30111 (31.62008)   64.12218 (29
> .56229)    0.27   |
  |----------------------------------------------------------------------------
> ------------------|
  | bmi_cat       Missing                    997 (20.1%)           12 (33.3%)  
>            0.29   |
  |               Underweight                461 ( 9.3%)           5 (13.9%)   
>                   |
  |               Healthy range              908 (18.3%)           6 (16.7%)   
>                   |
  |               Overweight                 963 (19.4%)           5 (13.9%)   
>                   |
  |               Obese                      1,381 (27.8%)         6 (16.7%)   
>                   |
  |               Morbidly obese             254 ( 5.1%)           2 ( 5.6%)   
>                   |
  |----------------------------------------------------------------------------
> ------------------|
  | eth5          White                      1,015 (20.4%)         9 (25.0%)   
>            0.97   |
  |               South Asian                1,013 (20.4%)         7 (19.4%)   
>                   |
  |               Black                      968 (19.5%)           7 (19.4%)   
>                   |
  |               Mixed                      983 (19.8%)           6 (16.7%)   
>                   |
  |               Other                      985 (19.8%)           7 (19.4%)   
>                   |
  +----------------------------------------------------------------------------
> ------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file ./output/tables/characteristics_no_appts_2020.csv saved
_columna_1: contains nonnumeric characters not specified in ignore(); n1 genera
> ted as double
(2 missing values generated)
_columna_0: contains nonnumeric characters not specified in ignore()
_columna_0: character , removed; n0 generated as double
(2 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent1 generated as double
(2 missing values generated)
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
file ./output/tables/characteristics_no_appts_2020_rounded.csv saved

Iteration 0:   log likelihood =  -1851.242  
Iteration 1:   log likelihood = -1849.8203  
Iteration 2:   log likelihood = -1849.8202  

Logistic regression                             Number of obs     =      2,703
                                                LR chi2(5)        =       2.84
                                                Prob > chi2       =     0.7241
Log likelihood = -1849.8202                     Pseudo R2         =     0.0008

------------------------------------------------------------------------------
fewer~s_2020 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
urban_rura~n |   .9889028    .076781    -0.14   0.886     .8493058    1.151445
             |
     age_cat |
18 - 40 y..  |   .8900014   .0837735    -1.24   0.216      .740064    1.070316
61 - 80 y..  |   .9196993   .0946965    -0.81   0.416     .7516267    1.125355
  >80 years  |    .816489   .1359162    -1.22   0.223     .5891904    1.131475
             |
        male |   .9461134   .0734889    -0.71   0.476     .8125059    1.101691
       _cons |   .8617727   .0754744    -1.70   0.089     .7258455    1.023155
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/urban_rural_bin_diff_rheum_2020.dta not found)
file ./output/tempdata/urban_rural_bin_diff_rheum_2020.dta saved

Iteration 0:   log likelihood =  -1851.242  
Iteration 1:   log likelihood = -1848.6584  
Iteration 2:   log likelihood = -1848.6582  

Logistic regression                             Number of obs     =      2,703
                                                LR chi2(9)        =       5.17
                                                Prob > chi2       =     0.8195
Log likelihood = -1848.6582                     Pseudo R2         =     0.0014

------------------------------------------------------------------------------
fewer~s_2020 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         imd |
          1  |   .8469568   .1661729    -0.85   0.397     .5765746    1.244134
          2  |   .8425076   .1643514    -0.88   0.380     .5748129     1.23487
          3  |   .8620155   .1686149    -0.76   0.448     .5875103    1.264779
          4  |   .7595705   .1499778    -1.39   0.164     .5158194    1.118507
          5  |   .8575258   .1685374    -0.78   0.434     .5833816    1.260497
             |
     age_cat |
18 - 40 y..  |   .8865922    .083576    -1.28   0.202     .7370282    1.066507
61 - 80 y..  |   .9207273   .0949472    -0.80   0.423     .7522349     1.12696
  >80 years  |   .8219347   .1369511    -1.18   0.239     .5929386     1.13937
             |
        male |    .947041   .0737107    -0.70   0.484     .8130506    1.103113
       _cons |   1.018849   .1918571     0.10   0.921     .7044043    1.473661
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/i.imd_diff_rheum_2020 not found)
file ./output/tempdata/i.imd_diff_rheum_2020 saved

Iteration 0:   log likelihood =  -1851.242  
Iteration 1:   log likelihood = -1846.6755  
Iteration 2:   log likelihood = -1846.6746  
Iteration 3:   log likelihood = -1846.6746  

Logistic regression                             Number of obs     =      2,703
                                                LR chi2(11)       =       9.13
                                                Prob > chi2       =     0.6094
Log likelihood = -1846.6746                     Pseudo R2         =     0.0025

------------------------------------------------------------------------------
fewer~s_2020 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    region_n |
          1  |   1.001812   .1534094     0.01   0.991     .7420623    1.352485
          2  |   .7701902   .1158818    -1.74   0.083     .5734919    1.034353
          4  |   .9266302   .1394545    -0.51   0.613     .6899279    1.244541
          5  |   1.121395   .1650229     0.78   0.436     .8404215    1.496306
          6  |   .9601739   .1180065    -0.33   0.741     .7546337    1.221697
          8  |     .96128   .1461952    -0.26   0.795      .713503    1.295102
          9  |   1.090837   .1641197     0.58   0.563     .8122576    1.464959
             |
     age_cat |
18 - 40 y..  |   .8885946   .0838574    -1.25   0.211     .7385418    1.069134
61 - 80 y..  |   .9205935   .0950593    -0.80   0.423     .7519238    1.127099
  >80 years  |   .8138692   .1358106    -1.23   0.217     .5868327    1.128742
             |
        male |   .9491856    .073926    -0.67   0.503     .8148102    1.105722
       _cons |   .8780395   .0962467    -1.19   0.235     .7082868    1.088476
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/ib3.region_n_diff_rheum_2020 not found)
file ./output/tempdata/ib3.region_n_diff_rheum_2020 saved

Iteration 0:   log likelihood =  -1851.242  
Iteration 1:   log likelihood = -1846.1177  
Iteration 2:   log likelihood = -1846.1172  
Iteration 3:   log likelihood = -1846.1172  

Logistic regression                             Number of obs     =      2,703
                                                LR chi2(8)        =      10.25
                                                Prob > chi2       =     0.2479
Log likelihood = -1846.1172                     Pseudo R2         =     0.0028

------------------------------------------------------------------------------
fewer~s_2020 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.351601   .1642087     2.48   0.013     1.065208    1.714995
      Black  |   1.176966   .1459164     1.31   0.189     .9230706    1.500698
      Mixed  |   1.044302   .1286142     0.35   0.725     .8203395    1.329408
      Other  |    1.10914   .1349146     0.85   0.394     .8738703     1.40775
             |
     age_cat |
18 - 40 y..  |   .8894418   .0839043    -1.24   0.214     .7392997    1.070076
61 - 80 y..  |   .9285228   .0958353    -0.72   0.472     .7584689    1.136704
  >80 years  |   .8337736   .1391677    -1.09   0.276     .6011344    1.156444
             |
        male |   .9393026   .0731262    -0.80   0.421      .806377     1.09414
       _cons |   .7585071   .0847128    -2.47   0.013     .6093888    .9441149
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/i.eth5_diff_rheum_2020 not found)
file ./output/tempdata/i.eth5_diff_rheum_2020 saved

Iteration 0:   log likelihood =  -1851.242  
Iteration 1:   log likelihood = -1841.4312  
Iteration 2:   log likelihood = -1841.4288  
Iteration 3:   log likelihood = -1841.4288  

Logistic regression                             Number of obs     =      2,703
                                                LR chi2(21)       =      19.63
                                                Prob > chi2       =     0.5450
Log likelihood = -1841.4288                     Pseudo R2         =     0.0053

------------------------------------------------------------------------------
fewer~s_2020 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     age_cat |
18 - 40 y..  |   .8837787   .0837275    -1.30   0.192     .7340107    1.064106
61 - 80 y..  |   .9320533     .09667    -0.68   0.497     .7606002    1.142155
  >80 years  |    .838339   .1404186    -1.05   0.292     .6037354    1.164106
             |
        male |    .942761   .0737576    -0.75   0.451     .8087369    1.098996
urban_rura~n |   .9837933    .077045    -0.21   0.835     .8438062    1.147004
             |
         imd |
          1  |   .8316434   .1639874    -0.93   0.350     .5650582    1.223999
          2  |   .8392897   .1643585    -0.89   0.371     .5717691    1.231978
          3  |   .8561404   .1681762    -0.79   0.429     .5825578    1.258204
          4  |   .7426588   .1474271    -1.50   0.134     .5032863    1.095881
          5  |   .8443632   .1666775    -0.86   0.391     .5734583    1.243245
             |
    region_n |
          1  |   .9913758   .1523156    -0.06   0.955     .7335998    1.339731
          2  |   .7598459   .1147061    -1.82   0.069     .5652342    1.021463
          4  |   .9221564   .1393223    -0.54   0.592     .6858077    1.239958
          5  |   1.118148   .1649564     0.76   0.449     .8373842    1.493049
          6  |   .9590207   .1182733    -0.34   0.734     .7530984    1.221249
          8  |   .9493621    .145021    -0.34   0.734     .7037292    1.280732
          9  |    1.08866   .1643975     0.56   0.574     .8097537     1.46363
             |
        eth5 |
South Asian  |   1.367928   .1667432     2.57   0.010     1.077224    1.737081
      Black  |     1.1799   .1467092     1.33   0.183     .9247124    1.505511
      Mixed  |   1.041723   .1286078     0.33   0.741     .8178348    1.326902
      Other  |   1.105326   .1347828     0.82   0.412     .8703532    1.403736
             |
       _cons |   .9460442   .2099779    -0.25   0.803     .6123281    1.461634
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/multi_diff_rheum_2020.dta not found)
file ./output/tempdata/multi_diff_rheum_2020.dta saved

  +---------------------------------------+
  | factor          N_0   N_1   m_0   m_1 |
  |---------------------------------------|
  | age_cat         999   775   292   203 |
  |---------------------------------------|
  | male          1,291   978     0     0 |
  |---------------------------------------|
  | Rural-Urban   1,291   978     0     0 |
  |---------------------------------------|
  | region        1,291   978     0     0 |
  |---------------------------------------|
  | imd           1,291   978     0     0 |
  |---------------------------------------|
  | smoking       1,291   978     0     0 |
  |---------------------------------------|
  | time_ra         576   432   715   546 |
  |---------------------------------------|
  | bmi_cat       1,291   978     0     0 |
  |---------------------------------------|
  | eth5          1,291   978     0     0 |
  +---------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------------------+
  |                                          fewer_appts_2021 = 0   fewer_appts
> _2021 = 1   p-value |
  |----------------------------------------------------------------------------
> --------------------|
  |                                          N=1,291                N=978      
>                     |
  |----------------------------------------------------------------------------
> --------------------|
  | age_cat       18 - 40 years              349 (34.9%)            290 (37.4%)
>              0.075  |
  |               41 - 60 years              320 (32.0%)            254 (32.8%)
>                     |
  |               61 - 80 years              254 (25.4%)            195 (25.2%)
>                     |
  |               >80 years                  76 ( 7.6%)             36 ( 4.6%) 
>                     |
  |----------------------------------------------------------------------------
> --------------------|
  | male          Female                     621 (48.1%)            529 (54.1%)
>              0.005  |
  |               Male                       670 (51.9%)            449 (45.9%)
>                     |
  |----------------------------------------------------------------------------
> --------------------|
  | Rural-Urban   Rural                      651 (50.4%)            485 (49.6%)
>              0.69   |
  |               Urban                      640 (49.6%)            493 (50.4%)
>                     |
  |----------------------------------------------------------------------------
> --------------------|
  | region        East Midlands              125 ( 9.7%)            94 ( 9.6%) 
>              0.42   |
  |               East of England            124 ( 9.6%)            100 (10.2%)
>                     |
  |               London                     275 (21.3%)            180 (18.4%)
>                     |
  |               North East                 121 ( 9.4%)            110 (11.2%)
>                     |
  |               North West                 139 (10.8%)            99 (10.1%) 
>                     |
  |               South East                 250 (19.4%)            209 (21.4%)
>                     |
  |               West Midlands              130 (10.1%)            85 ( 8.7%) 
>                     |
  |               Yorkshire and the Humber   127 ( 9.8%)            101 (10.3%)
>                     |
  |----------------------------------------------------------------------------
> --------------------|
  | imd           0                          67 ( 5.2%)             48 ( 4.9%) 
>              0.76   |
  |               1                          249 (19.3%)            181 (18.5%)
>                     |
  |               2                          241 (18.7%)            202 (20.7%)
>                     |
  |               3                          234 (18.1%)            189 (19.3%)
>                     |
  |               4                          254 (19.7%)            178 (18.2%)
>                     |
  |               5                          246 (19.1%)            180 (18.4%)
>                     |
  |----------------------------------------------------------------------------
> --------------------|
  | smoking       Never smoked               128 ( 9.9%)            98 (10.0%) 
>              0.23   |
  |               Current smoker             277 (21.5%)            178 (18.2%)
>                     |
  |               Ex-smoker                  212 (16.4%)            157 (16.1%)
>                     |
  |               Unknown                    674 (52.2%)            545 (55.7%)
>                     |
  |----------------------------------------------------------------------------
> --------------------|
  | time_ra                                  55.14484 (31.1174)     56.01344 (3
> 1.54993)     0.66   |
  |----------------------------------------------------------------------------
> --------------------|
  | bmi_cat       Missing                    253 (19.6%)            209 (21.4%)
>              0.51   |
  |               Underweight                128 ( 9.9%)            80 ( 8.2%) 
>                     |
  |               Healthy range              230 (17.8%)            188 (19.2%)
>                     |
  |               Overweight                 254 (19.7%)            179 (18.3%)
>                     |
  |               Obese                      351 (27.2%)            259 (26.5%)
>                     |
  |               Morbidly obese             75 ( 5.8%)             63 ( 6.4%) 
>                     |
  |----------------------------------------------------------------------------
> --------------------|
  | eth5          White                      265 (20.5%)            204 (20.9%)
>              0.98   |
  |               South Asian                267 (20.7%)            212 (21.7%)
>                     |
  |               Black                      236 (18.3%)            176 (18.0%)
>                     |
  |               Mixed                      257 (19.9%)            191 (19.5%)
>                     |
  |               Other                      266 (20.6%)            195 (19.9%)
>                     |
  +----------------------------------------------------------------------------
> --------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file ./output/tables/characteristics_fewer_appts_2021.csv saved
_columna_1: contains nonnumeric characters not specified in ignore(); n1 genera
> ted as double
(2 missing values generated)
_columna_0: contains nonnumeric characters not specified in ignore(); n0 genera
> ted as double
(2 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent1 generated as double
(2 missing values generated)
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
file ./output/tables/characteristics_fewer_appts_2021_rounded.csv saved

  +-----------------------------------------+
  | factor          N_0   N_1     m_0   m_1 |
  |-----------------------------------------|
  | age_cat       3,915    12   1,069     4 |
  |-----------------------------------------|
  | male          4,984    16       0     0 |
  |-----------------------------------------|
  | Rural-Urban   4,984    16       0     0 |
  |-----------------------------------------|
  | region        4,984    16       0     0 |
  |-----------------------------------------|
  | imd           4,984    16       0     0 |
  |-----------------------------------------|
  | smoking       4,984    16       0     0 |
  |-----------------------------------------|
  | time_ra       2,246     8   2,738     8 |
  |-----------------------------------------|
  | bmi_cat       4,984    16       0     0 |
  |-----------------------------------------|
  | eth5          4,984    16       0     0 |
  +-----------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> ------------------+
  |                                          no_appts_2021 = 0     no_appts_202
> 1 = 1     p-value |
  |----------------------------------------------------------------------------
> ------------------|
  |                                          N=4,984               N=16        
>                   |
  |----------------------------------------------------------------------------
> ------------------|
  | age_cat       18 - 40 years              1,419 (36.2%)         4 (33.3%)   
>            0.88   |
  |               41 - 60 years              1,274 (32.5%)         5 (41.7%)   
>                   |
  |               61 - 80 years              960 (24.5%)           2 (16.7%)   
>                   |
  |               >80 years                  262 ( 6.7%)           1 ( 8.3%)   
>                   |
  |----------------------------------------------------------------------------
> ------------------|
  | male          Female                     2,502 (50.2%)         7 (43.8%)   
>            0.61   |
  |               Male                       2,482 (49.8%)         9 (56.2%)   
>                   |
  |----------------------------------------------------------------------------
> ------------------|
  | Rural-Urban   Rural                      2,494 (50.0%)         7 (43.8%)   
>            0.62   |
  |               Urban                      2,490 (50.0%)         9 (56.2%)   
>                   |
  |----------------------------------------------------------------------------
> ------------------|
  | region        East Midlands              482 ( 9.7%)           3 (18.8%)   
>            0.35   |
  |               East of England            489 ( 9.8%)           2 (12.5%)   
>                   |
  |               London                     982 (19.7%)           6 (37.5%)   
>                   |
  |               North East                 505 (10.1%)           1 ( 6.2%)   
>                   |
  |               North West                 519 (10.4%)           0 ( 0.0%)   
>                   |
  |               South East                 999 (20.0%)           1 ( 6.2%)   
>                   |
  |               West Midlands              500 (10.0%)           2 (12.5%)   
>                   |
  |               Yorkshire and the Humber   508 (10.2%)           1 ( 6.2%)   
>                   |
  |----------------------------------------------------------------------------
> ------------------|
  | imd           0                          250 ( 5.0%)           2 (12.5%)   
>            0.55   |
  |               1                          951 (19.1%)           4 (25.0%)   
>                   |
  |               2                          952 (19.1%)           3 (18.8%)   
>                   |
  |               3                          965 (19.4%)           4 (25.0%)   
>                   |
  |               4                          930 (18.7%)           1 ( 6.2%)   
>                   |
  |               5                          936 (18.8%)           2 (12.5%)   
>                   |
  |----------------------------------------------------------------------------
> ------------------|
  | smoking       Never smoked               506 (10.2%)           0 ( 0.0%)   
>            0.068  |
  |               Current smoker             989 (19.8%)           7 (43.8%)   
>                   |
  |               Ex-smoker                  781 (15.7%)           3 (18.8%)   
>                   |
  |               Unknown                    2,708 (54.3%)         6 (37.5%)   
>                   |
  |----------------------------------------------------------------------------
> ------------------|
  | time_ra                                  55.38189 (31.61803)   50.26249 (30
> .30368)    0.65   |
  |----------------------------------------------------------------------------
> ------------------|
  | bmi_cat       Missing                    1,006 (20.2%)         3 (18.8%)   
>            0.68   |
  |               Underweight                466 ( 9.3%)           0 ( 0.0%)   
>                   |
  |               Healthy range              911 (18.3%)           3 (18.8%)   
>                   |
  |               Overweight                 964 (19.3%)           4 (25.0%)   
>                   |
  |               Obese                      1,381 (27.7%)         6 (37.5%)   
>                   |
  |               Morbidly obese             256 ( 5.1%)           0 ( 0.0%)   
>                   |
  |----------------------------------------------------------------------------
> ------------------|
  | eth5          White                      1,019 (20.4%)         5 (31.2%)   
>            0.85   |
  |               South Asian                1,017 (20.4%)         3 (18.8%)   
>                   |
  |               Black                      973 (19.5%)           2 (12.5%)   
>                   |
  |               Mixed                      986 (19.8%)           3 (18.8%)   
>                   |
  |               Other                      989 (19.8%)           3 (18.8%)   
>                   |
  +----------------------------------------------------------------------------
> ------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file ./output/tables/characteristics_no_appts_2021.csv saved
_columna_1: contains nonnumeric characters not specified in ignore(); n1 genera
> ted as double
(2 missing values generated)
_columna_0: contains nonnumeric characters not specified in ignore()
_columna_0: character , removed; n0 generated as double
(2 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent1 generated as double
(2 missing values generated)
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
file ./output/tables/characteristics_no_appts_2021_rounded.csv saved

Iteration 0:   log likelihood = -1215.4632  
Iteration 1:   log likelihood = -1208.3174  
Iteration 2:   log likelihood = -1208.3082  
Iteration 3:   log likelihood = -1208.3082  

Logistic regression                             Number of obs     =      1,774
                                                LR chi2(5)        =      14.31
                                                Prob > chi2       =     0.0138
Log likelihood = -1208.3082                     Pseudo R2         =     0.0059

------------------------------------------------------------------------------
fewer~s_2021 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
urban_rura~n |   1.010632   .0971739     0.11   0.912     .8370447    1.220218
             |
     age_cat |
18 - 40 y..  |   1.045524   .1211755     0.38   0.701     .8330674    1.312162
61 - 80 y..  |   .9627472   .1225268    -0.30   0.765     .7502079      1.2355
  >80 years  |   .5835599   .1281889    -2.45   0.014     .3794062     .897566
             |
        male |   .7725318   .0743464    -2.68   0.007     .6397333    .9328971
       _cons |   .8991382   .0972377    -0.98   0.326     .7273993    1.111425
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/urban_rural_bin_diff_rheum_2021.dta not found)
file ./output/tempdata/urban_rural_bin_diff_rheum_2021.dta saved

Iteration 0:   log likelihood = -1215.4632  
Iteration 1:   log likelihood = -1206.8232  
Iteration 2:   log likelihood = -1206.8124  
Iteration 3:   log likelihood = -1206.8124  

Logistic regression                             Number of obs     =      1,774
                                                LR chi2(9)        =      17.30
                                                Prob > chi2       =     0.0442
Log likelihood = -1206.8124                     Pseudo R2         =     0.0071

------------------------------------------------------------------------------
fewer~s_2021 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         imd |
          1  |    1.13767   .2691484     0.55   0.586     .7155508    1.808808
          2  |   1.121643   .2638216     0.49   0.626     .7073653    1.778549
          3  |   1.184142   .2808935     0.71   0.476     .7438547    1.885036
          4  |   .9366573   .2232668    -0.27   0.784     .5870615    1.494438
          5  |   1.019698   .2427683     0.08   0.935     .6394682    1.626015
             |
     age_cat |
18 - 40 y..  |   1.050958   .1220318     0.43   0.669     .8370436     1.31954
61 - 80 y..  |   .9575092   .1220736    -0.34   0.733     .7458003    1.229316
  >80 years  |   .5943015   .1309732    -2.36   0.018     .3858491     .915369
             |
        male |   .7701249   .0743163    -2.71   0.007     .6374133    .9304677
       _cons |    .841515   .1901196    -0.76   0.445     .5404478    1.310298
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/i.imd_diff_rheum_2021 not found)
file ./output/tempdata/i.imd_diff_rheum_2021 saved

Iteration 0:   log likelihood = -1215.4632  
Iteration 1:   log likelihood = -1205.5372  
Iteration 2:   log likelihood = -1205.5259  
Iteration 3:   log likelihood = -1205.5259  

Logistic regression                             Number of obs     =      1,774
                                                LR chi2(11)       =      19.87
                                                Prob > chi2       =     0.0471
Log likelihood = -1205.5259                     Pseudo R2         =     0.0082

------------------------------------------------------------------------------
fewer~s_2021 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    region_n |
          1  |   1.038115   .1987659     0.20   0.845     .7132921    1.510857
          2  |   1.106293   .2036319     0.55   0.583     .7712442    1.586895
          4  |   1.433721   .2657823     1.94   0.052     .9969413    2.061864
          5  |   1.047085   .1943808     0.25   0.804     .7277208    1.506603
          6  |   1.263407   .1938852     1.52   0.128     .9352247    1.706752
          8  |   1.065265   .2033514     0.33   0.740     .7327728    1.548624
          9  |   1.100917    .203874     0.52   0.604     .7658156     1.58265
             |
     age_cat |
18 - 40 y..  |   1.033979    .120342     0.29   0.774     .8230809    1.298915
61 - 80 y..  |    .955299   .1220993    -0.36   0.720     .7436096    1.227252
  >80 years  |   .5682356   .1252774    -2.56   0.010      .368864    .8753678
             |
        male |   .7682912   .0742658    -2.73   0.006     .6356903    .9285516
       _cons |   .8112057   .1098152    -1.55   0.122     .6221591    1.057695
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/ib3.region_n_diff_rheum_2021 not found)
file ./output/tempdata/ib3.region_n_diff_rheum_2021 saved

Iteration 0:   log likelihood = -1215.4632  
Iteration 1:   log likelihood = -1207.9877  
Iteration 2:   log likelihood =  -1207.978  
Iteration 3:   log likelihood =  -1207.978  

Logistic regression                             Number of obs     =      1,774
                                                LR chi2(8)        =      14.97
                                                Prob > chi2       =     0.0597
Log likelihood =  -1207.978                     Pseudo R2         =     0.0062

------------------------------------------------------------------------------
fewer~s_2021 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.061671   .1605544     0.40   0.692     .7893404    1.427958
      Black  |   1.018229   .1576108     0.12   0.907     .7517765     1.37912
      Mixed  |   .9396231   .1439785    -0.41   0.684     .6958634    1.268771
      Other  |   1.006395   .1523362     0.04   0.966     .7480382    1.353984
             |
     age_cat |
18 - 40 y..  |     1.0436    .121062     0.37   0.713     .8313636    1.310017
61 - 80 y..  |   .9642617    .122954    -0.29   0.775     .7510301    1.238034
  >80 years  |   .5849467   .1286115    -2.44   0.015     .3801576    .9000549
             |
        male |   .7696365   .0741902    -2.72   0.007      .637137    .9296906
       _cons |   .9012468   .1264185    -0.74   0.459     .6846131    1.186431
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/i.eth5_diff_rheum_2021 not found)
file ./output/tempdata/i.eth5_diff_rheum_2021 saved

Iteration 0:   log likelihood = -1215.4632  
Iteration 1:   log likelihood = -1203.6958  
Iteration 2:   log likelihood = -1203.6822  
Iteration 3:   log likelihood = -1203.6822  

Logistic regression                             Number of obs     =      1,774
                                                LR chi2(21)       =      23.56
                                                Prob > chi2       =     0.3148
Log likelihood = -1203.6822                     Pseudo R2         =     0.0097

------------------------------------------------------------------------------
fewer~s_2021 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     age_cat |
18 - 40 y..  |   1.037592   .1210978     0.32   0.752     .8254348     1.30428
61 - 80 y..  |   .9523624   .1221635    -0.38   0.704     .7406534    1.224586
  >80 years  |    .580868   .1285835    -2.45   0.014     .3764019    .8964026
             |
        male |   .7630102   .0740732    -2.79   0.005     .6308055    .9229225
urban_rura~n |   .9968176   .0967068    -0.03   0.974     .8242064    1.205578
             |
         imd |
          1  |   1.120882   .2663858     0.48   0.631     .7035027    1.785888
          2  |   1.100704   .2598833     0.41   0.684     .6929413    1.748416
          3  |   1.165139   .2773814     0.64   0.521     .7306923    1.857894
          4  |   .9186112   .2199404    -0.35   0.723     .5745543    1.468698
          5  |   .9989567   .2387741    -0.00   0.997     .6253016    1.595893
             |
    region_n |
          1  |   1.023785   .1967266     0.12   0.903     .7024979    1.492012
          2  |   1.097179   .2028458     0.50   0.616     .7636739     1.57633
          4  |   1.426337   .2650819     1.91   0.056     .9908963    2.053129
          5  |   1.037888   .1931105     0.20   0.842     .7207345    1.494604
          6  |   1.253082   .1929304     1.47   0.143      .926669    1.694473
          8  |   1.052536   .2016185     0.27   0.789     .7230782    1.532106
          9  |   1.086496   .2019198     0.45   0.655     .7548084    1.563939
             |
        eth5 |
South Asian  |   1.064629   .1618081     0.41   0.680     .7903656    1.434064
      Black  |   1.026229   .1595876     0.17   0.868      .756615    1.391918
      Mixed  |   .9399383   .1445241    -0.40   0.687     .6953754    1.270514
      Other  |   1.006762   .1528899     0.04   0.965     .7475855    1.355791
             |
       _cons |   .7712718    .207714    -0.96   0.335     .4549538    1.307518
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/multi_diff_rheum_2021.dta not found)
file ./output/tempdata/multi_diff_rheum_2021.dta saved

. * Put together 2020 and 2021 logistic regression results
. preserve 

. use "./output/tempdata/urban_rural_bin_diff_rheum_2020", clear 

. append using "./output/tempdata/i.imd_diff_rheum_2020"

. append using "./output/tempdata/ib3.region_n_diff_rheum_2020"

. append using "./output/tempdata/i.eth5_diff_rheum_2020"

. append using "./output/tempdata/multi_diff_rheum_2020"

. append using "./output/tempdata/urban_rural_bin_diff_rheum_2021"

. append using "./output/tempdata/i.imd_diff_rheum_2021"

. append using "./output/tempdata/ib3.region_n_diff_rheum_2021"

. append using "./output/tempdata/i.eth5_diff_rheum_2021"

. append using "./output/tempdata/multi_diff_rheum_2021"

. drop stderr z 

. export delimited using ./output/tables/logistic_diff_results.csv 
file ./output/tables/logistic_diff_results.csv saved

. restore

. 
. 
. * Tabulate characteristics by categories of differences in all outpatient app
> ointments for each year
. * When stratified there are small numbers with missing region therefore tabul
> ate only those without region missing
. drop if region=="missing"
(0 observations deleted)

. tempfile tempfile

. forvalues i=2020/2021 {
  2.     preserve
  3.     table1_mc, vars(age_cat cat \ male cat \ urban_rural_bin cat \ region 
> cat \ imd cat \ smoking cat \ time_ra contn \ bmi_cat cat \ eth5 cat) by(fewe
> r_appts_all_`i') clear
  4.     export delimited using ./output/tables/characteristics_fewer_appts_all
> _`i'.csv    
  5.     destring _columna_1, gen(n1) ignore(",") force
  6.     destring _columna_0, gen(n0) ignore(",") force
  7.     destring _columnb_1, gen(percent1) ignore("-" "%" "(" ")")  force
  8.     destring _columnb_0, gen(percent0) ignore("-" "%" "(" ")")  force
  9.     gen rounded_n1 = round(n1, 5)
 10.     gen rounded_n0 = round(n0, 5)
 11.     keep factor level rounded_n0 percent0 rounded_n1 percent1
 12.     export delimited using ./output/tables/characteristics_fewer_appts_all
> _`i'_rounded.csv
 13.     restore 
 14.     * No appointments 
.     preserve
 15.     table1_mc, vars(age_cat cat \ male cat \ urban_rural_bin cat \ region 
> cat \ imd cat \ smoking cat \ time_ra contn \ bmi_cat cat \ eth5 cat) by(no_a
> ppts_all_`i') clear
 16.     export delimited using ./output/tables/characteristics_no_appts_all_`i
> '.csv    
 17.     destring _columna_1, gen(n1) ignore(",") force
 18.     destring _columna_0, gen(n0) ignore(",") force
 19.     destring _columnb_1, gen(percent1) ignore("-" "%" "(" ")")  force
 20.     destring _columnb_0, gen(percent0) ignore("-" "%" "(" ")")  force
 21.     gen rounded_n1 = round(n1, 5)
 22.     gen rounded_n0 = round(n0, 5)
 23.     keep factor level rounded_n0 percent0 rounded_n1 percent1
 24.     export delimited using ./output/tables/characteristics_no_appts_all_`i
> '_rounded.csv
 25.     restore
 26.     * Logistic regression 
.     foreach var in urban_rural_bin i.imd i.region_n i.eth5 {
 27.         logit fewer_appts_all_`i' `var' ib1.age_cat male, or 
 28.         est sto m2
 29.         parmest, label eform format(estimate p min95 max95) saving("./outp
> ut/tempdata/`var'_diff_all_`i'", replace) idstr("`var'_all_`i'")
 30.         }
 31.     logit fewer_appts_all_`i' ib1.age_cat male urban_rural_bin i.imd i.reg
> ion_n i.eth5, or 
 32.     est sto m2
 33.     parmest, label eform format(estimate p min95 max95) saving("./output/t
> empdata/multi_diff_all_`i'", replace) idstr("multi_all_`i'")
 34.     }

  +-------------------------------------------+
  | factor          N_0     N_1     m_0   m_1 |
  |-------------------------------------------|
  | age_cat       1,494   1,206     414   324 |
  |-------------------------------------------|
  | male          1,908   1,530       0     0 |
  |-------------------------------------------|
  | Rural-Urban   1,908   1,530       0     0 |
  |-------------------------------------------|
  | region        1,908   1,530       0     0 |
  |-------------------------------------------|
  | imd           1,908   1,530       0     0 |
  |-------------------------------------------|
  | smoking       1,908   1,530       0     0 |
  |-------------------------------------------|
  | time_ra         848     682   1,060   848 |
  |-------------------------------------------|
  | bmi_cat       1,908   1,530       0     0 |
  |-------------------------------------------|
  | eth5          1,908   1,530       0     0 |
  +-------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> ----------------------------+
  |                                          fewer_appts_all_2020 = 0   fewer_a
> ppts_all_2020 = 1   p-value |
  |----------------------------------------------------------------------------
> ----------------------------|
  |                                          N=1,908                    N=1,530
>                             |
  |----------------------------------------------------------------------------
> ----------------------------|
  | age_cat       18 - 40 years              516 (34.5%)                445 (36
> .9%)                 0.12   |
  |               41 - 60 years              479 (32.1%)                393 (32
> .6%)                        |
  |               61 - 80 years              384 (25.7%)                301 (25
> .0%)                        |
  |               >80 years                  115 ( 7.7%)                67 ( 5.
> 6%)                         |
  |----------------------------------------------------------------------------
> ----------------------------|
  | male          Female                     974 (51.0%)                748 (48
> .9%)                 0.21   |
  |               Male                       934 (49.0%)                782 (51
> .1%)                        |
  |----------------------------------------------------------------------------
> ----------------------------|
  | Rural-Urban   Rural                      976 (51.2%)                750 (49
> .0%)                 0.21   |
  |               Urban                      932 (48.8%)                780 (51
> .0%)                        |
  |----------------------------------------------------------------------------
> ----------------------------|
  | region        East Midlands              183 ( 9.6%)                150 ( 9
> .8%)                 0.16   |
  |               East of England            198 (10.4%)                142 ( 9
> .3%)                        |
  |               London                     367 (19.2%)                309 (20
> .2%)                        |
  |               North East                 181 ( 9.5%)                178 (11
> .6%)                        |
  |               North West                 210 (11.0%)                160 (10
> .5%)                        |
  |               South East                 381 (20.0%)                312 (20
> .4%)                        |
  |               West Midlands              183 ( 9.6%)                151 ( 9
> .9%)                        |
  |               Yorkshire and the Humber   205 (10.7%)                128 ( 8
> .4%)                        |
  |----------------------------------------------------------------------------
> ----------------------------|
  | imd           0                          106 ( 5.6%)                67 ( 4.
> 4%)                  0.47   |
  |               1                          365 (19.1%)                291 (19
> .0%)                        |
  |               2                          371 (19.4%)                300 (19
> .6%)                        |
  |               3                          367 (19.2%)                293 (19
> .2%)                        |
  |               4                          359 (18.8%)                275 (18
> .0%)                        |
  |               5                          340 (17.8%)                304 (19
> .9%)                        |
  |----------------------------------------------------------------------------
> ----------------------------|
  | smoking       Never smoked               194 (10.2%)                153 (10
> .0%)                 0.73   |
  |               Current smoker             367 (19.2%)                315 (20
> .6%)                        |
  |               Ex-smoker                  310 (16.2%)                255 (16
> .7%)                        |
  |               Unknown                    1,037 (54.4%)              807 (52
> .7%)                        |
  |----------------------------------------------------------------------------
> ----------------------------|
  | time_ra                                  55.83265 (30.93623)        55.5701
> 3 (31.21496)         0.87   |
  |----------------------------------------------------------------------------
> ----------------------------|
  | bmi_cat       Missing                    386 (20.2%)                311 (20
> .3%)                 0.55   |
  |               Underweight                165 ( 8.6%)                156 (10
> .2%)                        |
  |               Healthy range              343 (18.0%)                285 (18
> .6%)                        |
  |               Overweight                 382 (20.0%)                279 (18
> .2%)                        |
  |               Obese                      525 (27.5%)                419 (27
> .4%)                        |
  |               Morbidly obese             107 ( 5.6%)                80 ( 5.
> 2%)                         |
  |----------------------------------------------------------------------------
> ----------------------------|
  | eth5          White                      403 (21.1%)                327 (21
> .4%)                 0.83   |
  |               South Asian                383 (20.1%)                318 (20
> .8%)                        |
  |               Black                      363 (19.0%)                271 (17
> .7%)                        |
  |               Mixed                      370 (19.4%)                310 (20
> .3%)                        |
  |               Other                      389 (20.4%)                304 (19
> .9%)                        |
  +----------------------------------------------------------------------------
> ----------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file ./output/tables/characteristics_fewer_appts_all_2020.csv saved
_columna_1: contains nonnumeric characters not specified in ignore(); n1 genera
> ted as double
(2 missing values generated)
_columna_0: contains nonnumeric characters not specified in ignore()
_columna_0: character , removed; n0 generated as double
(2 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent1 generated as double
(2 missing values generated)
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
file ./output/tables/characteristics_fewer_appts_all_2020_rounded.csv saved

  +-----------------------------------------+
  | factor          N_0   N_1     m_0   m_1 |
  |-----------------------------------------|
  | age_cat       3,899    28   1,067     6 |
  |-----------------------------------------|
  | male          4,966    34       0     0 |
  |-----------------------------------------|
  | Rural-Urban   4,966    34       0     0 |
  |-----------------------------------------|
  | region        4,966    34       0     0 |
  |-----------------------------------------|
  | imd           4,966    34       0     0 |
  |-----------------------------------------|
  | smoking       4,966    34       0     0 |
  |-----------------------------------------|
  | time_ra       2,243    11   2,723    23 |
  |-----------------------------------------|
  | bmi_cat       4,966    34       0     0 |
  |-----------------------------------------|
  | eth5          4,966    34       0     0 |
  +-----------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> ----------------------+
  |                                          no_appts_all_2020 = 0   no_appts_a
> ll_2020 = 1   p-value |
  |----------------------------------------------------------------------------
> ----------------------|
  |                                          N=4,966                 N=34      
>                       |
  |----------------------------------------------------------------------------
> ----------------------|
  | age_cat       18 - 40 years              1,409 (36.1%)           14 (50.0%)
>                0.28   |
  |               41 - 60 years              1,270 (32.6%)           9 (32.1%) 
>                       |
  |               61 - 80 years              957 (24.5%)             5 (17.9%) 
>                       |
  |               >80 years                  263 ( 6.7%)             0 ( 0.0%) 
>                       |
  |----------------------------------------------------------------------------
> ----------------------|
  | male          Female                     2,491 (50.2%)           18 (52.9%)
>                0.75   |
  |               Male                       2,475 (49.8%)           16 (47.1%)
>                       |
  |----------------------------------------------------------------------------
> ----------------------|
  | Rural-Urban   Rural                      2,481 (50.0%)           20 (58.8%)
>                0.30   |
  |               Urban                      2,485 (50.0%)           14 (41.2%)
>                       |
  |----------------------------------------------------------------------------
> ----------------------|
  | region        East Midlands              480 ( 9.7%)             5 (14.7%) 
>                0.33   |
  |               East of England            487 ( 9.8%)             4 (11.8%) 
>                       |
  |               London                     980 (19.7%)             8 (23.5%) 
>                       |
  |               North East                 506 (10.2%)             0 ( 0.0%) 
>                       |
  |               North West                 518 (10.4%)             1 ( 2.9%) 
>                       |
  |               South East                 994 (20.0%)             6 (17.6%) 
>                       |
  |               West Midlands              497 (10.0%)             5 (14.7%) 
>                       |
  |               Yorkshire and the Humber   504 (10.1%)             5 (14.7%) 
>                       |
  |----------------------------------------------------------------------------
> ----------------------|
  | imd           0                          251 ( 5.1%)             1 ( 2.9%) 
>                0.17   |
  |               1                          952 (19.2%)             3 ( 8.8%) 
>                       |
  |               2                          950 (19.1%)             5 (14.7%) 
>                       |
  |               3                          957 (19.3%)             12 (35.3%)
>                       |
  |               4                          926 (18.6%)             5 (14.7%) 
>                       |
  |               5                          930 (18.7%)             8 (23.5%) 
>                       |
  |----------------------------------------------------------------------------
> ----------------------|
  | smoking       Never smoked               502 (10.1%)             4 (11.8%) 
>                0.20   |
  |               Current smoker             994 (20.0%)             2 ( 5.9%) 
>                       |
  |               Ex-smoker                  779 (15.7%)             5 (14.7%) 
>                       |
  |               Unknown                    2,691 (54.2%)           23 (67.6%)
>                       |
  |----------------------------------------------------------------------------
> ----------------------|
  | time_ra                                  55.33802 (31.58899)     60.60506 (
> 36.67167)      0.58   |
  |----------------------------------------------------------------------------
> ----------------------|
  | bmi_cat       Missing                    998 (20.1%)             11 (32.4%)
>                0.53   |
  |               Underweight                463 ( 9.3%)             3 ( 8.8%) 
>                       |
  |               Healthy range              909 (18.3%)             5 (14.7%) 
>                       |
  |               Overweight                 964 (19.4%)             4 (11.8%) 
>                       |
  |               Obese                      1,377 (27.7%)           10 (29.4%)
>                       |
  |               Morbidly obese             255 ( 5.1%)             1 ( 2.9%) 
>                       |
  |----------------------------------------------------------------------------
> ----------------------|
  | eth5          White                      1,015 (20.4%)           9 (26.5%) 
>                0.41   |
  |               South Asian                1,012 (20.4%)           8 (23.5%) 
>                       |
  |               Black                      970 (19.5%)             5 (14.7%) 
>                       |
  |               Mixed                      986 (19.9%)             3 ( 8.8%) 
>                       |
  |               Other                      983 (19.8%)             9 (26.5%) 
>                       |
  +----------------------------------------------------------------------------
> ----------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file ./output/tables/characteristics_no_appts_all_2020.csv saved
_columna_1: contains nonnumeric characters not specified in ignore(); n1 genera
> ted as double
(2 missing values generated)
_columna_0: contains nonnumeric characters not specified in ignore()
_columna_0: character , removed; n0 generated as double
(2 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent1 generated as double
(2 missing values generated)
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
file ./output/tables/characteristics_no_appts_all_2020_rounded.csv saved

Iteration 0:   log likelihood = -1856.1081  
Iteration 1:   log likelihood = -1851.4177  
Iteration 2:   log likelihood = -1851.4159  
Iteration 3:   log likelihood = -1851.4159  

Logistic regression                             Number of obs     =      2,700
                                                LR chi2(5)        =       9.38
                                                Prob > chi2       =     0.0947
Log likelihood = -1851.4159                     Pseudo R2         =     0.0025

------------------------------------------------------------------------------
fewer~l_2020 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
urban_rura~n |    1.13502   .0880591     1.63   0.103     .9749095    1.321427
             |
     age_cat |
18 - 40 y..  |   1.050899   .0987457     0.53   0.597      .874137    1.263405
61 - 80 y..  |   .9546823   .0981969    -0.45   0.652     .7803794    1.167917
  >80 years  |   .7109484   .1196232    -2.03   0.043     .5112297    .9886898
             |
        male |   1.076534   .0835538     0.95   0.342     .9246188    1.253408
       _cons |   .7425082   .0652359    -3.39   0.001     .6250514     .882037
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/urban_rural_bin_diff_all_2020.dta not found)
file ./output/tempdata/urban_rural_bin_diff_all_2020.dta saved

Iteration 0:   log likelihood = -1856.1081  
Iteration 1:   log likelihood = -1850.9047  
Iteration 2:   log likelihood = -1850.9027  
Iteration 3:   log likelihood = -1850.9027  

Logistic regression                             Number of obs     =      2,700
                                                LR chi2(9)        =      10.41
                                                Prob > chi2       =     0.3183
Log likelihood = -1850.9027                     Pseudo R2         =     0.0028

------------------------------------------------------------------------------
fewer~l_2020 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         imd |
          1  |   1.236122   .2446148     1.07   0.284     .8387224    1.821817
          2  |   1.291467   .2542958     1.30   0.194     .8779664    1.899717
          3  |   1.251404   .2475375     1.13   0.257     .8492261    1.844047
          4  |   1.238152   .2463523     1.07   0.283     .8383247    1.828671
          5  |   1.422829   .2820153     1.78   0.075     .9648019    2.098298
             |
     age_cat |
18 - 40 y..  |   1.054936   .0992454     0.57   0.570     .8772985    1.268542
61 - 80 y..  |   .9573857   .0986041    -0.42   0.672     .7823824    1.171534
  >80 years  |   .7142712   .1202776    -2.00   0.046     .5134848    .9935706
             |
        male |   1.078941   .0838891     0.98   0.328     .9264364     1.25655
       _cons |   .6205029    .118175    -2.51   0.012     .4272009    .9012712
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/i.imd_diff_all_2020 not found)
file ./output/tempdata/i.imd_diff_all_2020 saved

Iteration 0:   log likelihood = -1856.1081  
Iteration 1:   log likelihood = -1850.2804  
Iteration 2:   log likelihood = -1850.2782  
Iteration 3:   log likelihood = -1850.2782  

Logistic regression                             Number of obs     =      2,700
                                                LR chi2(11)       =      11.66
                                                Prob > chi2       =     0.3898
Log likelihood = -1850.2782                     Pseudo R2         =     0.0031

------------------------------------------------------------------------------
fewer~l_2020 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    region_n |
          2  |   .9254524   .1613043    -0.44   0.657      .657645    1.302317
          3  |   1.037819    .158763     0.24   0.808     .7689657    1.400672
          4  |   1.173662   .2045254     0.92   0.358     .8340855    1.651489
          5  |   .9969716   .1724413    -0.02   0.986      .710321      1.3993
          6  |   .9781636   .1497775    -0.14   0.885     .7245603    1.320531
          8  |   .9723674   .1723186    -0.16   0.874     .6870436    1.376184
          9  |   .8190124   .1456882    -1.12   0.262     .5779315    1.160659
             |
     age_cat |
18 - 40 y..  |   1.055651   .0993785     0.58   0.565     .8777865    1.269557
61 - 80 y..  |   .9649258   .0994311    -0.35   0.729     .7884635    1.180881
  >80 years  |   .7146268   .1204317    -1.99   0.046     .5136077    .9943221
             |
        male |   1.069257   .0831618     0.86   0.389     .9180785    1.245331
       _cons |   .7985459    .114329    -1.57   0.116     .6031594    1.057226
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/i.region_n_diff_all_2020 not found)
file ./output/tempdata/i.region_n_diff_all_2020 saved

Iteration 0:   log likelihood = -1856.1081  
Iteration 1:   log likelihood = -1852.5311  
Iteration 2:   log likelihood = -1852.5295  
Iteration 3:   log likelihood = -1852.5295  

Logistic regression                             Number of obs     =      2,700
                                                LR chi2(8)        =       7.16
                                                Prob > chi2       =     0.5198
Log likelihood = -1852.5295                     Pseudo R2         =     0.0019

------------------------------------------------------------------------------
fewer~l_2020 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.002821   .1213597     0.02   0.981     .7910651     1.27126
      Black  |   .9458932   .1167811    -0.45   0.652     .7425945    1.204849
      Mixed  |   1.020066   .1243507     0.16   0.871     .8032727     1.29537
      Other  |   .9763054   .1180868    -0.20   0.843      .770248    1.237487
             |
     age_cat |
18 - 40 y..  |   1.050035   .0987064     0.52   0.603     .8733499    1.262464
61 - 80 y..  |   .9561623   .0984128    -0.44   0.663     .7814871     1.16988
  >80 years  |    .711736   .1198663    -2.02   0.043     .5116402    .9900867
             |
        male |   1.075171   .0834813     0.93   0.351      .923392    1.251897
       _cons |   .7998525    .088749    -2.01   0.044      .643522    .9941603
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/i.eth5_diff_all_2020 not found)
file ./output/tempdata/i.eth5_diff_all_2020 saved

Iteration 0:   log likelihood = -1856.1081  
Iteration 1:   log likelihood = -1846.9687  
Iteration 2:   log likelihood = -1846.9651  
Iteration 3:   log likelihood = -1846.9651  

Logistic regression                             Number of obs     =      2,700
                                                LR chi2(21)       =      18.29
                                                Prob > chi2       =     0.6308
Log likelihood = -1846.9651                     Pseudo R2         =     0.0049

------------------------------------------------------------------------------
fewer~l_2020 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     age_cat |
18 - 40 y..  |   1.058867   .0999935     0.61   0.545     .8799514    1.274161
61 - 80 y..  |   .9612958   .0994404    -0.38   0.703     .7848836    1.177359
  >80 years  |   .7119435   .1203965    -2.01   0.045      .511092    .9917266
             |
        male |   1.075707   .0839837     0.93   0.350     .9230778    1.253574
urban_rura~n |   1.137705   .0888935     1.65   0.099     .9761617    1.325981
             |
         imd |
          1  |   1.227277   .2437194     1.03   0.302     .8315845    1.811252
          2  |   1.288536   .2543152     1.28   0.199      .875179    1.897126
          3  |   1.245734    .247083     1.11   0.268     .8444914    1.837619
          4  |   1.245379   .2486956     1.10   0.272     .8420171    1.841967
          5  |   1.415676   .2814182     1.75   0.080     .9588619    2.090123
             |
    region_n |
          2  |   .9264576   .1618776    -0.44   0.662     .6578051     1.30483
          3  |   1.033689   .1585097     0.22   0.829     .7653561    1.396099
          4  |   1.155144   .2017397     0.83   0.409     .8203105    1.626649
          5  |   .9944064   .1723794    -0.03   0.974     .7079604    1.396751
          6  |   .9763375   .1497937    -0.16   0.876     .7227783    1.318848
          8  |   .9742919   .1730427    -0.15   0.883      .687873    1.379971
          9  |   .8123774   .1448234    -1.17   0.244     .5728134    1.152133
             |
        eth5 |
South Asian  |    1.00553    .122135     0.05   0.964     .7925105    1.275806
      Black  |   .9484377   .1174706    -0.43   0.669     .7440148    1.209027
      Mixed  |   1.017355   .1243863     0.14   0.888     .8005725    1.292838
      Other  |   .9788751   .1187398    -0.18   0.860     .7717464    1.241595
             |
       _cons |   .5973788   .1452931    -2.12   0.034     .3708707     .962226
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/multi_diff_all_2020.dta not found)
file ./output/tempdata/multi_diff_all_2020.dta saved

  +-----------------------------------------+
  | factor          N_0     N_1   m_0   m_1 |
  |-----------------------------------------|
  | age_cat       1,002     770   248   244 |
  |-----------------------------------------|
  | male          1,250   1,014     0     0 |
  |-----------------------------------------|
  | Rural-Urban   1,250   1,014     0     0 |
  |-----------------------------------------|
  | region        1,250   1,014     0     0 |
  |-----------------------------------------|
  | imd           1,250   1,014     0     0 |
  |-----------------------------------------|
  | smoking       1,250   1,014     0     0 |
  |-----------------------------------------|
  | time_ra         559     448   691   566 |
  |-----------------------------------------|
  | bmi_cat       1,250   1,014     0     0 |
  |-----------------------------------------|
  | eth5          1,250   1,014     0     0 |
  +-----------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> ----------------------------+
  |                                          fewer_appts_all_2021 = 0   fewer_a
> ppts_all_2021 = 1   p-value |
  |----------------------------------------------------------------------------
> ----------------------------|
  |                                          N=1,250                    N=1,014
>                             |
  |----------------------------------------------------------------------------
> ----------------------------|
  | age_cat       18 - 40 years              362 (36.1%)                279 (36
> .2%)                 0.96   |
  |               41 - 60 years              319 (31.8%)                253 (32
> .9%)                        |
  |               61 - 80 years              257 (25.6%)                190 (24
> .7%)                        |
  |               >80 years                  64 ( 6.4%)                 48 ( 6.
> 2%)                         |
  |----------------------------------------------------------------------------
> ----------------------------|
  | male          Female                     648 (51.8%)                495 (48
> .8%)                 0.15   |
  |               Male                       602 (48.2%)                519 (51
> .2%)                        |
  |----------------------------------------------------------------------------
> ----------------------------|
  | Rural-Urban   Rural                      635 (50.8%)                500 (49
> .3%)                 0.48   |
  |               Urban                      615 (49.2%)                514 (50
> .7%)                        |
  |----------------------------------------------------------------------------
> ----------------------------|
  | region        East Midlands              128 (10.2%)                93 ( 9.
> 2%)                  0.13   |
  |               East of England            118 ( 9.4%)                106 (10
> .5%)                        |
  |               London                     224 (17.9%)                231 (22
> .8%)                        |
  |               North East                 124 ( 9.9%)                103 (10
> .2%)                        |
  |               North West                 131 (10.5%)                105 (10
> .4%)                        |
  |               South East                 268 (21.4%)                189 (18
> .6%)                        |
  |               West Midlands              125 (10.0%)                91 ( 9.
> 0%)                         |
  |               Yorkshire and the Humber   132 (10.6%)                96 ( 9.
> 5%)                         |
  |----------------------------------------------------------------------------
> ----------------------------|
  | imd           0                          64 ( 5.1%)                 52 ( 5.
> 1%)                  0.50   |
  |               1                          237 (19.0%)                192 (18
> .9%)                        |
  |               2                          235 (18.8%)                207 (20
> .4%)                        |
  |               3                          251 (20.1%)                171 (16
> .9%)                        |
  |               4                          236 (18.9%)                195 (19
> .2%)                        |
  |               5                          227 (18.2%)                197 (19
> .4%)                        |
  |----------------------------------------------------------------------------
> ----------------------------|
  | smoking       Never smoked               122 ( 9.8%)                102 (10
> .1%)                 0.50   |
  |               Current smoker             245 (19.6%)                214 (21
> .1%)                        |
  |               Ex-smoker                  196 (15.7%)                173 (17
> .1%)                        |
  |               Unknown                    687 (55.0%)                525 (51
> .8%)                        |
  |----------------------------------------------------------------------------
> ----------------------------|
  | time_ra                                  55.69559 (31.46386)        55.2290
> 8 (31.13379)         0.81   |
  |----------------------------------------------------------------------------
> ----------------------------|
  | bmi_cat       Missing                    245 (19.6%)                213 (21
> .0%)                 0.66   |
  |               Underweight                107 ( 8.6%)                98 ( 9.
> 7%)                         |
  |               Healthy range              238 (19.0%)                180 (17
> .8%)                        |
  |               Overweight                 247 (19.8%)                190 (18
> .7%)                        |
  |               Obese                      331 (26.5%)                277 (27
> .3%)                        |
  |               Morbidly obese             82 ( 6.6%)                 56 ( 5.
> 5%)                         |
  |----------------------------------------------------------------------------
> ----------------------------|
  | eth5          White                      263 (21.0%)                206 (20
> .3%)                 0.61   |
  |               South Asian                265 (21.2%)                212 (20
> .9%)                        |
  |               Black                      238 (19.0%)                173 (17
> .1%)                        |
  |               Mixed                      238 (19.0%)                212 (20
> .9%)                        |
  |               Other                      246 (19.7%)                211 (20
> .8%)                        |
  +----------------------------------------------------------------------------
> ----------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file ./output/tables/characteristics_fewer_appts_all_2021.csv saved
_columna_1: contains nonnumeric characters not specified in ignore(); n1 genera
> ted as double
(2 missing values generated)
_columna_0: contains nonnumeric characters not specified in ignore(); n0 genera
> ted as double
(2 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent1 generated as double
(2 missing values generated)
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
file ./output/tables/characteristics_fewer_appts_all_2021_rounded.csv saved

  +-----------------------------------------+
  | factor          N_0   N_1     m_0   m_1 |
  |-----------------------------------------|
  | age_cat       3,913    14   1,066     7 |
  |-----------------------------------------|
  | male          4,979    21       0     0 |
  |-----------------------------------------|
  | Rural-Urban   4,979    21       0     0 |
  |-----------------------------------------|
  | region        4,979    21       0     0 |
  |-----------------------------------------|
  | imd           4,979    21       0     0 |
  |-----------------------------------------|
  | smoking       4,979    21       0     0 |
  |-----------------------------------------|
  | time_ra       2,245     9   2,734    12 |
  |-----------------------------------------|
  | bmi_cat       4,979    21       0     0 |
  |-----------------------------------------|
  | eth5          4,979    21       0     0 |
  +-----------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> ----------------------+
  |                                          no_appts_all_2021 = 0   no_appts_a
> ll_2021 = 1   p-value |
  |----------------------------------------------------------------------------
> ----------------------|
  |                                          N=4,979                 N=21      
>                       |
  |----------------------------------------------------------------------------
> ----------------------|
  | age_cat       18 - 40 years              1,421 (36.3%)           2 (14.3%) 
>                0.35   |
  |               41 - 60 years              1,272 (32.5%)           7 (50.0%) 
>                       |
  |               61 - 80 years              958 (24.5%)             4 (28.6%) 
>                       |
  |               >80 years                  262 ( 6.7%)             1 ( 7.1%) 
>                       |
  |----------------------------------------------------------------------------
> ----------------------|
  | male          Female                     2,495 (50.1%)           14 (66.7%)
>                0.13   |
  |               Male                       2,484 (49.9%)           7 (33.3%) 
>                       |
  |----------------------------------------------------------------------------
> ----------------------|
  | Rural-Urban   Rural                      2,493 (50.1%)           8 (38.1%) 
>                0.27   |
  |               Urban                      2,486 (49.9%)           13 (61.9%)
>                       |
  |----------------------------------------------------------------------------
> ----------------------|
  | region        East Midlands              484 ( 9.7%)             1 ( 4.8%) 
>                0.45   |
  |               East of England            489 ( 9.8%)             2 ( 9.5%) 
>                       |
  |               London                     982 (19.7%)             6 (28.6%) 
>                       |
  |               North East                 501 (10.1%)             5 (23.8%) 
>                       |
  |               North West                 517 (10.4%)             2 ( 9.5%) 
>                       |
  |               South East                 997 (20.0%)             3 (14.3%) 
>                       |
  |               West Midlands              501 (10.1%)             1 ( 4.8%) 
>                       |
  |               Yorkshire and the Humber   508 (10.2%)             1 ( 4.8%) 
>                       |
  |----------------------------------------------------------------------------
> ----------------------|
  | imd           0                          251 ( 5.0%)             1 ( 4.8%) 
>                0.92   |
  |               1                          950 (19.1%)             5 (23.8%) 
>                       |
  |               2                          951 (19.1%)             4 (19.0%) 
>                       |
  |               3                          964 (19.4%)             5 (23.8%) 
>                       |
  |               4                          929 (18.7%)             2 ( 9.5%) 
>                       |
  |               5                          934 (18.8%)             4 (19.0%) 
>                       |
  |----------------------------------------------------------------------------
> ----------------------|
  | smoking       Never smoked               504 (10.1%)             2 ( 9.5%) 
>                0.90   |
  |               Current smoker             993 (19.9%)             3 (14.3%) 
>                       |
  |               Ex-smoker                  781 (15.7%)             3 (14.3%) 
>                       |
  |               Unknown                    2,701 (54.2%)           13 (61.9%)
>                       |
  |----------------------------------------------------------------------------
> ----------------------|
  | time_ra                                  55.3688 (31.62342)      54.09658 (
> 29.27923)      0.90   |
  |----------------------------------------------------------------------------
> ----------------------|
  | bmi_cat       Missing                    1,002 (20.1%)           7 (33.3%) 
>                0.13   |
  |               Underweight                463 ( 9.3%)             3 (14.3%) 
>                       |
  |               Healthy range              911 (18.3%)             3 (14.3%) 
>                       |
  |               Overweight                 968 (19.4%)             0 ( 0.0%) 
>                       |
  |               Obese                      1,379 (27.7%)           8 (38.1%) 
>                       |
  |               Morbidly obese             256 ( 5.1%)             0 ( 0.0%) 
>                       |
  |----------------------------------------------------------------------------
> ----------------------|
  | eth5          White                      1,019 (20.5%)           5 (23.8%) 
>                0.30   |
  |               South Asian                1,015 (20.4%)           5 (23.8%) 
>                       |
  |               Black                      972 (19.5%)             3 (14.3%) 
>                       |
  |               Mixed                      988 (19.8%)             1 ( 4.8%) 
>                       |
  |               Other                      985 (19.8%)             7 (33.3%) 
>                       |
  +----------------------------------------------------------------------------
> ----------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file ./output/tables/characteristics_no_appts_all_2021.csv saved
_columna_1: contains nonnumeric characters not specified in ignore(); n1 genera
> ted as double
(2 missing values generated)
_columna_0: contains nonnumeric characters not specified in ignore()
_columna_0: character , removed; n0 generated as double
(2 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent1 generated as double
(2 missing values generated)
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
file ./output/tables/characteristics_no_appts_all_2021_rounded.csv saved

Iteration 0:   log likelihood = -1213.0258  
Iteration 1:   log likelihood = -1211.0955  
Iteration 2:   log likelihood = -1211.0954  

Logistic regression                             Number of obs     =      1,772
                                                LR chi2(5)        =       3.86
                                                Prob > chi2       =     0.5696
Log likelihood = -1211.0954                     Pseudo R2         =     0.0016

------------------------------------------------------------------------------
fewer~l_2021 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
urban_rura~n |   1.107376   .1062769     1.06   0.288     .9174952    1.336554
             |
     age_cat |
18 - 40 y..  |   .9739876   .1130084    -0.23   0.820     .7758745    1.222687
61 - 80 y..  |   .9340063   .1191627    -0.54   0.593     .7273635    1.199356
  >80 years  |   .9552202    .199648    -0.22   0.826     .6341561    1.438834
             |
        male |   1.161352   .1115037     1.56   0.119       .96214    1.401811
       _cons |   .6984388   .0760082    -3.30   0.001     .5642813    .8644922
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/urban_rural_bin_diff_all_2021.dta not found)
file ./output/tempdata/urban_rural_bin_diff_all_2021.dta saved

Iteration 0:   log likelihood = -1213.0258  
Iteration 1:   log likelihood = -1210.1553  
Iteration 2:   log likelihood = -1210.1549  
Iteration 3:   log likelihood = -1210.1549  

Logistic regression                             Number of obs     =      1,772
                                                LR chi2(9)        =       5.74
                                                Prob > chi2       =     0.7655
Log likelihood = -1210.1549                     Pseudo R2         =     0.0024

------------------------------------------------------------------------------
fewer~l_2021 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         imd |
          1  |   1.012022   .2373028     0.05   0.959      .639141    1.602444
          2  |   1.030165   .2399399     0.13   0.898      .652604    1.626161
          3  |   .8212116   .1934965    -0.84   0.403     .5174784    1.303221
          4  |   .9684338    .228016    -0.14   0.892     .6104584    1.536328
          5  |   1.031691   .2428708     0.13   0.895     .6503808    1.636557
             |
     age_cat |
18 - 40 y..  |   .9730891    .113055    -0.23   0.814     .7749233     1.22193
61 - 80 y..  |   .9410338   .1202309    -0.48   0.634     .7325743    1.208812
  >80 years  |   .9586162    .201032    -0.20   0.840     .6355339    1.445942
             |
        male |   1.170789   .1126795     1.64   0.101     .9695204     1.41384
       _cons |   .7513654   .1680701    -1.28   0.201     .4846733    1.164805
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/i.imd_diff_all_2021 not found)
file ./output/tempdata/i.imd_diff_all_2021 saved

Iteration 0:   log likelihood = -1213.0258  
Iteration 1:   log likelihood = -1206.4193  
Iteration 2:   log likelihood = -1206.4181  
Iteration 3:   log likelihood = -1206.4181  

Logistic regression                             Number of obs     =      1,772
                                                LR chi2(11)       =      13.22
                                                Prob > chi2       =     0.2795
Log likelihood = -1206.4181                     Pseudo R2         =     0.0054

------------------------------------------------------------------------------
fewer~l_2021 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    region_n |
          2  |   1.272972   .2735414     1.12   0.261     .8354283    1.939673
          3  |   1.464502    .277941     2.01   0.044     1.009588    2.124396
          4  |   1.197582   .2607952     0.83   0.408     .7815212    1.835143
          5  |   1.205717   .2609176     0.86   0.387     .7889415    1.842662
          6  |   .9350175   .1796116    -0.35   0.727     .6416655    1.362482
          8  |   1.088178   .2406122     0.38   0.702     .7054829    1.678468
          9  |   1.066619   .2314617     0.30   0.766     .6970984    1.632016
             |
     age_cat |
18 - 40 y..  |   .9845546    .114867    -0.13   0.894     .7833052     1.23751
61 - 80 y..  |   .9471399   .1214594    -0.42   0.672      .736644    1.217785
  >80 years  |   .9910528    .208122    -0.04   0.966     .6566648    1.495719
             |
        male |   1.167439   .1127186     1.60   0.109     .9661595     1.41065
       _cons |   .6295028   .1110788    -2.62   0.009     .4454501    .8896029
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/i.region_n_diff_all_2021 not found)
file ./output/tempdata/i.region_n_diff_all_2021 saved

Iteration 0:   log likelihood = -1213.0258  
Iteration 1:   log likelihood = -1210.7716  
Iteration 2:   log likelihood = -1210.7715  

Logistic regression                             Number of obs     =      1,772
                                                LR chi2(8)        =       4.51
                                                Prob > chi2       =     0.8086
Log likelihood = -1210.7715                     Pseudo R2         =     0.0019

------------------------------------------------------------------------------
fewer~l_2021 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.026444   .1554948     0.17   0.863     .7627596    1.381283
      Black  |   .9594345   .1486517    -0.27   0.789     .7081625    1.299864
      Mixed  |   1.161635   .1767181     0.98   0.325      .862139    1.565171
      Other  |    1.05914   .1602295     0.38   0.704     .7873749    1.424707
             |
     age_cat |
18 - 40 y..  |   .9765869   .1134306    -0.20   0.838     .7777567    1.226247
61 - 80 y..  |    .935209   .1195931    -0.52   0.600     .7278775    1.201597
  >80 years  |   .9549365   .1997651    -0.22   0.826     .6337383    1.438928
             |
        male |   1.165887   .1120912     1.60   0.110       .96565    1.407644
       _cons |   .7037051   .0992057    -2.49   0.013     .5338159    .9276622
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/i.eth5_diff_all_2021 not found)
file ./output/tempdata/i.eth5_diff_all_2021 saved

Iteration 0:   log likelihood = -1213.0258  
Iteration 1:   log likelihood = -1203.6709  
Iteration 2:   log likelihood = -1203.6681  
Iteration 3:   log likelihood = -1203.6681  

Logistic regression                             Number of obs     =      1,772
                                                LR chi2(21)       =      18.72
                                                Prob > chi2       =     0.6034
Log likelihood = -1203.6681                     Pseudo R2         =     0.0077

------------------------------------------------------------------------------
fewer~l_2021 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     age_cat |
18 - 40 y..  |   .9894413   .1158292    -0.09   0.928     .7865817    1.244618
61 - 80 y..  |   .9538474   .1228771    -0.37   0.714     .7410115    1.227815
  >80 years  |   .9918555   .2092161    -0.04   0.969     .6559957     1.49967
             |
        male |   1.182158   .1146438     1.73   0.084     .9775244     1.42963
urban_rura~n |    1.10538   .1071995     1.03   0.302     .9140342    1.336784
             |
         imd |
          1  |    1.03643   .2445966     0.15   0.879     .6526151    1.645973
          2  |   1.067203   .2499734     0.28   0.781     .6743231    1.688985
          3  |   .8482867   .2009437    -0.69   0.487     .5332224    1.349512
          4  |   1.005167   .2381737     0.02   0.983     .6317517      1.5993
          5  |   1.053367   .2494147     0.22   0.826     .6622679    1.675429
             |
    region_n |
          2  |   1.271489   .2743744     1.11   0.266     .8329747    1.940855
          3  |   1.450639   .2764343     1.95   0.051     .9985134    2.107485
          4  |   1.174276     .25698     0.73   0.463     .7647018    1.803218
          5  |    1.20879   .2626751     0.87   0.383     .7895531    1.850634
          6  |   .9371162   .1806088    -0.34   0.736     .6423073    1.367238
          8  |   1.092218   .2423157     0.40   0.691     .7070738    1.687151
          9  |   1.051246   .2290979     0.23   0.819     .6858075    1.611412
             |
        eth5 |
South Asian  |   1.040365   .1587017     0.26   0.795     .7715072    1.402916
      Black  |   .9614586   .1498567    -0.25   0.801     .7083681    1.304975
      Mixed  |   1.159908   .1773998     0.97   0.332     .8594851    1.565341
      Other  |    1.06266   .1616255     0.40   0.689     .7887342     1.43172
             |
       _cons |   .5709784   .1675305    -1.91   0.056     .3212692    1.014776
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/multi_diff_all_2021.dta not found)
file ./output/tempdata/multi_diff_all_2021.dta saved

. * Put together 2020 and 2021 logistic regression results
. use "./output/tempdata/urban_rural_bin_diff_all_2020", clear 

. append using "./output/tempdata/i.imd_diff_all_2020"

. append using "./output/tempdata/i.region_n_diff_all_2020"

. append using "./output/tempdata/i.eth5_diff_all_2020"

. append using "./output/tempdata/multi_diff_all_2020"

. append using "./output/tempdata/urban_rural_bin_diff_all_2021"

. append using "./output/tempdata/i.imd_diff_all_2021"

. append using "./output/tempdata/i.region_n_diff_all_2021"

. append using "./output/tempdata/i.eth5_diff_all_2021"

. append using "./output/tempdata/multi_diff_all_2021"

. drop stderr z 

. export delimited using ./output/tables/logistic_diff_all_results.csv
file ./output/tables/logistic_diff_all_results.csv saved

. 
.     
. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/outpatients.log
  log type:  text
 closed on:  31 May 2023, 15:52:01
-------------------------------------------------------------------------------
