
. 
. cap mkdir ./output/tables

. * Import data
. import delimited using ./output/input.csv
(36 vars, 1,000 obs)

. * Check data
. count if age==. 
  0

. count if age<18 
  202

. count if age>110 & age!=.
  0

. sum age, d

                             age
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              0
 5%            5              0
10%          8.5              0       Obs               1,000
25%           21              0       Sum of Wgt.       1,000

50%           42                      Mean             41.336
                        Largest       Std. Dev.      23.63984
75%           60             94
90%           73             98       Variance       558.8419
95%           78             99       Skewness       .0481511
99%         88.5            109       Kurtosis       2.006435

. count if sex==""
  0

. tab sex

        sex |      Freq.     Percent        Cum.
------------+-----------------------------------
          F |        505       50.50       50.50
          M |        490       49.00       99.50
          U |          5        0.50      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. sum household, d

                          household
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               1,000
25%            2              0       Sum of Wgt.       1,000

50%            3                      Mean              2.484
                        Largest       Std. Dev.      1.047302
75%            3              5
90%            4              5       Variance       1.096841
95%            4              6       Skewness      -.0857891
99%            5              6       Kurtosis       2.906347

. tab care_home_type

care_home_t |
        ype |      Freq.     Percent        Cum.
------------+-----------------------------------
         PC |         55        5.55        5.55
         PN |         55        5.55       11.10
         PR |        829       83.65       94.75
         PS |         52        5.25      100.00
------------+-----------------------------------
      Total |        991      100.00

. * Checking RA algorithm variables
. tab has_dmards has_alt_dmard_diag, m

           |  has_alt_dmard_diag
has_dmards |         0          1 |     Total
-----------+----------------------+----------
         0 |       246        254 |       500 
         1 |       254        246 |       500 
-----------+----------------------+----------
     Total |       500        500 |     1,000 

. * Checking type of DMARD that meets inclusion
. foreach dmard in metho leflu sulfa hydrox azathioprine {
  2.     gen `dmard'_multi = (`dmard'_count>=2)
  3.     tab `dmard'_multi if has_dmards==1, m
  4. }

metho_multi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         76       15.20       15.20
          1 |        424       84.80      100.00
------------+-----------------------------------
      Total |        500      100.00

leflu_multi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         81       16.20       16.20
          1 |        419       83.80      100.00
------------+-----------------------------------
      Total |        500      100.00

sulfa_multi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         80       16.00       16.00
          1 |        420       84.00      100.00
------------+-----------------------------------
      Total |        500      100.00

hydrox_mult |
          i |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         71       14.20       14.20
          1 |        429       85.80      100.00
------------+-----------------------------------
      Total |        500      100.00

azathioprin |
    e_multi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         77       15.40       15.40
          1 |        423       84.60      100.00
------------+-----------------------------------
      Total |        500      100.00

. 
. sum number_ra_codes

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
number_ra_~s |      1,000       2.472    1.060349          0          6

. di "Number where no DMARDs but does have multiple RA codes and no alt diag"
Number where no DMARDs but does have multiple RA codes and no alt diag

. count if has_dmards==0 & number_ra_codes>=2 & alt_diag!=1
  213

. tab has_ra, m

     has_ra |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        500       50.00       50.00
          1 |        500       50.00      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. * Time since first RA code
. gen first_ra_codeA = date(first_ra_code, "YMD")
(557 missing values generated)

. format first_ra_codeA %dD/N/CY

. gen time_ra = (date("01Mar2018", "DMY") - first_ra_codeA)/365.25
(557 missing values generated)

. sum time_ra, d

                           time_ra
-------------------------------------------------------------
      Percentiles      Smallest
 1%     1.075975       .0109514
 5%     6.045175       .0793977
10%     9.642711       .0985626       Obs                 443
25%     26.27242       .5037646       Sum of Wgt.         443

50%     54.64202                      Mean           54.20033
                        Largest       Std. Dev.      32.10281
75%     81.06776       107.8576
90%     98.82546       108.4463       Variance        1030.59
95%     104.5257       108.5175       Skewness       .0049685
99%     107.7947       108.6653       Kurtosis       1.766473

. sum number_ra_codes, d

                       number_ra_codes
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               1,000
25%            2              0       Sum of Wgt.       1,000

50%            2                      Mean              2.472
                        Largest       Std. Dev.      1.060349
75%            3              5
90%            4              6       Variance        1.12434
95%            4              6       Skewness       .1616022
99%            5              6       Kurtosis       2.973779

. sum metho_count, d

                         metho_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               1,000
25%            2              0       Sum of Wgt.       1,000

50%            2                      Mean              2.502
                        Largest       Std. Dev.       1.05504
75%            3              5
90%            4              5       Variance       1.113109
95%            4              6       Skewness       .0740466
99%            5              6       Kurtosis       3.054324

. sum sulfa_count, d 

                         sulfa_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               1,000
25%            2              0       Sum of Wgt.       1,000

50%            3                      Mean              2.515
                        Largest       Std. Dev.       1.04636
75%            3              5
90%            4              5       Variance        1.09487
95%            4              6       Skewness       .0599057
99%            5              6       Kurtosis        2.91464

. sum leflu_count, d 

                         leflu_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               1,000
25%            2              0       Sum of Wgt.       1,000

50%            2                      Mean               2.46
                        Largest       Std. Dev.      .9966912
75%            3              5
90%            4              5       Variance       .9933934
95%            4              5       Skewness        -.02918
99%            5              5       Kurtosis       2.863718

. sum hydrox_count, d 

                        hydrox_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               1,000
25%            2              0       Sum of Wgt.       1,000

50%            3                      Mean              2.525
                        Largest       Std. Dev.      1.023925
75%            3              5
90%            4              6       Variance       1.048423
95%            4              6       Skewness       .0920622
99%            5              6       Kurtosis       3.131925

. 
. sum outpatient*, d

                    outpatient_appt_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%           .5              0
 5%            1              0
10%            1              0       Obs               1,000
25%            2              0       Sum of Wgt.       1,000

50%            3                      Mean              2.539
                        Largest       Std. Dev.      1.010693
75%            3              5
90%            4              5       Variance       1.021501
95%            4              5       Skewness       .1031111
99%            5              6       Kurtosis       2.718134

                    outpatient_appt_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               1,000
25%            2              0       Sum of Wgt.       1,000

50%            2                      Mean              2.499
                        Largest       Std. Dev.      1.007479
75%            3              5
90%            4              5       Variance       1.015014
95%            4              6       Skewness       .1026294
99%            5              6       Kurtosis       3.062567

                    outpatient_appt_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               1,000
25%            2              0       Sum of Wgt.       1,000

50%            3                      Mean               2.54
                        Largest       Std. Dev.      1.023449
75%            3              5
90%            4              5       Variance       1.047447
95%            4              5       Skewness       .0236995
99%            5              6       Kurtosis       3.005968

                   outpatient_medium_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs                 500
25%            2              1       Sum of Wgt.         500

50%            5                      Mean             13.112
                        Largest       Std. Dev.      27.47488
75%            7             98
90%            8             98       Variance       754.8692
95%           98             98       Skewness       2.743532
99%           98             98       Kurtosis       8.614575

                   outpatient_medium_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs                 500
25%            2              1       Sum of Wgt.         500

50%            4                      Mean             13.932
                        Largest       Std. Dev.      29.06898
75%            7             98
90%           98             98       Variance       845.0054
95%           98             98       Skewness       2.529124
99%           98             98       Kurtosis        7.46149

                   outpatient_medium_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs                 500
25%            2              1       Sum of Wgt.         500

50%            5                      Mean               14.8
                        Largest       Std. Dev.      29.66682
75%            7             98
90%           98             98       Variance       880.1202
95%           98             98       Skewness       2.432075
99%           98             98       Kurtosis       6.974642

. 
. keep if has_ra
(500 observations deleted)

. 
. * Format variables
. *re-order ethnicity
.  gen eth5=1 if ethnicity==1
(396 missing values generated)

.  replace eth5=2 if ethnicity==3
(92 real changes made)

.  replace eth5=3 if ethnicity==4
(100 real changes made)

.  replace eth5=4 if ethnicity==2
(108 real changes made)

.  replace eth5=5 if ethnicity==5
(96 real changes made)

.  replace eth5=. if ethnicity==.
(0 real changes made)

. 
.  label define eth5                      1 "White"                            
>            ///
>                                                         2 "South Asian"      
>                    ///                                             
>                                                         3 "Black"            
>                            ///
>                                                         4 "Mixed"            
>                            ///
>                                                         5 "Other"            
>                            

.                                         
. 
. label values eth5 eth5

. safetab eth5, m
5

       eth5 |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |        104       20.80       20.80
South Asian |         92       18.40       39.20
      Black |        100       20.00       59.20
      Mixed |        108       21.60       80.80
      Other |         96       19.20      100.00
------------+-----------------------------------
      Total |        500      100.00

. 
. * formatting gender
. gen male=(sex=="M")

. replace male = 0 if sex == "F"
(0 real changes made)

. label define male 0"Female" 1"Male"

. label values male male

. safetab male, miss
5

       male |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |        231       46.20       46.20
       Male |        269       53.80      100.00
------------+-----------------------------------
      Total |        500      100.00

. 
. * Make region numeric
. generate region2=.
(500 missing values generated)

. replace region2=0 if region=="East"
(0 real changes made)

. replace region2=1 if region=="East Midlands"
(55 real changes made)

. replace region2=2 if region=="London"
(97 real changes made)

. replace region2=3 if region=="North East"
(56 real changes made)

. replace region2=4 if region=="North West"
(48 real changes made)

. replace region2=5 if region=="South East"
(106 real changes made)

. replace region2=6 if region=="South West"
(0 real changes made)

. replace region2=7 if region=="West Midlands"
(48 real changes made)

. replace region2=8 if region=="Yorkshire and The Humber"
(0 real changes made)

. drop region

. rename region2 region

. label var region "region of England"

. label define region 0 "East" 1 "East Midlands"  2 "London" 3 "North East" 4 "
> North West" 5 "South East" 6 "South West" 7 "West Midlands" 8 "Yorkshire and 
> The Humber"

. label values region region

. safetab region, miss
7

       region of England |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
           East Midlands |         55       11.00       11.00
                  London |         97       19.40       30.40
              North East |         56       11.20       41.60
              North West |         48        9.60       51.20
              South East |        106       21.20       72.40
           West Midlands |         48        9.60       82.00
                       . |         90       18.00      100.00
-------------------------+-----------------------------------
                   Total |        500      100.00

. 
. *create a 4 category rural urban variable 
. generate urban_rural_5=.
(500 missing values generated)

. la var urban_rural_5 "Rural Urban in five categories"

. replace urban_rural_5=1 if urban_rural==1
(55 real changes made)

. replace urban_rural_5=2 if urban_rural==2
(65 real changes made)

. replace urban_rural_5=3 if urban_rural==3|urban_rural==4
(134 real changes made)

. replace urban_rural_5=4 if urban_rural==5|urban_rural==6
(117 real changes made)

. replace urban_rural_5=5 if urban_rural==7|urban_rural==8
(129 real changes made)

. label define urban_rural_5 1 "Urban major conurbation" 2 "Urban minor conurba
> tion" 3 "Urban city and town" 4 "Rural town and fringe" 5 "Rural village and 
> dispersed"

. label values urban_rural_5 urban_rural_5

. safetab urban_rural_5, miss
14

        Rural Urban in five |
                 categories |      Freq.     Percent        Cum.
----------------------------+-----------------------------------
    Urban major conurbation |         55       11.00       11.00
    Urban minor conurbation |         65       13.00       24.00
        Urban city and town |        134       26.80       50.80
      Rural town and fringe |        117       23.40       74.20
Rural village and dispersed |        129       25.80      100.00
----------------------------+-----------------------------------
                      Total |        500      100.00

. 
. *generate a binary rural urban (with missing assigned to urban)
. generate urban_rural_bin=.
(500 missing values generated)

. replace urban_rural_bin=1 if urban_rural<=4|urban_rural==.
(254 real changes made)

. replace urban_rural_bin=0 if urban_rural>4 & urban_rural!=.
(246 real changes made)

. label define urban_rural_bin 0 "Rural" 1 "Urban"

. label values urban_rural_bin urban_rural_bin

. safetab urban_rural_bin urban_rural, miss
28

urban_rura |                      urban_rural
     l_bin |         1          2          3          4          5 |     Total
-----------+-------------------------------------------------------+----------
     Rural |         0          0          0          0         57 |       246 
     Urban |        55         65         72         62          0 |       254 
-----------+-------------------------------------------------------+----------
     Total |        55         65         72         62         57 |       500 


urban_rura |           urban_rural
     l_bin |         6          7          8 |     Total
-----------+---------------------------------+----------
     Rural |        60         66         63 |       246 
     Urban |         0          0          0 |       254 
-----------+---------------------------------+----------
     Total |        60         66         63 |       500 

. label var urban_rural_bin "Rural-Urban"

. 
. * Define age categories
. * Create age categories
. egen age_cat = cut(age), at(18, 40, 60, 80, 120) icodes
(95 missing values generated)

. label define age 0 "18 - 40 years" 1 "41 - 60 years" 2 "61 - 80 years" 3 ">80
>  years"

. label values age_cat age

. safetab age_cat, miss
8

      age_cat |      Freq.     Percent        Cum.
--------------+-----------------------------------
18 - 40 years |        126       25.20       25.20
41 - 60 years |        136       27.20       52.40
61 - 80 years |        120       24.00       76.40
    >80 years |         23        4.60       81.00
            . |         95       19.00      100.00
--------------+-----------------------------------
        Total |        500      100.00

. 
. * Flag if in a care-home
.     gen care_home=care_home_type!="PR"

. 
. * Categorise number of outpatient appointments
. label define appt 0 "No appointments" 1 "1-2 per year" 2 "3-6 per year" 3 "7-
> 12 per year" 4 "More than 12 per year"

. forvalues i=2019/2021 {
  2.     egen op_appt_`i'_cat = cut(outpatient_appt_`i'), at(0, 1, 3, 7, 13, 10
> 00) icodes
  3.     label values op_appt_`i'_cat appt
  4.     }

. preserve

. * Tabulate
. table1_mc, vars(op_appt_2019_cat cate \ op_appt_2020_cat cate \ op_appt_2021_
> cat cate) clear

  +------------------------------+
  | factor             N_1   m_1 |
  |------------------------------|
  | op_appt_2019_cat   500     0 |
  |------------------------------|
  | op_appt_2020_cat   500     0 |
  |------------------------------|
  | op_appt_2021_cat   500     0 |
  +------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------+
  |                                      Total       |
  |--------------------------------------------------|
  |                                      N=500       |
  |--------------------------------------------------|
  | op_appt_2019_cat   No appointments   5 ( 1.0%)   |
  |                    1-2 per year      251 (50.2%) |
  |                    3-6 per year      244 (48.8%) |
  |--------------------------------------------------|
  | op_appt_2020_cat   No appointments   12 ( 2.4%)  |
  |                    1-2 per year      234 (46.8%) |
  |                    3-6 per year      254 (50.8%) |
  |--------------------------------------------------|
  | op_appt_2021_cat   No appointments   9 ( 1.8%)   |
  |                    1-2 per year      223 (44.6%) |
  |                    3-6 per year      268 (53.6%) |
  +--------------------------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/op_appt_yrs.csv
file ./output/tables/op_appt_yrs.csv saved

. restore 

. table1_mc, vars(age_cat cate \ male cate \ region cate \ urban_rural_5 cate \
>  prescribed_biologics cate \ imd cate \ care_home cate) clear

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                          405    95 |
  |--------------------------------------------|
  | male                             500     0 |
  |--------------------------------------------|
  | region of England                410    90 |
  |--------------------------------------------|
  | Rural Urban in five categories   500     0 |
  |--------------------------------------------|
  | prescribed_biologics             500     0 |
  |--------------------------------------------|
  | imd                              500     0 |
  |--------------------------------------------|
  | care_home                        500     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> +
  |                                                                Total       
> |
  |----------------------------------------------------------------------------
> |
  |                                                                N=500       
> |
  |----------------------------------------------------------------------------
> |
  | age_cat                          18 - 40 years                 126 (31.1%) 
> |
  |                                  41 - 60 years                 136 (33.6%) 
> |
  |                                  61 - 80 years                 120 (29.6%) 
> |
  |                                  >80 years                     23 ( 5.7%)  
> |
  |----------------------------------------------------------------------------
> |
  | male                             Female                        231 (46.2%) 
> |
  |                                  Male                          269 (53.8%) 
> |
  |----------------------------------------------------------------------------
> |
  | region of England                East Midlands                 55 (13.4%)  
> |
  |                                  London                        97 (23.7%)  
> |
  |                                  North East                    56 (13.7%)  
> |
  |                                  North West                    48 (11.7%)  
> |
  |                                  South East                    106 (25.9%) 
> |
  |                                  West Midlands                 48 (11.7%)  
> |
  |----------------------------------------------------------------------------
> |
  | Rural Urban in five categories   Urban major conurbation       55 (11.0%)  
> |
  |                                  Urban minor conurbation       65 (13.0%)  
> |
  |                                  Urban city and town           134 (26.8%) 
> |
  |                                  Rural town and fringe         117 (23.4%) 
> |
  |                                  Rural village and dispersed   129 (25.8%) 
> |
  |----------------------------------------------------------------------------
> |
  | prescribed_biologics             0                             255 (51.0%) 
> |
  |                                  1                             245 (49.0%) 
> |
  |----------------------------------------------------------------------------
> |
  | imd                              0                             24 ( 4.8%)  
> |
  |                                  1                             103 (20.6%) 
> |
  |                                  2                             94 (18.8%)  
> |
  |                                  3                             91 (18.2%)  
> |
  |                                  4                             101 (20.2%) 
> |
  |                                  5                             87 (17.4%)  
> |
  |----------------------------------------------------------------------------
> |
  | care_home                        0                             414 (82.8%) 
> |
  |                                  1                             86 (17.2%)  
> |
  +----------------------------------------------------------------------------
> +
Data are presented as n (%).
 

. export delimited using ./output/tables/op_chars.csv
file ./output/tables/op_chars.csv saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/outpatients.log
  log type:  text
 closed on:  25 Jul 2022, 12:06:56
-------------------------------------------------------------------------------
