
. 
. cap mkdir ./output/tables

. * Import data
. import delimited using ./output/input.csv
(42 vars, 1,000 obs)

. * Check data
. count if age==. 
  0

. count if age<18 
  225

. count if age>110 & age!=.
  0

. sum age, d

                             age
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            3              0
10%            7              0       Obs               1,000
25%           19              0       Sum of Wgt.       1,000

50%           40                      Mean             40.117
                        Largest       Std. Dev.      24.43289
75%           58             95
90%           74             97       Variance       596.9663
95%         81.5             98       Skewness       .1706589
99%           91             99       Kurtosis       2.073088

. count if sex==""
  0

. tab sex

        sex |      Freq.     Percent        Cum.
------------+-----------------------------------
          F |        482       48.20       48.20
          M |        509       50.90       99.10
          U |          9        0.90      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. sum household, d

                          household
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               1,000
25%            2              0       Sum of Wgt.       1,000

50%            2                      Mean              2.486
                        Largest       Std. Dev.      1.062513
75%            3              5
90%            4              5       Variance       1.128933
95%            4              5       Skewness       .0040665
99%            5              6       Kurtosis         2.8118

. tab care_home_type

care_home_t |
        ype |      Freq.     Percent        Cum.
------------+-----------------------------------
         PC |         39        3.95        3.95
         PN |         51        5.16        9.11
         PR |        842       85.22       94.33
         PS |         56        5.67      100.00
------------+-----------------------------------
      Total |        988      100.00

. * Checking RA algorithm variables
. * Checking type of DMARD that meets inclusion
. foreach dmard in metho leflu sulfa hydrox {
  2.     gen `dmard'_multi = (`dmard'_count>=2)
  3.     tab `dmard'_multi if has_dmards==1, m
  4. }

metho_multi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         66       13.20       13.20
          1 |        434       86.80      100.00
------------+-----------------------------------
      Total |        500      100.00

leflu_multi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         78       15.60       15.60
          1 |        422       84.40      100.00
------------+-----------------------------------
      Total |        500      100.00

sulfa_multi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         87       17.40       17.40
          1 |        413       82.60      100.00
------------+-----------------------------------
      Total |        500      100.00

hydrox_mult |
          i |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         86       17.20       17.20
          1 |        414       82.80      100.00
------------+-----------------------------------
      Total |        500      100.00

. gen dmard_multi = (metho_multi==1 | leflu_multi==1 | sulfa_multi==1 | hydrox_
> multi==1)

. tab dmard_multi has_alt_dmard_diag

dmard_mult |  has_alt_dmard_diag
         i |         0          1 |     Total
-----------+----------------------+----------
         1 |       500        500 |     1,000 
-----------+----------------------+----------
     Total |       500        500 |     1,000 

. sum number_ra_codes

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
number_ra_~s |      1,000       2.502    1.031048          0          5

. di "Number where no DMARDs but does have multiple RA codes and no alt diag"
Number where no DMARDs but does have multiple RA codes and no alt diag

. count if has_dmards==0 & number_ra_codes>=2 & alt_diag!=1
  190

. tab has_ra, m

     has_ra |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        500       50.00       50.00
          1 |        500       50.00      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. * Time since first RA code
. gen first_ra_codeA = date(first_ra_code, "YMD")
(556 missing values generated)

. format first_ra_codeA %dD/N/CY

. gen time_ra = (date("01Mar2018", "DMY") - first_ra_codeA)/365.25
(556 missing values generated)

. sum time_ra, d

                           time_ra
-------------------------------------------------------------
      Percentiles      Smallest
 1%      1.98768       .7392197
 5%     7.154004       .8514716
10%     12.90623       1.664613       Obs                 444
25%     28.21629       1.689254       Sum of Wgt.         444

50%     51.86858                      Mean           53.84421
                        Largest       Std. Dev.      30.30269
75%     78.31211       107.5264
90%     96.92539       107.6058       Variance       918.2528
95%     102.2423       107.8987       Skewness       .0660318
99%     107.5099       108.6434       Kurtosis       1.858703

. sum number_ra_codes, d

                       number_ra_codes
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               1,000
25%            2              0       Sum of Wgt.       1,000

50%            3                      Mean              2.502
                        Largest       Std. Dev.      1.031048
75%            3              5
90%            4              5       Variance       1.063059
95%            4              5       Skewness      -.0382595
99%            5              5       Kurtosis       2.770625

. sum metho_count, d

                         metho_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               1,000
25%            2              0       Sum of Wgt.       1,000

50%            3                      Mean              2.565
                        Largest       Std. Dev.        1.0143
75%            3              5
90%            4              5       Variance       1.028804
95%            4              5       Skewness      -.1223098
99%            5              5       Kurtosis        2.80271

. sum sulfa_count, d 

                         sulfa_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               1,000
25%            2              0       Sum of Wgt.       1,000

50%            2                      Mean              2.415
                        Largest       Std. Dev.      1.015779
75%            3              5
90%            4              5       Variance       1.031807
95%            4              5       Skewness       .0594465
99%            5              5       Kurtosis       2.907223

. sum leflu_count, d 

                         leflu_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               1,000
25%            2              0       Sum of Wgt.       1,000

50%            3                      Mean              2.541
                        Largest       Std. Dev.      1.038941
75%            3              5
90%            4              5       Variance       1.079398
95%            4              5       Skewness       .0112059
99%            5              6       Kurtosis       2.962373

. sum hydrox_count, d 

                        hydrox_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               1,000
25%            2              0       Sum of Wgt.       1,000

50%            2                      Mean              2.443
                        Largest       Std. Dev.      .9898135
75%            3              5
90%            4              5       Variance       .9797307
95%            4              5       Skewness       .0591778
99%            5              5       Kurtosis       2.770985

. 
. sum outpatient*, d

                    outpatient_appt_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               1,000
25%            2              0       Sum of Wgt.       1,000

50%            3                      Mean              2.534
                        Largest       Std. Dev.       1.06206
75%            3              5
90%            4              5       Variance       1.127972
95%            4              5       Skewness      -.0764748
99%            5              5       Kurtosis       2.783262

                    outpatient_appt_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               1,000
25%            2              0       Sum of Wgt.       1,000

50%            3                      Mean              2.508
                        Largest       Std. Dev.      1.028102
75%            3              5
90%            4              5       Variance       1.056993
95%            4              5       Skewness       -.035337
99%            5              5       Kurtosis       2.832573

                    outpatient_appt_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -1
 5%            1              0
10%            1              0       Obs               1,000
25%            2              0       Sum of Wgt.       1,000

50%            3                      Mean              2.511
                        Largest       Std. Dev.      1.062548
75%            3              5
90%            4              5       Variance       1.129008
95%            4              6       Skewness      -.0012283
99%            5              6       Kurtosis       2.792795

                   outpatient_medium_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs                 500
25%            2              1       Sum of Wgt.         500

50%            5                      Mean              14.61
                        Largest       Std. Dev.      29.72462
75%            7             98
90%           98             98       Variance        883.553
95%           98             98       Skewness       2.435276
99%           98             98       Kurtosis       6.983404

                   outpatient_medium_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs                 500
25%            2              1       Sum of Wgt.         500

50%            5                      Mean             12.668
                        Largest       Std. Dev.      26.96011
75%            7             98
90%            8             98       Variance       726.8475
95%           98             98       Skewness        2.82756
99%           98             98       Kurtosis       9.081733

                   outpatient_medium_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs                 500
25%            2              1       Sum of Wgt.         500

50%            4                      Mean             14.038
                        Largest       Std. Dev.      29.02878
75%            7             98
90%           98             98       Variance       842.6699
95%           98             98       Skewness        2.53026
99%           98             98       Kurtosis       7.465019

. 
. keep if has_ra
(500 observations deleted)

. 
. * How many people are not on DMARDs and have no RA appointments?
. 
. 
. * Format variables
. *re-order ethnicity
.  gen eth5=1 if ethnicity==1
(410 missing values generated)

.  replace eth5=2 if ethnicity==3
(118 real changes made)

.  replace eth5=3 if ethnicity==4
(100 real changes made)

.  replace eth5=4 if ethnicity==2
(84 real changes made)

.  replace eth5=5 if ethnicity==5
(108 real changes made)

.  replace eth5=. if ethnicity==.
(0 real changes made)

. 
.  label define eth5                      1 "White"                            
>            ///
>                                                         2 "South Asian"      
>                    ///                                             
>                                                         3 "Black"            
>                            ///
>                                                         4 "Mixed"            
>                            ///
>                                                         5 "Other"            
>                            

.                                         
. 
. label values eth5 eth5

. safetab eth5, m
5

       eth5 |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |         90       18.00       18.00
South Asian |        118       23.60       41.60
      Black |        100       20.00       61.60
      Mixed |         84       16.80       78.40
      Other |        108       21.60      100.00
------------+-----------------------------------
      Total |        500      100.00

. 
. * formatting gender
. gen male=(sex=="M")

. replace male = 0 if sex == "F"
(0 real changes made)

. label define male 0"Female" 1"Male"

. label values male male

. safetab male, miss
5

       male |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |        239       47.80       47.80
       Male |        261       52.20      100.00
------------+-----------------------------------
      Total |        500      100.00

. 
. * Make region numeric
. generate region2=.
(500 missing values generated)

. replace region2=0 if region=="East"
(0 real changes made)

. replace region2=1 if region=="East Midlands"
(57 real changes made)

. replace region2=2 if region=="London"
(94 real changes made)

. replace region2=3 if region=="North East"
(54 real changes made)

. replace region2=4 if region=="North West"
(50 real changes made)

. replace region2=5 if region=="South East"
(86 real changes made)

. replace region2=6 if region=="South West"
(0 real changes made)

. replace region2=7 if region=="West Midlands"
(45 real changes made)

. replace region2=8 if region=="Yorkshire and The Humber"
(0 real changes made)

. drop region

. rename region2 region

. label var region "region of England"

. label define region 0 "East" 1 "East Midlands"  2 "London" 3 "North East" 4 "
> North West" 5 "South East" 6 "South West" 7 "West Midlands" 8 "Yorkshire and 
> The Humber"

. label values region region

. safetab region, miss
7

       region of England |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
           East Midlands |         57       11.40       11.40
                  London |         94       18.80       30.20
              North East |         54       10.80       41.00
              North West |         50       10.00       51.00
              South East |         86       17.20       68.20
           West Midlands |         45        9.00       77.20
                       . |        114       22.80      100.00
-------------------------+-----------------------------------
                   Total |        500      100.00

. 
. *create a 4 category rural urban variable 
. generate urban_rural_5=.
(500 missing values generated)

. la var urban_rural_5 "Rural Urban in five categories"

. replace urban_rural_5=1 if urban_rural==1
(70 real changes made)

. replace urban_rural_5=2 if urban_rural==2
(59 real changes made)

. replace urban_rural_5=3 if urban_rural==3|urban_rural==4
(122 real changes made)

. replace urban_rural_5=4 if urban_rural==5|urban_rural==6
(115 real changes made)

. replace urban_rural_5=5 if urban_rural==7|urban_rural==8
(134 real changes made)

. label define urban_rural_5 1 "Urban major conurbation" 2 "Urban minor conurba
> tion" 3 "Urban city and town" 4 "Rural town and fringe" 5 "Rural village and 
> dispersed"

. label values urban_rural_5 urban_rural_5

. safetab urban_rural_5, miss
14

        Rural Urban in five |
                 categories |      Freq.     Percent        Cum.
----------------------------+-----------------------------------
    Urban major conurbation |         70       14.00       14.00
    Urban minor conurbation |         59       11.80       25.80
        Urban city and town |        122       24.40       50.20
      Rural town and fringe |        115       23.00       73.20
Rural village and dispersed |        134       26.80      100.00
----------------------------+-----------------------------------
                      Total |        500      100.00

. 
. *generate a binary rural urban (with missing assigned to urban)
. generate urban_rural_bin=.
(500 missing values generated)

. replace urban_rural_bin=1 if urban_rural<=4|urban_rural==.
(251 real changes made)

. replace urban_rural_bin=0 if urban_rural>4 & urban_rural!=.
(249 real changes made)

. label define urban_rural_bin 0 "Rural" 1 "Urban"

. label values urban_rural_bin urban_rural_bin

. safetab urban_rural_bin urban_rural, miss
28

urban_rura |                      urban_rural
     l_bin |         1          2          3          4          5 |     Total
-----------+-------------------------------------------------------+----------
     Rural |         0          0          0          0         63 |       249 
     Urban |        70         59         62         60          0 |       251 
-----------+-------------------------------------------------------+----------
     Total |        70         59         62         60         63 |       500 


urban_rura |           urban_rural
     l_bin |         6          7          8 |     Total
-----------+---------------------------------+----------
     Rural |        52         64         70 |       249 
     Urban |         0          0          0 |       251 
-----------+---------------------------------+----------
     Total |        52         64         70 |       500 

. label var urban_rural_bin "Rural-Urban"

. 
. * Define age categories
. * Create age categories
. egen age_cat = cut(age), at(18, 40, 60, 80, 120) icodes
(106 missing values generated)

. label define age 0 "18 - 40 years" 1 "41 - 60 years" 2 "61 - 80 years" 3 ">80
>  years"

. label values age_cat age

. safetab age_cat, miss
8

      age_cat |      Freq.     Percent        Cum.
--------------+-----------------------------------
18 - 40 years |        133       26.60       26.60
41 - 60 years |        153       30.60       57.20
61 - 80 years |         82       16.40       73.60
    >80 years |         26        5.20       78.80
            . |        106       21.20      100.00
--------------+-----------------------------------
        Total |        500      100.00

. 
. * Flag if in a care-home
.     gen care_home=care_home_type!="PR"

. 
. * Smoking status
. gen smoking = 0 if smoking_status=="N"
(455 missing values generated)

. replace smoking = 1 if smoking_status=="S"
(96 real changes made)

. replace smoking = 2 if smoking_status=="E"
(77 real changes made)

. replace smoking = 3 if smoking==.
(282 real changes made)

. 
. label define smok 1 "Current smoker" 2 "Ex-smoker" 0 "Never smoked" 3 "Unknow
> n"

. label values smoking smok

. 
. * BMI categories
. egen bmi_cat = cut(bmi), at(0, 1, 18.5, 24.9, 29.9, 39.9, 100) icodes

. bys bmi_cat: sum bmi

-------------------------------------------------------------------------------
-> bmi_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        100           0           0          0          0

-------------------------------------------------------------------------------
-> bmi_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |         53    14.34988    3.174376   4.454173   18.26565

-------------------------------------------------------------------------------
-> bmi_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |         88    22.10684    1.829192   18.50281   24.79957

-------------------------------------------------------------------------------
-> bmi_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        101     27.5274    1.433696   24.90412   29.79772

-------------------------------------------------------------------------------
-> bmi_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        132    34.00383    2.922884   29.96773   39.70295

-------------------------------------------------------------------------------
-> bmi_cat = 5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |         26    43.44203    3.033375   40.23106   52.46079


. label define bmi 0 "Missing" 1 "Underweight" 2 "Healthy range" 3 "Overweight"
>  4 "Obese" 5 "Morbidly obese"

. label values bmi_cat bmi

. 
. * Categorise number of outpatient appointments
. label define appt 0 "No appointments" 1 "1-2 per year" 2 "3-6 per year" 3 "7-
> 12 per year" 4 "More than 12 per year"

. forvalues i=2019/2021 {
  2.     egen op_appt_`i'_cat = cut(outpatient_appt_`i'), at(0, 1, 3, 7, 13, 10
> 00) icodes
  3.     label values op_appt_`i'_cat appt
  4.     }

. preserve

. * Tabulate number of appointments per year
. table1_mc, vars(op_appt_2019_cat cate \ op_appt_2020_cat cate \ op_appt_2021_
> cat cate) clear

  +------------------------------+
  | factor             N_1   m_1 |
  |------------------------------|
  | op_appt_2019_cat   500     0 |
  |------------------------------|
  | op_appt_2020_cat   500     0 |
  |------------------------------|
  | op_appt_2021_cat   500     0 |
  +------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------+
  |                                      Total       |
  |--------------------------------------------------|
  |                                      N=500       |
  |--------------------------------------------------|
  | op_appt_2019_cat   No appointments   15 ( 3.0%)  |
  |                    1-2 per year      232 (46.4%) |
  |                    3-6 per year      253 (50.6%) |
  |--------------------------------------------------|
  | op_appt_2020_cat   No appointments   16 ( 3.2%)  |
  |                    1-2 per year      224 (44.8%) |
  |                    3-6 per year      260 (52.0%) |
  |--------------------------------------------------|
  | op_appt_2021_cat   No appointments   6 ( 1.2%)   |
  |                    1-2 per year      244 (48.8%) |
  |                    3-6 per year      250 (50.0%) |
  +--------------------------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/op_appt_yrs.csv
file ./output/tables/op_appt_yrs.csv saved

. restore 

. * Tabulate overall characteristics 
. preserve

. table1_mc, vars(age_cat cate \ male cate \ region cate \ urban_rural_5 cate \
>  prescribed_biologics cate \ imd cate \ care_home cate \ smoking cate \ time_
> ra contn \ bmi_cat cate) clear

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                          394   106 |
  |--------------------------------------------|
  | male                             500     0 |
  |--------------------------------------------|
  | region of England                386   114 |
  |--------------------------------------------|
  | Rural Urban in five categories   500     0 |
  |--------------------------------------------|
  | prescribed_biologics             500     0 |
  |--------------------------------------------|
  | imd                              500     0 |
  |--------------------------------------------|
  | care_home                        500     0 |
  |--------------------------------------------|
  | smoking                          500     0 |
  |--------------------------------------------|
  | time_ra                          227   273 |
  |--------------------------------------------|
  | bmi_cat                          500     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=500       
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 133 (33.8%) 
>         |
  |                                  41 - 60 years                 153 (38.8%) 
>         |
  |                                  61 - 80 years                 82 (20.8%)  
>         |
  |                                  >80 years                     26 ( 6.6%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        239 (47.8%) 
>         |
  |                                  Male                          261 (52.2%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | region of England                East Midlands                 57 (14.8%)  
>         |
  |                                  London                        94 (24.4%)  
>         |
  |                                  North East                    54 (14.0%)  
>         |
  |                                  North West                    50 (13.0%)  
>         |
  |                                  South East                    86 (22.3%)  
>         |
  |                                  West Midlands                 45 (11.7%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       70 (14.0%)  
>         |
  |                                  Urban minor conurbation       59 (11.8%)  
>         |
  |                                  Urban city and town           122 (24.4%) 
>         |
  |                                  Rural town and fringe         115 (23.0%) 
>         |
  |                                  Rural village and dispersed   134 (26.8%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             257 (51.4%) 
>         |
  |                                  1                             243 (48.6%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             27 ( 5.4%)  
>         |
  |                                  1                             90 (18.0%)  
>         |
  |                                  2                             93 (18.6%)  
>         |
  |                                  3                             98 (19.6%)  
>         |
  |                                  4                             96 (19.2%)  
>         |
  |                                  5                             96 (19.2%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | care_home                        0                             411 (82.2%) 
>         |
  |                                  1                             89 (17.8%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  45 ( 9.0%)  
>         |
  |                                  Current smoker                96 (19.2%)  
>         |
  |                                  Ex-smoker                     77 (15.4%)  
>         |
  |                                  Unknown                       282 (56.4%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        54.90532 (29
> .50257) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       100 (20.0%) 
>         |
  |                                  Underweight                   53 (10.6%)  
>         |
  |                                  Healthy range                 88 (17.6%)  
>         |
  |                                  Overweight                    101 (20.2%) 
>         |
  |                                  Obese                         132 (26.4%) 
>         |
  |                                  Morbidly obese                26 ( 5.2%)  
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 

. export delimited using ./output/tables/op_chars.csv
file ./output/tables/op_chars.csv saved

. restore

. * Tabulate characteristics by category of outpatient appointments for each ye
> ar
. tempfile tempfile

. forvalues i=2019/2021 {
  2.     preserve
  3.     keep if op_appt_`i'_cat==0
  4.     table1_mc, vars(age_cat cate \ male cate \ region cate \ urban_rural_5
>  cate \ prescribed_biologics cate \ imd cate \ care_home cate \ smoking cate 
> \ time_ra contn \ bmi_cat cate) clear
  5.     save `tempfile', replace
  6.     restore
  7.     forvalues j=1/2 {
  8.         preserve
  9.         keep if op_appt_`i'_cat==`j'
 10.         table1_mc, vars(age_cat cate \ male cate \ region cate \ urban_rur
> al_5 cate \ prescribed_biologics cate \ imd cate \ care_home cate \ smoking c
> ate \ time_ra contn \ bmi_cat cate) clear
 11.         append using `tempfile'
 12.         save `tempfile', replace
 13.         if `j'==2 {
 14.             export delimited using ./output/tables/characteristics_strata`
> i'.csv
 15.         }
 16.         restore
 17.         }
 18.     * Tabulate characteristics by whether hospitalised with RA for each ye
> ar
.     preserve
 19.     keep if ra_hosp_`i'==1
 20.     table1_mc, vars(age_cat cate \ male cate \ region cate \ urban_rural_5
>  cate \ prescribed_biologics cate \ imd cate \ care_home cate \ smoking cate 
> \ time_ra contn \ bmi_cat cate) clear
 21.     export delimited using ./output/tables/characteristics_ra_hosp_`i'.csv
 22.     restore
 23.     }
(485 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                           10     5 |
  |--------------------------------------------|
  | male                              15     0 |
  |--------------------------------------------|
  | region of England                 12     3 |
  |--------------------------------------------|
  | Rural Urban in five categories    15     0 |
  |--------------------------------------------|
  | prescribed_biologics              15     0 |
  |--------------------------------------------|
  | imd                               15     0 |
  |--------------------------------------------|
  | care_home                         15     0 |
  |--------------------------------------------|
  | smoking                           15     0 |
  |--------------------------------------------|
  | time_ra                           10     5 |
  |--------------------------------------------|
  | bmi_cat                           15     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> -------+
  |                                                                Total       
>        |
  |----------------------------------------------------------------------------
> -------|
  |                                                                N=15        
>        |
  |----------------------------------------------------------------------------
> -------|
  | age_cat                          18 - 40 years                 4 (40%)     
>        |
  |                                  41 - 60 years                 4 (40%)     
>        |
  |                                  61 - 80 years                 1 (10%)     
>        |
  |                                  >80 years                     1 (10%)     
>        |
  |----------------------------------------------------------------------------
> -------|
  | male                             Female                        9 (60%)     
>        |
  |                                  Male                          6 (40%)     
>        |
  |----------------------------------------------------------------------------
> -------|
  | region of England                East Midlands                 1 ( 8%)     
>        |
  |                                  London                        3 (25%)     
>        |
  |                                  North East                    1 ( 8%)     
>        |
  |                                  North West                    3 (25%)     
>        |
  |                                  South East                    1 ( 8%)     
>        |
  |                                  West Midlands                 3 (25%)     
>        |
  |----------------------------------------------------------------------------
> -------|
  | Rural Urban in five categories   Urban major conurbation       1 ( 7%)     
>        |
  |                                  Urban city and town           3 (20%)     
>        |
  |                                  Rural town and fringe         5 (33%)     
>        |
  |                                  Rural village and dispersed   6 (40%)     
>        |
  |----------------------------------------------------------------------------
> -------|
  | prescribed_biologics             0                             11 (73%)    
>        |
  |                                  1                             4 (27%)     
>        |
  |----------------------------------------------------------------------------
> -------|
  | imd                              0                             2 (13%)     
>        |
  |                                  1                             2 (13%)     
>        |
  |                                  2                             1 ( 7%)     
>        |
  |                                  3                             5 (33%)     
>        |
  |                                  4                             4 (27%)     
>        |
  |                                  5                             1 ( 7%)     
>        |
  |----------------------------------------------------------------------------
> -------|
  | care_home                        0                             13 (87%)    
>        |
  |                                  1                             2 (13%)     
>        |
  |----------------------------------------------------------------------------
> -------|
  | smoking                          Never smoked                  3 (20%)     
>        |
  |                                  Current smoker                4 (27%)     
>        |
  |                                  Ex-smoker                     3 (20%)     
>        |
  |                                  Unknown                       5 (33%)     
>        |
  |----------------------------------------------------------------------------
> -------|
  | time_ra                                                        58.6768 (38.
> 28842) |
  |----------------------------------------------------------------------------
> -------|
  | bmi_cat                          Missing                       2 (13%)     
>        |
  |                                  Healthy range                 3 (20%)     
>        |
  |                                  Overweight                    1 ( 7%)     
>        |
  |                                  Obese                         9 (60%)     
>        |
  +----------------------------------------------------------------------------
> -------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
(note: file /tmp/St00011.000003 not found)
file /tmp/St00011.000003 saved
(268 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                          181    51 |
  |--------------------------------------------|
  | male                             232     0 |
  |--------------------------------------------|
  | region of England                185    47 |
  |--------------------------------------------|
  | Rural Urban in five categories   232     0 |
  |--------------------------------------------|
  | prescribed_biologics             232     0 |
  |--------------------------------------------|
  | imd                              232     0 |
  |--------------------------------------------|
  | care_home                        232     0 |
  |--------------------------------------------|
  | smoking                          232     0 |
  |--------------------------------------------|
  | time_ra                          103   129 |
  |--------------------------------------------|
  | bmi_cat                          232     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=232       
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 63 (34.8%)  
>         |
  |                                  41 - 60 years                 73 (40.3%)  
>         |
  |                                  61 - 80 years                 38 (21.0%)  
>         |
  |                                  >80 years                     7 ( 3.9%)   
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        107 (46.1%) 
>         |
  |                                  Male                          125 (53.9%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | region of England                East Midlands                 28 (15.1%)  
>         |
  |                                  London                        43 (23.2%)  
>         |
  |                                  North East                    28 (15.1%)  
>         |
  |                                  North West                    22 (11.9%)  
>         |
  |                                  South East                    41 (22.2%)  
>         |
  |                                  West Midlands                 23 (12.4%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       32 (13.8%)  
>         |
  |                                  Urban minor conurbation       27 (11.6%)  
>         |
  |                                  Urban city and town           67 (28.9%)  
>         |
  |                                  Rural town and fringe         45 (19.4%)  
>         |
  |                                  Rural village and dispersed   61 (26.3%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             110 (47.4%) 
>         |
  |                                  1                             122 (52.6%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             11 ( 4.7%)  
>         |
  |                                  1                             46 (19.8%)  
>         |
  |                                  2                             41 (17.7%)  
>         |
  |                                  3                             51 (22.0%)  
>         |
  |                                  4                             40 (17.2%)  
>         |
  |                                  5                             43 (18.5%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | care_home                        0                             193 (83.2%) 
>         |
  |                                  1                             39 (16.8%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  20 ( 8.6%)  
>         |
  |                                  Current smoker                47 (20.3%)  
>         |
  |                                  Ex-smoker                     37 (15.9%)  
>         |
  |                                  Unknown                       128 (55.2%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        54.17223 (30
> .77229) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       45 (19.4%)  
>         |
  |                                  Underweight                   29 (12.5%)  
>         |
  |                                  Healthy range                 41 (17.7%)  
>         |
  |                                  Overweight                    47 (20.3%)  
>         |
  |                                  Obese                         61 (26.3%)  
>         |
  |                                  Morbidly obese                9 ( 3.9%)   
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000003 saved
(247 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                          203    50 |
  |--------------------------------------------|
  | male                             253     0 |
  |--------------------------------------------|
  | region of England                189    64 |
  |--------------------------------------------|
  | Rural Urban in five categories   253     0 |
  |--------------------------------------------|
  | prescribed_biologics             253     0 |
  |--------------------------------------------|
  | imd                              253     0 |
  |--------------------------------------------|
  | care_home                        253     0 |
  |--------------------------------------------|
  | smoking                          253     0 |
  |--------------------------------------------|
  | time_ra                          114   139 |
  |--------------------------------------------|
  | bmi_cat                          253     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=253       
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 66 (32.5%)  
>         |
  |                                  41 - 60 years                 76 (37.4%)  
>         |
  |                                  61 - 80 years                 43 (21.2%)  
>         |
  |                                  >80 years                     18 ( 8.9%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        123 (48.6%) 
>         |
  |                                  Male                          130 (51.4%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | region of England                East Midlands                 28 (14.8%)  
>         |
  |                                  London                        48 (25.4%)  
>         |
  |                                  North East                    25 (13.2%)  
>         |
  |                                  North West                    25 (13.2%)  
>         |
  |                                  South East                    44 (23.3%)  
>         |
  |                                  West Midlands                 19 (10.1%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       37 (14.6%)  
>         |
  |                                  Urban minor conurbation       32 (12.6%)  
>         |
  |                                  Urban city and town           52 (20.6%)  
>         |
  |                                  Rural town and fringe         65 (25.7%)  
>         |
  |                                  Rural village and dispersed   67 (26.5%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             136 (53.8%) 
>         |
  |                                  1                             117 (46.2%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             14 ( 5.5%)  
>         |
  |                                  1                             42 (16.6%)  
>         |
  |                                  2                             51 (20.2%)  
>         |
  |                                  3                             42 (16.6%)  
>         |
  |                                  4                             52 (20.6%)  
>         |
  |                                  5                             52 (20.6%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | care_home                        0                             205 (81.0%) 
>         |
  |                                  1                             48 (19.0%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  22 ( 8.7%)  
>         |
  |                                  Current smoker                45 (17.8%)  
>         |
  |                                  Ex-smoker                     37 (14.6%)  
>         |
  |                                  Unknown                       149 (58.9%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        55.23684 (27
> .70251) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       53 (20.9%)  
>         |
  |                                  Underweight                   24 ( 9.5%)  
>         |
  |                                  Healthy range                 44 (17.4%)  
>         |
  |                                  Overweight                    53 (20.9%)  
>         |
  |                                  Obese                         62 (24.5%)  
>         |
  |                                  Morbidly obese                17 ( 6.7%)  
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000003 saved
file ./output/tables/characteristics_strata2019.csv saved
(437 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                           52    11 |
  |--------------------------------------------|
  | male                              63     0 |
  |--------------------------------------------|
  | region of England                 51    12 |
  |--------------------------------------------|
  | Rural Urban in five categories    63     0 |
  |--------------------------------------------|
  | prescribed_biologics              63     0 |
  |--------------------------------------------|
  | imd                               63     0 |
  |--------------------------------------------|
  | care_home                         63     0 |
  |--------------------------------------------|
  | smoking                           63     0 |
  |--------------------------------------------|
  | time_ra                           28    35 |
  |--------------------------------------------|
  | bmi_cat                           63     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=63        
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 21 (40%)    
>         |
  |                                  41 - 60 years                 23 (44%)    
>         |
  |                                  61 - 80 years                 6 (12%)     
>         |
  |                                  >80 years                     2 ( 4%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        28 (44%)    
>         |
  |                                  Male                          35 (56%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | region of England                East Midlands                 6 (12%)     
>         |
  |                                  London                        16 (31%)    
>         |
  |                                  North East                    7 (14%)     
>         |
  |                                  North West                    8 (16%)     
>         |
  |                                  South East                    7 (14%)     
>         |
  |                                  West Midlands                 7 (14%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       8 (13%)     
>         |
  |                                  Urban minor conurbation       12 (19%)    
>         |
  |                                  Urban city and town           11 (17%)    
>         |
  |                                  Rural town and fringe         17 (27%)    
>         |
  |                                  Rural village and dispersed   15 (24%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             28 (44%)    
>         |
  |                                  1                             35 (56%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             3 ( 5%)     
>         |
  |                                  1                             12 (19%)    
>         |
  |                                  2                             16 (25%)    
>         |
  |                                  3                             8 (13%)     
>         |
  |                                  4                             14 (22%)    
>         |
  |                                  5                             10 (16%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | care_home                        0                             58 (92%)    
>         |
  |                                  1                             5 ( 8%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  5 ( 8%)     
>         |
  |                                  Current smoker                10 (16%)    
>         |
  |                                  Ex-smoker                     10 (16%)    
>         |
  |                                  Unknown                       38 (60%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        45.73306 (28
> .38315) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       8 (13%)     
>         |
  |                                  Underweight                   10 (16%)    
>         |
  |                                  Healthy range                 14 (22%)    
>         |
  |                                  Overweight                    11 (17%)    
>         |
  |                                  Obese                         16 (25%)    
>         |
  |                                  Morbidly obese                4 ( 6%)     
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file ./output/tables/characteristics_ra_hosp_2019.csv saved
(484 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                           11     5 |
  |--------------------------------------------|
  | male                              16     0 |
  |--------------------------------------------|
  | region of England                 14     2 |
  |--------------------------------------------|
  | Rural Urban in five categories    16     0 |
  |--------------------------------------------|
  | prescribed_biologics              16     0 |
  |--------------------------------------------|
  | imd                               16     0 |
  |--------------------------------------------|
  | care_home                         16     0 |
  |--------------------------------------------|
  | smoking                           16     0 |
  |--------------------------------------------|
  | time_ra                            8     8 |
  |--------------------------------------------|
  | bmi_cat                           16     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=16        
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 2 (18%)     
>         |
  |                                  41 - 60 years                 5 (45%)     
>         |
  |                                  61 - 80 years                 3 (27%)     
>         |
  |                                  >80 years                     1 ( 9%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        9 (56%)     
>         |
  |                                  Male                          7 (44%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | region of England                East Midlands                 4 (29%)     
>         |
  |                                  London                        3 (21%)     
>         |
  |                                  North East                    1 ( 7%)     
>         |
  |                                  North West                    2 (14%)     
>         |
  |                                  South East                    2 (14%)     
>         |
  |                                  West Midlands                 2 (14%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       1 ( 6%)     
>         |
  |                                  Urban minor conurbation       1 ( 6%)     
>         |
  |                                  Urban city and town           5 (31%)     
>         |
  |                                  Rural town and fringe         4 (25%)     
>         |
  |                                  Rural village and dispersed   5 (31%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             8 (50%)     
>         |
  |                                  1                             8 (50%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             1 ( 6%)     
>         |
  |                                  1                             1 ( 6%)     
>         |
  |                                  2                             3 (19%)     
>         |
  |                                  3                             5 (31%)     
>         |
  |                                  4                             1 ( 6%)     
>         |
  |                                  5                             5 (31%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | care_home                        0                             10 (62%)    
>         |
  |                                  1                             6 (38%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  3 (19%)     
>         |
  |                                  Current smoker                3 (19%)     
>         |
  |                                  Ex-smoker                     4 (25%)     
>         |
  |                                  Unknown                       6 (38%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        62.67214 (23
> .76005) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       3 (19%)     
>         |
  |                                  Underweight                   3 (19%)     
>         |
  |                                  Healthy range                 3 (19%)     
>         |
  |                                  Overweight                    3 (19%)     
>         |
  |                                  Obese                         3 (19%)     
>         |
  |                                  Morbidly obese                1 ( 6%)     
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000003 saved
(276 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                          178    46 |
  |--------------------------------------------|
  | male                             224     0 |
  |--------------------------------------------|
  | region of England                172    52 |
  |--------------------------------------------|
  | Rural Urban in five categories   224     0 |
  |--------------------------------------------|
  | prescribed_biologics             224     0 |
  |--------------------------------------------|
  | imd                              224     0 |
  |--------------------------------------------|
  | care_home                        224     0 |
  |--------------------------------------------|
  | smoking                          224     0 |
  |--------------------------------------------|
  | time_ra                          100   124 |
  |--------------------------------------------|
  | bmi_cat                          224     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=224       
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 60 (33.7%)  
>         |
  |                                  41 - 60 years                 67 (37.6%)  
>         |
  |                                  61 - 80 years                 41 (23.0%)  
>         |
  |                                  >80 years                     10 ( 5.6%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        107 (47.8%) 
>         |
  |                                  Male                          117 (52.2%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | region of England                East Midlands                 30 (17.4%)  
>         |
  |                                  London                        42 (24.4%)  
>         |
  |                                  North East                    16 ( 9.3%)  
>         |
  |                                  North West                    21 (12.2%)  
>         |
  |                                  South East                    40 (23.3%)  
>         |
  |                                  West Midlands                 23 (13.4%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       33 (14.7%)  
>         |
  |                                  Urban minor conurbation       32 (14.3%)  
>         |
  |                                  Urban city and town           50 (22.3%)  
>         |
  |                                  Rural town and fringe         47 (21.0%)  
>         |
  |                                  Rural village and dispersed   62 (27.7%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             118 (52.7%) 
>         |
  |                                  1                             106 (47.3%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             14 ( 6.2%)  
>         |
  |                                  1                             41 (18.3%)  
>         |
  |                                  2                             39 (17.4%)  
>         |
  |                                  3                             37 (16.5%)  
>         |
  |                                  4                             44 (19.6%)  
>         |
  |                                  5                             49 (21.9%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | care_home                        0                             186 (83.0%) 
>         |
  |                                  1                             38 (17.0%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  14 ( 6.2%)  
>         |
  |                                  Current smoker                51 (22.8%)  
>         |
  |                                  Ex-smoker                     33 (14.7%)  
>         |
  |                                  Unknown                       126 (56.2%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        50.69394 (28
> .09103) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       53 (23.7%)  
>         |
  |                                  Underweight                   23 (10.3%)  
>         |
  |                                  Healthy range                 40 (17.9%)  
>         |
  |                                  Overweight                    41 (18.3%)  
>         |
  |                                  Obese                         56 (25.0%)  
>         |
  |                                  Morbidly obese                11 ( 4.9%)  
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000003 saved
(240 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                          205    55 |
  |--------------------------------------------|
  | male                             260     0 |
  |--------------------------------------------|
  | region of England                200    60 |
  |--------------------------------------------|
  | Rural Urban in five categories   260     0 |
  |--------------------------------------------|
  | prescribed_biologics             260     0 |
  |--------------------------------------------|
  | imd                              260     0 |
  |--------------------------------------------|
  | care_home                        260     0 |
  |--------------------------------------------|
  | smoking                          260     0 |
  |--------------------------------------------|
  | time_ra                          119   141 |
  |--------------------------------------------|
  | bmi_cat                          260     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=260       
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 71 (34.6%)  
>         |
  |                                  41 - 60 years                 81 (39.5%)  
>         |
  |                                  61 - 80 years                 38 (18.5%)  
>         |
  |                                  >80 years                     15 ( 7.3%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        123 (47.3%) 
>         |
  |                                  Male                          137 (52.7%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | region of England                East Midlands                 23 (11.5%)  
>         |
  |                                  London                        49 (24.5%)  
>         |
  |                                  North East                    37 (18.5%)  
>         |
  |                                  North West                    27 (13.5%)  
>         |
  |                                  South East                    44 (22.0%)  
>         |
  |                                  West Midlands                 20 (10.0%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       36 (13.8%)  
>         |
  |                                  Urban minor conurbation       26 (10.0%)  
>         |
  |                                  Urban city and town           67 (25.8%)  
>         |
  |                                  Rural town and fringe         64 (24.6%)  
>         |
  |                                  Rural village and dispersed   67 (25.8%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             131 (50.4%) 
>         |
  |                                  1                             129 (49.6%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             12 ( 4.6%)  
>         |
  |                                  1                             48 (18.5%)  
>         |
  |                                  2                             51 (19.6%)  
>         |
  |                                  3                             56 (21.5%)  
>         |
  |                                  4                             51 (19.6%)  
>         |
  |                                  5                             42 (16.2%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | care_home                        0                             215 (82.7%) 
>         |
  |                                  1                             45 (17.3%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  28 (10.8%)  
>         |
  |                                  Current smoker                42 (16.2%)  
>         |
  |                                  Ex-smoker                     40 (15.4%)  
>         |
  |                                  Unknown                       150 (57.7%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        57.92216 (30
> .71167) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       44 (16.9%)  
>         |
  |                                  Underweight                   27 (10.4%)  
>         |
  |                                  Healthy range                 45 (17.3%)  
>         |
  |                                  Overweight                    57 (21.9%)  
>         |
  |                                  Obese                         73 (28.1%)  
>         |
  |                                  Morbidly obese                14 ( 5.4%)  
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000003 saved
file ./output/tables/characteristics_strata2020.csv saved
(430 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                           54    16 |
  |--------------------------------------------|
  | male                              70     0 |
  |--------------------------------------------|
  | region of England                 59    11 |
  |--------------------------------------------|
  | Rural Urban in five categories    70     0 |
  |--------------------------------------------|
  | prescribed_biologics              70     0 |
  |--------------------------------------------|
  | imd                               70     0 |
  |--------------------------------------------|
  | care_home                         70     0 |
  |--------------------------------------------|
  | smoking                           70     0 |
  |--------------------------------------------|
  | time_ra                           33    37 |
  |--------------------------------------------|
  | bmi_cat                           70     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> -------+
  |                                                                Total       
>        |
  |----------------------------------------------------------------------------
> -------|
  |                                                                N=70        
>        |
  |----------------------------------------------------------------------------
> -------|
  | age_cat                          18 - 40 years                 15 (28%)    
>        |
  |                                  41 - 60 years                 27 (50%)    
>        |
  |                                  61 - 80 years                 10 (19%)    
>        |
  |                                  >80 years                     2 ( 4%)     
>        |
  |----------------------------------------------------------------------------
> -------|
  | male                             Female                        32 (46%)    
>        |
  |                                  Male                          38 (54%)    
>        |
  |----------------------------------------------------------------------------
> -------|
  | region of England                East Midlands                 9 (15%)     
>        |
  |                                  London                        14 (24%)    
>        |
  |                                  North East                    11 (19%)    
>        |
  |                                  North West                    6 (10%)     
>        |
  |                                  South East                    13 (22%)    
>        |
  |                                  West Midlands                 6 (10%)     
>        |
  |----------------------------------------------------------------------------
> -------|
  | Rural Urban in five categories   Urban major conurbation       12 (17%)    
>        |
  |                                  Urban minor conurbation       5 ( 7%)     
>        |
  |                                  Urban city and town           12 (17%)    
>        |
  |                                  Rural town and fringe         18 (26%)    
>        |
  |                                  Rural village and dispersed   23 (33%)    
>        |
  |----------------------------------------------------------------------------
> -------|
  | prescribed_biologics             0                             38 (54%)    
>        |
  |                                  1                             32 (46%)    
>        |
  |----------------------------------------------------------------------------
> -------|
  | imd                              0                             5 ( 7%)     
>        |
  |                                  1                             11 (16%)    
>        |
  |                                  2                             15 (21%)    
>        |
  |                                  3                             16 (23%)    
>        |
  |                                  4                             11 (16%)    
>        |
  |                                  5                             12 (17%)    
>        |
  |----------------------------------------------------------------------------
> -------|
  | care_home                        0                             57 (81%)    
>        |
  |                                  1                             13 (19%)    
>        |
  |----------------------------------------------------------------------------
> -------|
  | smoking                          Never smoked                  4 ( 6%)     
>        |
  |                                  Current smoker                15 (21%)    
>        |
  |                                  Ex-smoker                     10 (14%)    
>        |
  |                                  Unknown                       41 (59%)    
>        |
  |----------------------------------------------------------------------------
> -------|
  | time_ra                                                        59.01977 (29
> .8778) |
  |----------------------------------------------------------------------------
> -------|
  | bmi_cat                          Missing                       11 (16%)    
>        |
  |                                  Underweight                   8 (11%)     
>        |
  |                                  Healthy range                 14 (20%)    
>        |
  |                                  Overweight                    11 (16%)    
>        |
  |                                  Obese                         20 (29%)    
>        |
  |                                  Morbidly obese                6 ( 9%)     
>        |
  +----------------------------------------------------------------------------
> -------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file ./output/tables/characteristics_ra_hosp_2020.csv saved
(494 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                            5     1 |
  |--------------------------------------------|
  | male                               6     0 |
  |--------------------------------------------|
  | region of England                  4     2 |
  |--------------------------------------------|
  | Rural Urban in five categories     6     0 |
  |--------------------------------------------|
  | prescribed_biologics               6     0 |
  |--------------------------------------------|
  | imd                                6     0 |
  |--------------------------------------------|
  | care_home                          6     0 |
  |--------------------------------------------|
  | smoking                            6     0 |
  |--------------------------------------------|
  | time_ra                            2     4 |
  |--------------------------------------------|
  | bmi_cat                            6     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> ----+
  |                                                            Total           
>     |
  |----------------------------------------------------------------------------
> ----|
  |                                                            N=6             
>     |
  |----------------------------------------------------------------------------
> ----|
  | age_cat                          18 - 40 years             4 (80%)         
>     |
  |                                  >80 years                 1 (20%)         
>     |
  |----------------------------------------------------------------------------
> ----|
  | male                             Female                    3 (50%)         
>     |
  |                                  Male                      3 (50%)         
>     |
  |----------------------------------------------------------------------------
> ----|
  | region of England                North West                1 (25%)         
>     |
  |                                  South East                2 (50%)         
>     |
  |                                  West Midlands             1 (25%)         
>     |
  |----------------------------------------------------------------------------
> ----|
  | Rural Urban in five categories   Urban major conurbation   2 (33%)         
>     |
  |                                  Urban minor conurbation   1 (17%)         
>     |
  |                                  Urban city and town       1 (17%)         
>     |
  |                                  Rural town and fringe     2 (33%)         
>     |
  |----------------------------------------------------------------------------
> ----|
  | prescribed_biologics             0                         4 (67%)         
>     |
  |                                  1                         2 (33%)         
>     |
  |----------------------------------------------------------------------------
> ----|
  | imd                              2                         1 (17%)         
>     |
  |                                  3                         2 (33%)         
>     |
  |                                  4                         1 (17%)         
>     |
  |                                  5                         2 (33%)         
>     |
  |----------------------------------------------------------------------------
> ----|
  | care_home                        0                         5 (83%)         
>     |
  |                                  1                         1 (17%)         
>     |
  |----------------------------------------------------------------------------
> ----|
  | smoking                          Never smoked              1 (17%)         
>     |
  |                                  Current smoker            1 (17%)         
>     |
  |                                  Ex-smoker                 2 (33%)         
>     |
  |                                  Unknown                   2 (33%)         
>     |
  |----------------------------------------------------------------------------
> ----|
  | time_ra                                                    33.58659 (16.631
> 77) |
  |----------------------------------------------------------------------------
> ----|
  | bmi_cat                          Missing                   2 (33%)         
>     |
  |                                  Healthy range             1 (17%)         
>     |
  |                                  Overweight                1 (17%)         
>     |
  |                                  Obese                     2 (33%)         
>     |
  +----------------------------------------------------------------------------
> ----+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000003 saved
(256 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                          196    48 |
  |--------------------------------------------|
  | male                             244     0 |
  |--------------------------------------------|
  | region of England                188    56 |
  |--------------------------------------------|
  | Rural Urban in five categories   244     0 |
  |--------------------------------------------|
  | prescribed_biologics             244     0 |
  |--------------------------------------------|
  | imd                              244     0 |
  |--------------------------------------------|
  | care_home                        244     0 |
  |--------------------------------------------|
  | smoking                          244     0 |
  |--------------------------------------------|
  | time_ra                          116   128 |
  |--------------------------------------------|
  | bmi_cat                          244     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> -------+
  |                                                                Total       
>        |
  |----------------------------------------------------------------------------
> -------|
  |                                                                N=244       
>        |
  |----------------------------------------------------------------------------
> -------|
  | age_cat                          18 - 40 years                 70 (35.7%)  
>        |
  |                                  41 - 60 years                 77 (39.3%)  
>        |
  |                                  61 - 80 years                 36 (18.4%)  
>        |
  |                                  >80 years                     13 ( 6.6%)  
>        |
  |----------------------------------------------------------------------------
> -------|
  | male                             Female                        110 (45.1%) 
>        |
  |                                  Male                          134 (54.9%) 
>        |
  |----------------------------------------------------------------------------
> -------|
  | region of England                East Midlands                 30 (16.0%)  
>        |
  |                                  London                        44 (23.4%)  
>        |
  |                                  North East                    30 (16.0%)  
>        |
  |                                  North West                    22 (11.7%)  
>        |
  |                                  South East                    38 (20.2%)  
>        |
  |                                  West Midlands                 24 (12.8%)  
>        |
  |----------------------------------------------------------------------------
> -------|
  | Rural Urban in five categories   Urban major conurbation       36 (14.8%)  
>        |
  |                                  Urban minor conurbation       33 (13.5%)  
>        |
  |                                  Urban city and town           53 (21.7%)  
>        |
  |                                  Rural town and fringe         57 (23.4%)  
>        |
  |                                  Rural village and dispersed   65 (26.6%)  
>        |
  |----------------------------------------------------------------------------
> -------|
  | prescribed_biologics             0                             118 (48.4%) 
>        |
  |                                  1                             126 (51.6%) 
>        |
  |----------------------------------------------------------------------------
> -------|
  | imd                              0                             11 ( 4.5%)  
>        |
  |                                  1                             39 (16.0%)  
>        |
  |                                  2                             58 (23.8%)  
>        |
  |                                  3                             48 (19.7%)  
>        |
  |                                  4                             45 (18.4%)  
>        |
  |                                  5                             43 (17.6%)  
>        |
  |----------------------------------------------------------------------------
> -------|
  | care_home                        0                             193 (79.1%) 
>        |
  |                                  1                             51 (20.9%)  
>        |
  |----------------------------------------------------------------------------
> -------|
  | smoking                          Never smoked                  24 ( 9.8%)  
>        |
  |                                  Current smoker                49 (20.1%)  
>        |
  |                                  Ex-smoker                     29 (11.9%)  
>        |
  |                                  Unknown                       142 (58.2%) 
>        |
  |----------------------------------------------------------------------------
> -------|
  | time_ra                                                        56.65371 (30
> .7002) |
  |----------------------------------------------------------------------------
> -------|
  | bmi_cat                          Missing                       57 (23.4%)  
>        |
  |                                  Underweight                   32 (13.1%)  
>        |
  |                                  Healthy range                 37 (15.2%)  
>        |
  |                                  Overweight                    47 (19.3%)  
>        |
  |                                  Obese                         60 (24.6%)  
>        |
  |                                  Morbidly obese                11 ( 4.5%)  
>        |
  +----------------------------------------------------------------------------
> -------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
(note: variable Total was str18, now str19 to accommodate using data's
       values)
file /tmp/St00011.000003 saved
(250 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                          193    57 |
  |--------------------------------------------|
  | male                             250     0 |
  |--------------------------------------------|
  | region of England                194    56 |
  |--------------------------------------------|
  | Rural Urban in five categories   250     0 |
  |--------------------------------------------|
  | prescribed_biologics             250     0 |
  |--------------------------------------------|
  | imd                              250     0 |
  |--------------------------------------------|
  | care_home                        250     0 |
  |--------------------------------------------|
  | smoking                          250     0 |
  |--------------------------------------------|
  | time_ra                          109   141 |
  |--------------------------------------------|
  | bmi_cat                          250     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=250       
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 59 (30.6%)  
>         |
  |                                  41 - 60 years                 76 (39.4%)  
>         |
  |                                  61 - 80 years                 46 (23.8%)  
>         |
  |                                  >80 years                     12 ( 6.2%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        126 (50.4%) 
>         |
  |                                  Male                          124 (49.6%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | region of England                East Midlands                 27 (13.9%)  
>         |
  |                                  London                        50 (25.8%)  
>         |
  |                                  North East                    24 (12.4%)  
>         |
  |                                  North West                    27 (13.9%)  
>         |
  |                                  South East                    46 (23.7%)  
>         |
  |                                  West Midlands                 20 (10.3%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       32 (12.8%)  
>         |
  |                                  Urban minor conurbation       25 (10.0%)  
>         |
  |                                  Urban city and town           68 (27.2%)  
>         |
  |                                  Rural town and fringe         56 (22.4%)  
>         |
  |                                  Rural village and dispersed   69 (27.6%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             135 (54.0%) 
>         |
  |                                  1                             115 (46.0%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             16 ( 6.4%)  
>         |
  |                                  1                             51 (20.4%)  
>         |
  |                                  2                             34 (13.6%)  
>         |
  |                                  3                             48 (19.2%)  
>         |
  |                                  4                             50 (20.0%)  
>         |
  |                                  5                             51 (20.4%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | care_home                        0                             213 (85.2%) 
>         |
  |                                  1                             37 (14.8%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  20 ( 8.0%)  
>         |
  |                                  Current smoker                46 (18.4%)  
>         |
  |                                  Ex-smoker                     46 (18.4%)  
>         |
  |                                  Unknown                       138 (55.2%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        53.43581 (28
> .30841) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       41 (16.4%)  
>         |
  |                                  Underweight                   21 ( 8.4%)  
>         |
  |                                  Healthy range                 50 (20.0%)  
>         |
  |                                  Overweight                    53 (21.2%)  
>         |
  |                                  Obese                         70 (28.0%)  
>         |
  |                                  Morbidly obese                15 ( 6.0%)  
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000003 saved
file ./output/tables/characteristics_strata2021.csv saved
(451 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                           37    12 |
  |--------------------------------------------|
  | male                              49     0 |
  |--------------------------------------------|
  | region of England                 38    11 |
  |--------------------------------------------|
  | Rural Urban in five categories    49     0 |
  |--------------------------------------------|
  | prescribed_biologics              49     0 |
  |--------------------------------------------|
  | imd                               49     0 |
  |--------------------------------------------|
  | care_home                         49     0 |
  |--------------------------------------------|
  | smoking                           49     0 |
  |--------------------------------------------|
  | time_ra                           24    25 |
  |--------------------------------------------|
  | bmi_cat                           49     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> -------+
  |                                                                Total       
>        |
  |----------------------------------------------------------------------------
> -------|
  |                                                                N=49        
>        |
  |----------------------------------------------------------------------------
> -------|
  | age_cat                          18 - 40 years                 13 (35%)    
>        |
  |                                  41 - 60 years                 11 (30%)    
>        |
  |                                  61 - 80 years                 9 (24%)     
>        |
  |                                  >80 years                     4 (11%)     
>        |
  |----------------------------------------------------------------------------
> -------|
  | male                             Female                        25 (51%)    
>        |
  |                                  Male                          24 (49%)    
>        |
  |----------------------------------------------------------------------------
> -------|
  | region of England                East Midlands                 10 (26%)    
>        |
  |                                  London                        6 (16%)     
>        |
  |                                  North East                    4 (11%)     
>        |
  |                                  North West                    5 (13%)     
>        |
  |                                  South East                    10 (26%)    
>        |
  |                                  West Midlands                 3 ( 8%)     
>        |
  |----------------------------------------------------------------------------
> -------|
  | Rural Urban in five categories   Urban major conurbation       8 (16%)     
>        |
  |                                  Urban minor conurbation       1 ( 2%)     
>        |
  |                                  Urban city and town           11 (22%)    
>        |
  |                                  Rural town and fringe         11 (22%)    
>        |
  |                                  Rural village and dispersed   18 (37%)    
>        |
  |----------------------------------------------------------------------------
> -------|
  | prescribed_biologics             0                             29 (59%)    
>        |
  |                                  1                             20 (41%)    
>        |
  |----------------------------------------------------------------------------
> -------|
  | imd                              0                             3 ( 6%)     
>        |
  |                                  1                             9 (18%)     
>        |
  |                                  2                             4 ( 8%)     
>        |
  |                                  3                             11 (22%)    
>        |
  |                                  4                             11 (22%)    
>        |
  |                                  5                             11 (22%)    
>        |
  |----------------------------------------------------------------------------
> -------|
  | care_home                        0                             41 (84%)    
>        |
  |                                  1                             8 (16%)     
>        |
  |----------------------------------------------------------------------------
> -------|
  | smoking                          Never smoked                  3 ( 6%)     
>        |
  |                                  Current smoker                15 (31%)    
>        |
  |                                  Ex-smoker                     3 ( 6%)     
>        |
  |                                  Unknown                       28 (57%)    
>        |
  |----------------------------------------------------------------------------
> -------|
  | time_ra                                                        51.6993 (29.
> 01344) |
  |----------------------------------------------------------------------------
> -------|
  | bmi_cat                          Missing                       11 (22%)    
>        |
  |                                  Underweight                   4 ( 8%)     
>        |
  |                                  Healthy range                 7 (14%)     
>        |
  |                                  Overweight                    9 (18%)     
>        |
  |                                  Obese                         13 (27%)    
>        |
  |                                  Morbidly obese                5 (10%)     
>        |
  +----------------------------------------------------------------------------
> -------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file ./output/tables/characteristics_ra_hosp_2021.csv saved

. preserve

.     keep if ra_hosp_2018==1
(428 observations deleted)

.     table1_mc, vars(age_cat cate \ male cate \ region cate \ urban_rural_5 ca
> te \ prescribed_biologics cate \ imd cate \ care_home cate \ smoking cate \ t
> ime_ra contn \ bmi_cat cate) clear

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                           59    13 |
  |--------------------------------------------|
  | male                              72     0 |
  |--------------------------------------------|
  | region of England                 58    14 |
  |--------------------------------------------|
  | Rural Urban in five categories    72     0 |
  |--------------------------------------------|
  | prescribed_biologics              72     0 |
  |--------------------------------------------|
  | imd                               72     0 |
  |--------------------------------------------|
  | care_home                         72     0 |
  |--------------------------------------------|
  | smoking                           72     0 |
  |--------------------------------------------|
  | time_ra                           36    36 |
  |--------------------------------------------|
  | bmi_cat                           72     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=72        
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 16 (27%)    
>         |
  |                                  41 - 60 years                 26 (44%)    
>         |
  |                                  61 - 80 years                 13 (22%)    
>         |
  |                                  >80 years                     4 ( 7%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        37 (51%)    
>         |
  |                                  Male                          35 (49%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | region of England                East Midlands                 8 (14%)     
>         |
  |                                  London                        17 (29%)    
>         |
  |                                  North East                    7 (12%)     
>         |
  |                                  North West                    9 (16%)     
>         |
  |                                  South East                    13 (22%)    
>         |
  |                                  West Midlands                 4 ( 7%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       8 (11%)     
>         |
  |                                  Urban minor conurbation       5 ( 7%)     
>         |
  |                                  Urban city and town           25 (35%)    
>         |
  |                                  Rural town and fringe         21 (29%)    
>         |
  |                                  Rural village and dispersed   13 (18%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             37 (51%)    
>         |
  |                                  1                             35 (49%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             4 ( 6%)     
>         |
  |                                  1                             13 (18%)    
>         |
  |                                  2                             14 (19%)    
>         |
  |                                  3                             10 (14%)    
>         |
  |                                  4                             18 (25%)    
>         |
  |                                  5                             13 (18%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | care_home                        0                             55 (76%)    
>         |
  |                                  1                             17 (24%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  5 ( 7%)     
>         |
  |                                  Current smoker                12 (17%)    
>         |
  |                                  Ex-smoker                     11 (15%)    
>         |
  |                                  Unknown                       44 (61%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        62.21682 (28
> .15212) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       15 (21%)    
>         |
  |                                  Underweight                   17 (24%)    
>         |
  |                                  Healthy range                 10 (14%)    
>         |
  |                                  Overweight                    15 (21%)    
>         |
  |                                  Obese                         13 (18%)    
>         |
  |                                  Morbidly obese                2 ( 3%)     
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 

.     export delimited using ./output/tables/characteristics_ra_hosp_2018.csv
file ./output/tables/characteristics_ra_hosp_2018.csv saved

.     restore

. log close
      name:  <unnamed>
       log:  /workspace/logs/outpatients.log
  log type:  text
 closed on:  17 Aug 2022, 10:43:14
-------------------------------------------------------------------------------
