
. 
. cap mkdir ./output/tables/

. cap mkdir ./output/tempdata

. 
. * Import data
. import delimited using ./output/input.csv
(54 vars, 10,000 obs)

. * Check data
. count if age==. 
  0

. count if age<18 
  2,106

. count if age>110 & age!=.
  0

. sum age, d

                             age
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            4              0
10%            8              0       Obs              10,000
25%           21              0       Sum of Wgt.      10,000

50%           40                      Mean            40.3826
                        Largest       Std. Dev.      23.77317
75%           59            103
90%           73            104       Variance       565.1637
95%           79            108       Skewness       .1377814
99%           89            108       Kurtosis       2.045401

. count if sex==""
  0

. tab sex

        sex |      Freq.     Percent        Cum.
------------+-----------------------------------
          F |      4,968       49.68       49.68
          M |      4,950       49.50       99.18
          U |         82        0.82      100.00
------------+-----------------------------------
      Total |     10,000      100.00

. * Checking RA algorithm variables
. * Checking type of DMARD that meets inclusion
. foreach dmard in metho leflu sulfa hydrox {
  2.     gen `dmard'_multi = (`dmard'_count>=2)
  3.     tab `dmard'_multi if has_dmards==1, m
  4. }

metho_multi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        794       15.88       15.88
          1 |      4,206       84.12      100.00
------------+-----------------------------------
      Total |      5,000      100.00

leflu_multi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        818       16.36       16.36
          1 |      4,182       83.64      100.00
------------+-----------------------------------
      Total |      5,000      100.00

sulfa_multi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        781       15.62       15.62
          1 |      4,219       84.38      100.00
------------+-----------------------------------
      Total |      5,000      100.00

hydrox_mult |
          i |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        809       16.18       16.18
          1 |      4,191       83.82      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. gen dmard_multi = (metho_multi==1 | leflu_multi==1 | sulfa_multi==1 | hydrox_
> multi==1)

. tab dmard_multi has_alt_dmard_diag

dmard_mult |  has_alt_dmard_diag
         i |         0          1 |     Total
-----------+----------------------+----------
         0 |         4          2 |         6 
         1 |     4,996      4,998 |     9,994 
-----------+----------------------+----------
     Total |     5,000      5,000 |    10,000 

. sum number_ra_codes

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
number_ra_~s |     10,000      2.5033    1.038411          0          6

. di "Number where no DMARDs but does have multiple RA codes and no alt diag"
Number where no DMARDs but does have multiple RA codes and no alt diag

. count if has_dmards==0 & number_ra_codes>=2 & alt_diag!=1
  2,122

. tab has_ra, m

     has_ra |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,000       50.00       50.00
          1 |      5,000       50.00      100.00
------------+-----------------------------------
      Total |     10,000      100.00

. keep if has_ra
(5,000 observations deleted)

. * Time since first RA code
. gen first_ra_codeA = date(first_ra_code, "YMD")
(2,746 missing values generated)

. format first_ra_codeA %dD/N/CY

. gen time_ra = (date("01Mar2019", "DMY") - first_ra_codeA)/365.25
(2,746 missing values generated)

. sum time_ra, d

                           time_ra
-------------------------------------------------------------
      Percentiles      Smallest
 1%     1.295003      -.0383299
 5%     6.143737      -.0164271
10%     11.48255      -.0164271       Obs               2,254
25%     27.68789        .019165       Sum of Wgt.       2,254

50%     55.17591                      Mean           55.36372
                        Largest       Std. Dev.      31.60848
75%       83.436       109.8508
90%      98.5462       109.8672       Variance       999.0962
95%      103.718       109.9439       Skewness      -.0253542
99%     109.0157       109.9439       Kurtosis       1.786186

. sum number_ra_codes, d

                       number_ra_codes
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            2                      Mean             2.5072
                        Largest       Std. Dev.      1.032745
75%            3              6
90%            4              6       Variance       1.066561
95%            4              6       Skewness       .0673534
99%            5              6       Kurtosis       2.843934

. sum metho_count, d

                         metho_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            3                      Mean             2.5154
                        Largest       Std. Dev.      1.023119
75%            3              6
90%            4              6       Variance       1.046772
95%            4              6       Skewness       .0615468
99%            5              6       Kurtosis        2.90493

. sum sulfa_count, d 

                         sulfa_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            2                      Mean             2.4982
                        Largest       Std. Dev.      1.022451
75%            3              6
90%            4              6       Variance       1.045406
95%            4              6       Skewness       .0632574
99%            5              6       Kurtosis       2.940736

. sum leflu_count, d 

                         leflu_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            3                      Mean             2.5096
                        Largest       Std. Dev.      1.032144
75%            3              6
90%            4              6       Variance       1.065321
95%            4              6       Skewness       .0485101
99%            5              7       Kurtosis       2.991625

. sum hydrox_count, d 

                        hydrox_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            2                      Mean             2.4918
                        Largest       Std. Dev.      1.035252
75%            3              6
90%            4              6       Variance       1.071747
95%            4              6       Skewness       .0522092
99%            5              6       Kurtosis       2.939922

. 
. sum outpatient*, d

                    outpatient_appt_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            2              0       Obs               5,000
25%            6              0       Sum of Wgt.       5,000

50%            7                      Mean             6.7332
                        Largest       Std. Dev.      2.933281
75%            9             13
90%           10             14       Variance       8.604139
95%           11             14       Skewness      -.8588885
99%           12             14       Kurtosis       3.472042

                    outpatient_appt_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               5,000
25%            6              0       Sum of Wgt.       5,000

50%            7                      Mean             6.7204
                        Largest       Std. Dev.      2.954381
75%            9             14
90%           10             14       Variance        8.72837
95%           11             14       Skewness      -.8871281
99%           12             15       Kurtosis       3.447576

                    outpatient_appt_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            2              0       Obs               5,000
25%            6              0       Sum of Wgt.       5,000

50%            7                      Mean             6.7742
                        Largest       Std. Dev.      2.938119
75%            9             13
90%           10             13       Variance       8.632541
95%           11             14       Skewness      -.8818083
99%           12             14       Kurtosis       3.489405

                   outpatient_medium_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               2,484
25%            2              1       Sum of Wgt.       2,484

50%            4                      Mean           13.27899
                        Largest       Std. Dev.       28.2496
75%            7             98
90%            8             98       Variance       798.0401
95%           98             98       Skewness       2.644713
99%           98             98       Kurtosis       8.065284

                   outpatient_medium_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               2,526
25%            2              1       Sum of Wgt.       2,526

50%            5                      Mean           13.73713
                        Largest       Std. Dev.      28.57855
75%            7             98
90%           98             98       Variance       816.7333
95%           98             98       Skewness       2.589031
99%           98             98       Kurtosis       7.771118

                   outpatient_medium_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               2,493
25%            2              1       Sum of Wgt.       2,493

50%            5                      Mean           13.74047
                        Largest       Std. Dev.      28.60153
75%            7             98
90%           98             98       Variance       818.0478
95%           98             98       Skewness       2.586237
99%           98             98       Kurtosis       7.756729

                  outpatient_appt_all_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               5,000
25%            6              0       Sum of Wgt.       5,000

50%            7                      Mean             6.7242
                        Largest       Std. Dev.      2.962953
75%            9             13
90%           10             13       Variance        8.77909
95%           11             13       Skewness      -.8706605
99%           12             14       Kurtosis       3.443204

                  outpatient_appt_all_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               5,000
25%            6              0       Sum of Wgt.       5,000

50%            7                      Mean             6.7076
                        Largest       Std. Dev.      2.967265
75%            9             14
90%           10             14       Variance       8.804663
95%           11             14       Skewness      -.8408435
99%           12             15       Kurtosis        3.44579

                  outpatient_appt_all_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            2              0       Obs               5,000
25%            6              0       Sum of Wgt.       5,000

50%            7                      Mean              6.753
                        Largest       Std. Dev.      2.916452
75%            9             14
90%           10             14       Variance       8.505692
95%           11             14       Skewness      -.8800061
99%           12             14       Kurtosis       3.553387

. 
. forvalues i=2019/2021 {
  2.     sum ra_hosp_beddays_`i' if ra_hosp_`i'>0, d 
  3. }

                    ra_hosp_beddays_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               4,886
25%            2              0       Sum of Wgt.       4,886

50%            3                      Mean           2.523537
                        Largest       Std. Dev.      1.047568
75%            3              6
90%            4              6       Variance       1.097399
95%            4              6       Skewness      -.0029988
99%            5              7       Kurtosis       2.919576

                    ra_hosp_beddays_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               4,886
25%            2              0       Sum of Wgt.       4,886

50%            2                      Mean           2.479124
                        Largest       Std. Dev.      1.059863
75%            3              6
90%            4              6       Variance        1.12331
95%            4              6       Skewness       .0547192
99%            5              6       Kurtosis       2.846063

                    ra_hosp_beddays_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               4,872
25%            2              0       Sum of Wgt.       4,872

50%            3                      Mean           2.504516
                        Largest       Std. Dev.      1.041522
75%            3              6
90%            4              6       Variance       1.084767
95%            4              6       Skewness       .0321512
99%            5              6       Kurtosis       2.894214

. 
. 
. * How many people are not on DMARDs and have no RA appointments?
. 
. * Format variables
. *re-order ethnicity
.  gen eth5=1 if ethnicity==1
(3,976 missing values generated)

.  replace eth5=2 if ethnicity==3
(1,020 real changes made)

.  replace eth5=3 if ethnicity==4
(975 real changes made)

.  replace eth5=4 if ethnicity==2
(989 real changes made)

.  replace eth5=5 if ethnicity==5
(992 real changes made)

.  replace eth5=6 if ethnicity==0
(0 real changes made)

. 
.  label define eth5                      1 "White"                            
>            ///
>                                                         2 "South Asian"      
>                    ///                                             
>                                                         3 "Black"            
>                            ///
>                                                         4 "Mixed"            
>                            ///
>                                                         5 "Other"            
>        ///
>                             6 "Missing"                                 

.                                         
. 
. label values eth5 eth5

. safetab eth5, m
5

       eth5 |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |      1,024       20.48       20.48
South Asian |      1,020       20.40       40.88
      Black |        975       19.50       60.38
      Mixed |        989       19.78       80.16
      Other |        992       19.84      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. 
. * formatting gender
. gen male=(sex=="M")

. replace male = 0 if sex == "F"
(0 real changes made)

. label define male 0"Female" 1"Male"

. label values male male

. safetab male, miss
5

       male |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |      2,509       50.18       50.18
       Male |      2,491       49.82      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. 
. *create a 4 category rural urban variable 
. generate urban_rural_5=.
(5,000 missing values generated)

. la var urban_rural_5 "Rural Urban in five categories"

. replace urban_rural_5=1 if urban_rural==1
(627 real changes made)

. replace urban_rural_5=2 if urban_rural==2
(636 real changes made)

. replace urban_rural_5=3 if urban_rural==3|urban_rural==4
(1,236 real changes made)

. replace urban_rural_5=4 if urban_rural==5|urban_rural==6
(1,233 real changes made)

. replace urban_rural_5=5 if urban_rural==7|urban_rural==8
(1,268 real changes made)

. label define urban_rural_5 1 "Urban major conurbation" 2 "Urban minor conurba
> tion" 3 "Urban city and town" 4 "Rural town and fringe" 5 "Rural village and 
> dispersed"

. label values urban_rural_5 urban_rural_5

. safetab urban_rural_5, miss
14

        Rural Urban in five |
                 categories |      Freq.     Percent        Cum.
----------------------------+-----------------------------------
    Urban major conurbation |        627       12.54       12.54
    Urban minor conurbation |        636       12.72       25.26
        Urban city and town |      1,236       24.72       49.98
      Rural town and fringe |      1,233       24.66       74.64
Rural village and dispersed |      1,268       25.36      100.00
----------------------------+-----------------------------------
                      Total |      5,000      100.00

. 
. *generate a binary rural urban (with missing assigned to urban)
. generate urban_rural_bin=.
(5,000 missing values generated)

. replace urban_rural_bin=1 if urban_rural<=4|urban_rural==.
(2,499 real changes made)

. replace urban_rural_bin=0 if urban_rural>4 & urban_rural!=.
(2,501 real changes made)

. label define urban_rural_bin 0 "Rural" 1 "Urban"

. label values urban_rural_bin urban_rural_bin

. safetab urban_rural_bin urban_rural, miss
28

urban_rura |                      urban_rural
     l_bin |         1          2          3          4          5 |     Total
-----------+-------------------------------------------------------+----------
     Rural |         0          0          0          0        629 |     2,501 
     Urban |       627        636        635        601          0 |     2,499 
-----------+-------------------------------------------------------+----------
     Total |       627        636        635        601        629 |     5,000 


urban_rura |           urban_rural
     l_bin |         6          7          8 |     Total
-----------+---------------------------------+----------
     Rural |       604        605        663 |     2,501 
     Urban |         0          0          0 |     2,499 
-----------+---------------------------------+----------
     Total |       604        605        663 |     5,000 

. label var urban_rural_bin "Rural-Urban"

. 
. * Make missing category for region
. replace region = "missing" if region==""
(0 real changes made)

. * Make numeric region variable 
. gen region_n = 1 if region=="East Midlands"
(4,515 missing values generated)

. replace region_n = 2 if region=="East of England"
(491 real changes made)

. replace region_n = 3 if region=="London"
(988 real changes made)

. replace region_n = 4 if region=="North East"
(506 real changes made)

. replace region_n = 5 if region=="North West"
(519 real changes made)

. replace region_n = 6 if region=="South East"
(1,000 real changes made)

. replace region_n = 7 if region=="South West"
(0 real changes made)

. replace region_n = 8 if region=="West Midlands"
(502 real changes made)

. replace region_n = 9 if region=="Yorkshire and the Humber"
(509 real changes made)

. tab region*, m 

                      |                  region_n
               region |         1          2          3          4 |     Total
----------------------+--------------------------------------------+----------
        East Midlands |       485          0          0          0 |       485 
      East of England |         0        491          0          0 |       491 
               London |         0          0        988          0 |       988 
           North East |         0          0          0        506 |       506 
           North West |         0          0          0          0 |       519 
           South East |         0          0          0          0 |     1,000 
        West Midlands |         0          0          0          0 |       502 
Yorkshire and the H.. |         0          0          0          0 |       509 
----------------------+--------------------------------------------+----------
                Total |       485        491        988        506 |     5,000 


                      |                  region_n
               region |         5          6          8          9 |     Total
----------------------+--------------------------------------------+----------
        East Midlands |         0          0          0          0 |       485 
      East of England |         0          0          0          0 |       491 
               London |         0          0          0          0 |       988 
           North East |         0          0          0          0 |       506 
           North West |       519          0          0          0 |       519 
           South East |         0      1,000          0          0 |     1,000 
        West Midlands |         0          0        502          0 |       502 
Yorkshire and the H.. |         0          0          0        509 |       509 
----------------------+--------------------------------------------+----------
                Total |       519      1,000        502        509 |     5,000 

. 
. * Define age categories
. * Create age categories
. egen age_cat = cut(age), at(18, 40, 60, 80, 120) icodes
(1073 missing values generated)

. label define age 0 "18 - 40 years" 1 "41 - 60 years" 2 "61 - 80 years" 3 ">80
>  years"

. label values age_cat age

. safetab age_cat, miss
8

      age_cat |      Freq.     Percent        Cum.
--------------+-----------------------------------
18 - 40 years |      1,423       28.46       28.46
41 - 60 years |      1,279       25.58       54.04
61 - 80 years |        962       19.24       73.28
    >80 years |        263        5.26       78.54
            . |      1,073       21.46      100.00
--------------+-----------------------------------
        Total |      5,000      100.00

. 
. * Smoking status
. gen smoking = 0 if smoking_status=="N"
(4,494 missing values generated)

. replace smoking = 1 if smoking_status=="S"
(996 real changes made)

. replace smoking = 2 if smoking_status=="E"
(784 real changes made)

. replace smoking = 3 if smoking==.
(2,714 real changes made)

. 
. label define smok 1 "Current smoker" 2 "Ex-smoker" 0 "Never smoked" 3 "Unknow
> n"

. label values smoking smok

. 
. * BMI categories
. egen bmi_cat = cut(bmi), at(0, 1, 18.5, 24.9, 29.9, 39.9, 100) icodes
(1 missing value generated)

. bys bmi_cat: sum bmi

-------------------------------------------------------------------------------
-> bmi_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |      1,008           0           0          0          0

-------------------------------------------------------------------------------
-> bmi_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        466    14.90973    3.171873   3.792555   18.48394

-------------------------------------------------------------------------------
-> bmi_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        914     22.0272    1.829278   18.50423   24.89146

-------------------------------------------------------------------------------
-> bmi_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        968    27.33716    1.422361   24.91101   29.89399

-------------------------------------------------------------------------------
-> bmi_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |      1,387    34.04492     2.65998   29.90162   39.86244

-------------------------------------------------------------------------------
-> bmi_cat = 5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        256    43.37262    2.766644   39.90857   54.91833

-------------------------------------------------------------------------------
-> bmi_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |          1   -3.161769           .  -3.161769  -3.161769


. * add missing . to zero category
. replace bmi_cat = 0 if bmi_cat==. 
(1 real change made)

. label define bmi 0 "Missing" 1 "Underweight" 2 "Healthy range" 3 "Overweight"
>  4 "Obese" 5 "Morbidly obese"

. label values bmi_cat bmi

. 
. * Determine if still in follow-up for each year
. * Format dates
. gen died_fuA = date(died_fu, "YMD")
(2,501 missing values generated)

. gen dereg_dateA = date(dereg_date, "YMD")
(2,514 missing values generated)

. gen end_fu = date("`j'-03-31", "YMD")
(5,000 missing values generated)

. gen end_date = min(died_fuA, dereg_dateA, end_fu)
(1,262 missing values generated)

. drop end_fu

. sum end_date

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    end_date |      3,738    22498.76      331.21      21976      23156

. di "Number where end date prior to follow-up start"
Number where end date prior to follow-up start

. count if end_date<date("2019-04-01", "YMD")
  0

. * determine range of dates for outpatient appointments to determine which sho
> uld be dropped
. gen end_2020 = end_date<date("2020-03-31", "YMD")

. gen end_2021 = end_date<date("2021-03-31", "YMD") 

. gen end_2022 = end_date<date("2022-03-31", "YMD") 

. tab end_2020

   end_2020 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,893       97.86       97.86
          1 |        107        2.14      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. tab end_2021

   end_2021 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,472       69.44       69.44
          1 |      1,528       30.56      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. tab end_2022

   end_2022 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,285       45.70       45.70
          1 |      2,715       54.30      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. 
. * Set outpatient appointment count to missing if end prior to the end of the 
> year 
. forvalues i=2019/2021 {
  2.     local j=`i'+1
  3.     di `j'
  4.     gen op_appt_`i'_orig = outpatient_appt_`i'
  5.     replace outpatient_appt_`i'=. if end_`j'
  6.     gen op_medium_`i'_orig = outpatient_medium_`i'
  7.     replace outpatient_medium_`i'=. if end_`j'
  8.     gen op_appt_all_`i'_orig = outpatient_appt_all_`i'
  9.     replace outpatient_appt_all_`i'=. if end_`j'
 10. }
2020
(107 real changes made, 107 to missing)
(2,516 missing values generated)
(58 real changes made, 58 to missing)
(107 real changes made, 107 to missing)
2021
(1,528 real changes made, 1,528 to missing)
(2,474 missing values generated)
(800 real changes made, 800 to missing)
(1,528 real changes made, 1,528 to missing)
2022
(2,715 real changes made, 2,715 to missing)
(2,507 missing values generated)
(1,359 real changes made, 1,359 to missing)
(2,715 real changes made, 2,715 to missing)

. 
. * Categorise number of outpatient appointments
. label define appt 0 "No appointments" 1 "1-2 per year" 2 "3 or more per year"
>  

. forvalues i=2019/2021 {
  2.     * Rheumatology outpatient appointments
.     egen op_appt_`i'_cat = cut(outpatient_appt_`i'), at(0, 1, 3, 1000) icodes
  3.     * Check all categorised
.     bys op_appt_`i'_cat: sum outpatient_appt_`i'
  4.     label values op_appt_`i'_cat appt
  5.     * Same for orginal variables
.     egen op_appt_`i'_orig_cat = cut(op_appt_`i'_orig), at(0, 1, 3, 1000) icod
> es
  6.     * Check all categorised
.     bys op_appt_`i'_orig_cat: sum op_appt_`i'_orig
  7.     label values op_appt_`i'_orig_cat appt
  8.     }
(107 missing values generated)

-------------------------------------------------------------------------------
-> op_appt_2019_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2019 |        475           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_2019_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2019 |         36    1.833333    .3779645          1          2

-------------------------------------------------------------------------------
-> op_appt_2019_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2019 |      4,382    7.515062     1.96793          3         14

-------------------------------------------------------------------------------
-> op_appt_2019_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2019 |          0


-------------------------------------------------------------------------------
-> op_appt_2019_orig_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2019_orig |        488           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_2019_orig_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2019_orig |         37    1.837838    .3736839          1          2

-------------------------------------------------------------------------------
-> op_appt_2019_orig_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2019_orig |      4,475    7.507933    1.967009          3         14

(1528 missing values generated)

-------------------------------------------------------------------------------
-> op_appt_2020_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2020 |        357           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_2020_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2020 |         19    1.736842    .4524139          1          2

-------------------------------------------------------------------------------
-> op_appt_2020_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2020 |      3,096    7.519703    1.950502          3         15

-------------------------------------------------------------------------------
-> op_appt_2020_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2020 |          0


-------------------------------------------------------------------------------
-> op_appt_2020_orig_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2020_orig |        513           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_2020_orig_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2020_orig |         27    1.777778    .4236593          1          2

-------------------------------------------------------------------------------
-> op_appt_2020_orig_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2020_orig |      4,460    7.523318     1.94823          3         15

(2715 missing values generated)

-------------------------------------------------------------------------------
-> op_appt_2021_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2021 |        227           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_2021_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2021 |         15         1.6    .5070926          1          2

-------------------------------------------------------------------------------
-> op_appt_2021_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2021 |      2,043    7.508566    1.948479          3         14

-------------------------------------------------------------------------------
-> op_appt_2021_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2021 |          0


-------------------------------------------------------------------------------
-> op_appt_2021_orig_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2021_orig |        488           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_2021_orig_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2021_orig |         29    1.724138    .4548588          1          2

-------------------------------------------------------------------------------
-> op_appt_2021_orig_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2021_orig |      4,483    7.544278    1.967834          3         14


. 
. * Calculate difference in rheumatology appointments compared to 2019
. gen diff_op_2020 = outpatient_appt_2020 - outpatient_appt_2019
(1,528 missing values generated)

. gen diff_op_2021 = outpatient_appt_2021 - outpatient_appt_2019
(2,715 missing values generated)

. sum diff_op_2020 diff_op_2021, d

                        diff_op_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%          -10            -13
 5%           -7            -13
10%           -6            -13       Obs               3,472
25%           -2            -12       Sum of Wgt.       3,472

50%            0                      Mean          -.0279378
                        Largest       Std. Dev.      4.160227
75%            2             12
90%            5             12       Variance       17.30749
95%            7             12       Skewness      -.0338069
99%           10             12       Kurtosis       3.174399

                        diff_op_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%          -10            -13
 5%           -7            -12
10%           -5            -12       Obs               2,285
25%           -2            -11       Sum of Wgt.       2,285

50%            0                      Mean          -.0052516
                        Largest       Std. Dev.      4.148932
75%            2             12
90%            5             13       Variance       17.21363
95%            7             13       Skewness      -.0254507
99%           10             13       Kurtosis       3.243611

. 
. * Identify people with no appointments in either year flag them and set diffe
> rence to missing
. forvalues i=2020/2021 {
  2.     gen no_appts_`i' = diff_op_`i'==0 & op_appt_`i'_cat==0
  3.     tab no_appts_`i' op_appt_`i'_cat
  4.     replace diff_op_`i'=. if no_appts_`i'==1
  5. }

no_appts_2 |         op_appt_2020_cat
       020 | No appoin  1-2 per y  3 or more |     Total
-----------+---------------------------------+----------
         0 |       321         19      3,096 |     3,436 
         1 |        36          0          0 |        36 
-----------+---------------------------------+----------
     Total |       357         19      3,096 |     3,472 
(36 real changes made, 36 to missing)

no_appts_2 |         op_appt_2021_cat
       021 | No appoin  1-2 per y  3 or more |     Total
-----------+---------------------------------+----------
         0 |       211         15      2,043 |     2,269 
         1 |        16          0          0 |        16 
-----------+---------------------------------+----------
     Total |       227         15      2,043 |     2,285 
(16 real changes made, 16 to missing)

. 
. * Identify of people with appointments whether they had fewer appointments 
. forvalues i=2020/2021 {
  2.     gen fewer_appts_`i' = (diff_op_`i' < 0) if diff_op_`i'!=.
  3. }
(1,564 missing values generated)
(2,731 missing values generated)

. 
. * Categorise number of outpatient appointments (all specialties)
. label define appt_all 0 "No appointments" 1 "1-2 per year" 2 "3-5 per year" 3
>  "6 or more per year"

. forvalues i=2019/2021 {
  2.     sum outpatient_appt_all_`i', d
  3.     egen op_appt_all_`i'_cat = cut(outpatient_appt_all_`i'), at(0, 1, 3, 6
> , 1000) icodes
  4.     * Check all categorised
.     bys op_appt_all_`i'_cat: sum outpatient_appt_all_`i'
  5.     label values op_appt_all_`i'_cat appt_all
  6.     * Same for orginal variables
.     egen op_appt_all_`i'_orig_cat = cut(op_appt_all_`i'_orig), at(0, 1, 3, 6,
>  1000) icodes
  7.     * Check all categorised
.     bys op_appt_all_`i'_orig_cat: sum op_appt_all_`i'_orig
  8.     label values op_appt_all_`i'_orig_cat appt_all
  9.     }

                  outpatient_appt_all_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               4,893
25%            6              0       Sum of Wgt.       4,893

50%            7                      Mean           6.724504
                        Largest       Std. Dev.      2.959754
75%            9             13
90%           10             13       Variance       8.760146
95%           11             13       Skewness      -.8684238
99%           12             14       Kurtosis       3.448342
(107 missing values generated)

-------------------------------------------------------------------------------
-> op_appt_all_2019_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2019 |        501           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_all_2019_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2019 |         32       1.875    .3360108          1          2

-------------------------------------------------------------------------------
-> op_appt_all_2019_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2019 |        657     4.51446    .6650149          3          5

-------------------------------------------------------------------------------
-> op_appt_all_2019_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2019 |      3,703    8.068323    1.581371          6         14

-------------------------------------------------------------------------------
-> op_appt_all_2019_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2019 |          0


-------------------------------------------------------------------------------
-> op_appt_all_2019_orig_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2019_orig |        514           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_all_2019_orig_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2019_orig |         34    1.882353     .327035          1          2

-------------------------------------------------------------------------------
-> op_appt_all_2019_orig_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2019_orig |        667    4.517241    .6627721          3          5

-------------------------------------------------------------------------------
-> op_appt_all_2019_orig_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2019_orig |      3,785    8.069749    1.580436          6         14


                  outpatient_appt_all_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               3,472
25%            5              0       Sum of Wgt.       3,472

50%            7                      Mean            6.65985
                        Largest       Std. Dev.      2.985284
75%            9             14
90%           10             14       Variance       8.911923
95%           11             14       Skewness      -.8197704
99%           12             15       Kurtosis       3.390351
(1528 missing values generated)

-------------------------------------------------------------------------------
-> op_appt_all_2020_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2020 |        367           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_all_2020_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2020 |         23    1.826087    .3875534          1          2

-------------------------------------------------------------------------------
-> op_appt_all_2020_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2020 |        486    4.502058    .6818682          3          5

-------------------------------------------------------------------------------
-> op_appt_all_2020_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2020 |      2,596    8.048151    1.597563          6         15

-------------------------------------------------------------------------------
-> op_appt_all_2020_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2020 |          0


-------------------------------------------------------------------------------
-> op_appt_all_2020_orig_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2020_orig |        513           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_all_2020_orig_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2020_orig |         34    1.794118    .4104256          1          2

-------------------------------------------------------------------------------
-> op_appt_all_2020_orig_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2020_orig |        685    4.521168    .6742367          3          5

-------------------------------------------------------------------------------
-> op_appt_all_2020_orig_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2020_orig |      3,768    8.062633    1.596653          6         15


                  outpatient_appt_all_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               2,285
25%            5              0       Sum of Wgt.       2,285

50%            7                      Mean           6.623632
                        Largest       Std. Dev.      2.960505
75%            9             13
90%           10             14       Variance        8.76459
95%           10             14       Skewness      -.8710588
99%           12             14       Kurtosis       3.412919
(2715 missing values generated)

-------------------------------------------------------------------------------
-> op_appt_all_2021_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2021 |        247           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_all_2021_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2021 |         11           2           0          2          2

-------------------------------------------------------------------------------
-> op_appt_all_2021_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2021 |        318    4.474843    .6862754          3          5

-------------------------------------------------------------------------------
-> op_appt_all_2021_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2021 |      1,709    8.010532    1.538311          6         14

-------------------------------------------------------------------------------
-> op_appt_all_2021_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2021 |          0


-------------------------------------------------------------------------------
-> op_appt_all_2021_orig_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2021_orig |        487           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_all_2021_orig_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2021_orig |         27    1.888889    .3202563          1          2

-------------------------------------------------------------------------------
-> op_appt_all_2021_orig_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2021_orig |        675    4.474074    .6915088          3          5

-------------------------------------------------------------------------------
-> op_appt_all_2021_orig_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2021_orig |      3,811    8.054054    1.569966          6         14


. 
. * Calculate difference in all outpatient appointments compared to 2019
. gen diff_op_all_2020 = outpatient_appt_all_2020 - outpatient_appt_all_2019
(1,528 missing values generated)

. gen diff_op_all_2021 = outpatient_appt_all_2021 - outpatient_appt_all_2019
(2,715 missing values generated)

. sum diff_op_all_2020 diff_op_all_2021, d

                      diff_op_all_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%          -10            -13
 5%           -8            -13
10%           -6            -13       Obs               3,472
25%           -2            -12       Sum of Wgt.       3,472

50%            0                      Mean          -.0385945
                        Largest       Std. Dev.      4.233219
75%            2             13
90%            6             13       Variance       17.92015
95%            7             13       Skewness       .0028716
99%           10             13       Kurtosis       3.218774

                      diff_op_all_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%          -10            -13
 5%           -8            -12
10%           -6            -11       Obs               2,285
25%           -2            -11       Sum of Wgt.       2,285

50%            0                      Mean          -.0827133
                        Largest       Std. Dev.      4.237238
75%            2             11
90%            5             11       Variance       17.95419
95%            7             12       Skewness      -.0035352
99%           10             12       Kurtosis       3.066747

. 
. * Identify people with no appointments in either year flag them and set diffe
> rence to missing
. forvalues i=2020/2021 {
  2.     gen no_appts_all_`i' = diff_op_all_`i'==0 & op_appt_all_`i'_cat==0
  3.     tab no_appts_all_`i' op_appt_all_`i'_cat
  4.     replace diff_op_all_`i'=. if no_appts_all_`i'==1
  5.     }

no_appts_a |            op_appt_all_2020_cat
   ll_2020 | No appoin  1-2 per y  3-5 per y  6 or more |     Total
-----------+--------------------------------------------+----------
         0 |       333         23        486      2,596 |     3,438 
         1 |        34          0          0          0 |        34 
-----------+--------------------------------------------+----------
     Total |       367         23        486      2,596 |     3,472 
(34 real changes made, 34 to missing)

no_appts_a |            op_appt_all_2021_cat
   ll_2021 | No appoin  1-2 per y  3-5 per y  6 or more |     Total
-----------+--------------------------------------------+----------
         0 |       226         11        318      1,709 |     2,264 
         1 |        21          0          0          0 |        21 
-----------+--------------------------------------------+----------
     Total |       247         11        318      1,709 |     2,285 
(21 real changes made, 21 to missing)

. 
. * Identify of people with appointments whether they had fewer appointments 
. forvalues i=2020/2021 {
  2.     gen fewer_appts_all_`i' = (diff_op_all_`i' < 0) if diff_op_all_`i'!=.
  3. }
(1,562 missing values generated)
(2,736 missing values generated)

. 
. preserve

. * Tabulate number of rheumatology appointments per year of those with whole y
> ear available
. table1_mc, vars(op_appt_2019_cat cate \ op_appt_2020_cat cate \ op_appt_2021_
> cat cate \ no_appts_2020 cate \ no_appts_2021 cate \ fewer_appts_2020 cate \ 
> fewer_appts_2021 cate) clear

  +----------------------------------+
  | factor               N_1     m_1 |
  |----------------------------------|
  | op_appt_2019_cat   4,893     107 |
  |----------------------------------|
  | op_appt_2020_cat   3,472   1,528 |
  |----------------------------------|
  | op_appt_2021_cat   2,285   2,715 |
  |----------------------------------|
  | no_appts_2020      5,000       0 |
  |----------------------------------|
  | no_appts_2021      5,000       0 |
  |----------------------------------|
  | fewer_appts_2020   3,436   1,564 |
  |----------------------------------|
  | fewer_appts_2021   2,269   2,731 |
  +----------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +-------------------------------------------------------+
  |                                         Total         |
  |-------------------------------------------------------|
  |                                         N=5,000       |
  |-------------------------------------------------------|
  | op_appt_2019_cat   No appointments      475 ( 9.7%)   |
  |                    1-2 per year         36 ( 0.7%)    |
  |                    3 or more per year   4,382 (89.6%) |
  |-------------------------------------------------------|
  | op_appt_2020_cat   No appointments      357 (10.3%)   |
  |                    1-2 per year         19 ( 0.5%)    |
  |                    3 or more per year   3,096 (89.2%) |
  |-------------------------------------------------------|
  | op_appt_2021_cat   No appointments      227 ( 9.9%)   |
  |                    1-2 per year         15 ( 0.7%)    |
  |                    3 or more per year   2,043 (89.4%) |
  |-------------------------------------------------------|
  | no_appts_2020      0                    4,964 (99.3%) |
  |                    1                    36 ( 0.7%)    |
  |-------------------------------------------------------|
  | no_appts_2021      0                    4,984 (99.7%) |
  |                    1                    16 ( 0.3%)    |
  |-------------------------------------------------------|
  | fewer_appts_2020   0                    1,925 (56.0%) |
  |                    1                    1,511 (44.0%) |
  |-------------------------------------------------------|
  | fewer_appts_2021   0                    1,291 (56.9%) |
  |                    1                    978 (43.1%)   |
  +-------------------------------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/op_appt_yrs.csv
file ./output/tables/op_appt_yrs.csv saved

. restore 

. preserve

. * Tabulate number of rheumatology appointments per year (includes people who 
> end follow-up during year)
. table1_mc, vars(op_appt_2019_orig_cat cate \ op_appt_2020_orig_cat cate \ op_
> appt_2021_orig_cat cate) clear

  +-------------------------------------+
  | factor                    N_1   m_1 |
  |-------------------------------------|
  | op_appt_2019_orig_cat   5,000     0 |
  |-------------------------------------|
  | op_appt_2020_orig_cat   5,000     0 |
  |-------------------------------------|
  | op_appt_2021_orig_cat   5,000     0 |
  +-------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +------------------------------------------------------------+
  |                                              Total         |
  |------------------------------------------------------------|
  |                                              N=5,000       |
  |------------------------------------------------------------|
  | op_appt_2019_orig_cat   No appointments      488 ( 9.8%)   |
  |                         1-2 per year         37 ( 0.7%)    |
  |                         3 or more per year   4,475 (89.5%) |
  |------------------------------------------------------------|
  | op_appt_2020_orig_cat   No appointments      513 (10.3%)   |
  |                         1-2 per year         27 ( 0.5%)    |
  |                         3 or more per year   4,460 (89.2%) |
  |------------------------------------------------------------|
  | op_appt_2021_orig_cat   No appointments      488 ( 9.8%)   |
  |                         1-2 per year         29 ( 0.6%)    |
  |                         3 or more per year   4,483 (89.7%) |
  +------------------------------------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/op_appt_orig_yrs.csv
file ./output/tables/op_appt_orig_yrs.csv saved

. restore 

. preserve

. * Tabulate number of all outpatient appointments per year of those with whole
>  year available
. table1_mc, vars(op_appt_all_2019_cat cate \ op_appt_all_2020_cat cate \ op_ap
> pt_all_2021_cat cate \ no_appts_all_2020 cate \ no_appts_all_2021 cate \ fewe
> r_appts_all_2020 cate \ fewer_appts_all_2021 cate) clear

  +--------------------------------------+
  | factor                   N_1     m_1 |
  |--------------------------------------|
  | op_appt_all_2019_cat   4,893     107 |
  |--------------------------------------|
  | op_appt_all_2020_cat   3,472   1,528 |
  |--------------------------------------|
  | op_appt_all_2021_cat   2,285   2,715 |
  |--------------------------------------|
  | no_appts_all_2020      5,000       0 |
  |--------------------------------------|
  | no_appts_all_2021      5,000       0 |
  |--------------------------------------|
  | fewer_appts_all_2020   3,438   1,562 |
  |--------------------------------------|
  | fewer_appts_all_2021   2,264   2,736 |
  +--------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +-----------------------------------------------------------+
  |                                             Total         |
  |-----------------------------------------------------------|
  |                                             N=5,000       |
  |-----------------------------------------------------------|
  | op_appt_all_2019_cat   No appointments      501 (10.2%)   |
  |                        1-2 per year         32 ( 0.7%)    |
  |                        3-5 per year         657 (13.4%)   |
  |                        6 or more per year   3,703 (75.7%) |
  |-----------------------------------------------------------|
  | op_appt_all_2020_cat   No appointments      367 (10.6%)   |
  |                        1-2 per year         23 ( 0.7%)    |
  |                        3-5 per year         486 (14.0%)   |
  |                        6 or more per year   2,596 (74.8%) |
  |-----------------------------------------------------------|
  | op_appt_all_2021_cat   No appointments      247 (10.8%)   |
  |                        1-2 per year         11 ( 0.5%)    |
  |                        3-5 per year         318 (13.9%)   |
  |                        6 or more per year   1,709 (74.8%) |
  |-----------------------------------------------------------|
  | no_appts_all_2020      0                    4,966 (99.3%) |
  |                        1                    34 ( 0.7%)    |
  |-----------------------------------------------------------|
  | no_appts_all_2021      0                    4,979 (99.6%) |
  |                        1                    21 ( 0.4%)    |
  |-----------------------------------------------------------|
  | fewer_appts_all_2020   0                    1,908 (55.5%) |
  |                        1                    1,530 (44.5%) |
  |-----------------------------------------------------------|
  | fewer_appts_all_2021   0                    1,250 (55.2%) |
  |                        1                    1,014 (44.8%) |
  +-----------------------------------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/op_appt_all_yrs.csv
file ./output/tables/op_appt_all_yrs.csv saved

. restore 

. * Tabulate overall characteristics 
. preserve

. table1_mc, vars(age_cat cate \ male cate \ urban_rural_bin cate \ region cate
>  \ imd cate \  smoking cate \ time_ra contn \ bmi_cat cate \ eth5 cate) clear

  +-----------------------------+
  | factor          N_1     m_1 |
  |-----------------------------|
  | age_cat       3,927   1,073 |
  |-----------------------------|
  | male          5,000       0 |
  |-----------------------------|
  | Rural-Urban   5,000       0 |
  |-----------------------------|
  | region        5,000       0 |
  |-----------------------------|
  | imd           5,000       0 |
  |-----------------------------|
  | smoking       5,000       0 |
  |-----------------------------|
  | time_ra       2,254   2,746 |
  |-----------------------------|
  | bmi_cat       5,000       0 |
  |-----------------------------|
  | eth5          5,000       0 |
  +-----------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------------------+
  |                                          Total               |
  |--------------------------------------------------------------|
  |                                          N=5,000             |
  |--------------------------------------------------------------|
  | age_cat       18 - 40 years              1,423 (36.2%)       |
  |               41 - 60 years              1,279 (32.6%)       |
  |               61 - 80 years              962 (24.5%)         |
  |               >80 years                  263 ( 6.7%)         |
  |--------------------------------------------------------------|
  | male          Female                     2,509 (50.2%)       |
  |               Male                       2,491 (49.8%)       |
  |--------------------------------------------------------------|
  | Rural-Urban   Rural                      2,501 (50.0%)       |
  |               Urban                      2,499 (50.0%)       |
  |--------------------------------------------------------------|
  | region        East Midlands              485 ( 9.7%)         |
  |               East of England            491 ( 9.8%)         |
  |               London                     988 (19.8%)         |
  |               North East                 506 (10.1%)         |
  |               North West                 519 (10.4%)         |
  |               South East                 1,000 (20.0%)       |
  |               West Midlands              502 (10.0%)         |
  |               Yorkshire and the Humber   509 (10.2%)         |
  |--------------------------------------------------------------|
  | imd           0                          252 ( 5.0%)         |
  |               1                          955 (19.1%)         |
  |               2                          955 (19.1%)         |
  |               3                          969 (19.4%)         |
  |               4                          931 (18.6%)         |
  |               5                          938 (18.8%)         |
  |--------------------------------------------------------------|
  | smoking       Never smoked               506 (10.1%)         |
  |               Current smoker             996 (19.9%)         |
  |               Ex-smoker                  784 (15.7%)         |
  |               Unknown                    2,714 (54.3%)       |
  |--------------------------------------------------------------|
  | time_ra                                  55.36372 (31.60848) |
  |--------------------------------------------------------------|
  | bmi_cat       Missing                    1,009 (20.2%)       |
  |               Underweight                466 ( 9.3%)         |
  |               Healthy range              914 (18.3%)         |
  |               Overweight                 968 (19.4%)         |
  |               Obese                      1,387 (27.7%)       |
  |               Morbidly obese             256 ( 5.1%)         |
  |--------------------------------------------------------------|
  | eth5          White                      1,024 (20.5%)       |
  |               South Asian                1,020 (20.4%)       |
  |               Black                      975 (19.5%)         |
  |               Mixed                      989 (19.8%)         |
  |               Other                      992 (19.8%)         |
  +--------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 

. export delimited using ./output/tables/op_chars.csv
file ./output/tables/op_chars.csv saved

. * Rounding numbers in table to nearest 5
. describe

Contains data from /tmp/St00015.000005
  obs:            40                          
 vars:             7                          26 May 2023 15:54
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
factor          str18   %-18s                 Factor
level           str24   %-24s                 Level
Total           str19   %-19s                 Total
N_1             str5    %9s                   
m_1             str5    %9s                   
_columna_1      str11   %6s                   1 _columna_
_columnb_1      str11   %-11s                 1 _columnb_
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. destring _columna_1, gen(n) ignore(",") force
_columna_1: contains nonnumeric characters not specified in ignore()
_columna_1: character , removed; n generated as double
(2 missing values generated)

. destring _columnb_1, gen(percent) ignore("-" "%" "(" ")") force
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent generated as double
(2 missing values generated)

. gen rounded_n = round(n, 5)
(2 missing values generated)

. keep factor level rounded_n percent

. export delimited using ./output/tables/op_chars_rounded.csv
file ./output/tables/op_chars_rounded.csv saved

. restore

. * Tabulate characteristics by category of outpatient appointments for each ye
> ar
. tempfile tempfile

. forvalues i=2019/2021 {
  2.     preserve
  3.     keep if op_appt_`i'_cat==0
  4.     table1_mc, vars(age_cat cate \ male cate \ urban_rural_bin cate \ regi
> on cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat cate \ eth5 cate)
>  clear
  5.     save `tempfile', replace
  6.     restore
  7.     forvalues j=1/2 {
  8.         preserve
  9.         keep if op_appt_`i'_cat==`j'
 10.         table1_mc, vars(age_cat cate \ male cate \ urban_rural_bin cate \ 
> region cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat cate \ eth5 c
> ate) clear
 11.         append using `tempfile'
 12.         save `tempfile', replace
 13.         if `j'==2 {
 14.             export delimited using ./output/tables/characteristics_strata`
> i'.csv
 15.             destring _columna_1, gen(n) ignore(",") force
 16.             destring _columnb_1, gen(percent) ignore("-" "%" "(" ")") forc
> e
 17.             gen rounded_n = round(n, 5)
 18.             keep factor level rounded_n percent
 19.             export delimited using ./output/tables/characteristics_strata`
> i'_rounded.csv
 20.         }
 21.         restore
 22.     }
 23.     * Characteristics by whether prescribed specific drugs 
.     * Weak opioids 
.     preserve
 24.     table1_mc, vars(age_cat cat \ male cat \ urban_rural_bin cat \ region 
> cat \ imd cat) by(prescribed_weak_opioids) clear
 25.     export delimited using ./output/tables/drug_weak_op_chars.csv
 26.     * Rounding numbers in table to nearest 5
.     destring _columna_1, gen(n1) ignore(",") force
 27.     destring _columna_0, gen(n0) ignore(",") force
 28.     destring _columnb_1, gen(percent1) ignore("-" "%" "(" ")")  force
 29.     destring _columnb_0, gen(percent0) ignore("-" "%" "(" ")")  force
 30.     gen rounded_n1 = round(n1, 5)
 31.     gen rounded_n0 = round(n0, 5)
 32.     keep factor level rounded_n0 percent0 rounded_n1 percent1
 33.     export delimited using ./output/tables/drug_weak_op_chars_rounded.csv
 34.     restore
 35.     
.     *Strong opioids 
.     table1_mc, vars(age_cat cat \ male cat \ urban_rural_bin cat \ region cat
>  \ imd cat) by(prescribed_strong_opioids) clear
 36.     export delimited using ./output/tables/drug_strong_op_chars.csv
 37.     * Rounding numbers in table to nearest 5
.     destring _columna_1, gen(n1) ignore(",") force
 38.     destring _columna_0, gen(n0) ignore(",") force
 39.     destring _columnb_1, gen(percent1) ignore("-" "%" "(" ")")  force
 40.     destring _columnb_0, gen(percent0) ignore("-" "%" "(" ")")  force
 41.     gen rounded_n1 = round(n1, 5)
 42.     gen rounded_n0 = round(n0, 5)
 43.     keep factor level rounded_n0 percent0 rounded_n1 percent1
 44.     export delimited using ./output/tables/drug_strong_op_chars_rounded.cs
> v
 45.     restore
 46. 
.     *GCs 
.     table1_mc, vars(age_cat cat \ male cat \ urban_rural_bin cat \ region cat
>  \ imd cat) by(prescribed_gcs) clear
 47.     export delimited using ./output/tables/drug_gc_chars.csv
 48.     * Rounding numbers in table to nearest 5
.     destring _columna_1, gen(n1) ignore(",") force
 49.     destring _columna_0, gen(n0) ignore(",") force
 50.     destring _columnb_1, gen(percent1) ignore("-" "%" "(" ")")  force
 51.     destring _columnb_0, gen(percent0) ignore("-" "%" "(" ")")  force
 52.     gen rounded_n1 = round(n1, 5)
 53.     gen rounded_n0 = round(n0, 5)
 54.     keep factor level rounded_n0 percent0 rounded_n1 percent1
 55.     export delimited using ./output/tables/drug_gc_chars_rounded.csv
 56.     restore
 57. 
.     /* Tabulate characteristics by whether hospitalised with RA for each year
>     preserve
>     keep if ra_hosp_`i'==0
>     table1_mc, vars(age_cat cate \ male cate \ urban_rural_5 cate \ prescribe
> d_biologics cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat cate) cl
> ear
>     save `tempfile', replace
>     restore
>     preserve
>     keep if ra_hosp_`i'==1
>     table1_mc, vars(age_cat cate \ male cate \ urban_rural_5 cate \ prescribe
> d_biologics cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat cate) cl
> ear
>     append using `tempfile'
>     save `tempfile', replace
>     export delimited using ./output/tables/characteristics_ra_hosp_`i'.csv
>     restore*/
.     }
(4,525 observations deleted)

  +-------------------------+
  | factor        N_1   m_1 |
  |-------------------------|
  | age_cat       377    98 |
  |-------------------------|
  | male          475     0 |
  |-------------------------|
  | Rural-Urban   475     0 |
  |-------------------------|
  | region        475     0 |
  |-------------------------|
  | imd           475     0 |
  |-------------------------|
  | smoking       475     0 |
  |-------------------------|
  | time_ra       204   271 |
  |-------------------------|
  | bmi_cat       475     0 |
  |-------------------------|
  | eth5          475     0 |
  +-------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------------------+
  |                                          Total               |
  |--------------------------------------------------------------|
  |                                          N=475               |
  |--------------------------------------------------------------|
  | age_cat       18 - 40 years              128 (34.0%)         |
  |               41 - 60 years              138 (36.6%)         |
  |               61 - 80 years              85 (22.5%)          |
  |               >80 years                  26 ( 6.9%)          |
  |--------------------------------------------------------------|
  | male          Female                     229 (48.2%)         |
  |               Male                       246 (51.8%)         |
  |--------------------------------------------------------------|
  | Rural-Urban   Rural                      245 (51.6%)         |
  |               Urban                      230 (48.4%)         |
  |--------------------------------------------------------------|
  | region        East Midlands              49 (10.3%)          |
  |               East of England            39 ( 8.2%)          |
  |               London                     89 (18.7%)          |
  |               North East                 58 (12.2%)          |
  |               North West                 55 (11.6%)          |
  |               South East                 91 (19.2%)          |
  |               West Midlands              48 (10.1%)          |
  |               Yorkshire and the Humber   46 ( 9.7%)          |
  |--------------------------------------------------------------|
  | imd           0                          21 ( 4.4%)          |
  |               1                          91 (19.2%)          |
  |               2                          94 (19.8%)          |
  |               3                          87 (18.3%)          |
  |               4                          87 (18.3%)          |
  |               5                          95 (20.0%)          |
  |--------------------------------------------------------------|
  | smoking       Never smoked               45 ( 9.5%)          |
  |               Current smoker             103 (21.7%)         |
  |               Ex-smoker                  73 (15.4%)          |
  |               Unknown                    254 (53.5%)         |
  |--------------------------------------------------------------|
  | time_ra                                  57.35047 (30.77057) |
  |--------------------------------------------------------------|
  | bmi_cat       Missing                    102 (21.5%)         |
  |               Underweight                39 ( 8.2%)          |
  |               Healthy range              102 (21.5%)         |
  |               Overweight                 96 (20.2%)          |
  |               Obese                      119 (25.1%)         |
  |               Morbidly obese             17 ( 3.6%)          |
  |--------------------------------------------------------------|
  | eth5          White                      110 (23.2%)         |
  |               South Asian                83 (17.5%)          |
  |               Black                      88 (18.5%)          |
  |               Mixed                      89 (18.7%)          |
  |               Other                      105 (22.1%)         |
  +--------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
(note: file /tmp/St00015.000005 not found)
file /tmp/St00015.000005 saved
(4,964 observations deleted)

  +-------------------------+
  | factor        N_1   m_1 |
  |-------------------------|
  | age_cat        27     9 |
  |-------------------------|
  | male           36     0 |
  |-------------------------|
  | Rural-Urban    36     0 |
  |-------------------------|
  | region         36     0 |
  |-------------------------|
  | imd            36     0 |
  |-------------------------|
  | smoking        36     0 |
  |-------------------------|
  | time_ra        19    17 |
  |-------------------------|
  | bmi_cat        36     0 |
  |-------------------------|
  | eth5           36     0 |
  +-------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------------------+
  |                                          Total               |
  |--------------------------------------------------------------|
  |                                          N=36                |
  |--------------------------------------------------------------|
  | age_cat       18 - 40 years              11 (41%)            |
  |               41 - 60 years              5 (19%)             |
  |               61 - 80 years              9 (33%)             |
  |               >80 years                  2 ( 7%)             |
  |--------------------------------------------------------------|
  | male          Female                     15 (42%)            |
  |               Male                       21 (58%)            |
  |--------------------------------------------------------------|
  | Rural-Urban   Rural                      22 (61%)            |
  |               Urban                      14 (39%)            |
  |--------------------------------------------------------------|
  | region        East Midlands              1 ( 3%)             |
  |               East of England            4 (11%)             |
  |               London                     4 (11%)             |
  |               North East                 1 ( 3%)             |
  |               North West                 4 (11%)             |
  |               South East                 10 (28%)            |
  |               West Midlands              7 (19%)             |
  |               Yorkshire and the Humber   5 (14%)             |
  |--------------------------------------------------------------|
  | imd           0                          3 ( 8%)             |
  |               1                          9 (25%)             |
  |               2                          11 (31%)            |
  |               3                          5 (14%)             |
  |               4                          4 (11%)             |
  |               5                          4 (11%)             |
  |--------------------------------------------------------------|
  | smoking       Never smoked               5 (14%)             |
  |               Current smoker             7 (19%)             |
  |               Ex-smoker                  12 (33%)            |
  |               Unknown                    12 (33%)            |
  |--------------------------------------------------------------|
  | time_ra                                  51.66742 (31.42741) |
  |--------------------------------------------------------------|
  | bmi_cat       Missing                    5 (14%)             |
  |               Underweight                3 ( 8%)             |
  |               Healthy range              6 (17%)             |
  |               Overweight                 11 (31%)            |
  |               Obese                      9 (25%)             |
  |               Morbidly obese             2 ( 6%)             |
  |--------------------------------------------------------------|
  | eth5          White                      5 (14%)             |
  |               South Asian                5 (14%)             |
  |               Black                      9 (25%)             |
  |               Mixed                      7 (19%)             |
  |               Other                      10 (28%)            |
  +--------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.000005 saved
(618 observations deleted)

  +-----------------------------+
  | factor          N_1     m_1 |
  |-----------------------------|
  | age_cat       3,440     942 |
  |-----------------------------|
  | male          4,382       0 |
  |-----------------------------|
  | Rural-Urban   4,382       0 |
  |-----------------------------|
  | region        4,382       0 |
  |-----------------------------|
  | imd           4,382       0 |
  |-----------------------------|
  | smoking       4,382       0 |
  |-----------------------------|
  | time_ra       1,981   2,401 |
  |-----------------------------|
  | bmi_cat       4,382       0 |
  |-----------------------------|
  | eth5          4,382       0 |
  +-----------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------------------+
  |                                          Total               |
  |--------------------------------------------------------------|
  |                                          N=4,382             |
  |--------------------------------------------------------------|
  | age_cat       18 - 40 years              1,249 (36.3%)       |
  |               41 - 60 years              1,115 (32.4%)       |
  |               61 - 80 years              843 (24.5%)         |
  |               >80 years                  233 ( 6.8%)         |
  |--------------------------------------------------------------|
  | male          Female                     2,216 (50.6%)       |
  |               Male                       2,166 (49.4%)       |
  |--------------------------------------------------------------|
  | Rural-Urban   Rural                      2,180 (49.7%)       |
  |               Urban                      2,202 (50.3%)       |
  |--------------------------------------------------------------|
  | region        East Midlands              426 ( 9.7%)         |
  |               East of England            435 ( 9.9%)         |
  |               London                     884 (20.2%)         |
  |               North East                 433 ( 9.9%)         |
  |               North West                 451 (10.3%)         |
  |               South East                 872 (19.9%)         |
  |               West Midlands              434 ( 9.9%)         |
  |               Yorkshire and the Humber   447 (10.2%)         |
  |--------------------------------------------------------------|
  | imd           0                          222 ( 5.1%)         |
  |               1                          836 (19.1%)         |
  |               2                          828 (18.9%)         |
  |               3                          855 (19.5%)         |
  |               4                          818 (18.7%)         |
  |               5                          823 (18.8%)         |
  |--------------------------------------------------------------|
  | smoking       Never smoked               444 (10.1%)         |
  |               Current smoker             864 (19.7%)         |
  |               Ex-smoker                  689 (15.7%)         |
  |               Unknown                    2,385 (54.4%)       |
  |--------------------------------------------------------------|
  | time_ra                                  55.26799 (31.70133) |
  |--------------------------------------------------------------|
  | bmi_cat       Missing                    880 (20.1%)         |
  |               Underweight                409 ( 9.3%)         |
  |               Healthy range              786 (17.9%)         |
  |               Overweight                 843 (19.2%)         |
  |               Obese                      1,236 (28.2%)       |
  |               Morbidly obese             228 ( 5.2%)         |
  |--------------------------------------------------------------|
  | eth5          White                      887 (20.2%)         |
  |               South Asian                910 (20.8%)         |
  |               Black                      858 (19.6%)         |
  |               Mixed                      873 (19.9%)         |
  |               Other                      854 (19.5%)         |
  +--------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.000005 saved
file ./output/tables/characteristics_strata2019.csv saved
_columna_1: contains nonnumeric characters not specified in ignore()
_columna_1: character , removed; n generated as double
(6 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent generated as double
(6 missing values generated)
(6 missing values generated)
file ./output/tables/characteristics_strata2019_rounded.csv saved

  +-----------------------------------------+
  | factor          N_0     N_1   m_0   m_1 |
  |-----------------------------------------|
  | age_cat       1,965   1,962   512   561 |
  |-----------------------------------------|
  | male          2,477   2,523     0     0 |
  |-----------------------------------------|
  | Rural-Urban   2,477   2,523     0     0 |
  |-----------------------------------------|
  | region        2,477   2,523     0     0 |
  |-----------------------------------------|
  | imd           2,477   2,523     0     0 |
  +-----------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> ----------------------------------+
  |                                          prescribed_weak_opioids = 0   pres
> cribed_weak_opioids = 1   p-value |
  |----------------------------------------------------------------------------
> ----------------------------------|
  |                                          N=2,477                       N=2,
> 523                               |
  |----------------------------------------------------------------------------
> ----------------------------------|
  | age_cat       18 - 40 years              705 (35.9%)                   718 
> (36.6%)                    0.80   |
  |               41 - 60 years              642 (32.7%)                   637 
> (32.5%)                           |
  |               61 - 80 years              479 (24.4%)                   483 
> (24.6%)                           |
  |               >80 years                  139 ( 7.1%)                   124 
> ( 6.3%)                           |
  |----------------------------------------------------------------------------
> ----------------------------------|
  | male          Female                     1,204 (48.6%)                 1,30
> 5 (51.7%)                  0.028  |
  |               Male                       1,273 (51.4%)                 1,21
> 8 (48.3%)                         |
  |----------------------------------------------------------------------------
> ----------------------------------|
  | Rural-Urban   Rural                      1,241 (50.1%)                 1,26
> 0 (49.9%)                  0.91   |
  |               Urban                      1,236 (49.9%)                 1,26
> 3 (50.1%)                         |
  |----------------------------------------------------------------------------
> ----------------------------------|
  | region        East Midlands              226 ( 9.1%)                   259 
> (10.3%)                    0.20   |
  |               East of England            250 (10.1%)                   241 
> ( 9.6%)                           |
  |               London                     485 (19.6%)                   503 
> (19.9%)                           |
  |               North East                 271 (10.9%)                   235 
> ( 9.3%)                           |
  |               North West                 257 (10.4%)                   262 
> (10.4%)                           |
  |               South East                 476 (19.2%)                   524 
> (20.8%)                           |
  |               West Midlands              242 ( 9.8%)                   260 
> (10.3%)                           |
  |               Yorkshire and the Humber   270 (10.9%)                   239 
> ( 9.5%)                           |
  |----------------------------------------------------------------------------
> ----------------------------------|
  | imd           0                          127 ( 5.1%)                   125 
> ( 5.0%)                    0.84   |
  |               1                          456 (18.4%)                   499 
> (19.8%)                           |
  |               2                          483 (19.5%)                   472 
> (18.7%)                           |
  |               3                          488 (19.7%)                   481 
> (19.1%)                           |
  |               4                          457 (18.4%)                   474 
> (18.8%)                           |
  |               5                          466 (18.8%)                   472 
> (18.7%)                           |
  +----------------------------------------------------------------------------
> ----------------------------------+
Data are presented as n (%).
 
file ./output/tables/drug_weak_op_chars.csv saved
_columna_1: contains nonnumeric characters not specified in ignore()
_columna_1: character , removed; n1 generated as int
(2 missing values generated)
_columna_0: contains nonnumeric characters not specified in ignore()
_columna_0: character , removed; n0 generated as int
(2 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent1 generated as double
(2 missing values generated)
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
file ./output/tables/drug_weak_op_chars_rounded.csv saved

  +-----------------------------------------+
  | factor          N_0     N_1   m_0   m_1 |
  |-----------------------------------------|
  | age_cat       2,001   1,926   553   520 |
  |-----------------------------------------|
  | male          2,554   2,446     0     0 |
  |-----------------------------------------|
  | Rural-Urban   2,554   2,446     0     0 |
  |-----------------------------------------|
  | region        2,554   2,446     0     0 |
  |-----------------------------------------|
  | imd           2,554   2,446     0     0 |
  +-----------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------------------------------------+
  |                                          prescribed_strong_opioids = 0   pr
> escribed_strong_opioids = 1   p-value |
  |----------------------------------------------------------------------------
> --------------------------------------|
  |                                          N=2,554                         N=
> 2,446                                 |
  |----------------------------------------------------------------------------
> --------------------------------------|
  | age_cat       18 - 40 years              753 (37.6%)                     67
> 0 (34.8%)                      0.33   |
  |               41 - 60 years              638 (31.9%)                     64
> 1 (33.3%)                             |
  |               61 - 80 years              479 (23.9%)                     48
> 3 (25.1%)                             |
  |               >80 years                  131 ( 6.5%)                     13
> 2 ( 6.9%)                             |
  |----------------------------------------------------------------------------
> --------------------------------------|
  | male          Female                     1,293 (50.6%)                   1,
> 216 (49.7%)                    0.52   |
  |               Male                       1,261 (49.4%)                   1,
> 230 (50.3%)                           |
  |----------------------------------------------------------------------------
> --------------------------------------|
  | Rural-Urban   Rural                      1,293 (50.6%)                   1,
> 208 (49.4%)                    0.38   |
  |               Urban                      1,261 (49.4%)                   1,
> 238 (50.6%)                           |
  |----------------------------------------------------------------------------
> --------------------------------------|
  | region        East Midlands              261 (10.2%)                     22
> 4 ( 9.2%)                      0.83   |
  |               East of England            254 ( 9.9%)                     23
> 7 ( 9.7%)                             |
  |               London                     489 (19.1%)                     49
> 9 (20.4%)                             |
  |               North East                 261 (10.2%)                     24
> 5 (10.0%)                             |
  |               North West                 260 (10.2%)                     25
> 9 (10.6%)                             |
  |               South East                 506 (19.8%)                     49
> 4 (20.2%)                             |
  |               West Midlands              254 ( 9.9%)                     24
> 8 (10.1%)                             |
  |               Yorkshire and the Humber   269 (10.5%)                     24
> 0 ( 9.8%)                             |
  |----------------------------------------------------------------------------
> --------------------------------------|
  | imd           0                          125 ( 4.9%)                     12
> 7 ( 5.2%)                      0.18   |
  |               1                          480 (18.8%)                     47
> 5 (19.4%)                             |
  |               2                          492 (19.3%)                     46
> 3 (18.9%)                             |
  |               3                          483 (18.9%)                     48
> 6 (19.9%)                             |
  |               4                          511 (20.0%)                     42
> 0 (17.2%)                             |
  |               5                          463 (18.1%)                     47
> 5 (19.4%)                             |
  +----------------------------------------------------------------------------
> --------------------------------------+
Data are presented as n (%).
 
file ./output/tables/drug_strong_op_chars.csv saved
_columna_1: contains nonnumeric characters not specified in ignore()
_columna_1: character , removed; n1 generated as int
(2 missing values generated)
_columna_0: contains nonnumeric characters not specified in ignore()
_columna_0: character , removed; n0 generated as int
(2 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent1 generated as double
(2 missing values generated)
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
file ./output/tables/drug_strong_op_chars_rounded.csv saved
nothing to restore
r(622);

end of do-file
r(622);

end of do-file

r(622);


