
. 
. cap mkdir ./output/tables/

. cap mkdir ./output/tempdata

. 
. * Import data
. import delimited using ./output/input.csv
(51 vars, 10,000 obs)

. * Check data
. count if age==. 
  0

. count if age<18 
  2,109

. count if age>110 & age!=.
  0

. sum age, d

                             age
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            4              0
10%            8              0       Obs              10,000
25%           21              0       Sum of Wgt.      10,000

50%           39                      Mean             40.081
                        Largest       Std. Dev.      23.43283
75%           59             99
90%           72             99       Variance       549.0975
95%           79            105       Skewness       .1474981
99%           89            108       Kurtosis       2.054333

. count if sex==""
  0

. tab sex

        sex |      Freq.     Percent        Cum.
------------+-----------------------------------
          F |      5,067       50.67       50.67
          M |      4,836       48.36       99.03
          U |         97        0.97      100.00
------------+-----------------------------------
      Total |     10,000      100.00

. * Checking RA algorithm variables
. * Checking type of DMARD that meets inclusion
. foreach dmard in metho leflu sulfa hydrox {
  2.     gen `dmard'_multi = (`dmard'_count>=2)
  3.     tab `dmard'_multi if has_dmards==1, m
  4. }

metho_multi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        773       15.46       15.46
          1 |      4,227       84.54      100.00
------------+-----------------------------------
      Total |      5,000      100.00

leflu_multi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        829       16.58       16.58
          1 |      4,171       83.42      100.00
------------+-----------------------------------
      Total |      5,000      100.00

sulfa_multi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        827       16.54       16.54
          1 |      4,173       83.46      100.00
------------+-----------------------------------
      Total |      5,000      100.00

hydrox_mult |
          i |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        809       16.18       16.18
          1 |      4,191       83.82      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. gen dmard_multi = (metho_multi==1 | leflu_multi==1 | sulfa_multi==1 | hydrox_
> multi==1)

. tab dmard_multi has_alt_dmard_diag

dmard_mult |  has_alt_dmard_diag
         i |         0          1 |     Total
-----------+----------------------+----------
         0 |         4          2 |         6 
         1 |     4,996      4,998 |     9,994 
-----------+----------------------+----------
     Total |     5,000      5,000 |    10,000 

. sum number_ra_codes

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
number_ra_~s |     10,000      2.4987    1.039089          0          6

. di "Number where no DMARDs but does have multiple RA codes and no alt diag"
Number where no DMARDs but does have multiple RA codes and no alt diag

. count if has_dmards==0 & number_ra_codes>=2 & alt_diag!=1
  2,082

. tab has_ra, m

     has_ra |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,000       50.00       50.00
          1 |      5,000       50.00      100.00
------------+-----------------------------------
      Total |     10,000      100.00

. keep if has_ra
(5,000 observations deleted)

. * Time since first RA code
. gen first_ra_codeA = date(first_ra_code, "YMD")
(2,755 missing values generated)

. format first_ra_codeA %dD/N/CY

. gen time_ra = (date("01Mar2019", "DMY") - first_ra_codeA)/365.25
(2,755 missing values generated)

. sum time_ra, d

                           time_ra
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .7200547       .0301164
 5%     4.851471       .1040383
10%     9.809719       .1396304       Obs               2,245
25%     25.95756       .1615332       Sum of Wgt.       2,245

50%     54.67214                      Mean            54.7392
                        Largest       Std. Dev.      32.48661
75%     83.30459       109.8207
90%     99.31828       109.8699       Variance        1055.38
95%     103.9726        109.911       Skewness      -.0069804
99%     108.8679       109.9658       Kurtosis       1.740655

. sum number_ra_codes, d

                       number_ra_codes
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            2                      Mean             2.4944
                        Largest       Std. Dev.       1.03527
75%            3              6
90%            4              6       Variance       1.071783
95%            4              6       Skewness       .0971849
99%            5              6       Kurtosis       2.886032

. sum metho_count, d

                         metho_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            2                      Mean             2.4932
                        Largest       Std. Dev.      1.026141
75%            3              6
90%            4              6       Variance       1.052964
95%            4              6       Skewness       .0488596
99%            5              6       Kurtosis       2.916423

. sum sulfa_count, d 

                         sulfa_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            2                      Mean             2.4834
                        Largest       Std. Dev.      1.029726
75%            3              6
90%            4              6       Variance       1.060337
95%            4              6       Skewness       .0544638
99%            5              6       Kurtosis       2.808431

. sum leflu_count, d 

                         leflu_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            2                      Mean             2.4738
                        Largest       Std. Dev.      1.038041
75%            3              5
90%            4              6       Variance       1.077529
95%            4              6       Skewness       .0226661
99%            5              6       Kurtosis       2.799505

. sum hydrox_count, d 

                        hydrox_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            2                      Mean             2.4806
                        Largest       Std. Dev.      1.031036
75%            3              6
90%            4              6       Variance       1.063036
95%            4              6       Skewness       .0733902
99%            5              6       Kurtosis       2.886825

. 
. sum outpatient*, d

                    outpatient_appt_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            2              0       Obs               5,000
25%            6              0       Sum of Wgt.       5,000

50%            7                      Mean             6.7872
                        Largest       Std. Dev.      2.917056
75%            9             14
90%           10             14       Variance       8.509218
95%           11             14       Skewness      -.8538891
99%           12             15       Kurtosis        3.54522

                    outpatient_appt_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            2              0       Obs               5,000
25%            6              0       Sum of Wgt.       5,000

50%            7                      Mean             6.7796
                        Largest       Std. Dev.      2.942508
75%            9             14
90%           10             14       Variance       8.658356
95%           11             14       Skewness      -.8909405
99%           12             14       Kurtosis       3.489146

                    outpatient_appt_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            3              0       Obs               5,000
25%            6              0       Sum of Wgt.       5,000

50%            7                      Mean             6.8028
                        Largest       Std. Dev.       2.92992
75%            9             14
90%           10             14       Variance       8.584429
95%           11             14       Skewness      -.8723463
99%           12             14       Kurtosis       3.528966

                   outpatient_medium_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               2,488
25%            2              1       Sum of Wgt.       2,488

50%            5                      Mean           13.60008
                        Largest       Std. Dev.      28.36945
75%            7             98
90%           98             98       Variance       804.8255
95%           98             98       Skewness       2.618126
99%           98             98       Kurtosis       7.924776

                   outpatient_medium_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               2,459
25%            2              1       Sum of Wgt.       2,459

50%            5                      Mean           13.98536
                        Largest       Std. Dev.      28.80095
75%            7             98
90%           98             98       Variance       829.4945
95%           98             98       Skewness       2.553981
99%           98             98       Kurtosis       7.590452

                   outpatient_medium_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               2,494
25%            2              1       Sum of Wgt.       2,494

50%            5                      Mean           12.89495
                        Largest       Std. Dev.      27.42343
75%            7             98
90%            8             98       Variance       752.0443
95%           98             98       Skewness       2.757557
99%           98             98       Kurtosis         8.6863

                  outpatient_appt_all_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               5,000
25%            6              0       Sum of Wgt.       5,000

50%            7                      Mean             6.7394
                        Largest       Std. Dev.      2.993272
75%            9             14
90%           10             14       Variance        8.95968
95%           11             14       Skewness      -.8494822
99%           12             14       Kurtosis       3.406827

                  outpatient_appt_all_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               5,000
25%            6              0       Sum of Wgt.       5,000

50%            7                      Mean             6.7218
                        Largest       Std. Dev.      2.951702
75%            9             14
90%           10             14       Variance       8.712547
95%           11             14       Skewness      -.8600302
99%           12             15       Kurtosis       3.434725

                  outpatient_appt_all_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            2              0       Obs               5,000
25%            6              0       Sum of Wgt.       5,000

50%            7                      Mean             6.7864
                        Largest       Std. Dev.       2.92713
75%            9             14
90%           10             15       Variance       8.568089
95%           11             15       Skewness      -.8807667
99%           12             15       Kurtosis       3.551128

. 
. forvalues i=2019/2021 {
  2.     sum ra_hosp_beddays_`i' if ra_hosp_`i'>0, d 
  3. }

                    ra_hosp_beddays_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               4,903
25%            2              0       Sum of Wgt.       4,903

50%            3                      Mean           2.516419
                        Largest       Std. Dev.      1.039846
75%            3              6
90%            4              6       Variance       1.081279
95%            4              6       Skewness      -.0001764
99%            5              6       Kurtosis       2.848119

                    ra_hosp_beddays_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               4,888
25%            2              0       Sum of Wgt.       4,888

50%            3                      Mean           2.496931
                        Largest       Std. Dev.      1.049419
75%            3              6
90%            4              6       Variance        1.10128
95%            4              6       Skewness       .0421079
99%            5              7       Kurtosis       2.932945

                    ra_hosp_beddays_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -1
 5%            1              0
10%            1              0       Obs               4,884
25%            2              0       Sum of Wgt.       4,884

50%            2                      Mean           2.486486
                        Largest       Std. Dev.      1.040458
75%            3              6
90%            4              6       Variance       1.082553
95%            4              6       Skewness       .0430616
99%            5              6       Kurtosis       2.909338

. 
. 
. * How many people are not on DMARDs and have no RA appointments?
. 
. * Format variables
. *re-order ethnicity
.  gen eth5=1 if ethnicity==1
(3,987 missing values generated)

.  replace eth5=2 if ethnicity==3
(1,022 real changes made)

.  replace eth5=3 if ethnicity==4
(980 real changes made)

.  replace eth5=4 if ethnicity==2
(974 real changes made)

.  replace eth5=5 if ethnicity==5
(1,011 real changes made)

.  replace eth5=6 if ethnicity==0
(0 real changes made)

. 
.  label define eth5                      1 "White"                            
>            ///
>                                                         2 "South Asian"      
>                    ///                                             
>                                                         3 "Black"            
>                            ///
>                                                         4 "Mixed"            
>                            ///
>                                                         5 "Other"            
>        ///
>                             6 "Missing"                                 

.                                         
. 
. label values eth5 eth5

. safetab eth5, m
5

       eth5 |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |      1,013       20.26       20.26
South Asian |      1,022       20.44       40.70
      Black |        980       19.60       60.30
      Mixed |        974       19.48       79.78
      Other |      1,011       20.22      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. 
. * formatting gender
. gen male=(sex=="M")

. replace male = 0 if sex == "F"
(0 real changes made)

. label define male 0"Female" 1"Male"

. label values male male

. safetab male, miss
5

       male |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |      2,618       52.36       52.36
       Male |      2,382       47.64      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. 
. *create a 4 category rural urban variable 
. generate urban_rural_5=.
(5,000 missing values generated)

. la var urban_rural_5 "Rural Urban in five categories"

. replace urban_rural_5=1 if urban_rural==1
(616 real changes made)

. replace urban_rural_5=2 if urban_rural==2
(620 real changes made)

. replace urban_rural_5=3 if urban_rural==3|urban_rural==4
(1,198 real changes made)

. replace urban_rural_5=4 if urban_rural==5|urban_rural==6
(1,262 real changes made)

. replace urban_rural_5=5 if urban_rural==7|urban_rural==8
(1,304 real changes made)

. label define urban_rural_5 1 "Urban major conurbation" 2 "Urban minor conurba
> tion" 3 "Urban city and town" 4 "Rural town and fringe" 5 "Rural village and 
> dispersed"

. label values urban_rural_5 urban_rural_5

. safetab urban_rural_5, miss
14

        Rural Urban in five |
                 categories |      Freq.     Percent        Cum.
----------------------------+-----------------------------------
    Urban major conurbation |        616       12.32       12.32
    Urban minor conurbation |        620       12.40       24.72
        Urban city and town |      1,198       23.96       48.68
      Rural town and fringe |      1,262       25.24       73.92
Rural village and dispersed |      1,304       26.08      100.00
----------------------------+-----------------------------------
                      Total |      5,000      100.00

. 
. *generate a binary rural urban (with missing assigned to urban)
. generate urban_rural_bin=.
(5,000 missing values generated)

. replace urban_rural_bin=1 if urban_rural<=4|urban_rural==.
(2,434 real changes made)

. replace urban_rural_bin=0 if urban_rural>4 & urban_rural!=.
(2,566 real changes made)

. label define urban_rural_bin 0 "Rural" 1 "Urban"

. label values urban_rural_bin urban_rural_bin

. safetab urban_rural_bin urban_rural, miss
28

urban_rura |                      urban_rural
     l_bin |         1          2          3          4          5 |     Total
-----------+-------------------------------------------------------+----------
     Rural |         0          0          0          0        644 |     2,566 
     Urban |       616        620        605        593          0 |     2,434 
-----------+-------------------------------------------------------+----------
     Total |       616        620        605        593        644 |     5,000 


urban_rura |           urban_rural
     l_bin |         6          7          8 |     Total
-----------+---------------------------------+----------
     Rural |       618        674        630 |     2,566 
     Urban |         0          0          0 |     2,434 
-----------+---------------------------------+----------
     Total |       618        674        630 |     5,000 

. label var urban_rural_bin "Rural-Urban"

. 
. * Make missing category for region
. replace region = "missing" if region==""
(0 real changes made)

. * Make numeric region variable 
. gen region_n = 1 if region=="East Midlands"
(4,508 missing values generated)

. replace region_n = 2 if region=="East of England"
(538 real changes made)

. replace region_n = 3 if region=="London"
(1,038 real changes made)

. replace region_n = 4 if region=="North East"
(490 real changes made)

. replace region_n = 5 if region=="North West"
(501 real changes made)

. replace region_n = 6 if region=="South East"
(954 real changes made)

. replace region_n = 7 if region=="South West"
(0 real changes made)

. replace region_n = 8 if region=="West Midlands"
(480 real changes made)

. replace region_n = 9 if region=="Yorkshire and the Humber"
(507 real changes made)

. tab region*, m 

                      |                  region_n
               region |         1          2          3          4 |     Total
----------------------+--------------------------------------------+----------
        East Midlands |       492          0          0          0 |       492 
      East of England |         0        538          0          0 |       538 
               London |         0          0      1,038          0 |     1,038 
           North East |         0          0          0        490 |       490 
           North West |         0          0          0          0 |       501 
           South East |         0          0          0          0 |       954 
        West Midlands |         0          0          0          0 |       480 
Yorkshire and the H.. |         0          0          0          0 |       507 
----------------------+--------------------------------------------+----------
                Total |       492        538      1,038        490 |     5,000 


                      |                  region_n
               region |         5          6          8          9 |     Total
----------------------+--------------------------------------------+----------
        East Midlands |         0          0          0          0 |       492 
      East of England |         0          0          0          0 |       538 
               London |         0          0          0          0 |     1,038 
           North East |         0          0          0          0 |       490 
           North West |       501          0          0          0 |       501 
           South East |         0        954          0          0 |       954 
        West Midlands |         0          0        480          0 |       480 
Yorkshire and the H.. |         0          0          0        507 |       507 
----------------------+--------------------------------------------+----------
                Total |       501        954        480        507 |     5,000 

. 
. * Define age categories
. * Create age categories
. egen age_cat = cut(age), at(18, 40, 60, 80, 120) icodes
(1066 missing values generated)

. label define age 0 "18 - 40 years" 1 "41 - 60 years" 2 "61 - 80 years" 3 ">80
>  years"

. label values age_cat age

. safetab age_cat, miss
8

      age_cat |      Freq.     Percent        Cum.
--------------+-----------------------------------
18 - 40 years |      1,467       29.34       29.34
41 - 60 years |      1,303       26.06       55.40
61 - 80 years |        942       18.84       74.24
    >80 years |        222        4.44       78.68
            . |      1,066       21.32      100.00
--------------+-----------------------------------
        Total |      5,000      100.00

. 
. * Smoking status
. gen smoking = 0 if smoking_status=="N"
(4,483 missing values generated)

. replace smoking = 1 if smoking_status=="S"
(955 real changes made)

. replace smoking = 2 if smoking_status=="E"
(730 real changes made)

. replace smoking = 3 if smoking==.
(2,798 real changes made)

. 
. label define smok 1 "Current smoker" 2 "Ex-smoker" 0 "Never smoked" 3 "Unknow
> n"

. label values smoking smok

. 
. * BMI categories
. egen bmi_cat = cut(bmi), at(0, 1, 18.5, 24.9, 29.9, 39.9, 100) icodes
(2 missing values generated)

. bys bmi_cat: sum bmi

-------------------------------------------------------------------------------
-> bmi_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        991           0           0          0          0

-------------------------------------------------------------------------------
-> bmi_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        497    14.58525    3.135432   1.777325   18.48783

-------------------------------------------------------------------------------
-> bmi_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        934    22.04407    1.794865   18.50702   24.89782

-------------------------------------------------------------------------------
-> bmi_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        964    27.34485    1.439143   24.90137   29.89403

-------------------------------------------------------------------------------
-> bmi_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |      1,349    34.05688    2.692066   29.90012   39.89632

-------------------------------------------------------------------------------
-> bmi_cat = 5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        263     43.9701    3.455935   39.93222   56.19979

-------------------------------------------------------------------------------
-> bmi_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |          2   -1.900379    .3767544  -2.166785  -1.633974


. * add missing . to zero category
. replace bmi_cat = 0 if bmi_cat==. 
(2 real changes made)

. label define bmi 0 "Missing" 1 "Underweight" 2 "Healthy range" 3 "Overweight"
>  4 "Obese" 5 "Morbidly obese"

. label values bmi_cat bmi

. 
. * Determine if still in follow-up for each year
. * Format dates
. gen died_fuA = date(died_fu, "YMD")
(2,548 missing values generated)

. gen dereg_dateA = date(dereg_date, "YMD")
(2,426 missing values generated)

. gen end_fu = date("`j'-03-31", "YMD")
(5,000 missing values generated)

. gen end_date = min(died_fuA, dereg_dateA, end_fu)
(1,252 missing values generated)

. drop end_fu

. sum end_date

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    end_date |      3,748    22449.49    299.3403      21976      23034

. di "Number where end date prior to follow-up start"
Number where end date prior to follow-up start

. count if end_date<date("2019-04-01", "YMD")
  0

. * determine range of dates for outpatient appointments to determine which sho
> uld be dropped
. gen end_2020 = end_date<date("2020-03-31", "YMD")

. gen end_2021 = end_date<date("2021-03-31", "YMD") 

. gen end_2022 = end_date<date("2022-03-31", "YMD") 

. tab end_2020

   end_2020 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,870       97.40       97.40
          1 |        130        2.60      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. tab end_2021

   end_2021 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,327       66.54       66.54
          1 |      1,673       33.46      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. tab end_2022

   end_2022 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,066       41.32       41.32
          1 |      2,934       58.68      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. 
. * Set outpatient appointment count to missing if end prior to the end of the 
> year 
. forvalues i=2019/2021 {
  2.     local j=`i'+1
  3.     di `j'
  4.     gen op_appt_`i'_orig = outpatient_appt_`i'
  5.     replace outpatient_appt_`i'=. if end_`j'
  6.     gen op_medium_`i'_orig = outpatient_medium_`i'
  7.     replace outpatient_medium_`i'=. if end_`j'
  8.     gen op_appt_all_`i'_orig = outpatient_appt_all_`i'
  9.     replace outpatient_appt_all_`i'=. if end_`j'
 10. }
2020
(130 real changes made, 130 to missing)
(2,512 missing values generated)
(63 real changes made, 63 to missing)
(130 real changes made, 130 to missing)
2021
(1,673 real changes made, 1,673 to missing)
(2,541 missing values generated)
(848 real changes made, 848 to missing)
(1,673 real changes made, 1,673 to missing)
2022
(2,934 real changes made, 2,934 to missing)
(2,506 missing values generated)
(1,431 real changes made, 1,431 to missing)
(2,934 real changes made, 2,934 to missing)

. 
. * Categorise number of outpatient appointments
. label define appt 0 "No appointments" 1 "1-2 per year" 2 "3 or more per year"
>  

. forvalues i=2019/2021 {
  2.     * Rheumatology outpatient appointments
.     egen op_appt_`i'_cat = cut(outpatient_appt_`i'), at(0, 1, 3, 1000) icodes
  3.     * Check all categorised
.     bys op_appt_`i'_cat: sum outpatient_appt_`i'
  4.     label values op_appt_`i'_cat appt
  5.     * Same for orginal variables
.     egen op_appt_`i'_orig_cat = cut(op_appt_`i'_orig), at(0, 1, 3, 1000) icod
> es
  6.     * Check all categorised
.     bys op_appt_`i'_orig_cat: sum op_appt_`i'_orig
  7.     label values op_appt_`i'_orig_cat appt
  8.     }
(130 missing values generated)

-------------------------------------------------------------------------------
-> op_appt_2019_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2019 |        466           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_2019_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2019 |         29    1.862069    .3509312          1          2

-------------------------------------------------------------------------------
-> op_appt_2019_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2019 |      4,375      7.5344    1.975187          3         15

-------------------------------------------------------------------------------
-> op_appt_2019_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2019 |          0


-------------------------------------------------------------------------------
-> op_appt_2019_orig_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2019_orig |        472           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_2019_orig_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2019_orig |         30    1.866667    .3457459          1          2

-------------------------------------------------------------------------------
-> op_appt_2019_orig_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2019_orig |      4,498    7.532237    1.976503          3         15

(1673 missing values generated)

-------------------------------------------------------------------------------
-> op_appt_2020_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2020 |        315           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_2020_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2020 |         22    1.727273    .4558423          1          2

-------------------------------------------------------------------------------
-> op_appt_2020_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2020 |      2,990    7.544147    1.956167          3         14

-------------------------------------------------------------------------------
-> op_appt_2020_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2020 |          0


-------------------------------------------------------------------------------
-> op_appt_2020_orig_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2020_orig |        491           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_2020_orig_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2020_orig |         29    1.793103    .4122508          1          2

-------------------------------------------------------------------------------
-> op_appt_2020_orig_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2020_orig |      4,480    7.554911    1.965117          3         14

(2934 missing values generated)

-------------------------------------------------------------------------------
-> op_appt_2021_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2021 |        206           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_2021_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2021 |          5         1.8    .4472136          1          2

-------------------------------------------------------------------------------
-> op_appt_2021_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2021 |      1,855    7.616712     1.96387          3         14

-------------------------------------------------------------------------------
-> op_appt_2021_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2021 |          0


-------------------------------------------------------------------------------
-> op_appt_2021_orig_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2021_orig |        479           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_2021_orig_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2021_orig |         20         1.9    .3077935          1          2

-------------------------------------------------------------------------------
-> op_appt_2021_orig_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2021_orig |      4,501    7.548545    1.986658          3         14


. 
. * Calculate difference in rheumatology appointments compared to previous year
. gen diff_op_2020 = outpatient_appt_2020 - outpatient_appt_2019
(1,673 missing values generated)

. gen diff_op_2021 = outpatient_appt_2021 - outpatient_appt_2020
(2,934 missing values generated)

. sum diff_op_2020 diff_op_2021, d

                        diff_op_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%          -10            -13
 5%           -7            -12
10%           -5            -12       Obs               3,327
25%           -2            -12       Sum of Wgt.       3,327

50%            0                      Mean          -.0246468
                        Largest       Std. Dev.      4.163596
75%            2             11
90%            5             12       Variance       17.33553
95%            8             12       Skewness       .0018719
99%           10             12       Kurtosis        3.22603

                        diff_op_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%          -10            -12
 5%           -7            -12
10%           -5            -12       Obs               2,066
25%           -2            -11       Sum of Wgt.       2,066

50%            0                      Mean           .1001936
                        Largest       Std. Dev.      4.158032
75%            3             12
90%            5             12       Variance       17.28923
95%            7             12       Skewness      -.0234645
99%           10             13       Kurtosis       3.221002

. * Categorise difference
. egen diff_op_cat_2020 = cut(diff_op_2020), at(-100, 0, 1, 100) icodes
(1673 missing values generated)

. egen diff_op_cat_2021 = cut(diff_op_2021), at(-100, 0, 1, 100) icodes
(2934 missing values generated)

. label define op_cat 0 "No appointments both years" 1 "Fewer appointments" 2 "
> Same number of appointments" 3 "More appointments"

. forvalues i=2020/2021 {
  2.     tab diff_op_cat_`i' op_appt_`i'_cat
  3.     * Update categories to include category of those with no appointments 
> in both years
.     replace diff_op_cat_`i' = diff_op_cat_`i' + 1
  4.     tab diff_op_cat_`i'
  5.     replace diff_op_cat_`i' = 0 if diff_op_cat_`i'==2 & op_appt_`i'_cat==0
  6.     tab diff_op_cat_`i'
  7.     label values diff_op_cat_`i' op_cat
  8. }

diff_op_ca |         op_appt_2020_cat
    t_2020 | No appoin  1-2 per y  3 or more |     Total
-----------+---------------------------------+----------
         0 |       281         21      1,186 |     1,488 
         1 |        34          0        326 |       360 
         2 |         0          1      1,478 |     1,479 
-----------+---------------------------------+----------
     Total |       315         22      2,990 |     3,327 
(3,327 real changes made)

diff_op_cat |
      _2020 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,488       44.72       44.72
          2 |        360       10.82       55.55
          3 |      1,479       44.45      100.00
------------+-----------------------------------
      Total |      3,327      100.00
(34 real changes made)

diff_op_cat |
      _2020 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         34        1.02        1.02
          1 |      1,488       44.72       45.75
          2 |        326        9.80       55.55
          3 |      1,479       44.45      100.00
------------+-----------------------------------
      Total |      3,327      100.00

diff_op_ca |         op_appt_2021_cat
    t_2021 | No appoin  1-2 per y  3 or more |     Total
-----------+---------------------------------+----------
         0 |       185          5        676 |       866 
         1 |        21          0        253 |       274 
         2 |         0          0        926 |       926 
-----------+---------------------------------+----------
     Total |       206          5      1,855 |     2,066 
(2,066 real changes made)

diff_op_cat |
      _2021 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        866       41.92       41.92
          2 |        274       13.26       55.18
          3 |        926       44.82      100.00
------------+-----------------------------------
      Total |      2,066      100.00
(21 real changes made)

diff_op_cat |
      _2021 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         21        1.02        1.02
          1 |        866       41.92       42.93
          2 |        253       12.25       55.18
          3 |        926       44.82      100.00
------------+-----------------------------------
      Total |      2,066      100.00

. 
. * Categorise number of outpatient appointments (all specialties)
. label define appt_all 0 "No appointments" 1 "1-2 per year" 2 "3-5 per year" 3
>  "6 or more per year"

. forvalues i=2019/2021 {
  2.     sum outpatient_appt_all_`i', d
  3.     egen op_appt_all_`i'_cat = cut(outpatient_appt_all_`i'), at(0, 1, 3, 6
> , 1000) icodes
  4.     * Check all categorised
.     bys op_appt_all_`i'_cat: sum outpatient_appt_all_`i'
  5.     label values op_appt_all_`i'_cat appt_all
  6.     * Same for orginal variables
.     egen op_appt_all_`i'_orig_cat = cut(op_appt_all_`i'_orig), at(0, 1, 3, 6,
>  1000) icodes
  7.     * Check all categorised
.     bys op_appt_all_`i'_orig_cat: sum op_appt_all_`i'_orig
  8.     label values op_appt_all_`i'_orig_cat appt_all
  9.     }

                  outpatient_appt_all_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               4,870
25%            6              0       Sum of Wgt.       4,870

50%            7                      Mean           6.727721
                        Largest       Std. Dev.      2.996574
75%            9             14
90%           10             14       Variance       8.979453
95%           11             14       Skewness      -.8495503
99%           12             14       Kurtosis       3.400881
(130 missing values generated)

-------------------------------------------------------------------------------
-> op_appt_all_2019_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2019 |        513           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_all_2019_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2019 |         27    1.777778    .4236593          1          2

-------------------------------------------------------------------------------
-> op_appt_all_2019_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2019 |        670    4.540299    .6678748          3          5

-------------------------------------------------------------------------------
-> op_appt_all_2019_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2019 |      3,660     8.10765    1.599534          6         14

-------------------------------------------------------------------------------
-> op_appt_all_2019_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2019 |          0


-------------------------------------------------------------------------------
-> op_appt_all_2019_orig_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2019_orig |        521           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_all_2019_orig_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2019_orig |         29    1.793103    .4122508          1          2

-------------------------------------------------------------------------------
-> op_appt_all_2019_orig_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2019_orig |        686    4.533528    .6756763          3          5

-------------------------------------------------------------------------------
-> op_appt_all_2019_orig_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2019_orig |      3,764     8.11238     1.60267          6         14


                  outpatient_appt_all_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               3,327
25%            6              0       Sum of Wgt.       3,327

50%            7                      Mean           6.695521
                        Largest       Std. Dev.      2.962207
75%            9             14
90%           10             14       Variance       8.774673
95%           11             14       Skewness      -.8446411
99%           12             15       Kurtosis       3.419268
(1673 missing values generated)

-------------------------------------------------------------------------------
-> op_appt_all_2020_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2020 |        340           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_all_2020_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2020 |         13    1.615385    .5063697          1          2

-------------------------------------------------------------------------------
-> op_appt_all_2020_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2020 |        460    4.395652    .7468034          3          5

-------------------------------------------------------------------------------
-> op_appt_all_2020_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2020 |      2,514     8.04813    1.585245          6         15

-------------------------------------------------------------------------------
-> op_appt_all_2020_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2020 |          0


-------------------------------------------------------------------------------
-> op_appt_all_2020_orig_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2020_orig |        503           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_all_2020_orig_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2020_orig |         22    1.727273    .4558423          1          2

-------------------------------------------------------------------------------
-> op_appt_all_2020_orig_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2020_orig |        694    4.436599    .7274363          3          5

-------------------------------------------------------------------------------
-> op_appt_all_2020_orig_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2020_orig |      3,781    8.064533    1.582498          6         15


                  outpatient_appt_all_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               2,066
25%            6              0       Sum of Wgt.       2,066

50%            7                      Mean           6.755566
                        Largest       Std. Dev.      2.989049
75%            9             13
90%           10             14       Variance       8.934412
95%           11             14       Skewness       -.879464
99%           12             15       Kurtosis        3.42734
(2934 missing values generated)

-------------------------------------------------------------------------------
-> op_appt_all_2021_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2021 |        215           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_all_2021_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2021 |          9    1.666667          .5          1          2

-------------------------------------------------------------------------------
-> op_appt_all_2021_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2021 |        278    4.453237     .708107          3          5

-------------------------------------------------------------------------------
-> op_appt_all_2021_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2021 |      1,564    8.122762    1.572807          6         15

-------------------------------------------------------------------------------
-> op_appt_all_2021_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2021 |          0


-------------------------------------------------------------------------------
-> op_appt_all_2021_orig_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2021_orig |        483           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_all_2021_orig_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2021_orig |         26    1.846154    .3679465          1          2

-------------------------------------------------------------------------------
-> op_appt_all_2021_orig_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2021_orig |        673    4.456166    .7038974          3          5

-------------------------------------------------------------------------------
-> op_appt_all_2021_orig_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2021_orig |      3,818    8.089314    1.575998          6         15


. 
. * Calculate difference in all outpatient appointments compared to previous ye
> ar
. gen diff_op_all_2020 = outpatient_appt_all_2020 - outpatient_appt_all_2019
(1,673 missing values generated)

. gen diff_op_all_2021 = outpatient_appt_all_2021 - outpatient_appt_all_2020
(2,934 missing values generated)

. sum diff_op_all_2020 diff_op_all_2021, d

                      diff_op_all_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%          -10            -13
 5%           -7            -13
10%           -5            -13       Obs               3,327
25%           -3            -12       Sum of Wgt.       3,327

50%            0                      Mean          -.0309588
                        Largest       Std. Dev.      4.219682
75%            2             12
90%            6             12       Variance       17.80572
95%            8             12       Skewness       .0147819
99%           10             12       Kurtosis       3.197213

                      diff_op_all_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%          -10            -14
 5%           -8            -12
10%           -5            -12       Obs               2,066
25%           -2            -11       Sum of Wgt.       2,066

50%            0                      Mean           .0484027
                        Largest       Std. Dev.      4.312893
75%            3             12
90%            6             12       Variance       18.60105
95%            8             12       Skewness       .0110863
99%           10             14       Kurtosis       3.271211

. * Categorise difference
. egen diff_op_all_cat_2020 = cut(diff_op_all_2020), at(-100, 0, 1, 100) icodes
(1673 missing values generated)

. egen diff_op_all_cat_2021 = cut(diff_op_all_2021), at(-100, 0, 1, 100) icodes
(2934 missing values generated)

. forvalues i=2020/2021 {
  2.     tab diff_op_all_cat_`i' op_appt_all_`i'_cat
  3.     * Update categories to include category of those with no appointments 
> in both years
.     replace diff_op_all_cat_`i' = diff_op_all_cat_`i' + 1
  4.     tab diff_op_all_cat_`i'
  5.     replace diff_op_all_cat_`i' = 0 if diff_op_all_cat_`i'==2 & op_appt_al
> l_`i'_cat==0
  6.     tab diff_op_all_cat_`i'
  7.     label values diff_op_all_cat_`i' op_cat
  8. }

diff_op_al |            op_appt_all_2020_cat
l_cat_2020 | No appoin  1-2 per y  3-5 per y  6 or more |     Total
-----------+--------------------------------------------+----------
         0 |       297         12        381        801 |     1,491 
         1 |        43          0         31        334 |       408 
         2 |         0          1         48      1,379 |     1,428 
-----------+--------------------------------------------+----------
     Total |       340         13        460      2,514 |     3,327 
(3,327 real changes made)

diff_op_all |
  _cat_2020 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,491       44.82       44.82
          2 |        408       12.26       57.08
          3 |      1,428       42.92      100.00
------------+-----------------------------------
      Total |      3,327      100.00
(43 real changes made)

diff_op_all |
  _cat_2020 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         43        1.29        1.29
          1 |      1,491       44.82       46.11
          2 |        365       10.97       57.08
          3 |      1,428       42.92      100.00
------------+-----------------------------------
      Total |      3,327      100.00

diff_op_al |            op_appt_all_2021_cat
l_cat_2021 | No appoin  1-2 per y  3-5 per y  6 or more |     Total
-----------+--------------------------------------------+----------
         0 |       198          9        234        454 |       895 
         1 |        17          0         11        234 |       262 
         2 |         0          0         33        876 |       909 
-----------+--------------------------------------------+----------
     Total |       215          9        278      1,564 |     2,066 
(2,066 real changes made)

diff_op_all |
  _cat_2021 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        895       43.32       43.32
          2 |        262       12.68       56.00
          3 |        909       44.00      100.00
------------+-----------------------------------
      Total |      2,066      100.00
(17 real changes made)

diff_op_all |
  _cat_2021 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         17        0.82        0.82
          1 |        895       43.32       44.14
          2 |        245       11.86       56.00
          3 |        909       44.00      100.00
------------+-----------------------------------
      Total |      2,066      100.00

. 
. preserve

. * Tabulate number of rheumatology appointments per year of those with whole y
> ear available
. table1_mc, vars(op_appt_2019_cat cate \ op_appt_2020_cat cate \ op_appt_2021_
> cat cate \ diff_op_cat_2020 cate \ diff_op_cat_2021 cate) clear

  +----------------------------------+
  | factor               N_1     m_1 |
  |----------------------------------|
  | op_appt_2019_cat   4,870     130 |
  |----------------------------------|
  | op_appt_2020_cat   3,327   1,673 |
  |----------------------------------|
  | op_appt_2021_cat   2,066   2,934 |
  |----------------------------------|
  | diff_op_cat_2020   3,327   1,673 |
  |----------------------------------|
  | diff_op_cat_2021   2,066   2,934 |
  +----------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------+
  |                                                  Total         |
  |----------------------------------------------------------------|
  |                                                  N=5,000       |
  |----------------------------------------------------------------|
  | op_appt_2019_cat   No appointments               466 ( 9.6%)   |
  |                    1-2 per year                  29 ( 0.6%)    |
  |                    3 or more per year            4,375 (89.8%) |
  |----------------------------------------------------------------|
  | op_appt_2020_cat   No appointments               315 ( 9.5%)   |
  |                    1-2 per year                  22 ( 0.7%)    |
  |                    3 or more per year            2,990 (89.9%) |
  |----------------------------------------------------------------|
  | op_appt_2021_cat   No appointments               206 (10.0%)   |
  |                    1-2 per year                  5 ( 0.2%)     |
  |                    3 or more per year            1,855 (89.8%) |
  |----------------------------------------------------------------|
  | diff_op_cat_2020   No appointments both years    34 ( 1.0%)    |
  |                    Fewer appointments            1,488 (44.7%) |
  |                    Same number of appointments   326 ( 9.8%)   |
  |                    More appointments             1,479 (44.5%) |
  |----------------------------------------------------------------|
  | diff_op_cat_2021   No appointments both years    21 ( 1.0%)    |
  |                    Fewer appointments            866 (41.9%)   |
  |                    Same number of appointments   253 (12.2%)   |
  |                    More appointments             926 (44.8%)   |
  +----------------------------------------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/op_appt_yrs.csv
file ./output/tables/op_appt_yrs.csv saved

. restore 

. preserve

. * Tabulate number of rheumatology appointments per year (includes people who 
> end follow-up during year)
. table1_mc, vars(op_appt_2019_orig_cat cate \ op_appt_2020_orig_cat cate \ op_
> appt_2021_orig_cat cate) clear

  +-------------------------------------+
  | factor                    N_1   m_1 |
  |-------------------------------------|
  | op_appt_2019_orig_cat   5,000     0 |
  |-------------------------------------|
  | op_appt_2020_orig_cat   5,000     0 |
  |-------------------------------------|
  | op_appt_2021_orig_cat   5,000     0 |
  +-------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +------------------------------------------------------------+
  |                                              Total         |
  |------------------------------------------------------------|
  |                                              N=5,000       |
  |------------------------------------------------------------|
  | op_appt_2019_orig_cat   No appointments      472 ( 9.4%)   |
  |                         1-2 per year         30 ( 0.6%)    |
  |                         3 or more per year   4,498 (90.0%) |
  |------------------------------------------------------------|
  | op_appt_2020_orig_cat   No appointments      491 ( 9.8%)   |
  |                         1-2 per year         29 ( 0.6%)    |
  |                         3 or more per year   4,480 (89.6%) |
  |------------------------------------------------------------|
  | op_appt_2021_orig_cat   No appointments      479 ( 9.6%)   |
  |                         1-2 per year         20 ( 0.4%)    |
  |                         3 or more per year   4,501 (90.0%) |
  +------------------------------------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/op_appt_orig_yrs.csv
file ./output/tables/op_appt_orig_yrs.csv saved

. restore 

. preserve

. * Tabulate number of all outpatient appointments per year of those with whole
>  year available
. table1_mc, vars(op_appt_all_2019_cat cate \ op_appt_all_2020_cat cate \ op_ap
> pt_all_2021_cat cate \ diff_op_all_cat_2020 cate \ diff_op_all_cat_2021 cate)
>  clear

  +--------------------------------------+
  | factor                   N_1     m_1 |
  |--------------------------------------|
  | op_appt_all_2019_cat   4,870     130 |
  |--------------------------------------|
  | op_appt_all_2020_cat   3,327   1,673 |
  |--------------------------------------|
  | op_appt_all_2021_cat   2,066   2,934 |
  |--------------------------------------|
  | diff_op_all_cat_2020   3,327   1,673 |
  |--------------------------------------|
  | diff_op_all_cat_2021   2,066   2,934 |
  +--------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------------------------+
  |                                                      Total         |
  |--------------------------------------------------------------------|
  |                                                      N=5,000       |
  |--------------------------------------------------------------------|
  | op_appt_all_2019_cat   No appointments               513 (10.5%)   |
  |                        1-2 per year                  27 ( 0.6%)    |
  |                        3-5 per year                  670 (13.8%)   |
  |                        6 or more per year            3,660 (75.2%) |
  |--------------------------------------------------------------------|
  | op_appt_all_2020_cat   No appointments               340 (10.2%)   |
  |                        1-2 per year                  13 ( 0.4%)    |
  |                        3-5 per year                  460 (13.8%)   |
  |                        6 or more per year            2,514 (75.6%) |
  |--------------------------------------------------------------------|
  | op_appt_all_2021_cat   No appointments               215 (10.4%)   |
  |                        1-2 per year                  9 ( 0.4%)     |
  |                        3-5 per year                  278 (13.5%)   |
  |                        6 or more per year            1,564 (75.7%) |
  |--------------------------------------------------------------------|
  | diff_op_all_cat_2020   No appointments both years    43 ( 1.3%)    |
  |                        Fewer appointments            1,491 (44.8%) |
  |                        Same number of appointments   365 (11.0%)   |
  |                        More appointments             1,428 (42.9%) |
  |--------------------------------------------------------------------|
  | diff_op_all_cat_2021   No appointments both years    17 ( 0.8%)    |
  |                        Fewer appointments            895 (43.3%)   |
  |                        Same number of appointments   245 (11.9%)   |
  |                        More appointments             909 (44.0%)   |
  +--------------------------------------------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/op_appt_all_yrs.csv
file ./output/tables/op_appt_all_yrs.csv saved

. restore 

. * Tabulate overall characteristics 
. preserve

. table1_mc, vars(age_cat cate \ male cate \ urban_rural_bin cate \ region cate
>  \ imd cate \  smoking cate \ time_ra contn \ bmi_cat cate \ eth5 cate) clear

  +-----------------------------+
  | factor          N_1     m_1 |
  |-----------------------------|
  | age_cat       3,934   1,066 |
  |-----------------------------|
  | male          5,000       0 |
  |-----------------------------|
  | Rural-Urban   5,000       0 |
  |-----------------------------|
  | region        5,000       0 |
  |-----------------------------|
  | imd           5,000       0 |
  |-----------------------------|
  | smoking       5,000       0 |
  |-----------------------------|
  | time_ra       2,245   2,755 |
  |-----------------------------|
  | bmi_cat       5,000       0 |
  |-----------------------------|
  | eth5          5,000       0 |
  +-----------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +-------------------------------------------------------------+
  |                                          Total              |
  |-------------------------------------------------------------|
  |                                          N=5,000            |
  |-------------------------------------------------------------|
  | age_cat       18 - 40 years              1,467 (37.3%)      |
  |               41 - 60 years              1,303 (33.1%)      |
  |               61 - 80 years              942 (23.9%)        |
  |               >80 years                  222 ( 5.6%)        |
  |-------------------------------------------------------------|
  | male          Female                     2,618 (52.4%)      |
  |               Male                       2,382 (47.6%)      |
  |-------------------------------------------------------------|
  | Rural-Urban   Rural                      2,566 (51.3%)      |
  |               Urban                      2,434 (48.7%)      |
  |-------------------------------------------------------------|
  | region        East Midlands              492 ( 9.8%)        |
  |               East of England            538 (10.8%)        |
  |               London                     1,038 (20.8%)      |
  |               North East                 490 ( 9.8%)        |
  |               North West                 501 (10.0%)        |
  |               South East                 954 (19.1%)        |
  |               West Midlands              480 ( 9.6%)        |
  |               Yorkshire and the Humber   507 (10.1%)        |
  |-------------------------------------------------------------|
  | imd           0                          255 ( 5.1%)        |
  |               1                          999 (20.0%)        |
  |               2                          898 (18.0%)        |
  |               3                          940 (18.8%)        |
  |               4                          942 (18.8%)        |
  |               5                          966 (19.3%)        |
  |-------------------------------------------------------------|
  | smoking       Never smoked               517 (10.3%)        |
  |               Current smoker             955 (19.1%)        |
  |               Ex-smoker                  730 (14.6%)        |
  |               Unknown                    2,798 (56.0%)      |
  |-------------------------------------------------------------|
  | time_ra                                  54.7392 (32.48661) |
  |-------------------------------------------------------------|
  | bmi_cat       Missing                    993 (19.9%)        |
  |               Underweight                497 ( 9.9%)        |
  |               Healthy range              934 (18.7%)        |
  |               Overweight                 964 (19.3%)        |
  |               Obese                      1,349 (27.0%)      |
  |               Morbidly obese             263 ( 5.3%)        |
  |-------------------------------------------------------------|
  | eth5          White                      1,013 (20.3%)      |
  |               South Asian                1,022 (20.4%)      |
  |               Black                      980 (19.6%)        |
  |               Mixed                      974 (19.5%)        |
  |               Other                      1,011 (20.2%)      |
  +-------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 

. export delimited using ./output/tables/op_chars.csv
file ./output/tables/op_chars.csv saved

. restore

. * Tabulate characteristics by category of outpatient appointments for each ye
> ar
. tempfile tempfile

. forvalues i=2019/2021 {
  2.     preserve
  3.     keep if op_appt_`i'_cat==0
  4.     table1_mc, vars(age_cat cate \ male cate \ urban_rural_bin cate \ regi
> on cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat cate \ eth5 cate 
> \ diff_op_all_cat_2020 cate \ diff_op_all_cat_2021 cate) clear
  5.     save `tempfile', replace
  6.     restore
  7.     forvalues j=1/2 {
  8.         preserve
  9.         keep if op_appt_`i'_cat==`j'
 10.         table1_mc, vars(age_cat cate \ male cate \ urban_rural_bin cate \ 
> region cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat cate \ eth5 c
> ate \ diff_op_all_cat_2020 cate \ diff_op_all_cat_2021 cate) clear
 11.         append using `tempfile'
 12.         save `tempfile', replace
 13.         if `j'==2 {
 14.             export delimited using ./output/tables/characteristics_strata`
> i'.csv
 15.         }
 16.         restore
 17.     }
 18.    
.     /* Tabulate characteristics by whether hospitalised with RA for each year
>     preserve
>     keep if ra_hosp_`i'==0
>     table1_mc, vars(age_cat cate \ male cate \ urban_rural_5 cate \ prescribe
> d_biologics cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat cate) cl
> ear
>     save `tempfile', replace
>     restore
>     preserve
>     keep if ra_hosp_`i'==1
>     table1_mc, vars(age_cat cate \ male cate \ urban_rural_5 cate \ prescribe
> d_biologics cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat cate) cl
> ear
>     append using `tempfile'
>     save `tempfile', replace
>     export delimited using ./output/tables/characteristics_ra_hosp_`i'.csv
>     restore*/
.     }
(4,534 observations deleted)

  +----------------------------------+
  | factor                 N_1   m_1 |
  |----------------------------------|
  | age_cat                352   114 |
  |----------------------------------|
  | male                   466     0 |
  |----------------------------------|
  | Rural-Urban            466     0 |
  |----------------------------------|
  | region                 466     0 |
  |----------------------------------|
  | imd                    466     0 |
  |----------------------------------|
  | smoking                466     0 |
  |----------------------------------|
  | time_ra                198   268 |
  |----------------------------------|
  | bmi_cat                466     0 |
  |----------------------------------|
  | eth5                   466     0 |
  |----------------------------------|
  | diff_op_all_cat_2020   317   149 |
  |----------------------------------|
  | diff_op_all_cat_2021   199   267 |
  +----------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +-------------------------------------------------------------------------+
  |                                                      Total              |
  |-------------------------------------------------------------------------|
  |                                                      N=466              |
  |-------------------------------------------------------------------------|
  | age_cat                18 - 40 years                 133 (37.8%)        |
  |                        41 - 60 years                 120 (34.1%)        |
  |                        61 - 80 years                 87 (24.7%)         |
  |                        >80 years                     12 ( 3.4%)         |
  |-------------------------------------------------------------------------|
  | male                   Female                        250 (53.6%)        |
  |                        Male                          216 (46.4%)        |
  |-------------------------------------------------------------------------|
  | Rural-Urban            Rural                         239 (51.3%)        |
  |                        Urban                         227 (48.7%)        |
  |-------------------------------------------------------------------------|
  | region                 East Midlands                 52 (11.2%)         |
  |                        East of England               50 (10.7%)         |
  |                        London                        87 (18.7%)         |
  |                        North East                    39 ( 8.4%)         |
  |                        North West                    47 (10.1%)         |
  |                        South East                    79 (17.0%)         |
  |                        West Midlands                 49 (10.5%)         |
  |                        Yorkshire and the Humber      63 (13.5%)         |
  |-------------------------------------------------------------------------|
  | imd                    0                             28 ( 6.0%)         |
  |                        1                             100 (21.5%)        |
  |                        2                             83 (17.8%)         |
  |                        3                             85 (18.2%)         |
  |                        4                             73 (15.7%)         |
  |                        5                             97 (20.8%)         |
  |-------------------------------------------------------------------------|
  | smoking                Never smoked                  50 (10.7%)         |
  |                        Current smoker                90 (19.3%)         |
  |                        Ex-smoker                     65 (13.9%)         |
  |                        Unknown                       261 (56.0%)        |
  |-------------------------------------------------------------------------|
  | time_ra                                              61.22634 (31.6361) |
  |-------------------------------------------------------------------------|
  | bmi_cat                Missing                       89 (19.1%)         |
  |                        Underweight                   56 (12.0%)         |
  |                        Healthy range                 82 (17.6%)         |
  |                        Overweight                    85 (18.2%)         |
  |                        Obese                         129 (27.7%)        |
  |                        Morbidly obese                25 ( 5.4%)         |
  |-------------------------------------------------------------------------|
  | eth5                   White                         73 (15.7%)         |
  |                        South Asian                   114 (24.5%)        |
  |                        Black                         95 (20.4%)         |
  |                        Mixed                         98 (21.0%)         |
  |                        Other                         86 (18.5%)         |
  |-------------------------------------------------------------------------|
  | diff_op_all_cat_2020   No appointments both years    5 ( 1.6%)          |
  |                        Fewer appointments            159 (50.2%)        |
  |                        Same number of appointments   37 (11.7%)         |
  |                        More appointments             116 (36.6%)        |
  |-------------------------------------------------------------------------|
  | diff_op_all_cat_2021   No appointments both years    2 ( 1.0%)          |
  |                        Fewer appointments            86 (43.2%)         |
  |                        Same number of appointments   20 (10.1%)         |
  |                        More appointments             91 (45.7%)         |
  +-------------------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
(note: file /tmp/St00015.000005 not found)
file /tmp/St00015.000005 saved
(4,971 observations deleted)

  +----------------------------------+
  | factor                 N_1   m_1 |
  |----------------------------------|
  | age_cat                 25     4 |
  |----------------------------------|
  | male                    29     0 |
  |----------------------------------|
  | Rural-Urban             29     0 |
  |----------------------------------|
  | region                  29     0 |
  |----------------------------------|
  | imd                     29     0 |
  |----------------------------------|
  | smoking                 29     0 |
  |----------------------------------|
  | time_ra                 14    15 |
  |----------------------------------|
  | bmi_cat                 29     0 |
  |----------------------------------|
  | eth5                    29     0 |
  |----------------------------------|
  | diff_op_all_cat_2020    19    10 |
  |----------------------------------|
  | diff_op_all_cat_2021    15    14 |
  +----------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------------------------------+
  |                                                      Total               |
  |--------------------------------------------------------------------------|
  |                                                      N=29                |
  |--------------------------------------------------------------------------|
  | age_cat                18 - 40 years                 7 (28%)             |
  |                        41 - 60 years                 10 (40%)            |
  |                        61 - 80 years                 6 (24%)             |
  |                        >80 years                     2 ( 8%)             |
  |--------------------------------------------------------------------------|
  | male                   Female                        13 (45%)            |
  |                        Male                          16 (55%)            |
  |--------------------------------------------------------------------------|
  | Rural-Urban            Rural                         12 (41%)            |
  |                        Urban                         17 (59%)            |
  |--------------------------------------------------------------------------|
  | region                 East Midlands                 6 (21%)             |
  |                        East of England               4 (14%)             |
  |                        London                        6 (21%)             |
  |                        North East                    4 (14%)             |
  |                        North West                    1 ( 3%)             |
  |                        South East                    2 ( 7%)             |
  |                        West Midlands                 2 ( 7%)             |
  |                        Yorkshire and the Humber      4 (14%)             |
  |--------------------------------------------------------------------------|
  | imd                    0                             2 ( 7%)             |
  |                        1                             4 (14%)             |
  |                        2                             7 (24%)             |
  |                        3                             4 (14%)             |
  |                        4                             3 (10%)             |
  |                        5                             9 (31%)             |
  |--------------------------------------------------------------------------|
  | smoking                Never smoked                  1 ( 3%)             |
  |                        Current smoker                5 (17%)             |
  |                        Ex-smoker                     5 (17%)             |
  |                        Unknown                       18 (62%)            |
  |--------------------------------------------------------------------------|
  | time_ra                                              70.37196 (31.73187) |
  |--------------------------------------------------------------------------|
  | bmi_cat                Missing                       4 (14%)             |
  |                        Underweight                   3 (10%)             |
  |                        Healthy range                 7 (24%)             |
  |                        Overweight                    8 (28%)             |
  |                        Obese                         7 (24%)             |
  |--------------------------------------------------------------------------|
  | eth5                   White                         7 (24%)             |
  |                        South Asian                   5 (17%)             |
  |                        Black                         4 (14%)             |
  |                        Mixed                         7 (24%)             |
  |                        Other                         6 (21%)             |
  |--------------------------------------------------------------------------|
  | diff_op_all_cat_2020   Fewer appointments            6 (32%)             |
  |                        Same number of appointments   5 (26%)             |
  |                        More appointments             8 (42%)             |
  |--------------------------------------------------------------------------|
  | diff_op_all_cat_2021   Fewer appointments            7 (47%)             |
  |                        Same number of appointments   1 ( 7%)             |
  |                        More appointments             7 (47%)             |
  +--------------------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.000005 saved
(625 observations deleted)

  +--------------------------------------+
  | factor                   N_1     m_1 |
  |--------------------------------------|
  | age_cat                3,451     924 |
  |--------------------------------------|
  | male                   4,375       0 |
  |--------------------------------------|
  | Rural-Urban            4,375       0 |
  |--------------------------------------|
  | region                 4,375       0 |
  |--------------------------------------|
  | imd                    4,375       0 |
  |--------------------------------------|
  | smoking                4,375       0 |
  |--------------------------------------|
  | time_ra                1,979   2,396 |
  |--------------------------------------|
  | bmi_cat                4,375       0 |
  |--------------------------------------|
  | eth5                   4,375       0 |
  |--------------------------------------|
  | diff_op_all_cat_2020   2,991   1,384 |
  |--------------------------------------|
  | diff_op_all_cat_2021   1,852   2,523 |
  +--------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------------------------------+
  |                                                      Total               |
  |--------------------------------------------------------------------------|
  |                                                      N=4,375             |
  |--------------------------------------------------------------------------|
  | age_cat                18 - 40 years                 1,290 (37.4%)       |
  |                        41 - 60 years                 1,140 (33.0%)       |
  |                        61 - 80 years                 819 (23.7%)         |
  |                        >80 years                     202 ( 5.9%)         |
  |--------------------------------------------------------------------------|
  | male                   Female                        2,289 (52.3%)       |
  |                        Male                          2,086 (47.7%)       |
  |--------------------------------------------------------------------------|
  | Rural-Urban            Rural                         2,242 (51.2%)       |
  |                        Urban                         2,133 (48.8%)       |
  |--------------------------------------------------------------------------|
  | region                 East Midlands                 420 ( 9.6%)         |
  |                        East of England               473 (10.8%)         |
  |                        London                        917 (21.0%)         |
  |                        North East                    433 ( 9.9%)         |
  |                        North West                    442 (10.1%)         |
  |                        South East                    844 (19.3%)         |
  |                        West Midlands                 421 ( 9.6%)         |
  |                        Yorkshire and the Humber      425 ( 9.7%)         |
  |--------------------------------------------------------------------------|
  | imd                    0                             215 ( 4.9%)         |
  |                        1                             866 (19.8%)         |
  |                        2                             782 (17.9%)         |
  |                        3                             831 (19.0%)         |
  |                        4                             850 (19.4%)         |
  |                        5                             831 (19.0%)         |
  |--------------------------------------------------------------------------|
  | smoking                Never smoked                  451 (10.3%)         |
  |                        Current smoker                835 (19.1%)         |
  |                        Ex-smoker                     640 (14.6%)         |
  |                        Unknown                       2,449 (56.0%)       |
  |--------------------------------------------------------------------------|
  | time_ra                                              53.99981 (32.43506) |
  |--------------------------------------------------------------------------|
  | bmi_cat                Missing                       879 (20.1%)         |
  |                        Underweight                   419 ( 9.6%)         |
  |                        Healthy range                 825 (18.9%)         |
  |                        Overweight                    848 (19.4%)         |
  |                        Obese                         1,177 (26.9%)       |
  |                        Morbidly obese                227 ( 5.2%)         |
  |--------------------------------------------------------------------------|
  | eth5                   White                         905 (20.7%)         |
  |                        South Asian                   869 (19.9%)         |
  |                        Black                         855 (19.5%)         |
  |                        Mixed                         849 (19.4%)         |
  |                        Other                         897 (20.5%)         |
  |--------------------------------------------------------------------------|
  | diff_op_all_cat_2020   No appointments both years    38 ( 1.3%)          |
  |                        Fewer appointments            1,326 (44.3%)       |
  |                        Same number of appointments   323 (10.8%)         |
  |                        More appointments             1,304 (43.6%)       |
  |--------------------------------------------------------------------------|
  | diff_op_all_cat_2021   No appointments both years    15 ( 0.8%)          |
  |                        Fewer appointments            802 (43.3%)         |
  |                        Same number of appointments   224 (12.1%)         |
  |                        More appointments             811 (43.8%)         |
  +--------------------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.000005 saved
file ./output/tables/characteristics_strata2019.csv saved
(4,685 observations deleted)

  +----------------------------------+
  | factor                 N_1   m_1 |
  |----------------------------------|
  | age_cat                250    65 |
  |----------------------------------|
  | male                   315     0 |
  |----------------------------------|
  | Rural-Urban            315     0 |
  |----------------------------------|
  | region                 315     0 |
  |----------------------------------|
  | imd                    315     0 |
  |----------------------------------|
  | smoking                315     0 |
  |----------------------------------|
  | time_ra                137   178 |
  |----------------------------------|
  | bmi_cat                315     0 |
  |----------------------------------|
  | eth5                   315     0 |
  |----------------------------------|
  | diff_op_all_cat_2020   315     0 |
  |----------------------------------|
  | diff_op_all_cat_2021   202   113 |
  +----------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------------------------------+
  |                                                      Total               |
  |--------------------------------------------------------------------------|
  |                                                      N=315               |
  |--------------------------------------------------------------------------|
  | age_cat                18 - 40 years                 92 (36.8%)          |
  |                        41 - 60 years                 83 (33.2%)          |
  |                        61 - 80 years                 63 (25.2%)          |
  |                        >80 years                     12 ( 4.8%)          |
  |--------------------------------------------------------------------------|
  | male                   Female                        182 (57.8%)         |
  |                        Male                          133 (42.2%)         |
  |--------------------------------------------------------------------------|
  | Rural-Urban            Rural                         145 (46.0%)         |
  |                        Urban                         170 (54.0%)         |
  |--------------------------------------------------------------------------|
  | region                 East Midlands                 32 (10.2%)          |
  |                        East of England               38 (12.1%)          |
  |                        London                        65 (20.6%)          |
  |                        North East                    36 (11.4%)          |
  |                        North West                    30 ( 9.5%)          |
  |                        South East                    57 (18.1%)          |
  |                        West Midlands                 22 ( 7.0%)          |
  |                        Yorkshire and the Humber      35 (11.1%)          |
  |--------------------------------------------------------------------------|
  | imd                    0                             13 ( 4.1%)          |
  |                        1                             63 (20.0%)          |
  |                        2                             70 (22.2%)          |
  |                        3                             65 (20.6%)          |
  |                        4                             48 (15.2%)          |
  |                        5                             56 (17.8%)          |
  |--------------------------------------------------------------------------|
  | smoking                Never smoked                  29 ( 9.2%)          |
  |                        Current smoker                75 (23.8%)          |
  |                        Ex-smoker                     30 ( 9.5%)          |
  |                        Unknown                       181 (57.5%)         |
  |--------------------------------------------------------------------------|
  | time_ra                                              58.70839 (33.54249) |
  |--------------------------------------------------------------------------|
  | bmi_cat                Missing                       71 (22.5%)          |
  |                        Underweight                   25 ( 7.9%)          |
  |                        Healthy range                 55 (17.5%)          |
  |                        Overweight                    68 (21.6%)          |
  |                        Obese                         85 (27.0%)          |
  |                        Morbidly obese                11 ( 3.5%)          |
  |--------------------------------------------------------------------------|
  | eth5                   White                         67 (21.3%)          |
  |                        South Asian                   67 (21.3%)          |
  |                        Black                         55 (17.5%)          |
  |                        Mixed                         70 (22.2%)          |
  |                        Other                         56 (17.8%)          |
  |--------------------------------------------------------------------------|
  | diff_op_all_cat_2020   No appointments both years    6 ( 1.9%)           |
  |                        Fewer appointments            142 (45.1%)         |
  |                        Same number of appointments   41 (13.0%)          |
  |                        More appointments             126 (40.0%)         |
  |--------------------------------------------------------------------------|
  | diff_op_all_cat_2021   No appointments both years    4 ( 2.0%)           |
  |                        Fewer appointments            81 (40.1%)          |
  |                        Same number of appointments   27 (13.4%)          |
  |                        More appointments             90 (44.6%)          |
  +--------------------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.000005 saved
(4,978 observations deleted)

  +----------------------------------+
  | factor                 N_1   m_1 |
  |----------------------------------|
  | age_cat                 16     6 |
  |----------------------------------|
  | male                    22     0 |
  |----------------------------------|
  | Rural-Urban             22     0 |
  |----------------------------------|
  | region                  22     0 |
  |----------------------------------|
  | imd                     22     0 |
  |----------------------------------|
  | smoking                 22     0 |
  |----------------------------------|
  | time_ra                  5    17 |
  |----------------------------------|
  | bmi_cat                 22     0 |
  |----------------------------------|
  | eth5                    22     0 |
  |----------------------------------|
  | diff_op_all_cat_2020    22     0 |
  |----------------------------------|
  | diff_op_all_cat_2021    17     5 |
  +----------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------------------------------+
  |                                                      Total               |
  |--------------------------------------------------------------------------|
  |                                                      N=22                |
  |--------------------------------------------------------------------------|
  | age_cat                18 - 40 years                 6 (38%)             |
  |                        41 - 60 years                 4 (25%)             |
  |                        61 - 80 years                 6 (38%)             |
  |--------------------------------------------------------------------------|
  | male                   Female                        12 (55%)            |
  |                        Male                          10 (45%)            |
  |--------------------------------------------------------------------------|
  | Rural-Urban            Rural                         8 (36%)             |
  |                        Urban                         14 (64%)            |
  |--------------------------------------------------------------------------|
  | region                 East Midlands                 2 ( 9%)             |
  |                        East of England               3 (14%)             |
  |                        London                        4 (18%)             |
  |                        North East                    4 (18%)             |
  |                        North West                    2 ( 9%)             |
  |                        South East                    4 (18%)             |
  |                        West Midlands                 1 ( 5%)             |
  |                        Yorkshire and the Humber      2 ( 9%)             |
  |--------------------------------------------------------------------------|
  | imd                    1                             1 ( 5%)             |
  |                        2                             7 (32%)             |
  |                        3                             4 (18%)             |
  |                        4                             6 (27%)             |
  |                        5                             4 (18%)             |
  |--------------------------------------------------------------------------|
  | smoking                Never smoked                  1 ( 5%)             |
  |                        Current smoker                3 (14%)             |
  |                        Ex-smoker                     4 (18%)             |
  |                        Unknown                       14 (64%)            |
  |--------------------------------------------------------------------------|
  | time_ra                                              55.88446 (30.92495) |
  |--------------------------------------------------------------------------|
  | bmi_cat                Missing                       6 (27%)             |
  |                        Underweight                   5 (23%)             |
  |                        Healthy range                 2 ( 9%)             |
  |                        Overweight                    2 ( 9%)             |
  |                        Obese                         5 (23%)             |
  |                        Morbidly obese                2 ( 9%)             |
  |--------------------------------------------------------------------------|
  | eth5                   White                         6 (27%)             |
  |                        South Asian                   3 (14%)             |
  |                        Black                         6 (27%)             |
  |                        Mixed                         5 (23%)             |
  |                        Other                         2 ( 9%)             |
  |--------------------------------------------------------------------------|
  | diff_op_all_cat_2020   Fewer appointments            9 (41%)             |
  |                        Same number of appointments   4 (18%)             |
  |                        More appointments             9 (41%)             |
  |--------------------------------------------------------------------------|
  | diff_op_all_cat_2021   Fewer appointments            9 (53%)             |
  |                        Same number of appointments   1 ( 6%)             |
  |                        More appointments             7 (41%)             |
  +--------------------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.000005 saved
(2,010 observations deleted)

  +--------------------------------------+
  | factor                   N_1     m_1 |
  |--------------------------------------|
  | age_cat                2,361     629 |
  |--------------------------------------|
  | male                   2,990       0 |
  |--------------------------------------|
  | Rural-Urban            2,990       0 |
  |--------------------------------------|
  | region                 2,990       0 |
  |--------------------------------------|
  | imd                    2,990       0 |
  |--------------------------------------|
  | smoking                2,990       0 |
  |--------------------------------------|
  | time_ra                1,353   1,637 |
  |--------------------------------------|
  | bmi_cat                2,990       0 |
  |--------------------------------------|
  | eth5                   2,990       0 |
  |--------------------------------------|
  | diff_op_all_cat_2020   2,990       0 |
  |--------------------------------------|
  | diff_op_all_cat_2021   1,847   1,143 |
  +--------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------------------------------+
  |                                                      Total               |
  |--------------------------------------------------------------------------|
  |                                                      N=2,990             |
  |--------------------------------------------------------------------------|
  | age_cat                18 - 40 years                 884 (37.4%)         |
  |                        41 - 60 years                 782 (33.1%)         |
  |                        61 - 80 years                 569 (24.1%)         |
  |                        >80 years                     126 ( 5.3%)         |
  |--------------------------------------------------------------------------|
  | male                   Female                        1,567 (52.4%)       |
  |                        Male                          1,423 (47.6%)       |
  |--------------------------------------------------------------------------|
  | Rural-Urban            Rural                         1,507 (50.4%)       |
  |                        Urban                         1,483 (49.6%)       |
  |--------------------------------------------------------------------------|
  | region                 East Midlands                 290 ( 9.7%)         |
  |                        East of England               314 (10.5%)         |
  |                        London                        634 (21.2%)         |
  |                        North East                    274 ( 9.2%)         |
  |                        North West                    307 (10.3%)         |
  |                        South East                    567 (19.0%)         |
  |                        West Midlands                 304 (10.2%)         |
  |                        Yorkshire and the Humber      300 (10.0%)         |
  |--------------------------------------------------------------------------|
  | imd                    0                             144 ( 4.8%)         |
  |                        1                             597 (20.0%)         |
  |                        2                             525 (17.6%)         |
  |                        3                             539 (18.0%)         |
  |                        4                             585 (19.6%)         |
  |                        5                             600 (20.1%)         |
  |--------------------------------------------------------------------------|
  | smoking                Never smoked                  322 (10.8%)         |
  |                        Current smoker                544 (18.2%)         |
  |                        Ex-smoker                     453 (15.2%)         |
  |                        Unknown                       1,671 (55.9%)       |
  |--------------------------------------------------------------------------|
  | time_ra                                              54.55819 (32.48086) |
  |--------------------------------------------------------------------------|
  | bmi_cat                Missing                       594 (19.9%)         |
  |                        Underweight                   293 ( 9.8%)         |
  |                        Healthy range                 566 (18.9%)         |
  |                        Overweight                    588 (19.7%)         |
  |                        Obese                         791 (26.5%)         |
  |                        Morbidly obese                158 ( 5.3%)         |
  |--------------------------------------------------------------------------|
  | eth5                   White                         588 (19.7%)         |
  |                        South Asian                   602 (20.1%)         |
  |                        Black                         571 (19.1%)         |
  |                        Mixed                         577 (19.3%)         |
  |                        Other                         652 (21.8%)         |
  |--------------------------------------------------------------------------|
  | diff_op_all_cat_2020   No appointments both years    37 ( 1.2%)          |
  |                        Fewer appointments            1,340 (44.8%)       |
  |                        Same number of appointments   320 (10.7%)         |
  |                        More appointments             1,293 (43.2%)       |
  |--------------------------------------------------------------------------|
  | diff_op_all_cat_2021   No appointments both years    13 ( 0.7%)          |
  |                        Fewer appointments            805 (43.6%)         |
  |                        Same number of appointments   217 (11.7%)         |
  |                        More appointments             812 (44.0%)         |
  +--------------------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.000005 saved
file ./output/tables/characteristics_strata2020.csv saved
(4,794 observations deleted)

  +----------------------------------+
  | factor                 N_1   m_1 |
  |----------------------------------|
  | age_cat                164    42 |
  |----------------------------------|
  | male                   206     0 |
  |----------------------------------|
  | Rural-Urban            206     0 |
  |----------------------------------|
  | region                 206     0 |
  |----------------------------------|
  | imd                    206     0 |
  |----------------------------------|
  | smoking                206     0 |
  |----------------------------------|
  | time_ra                 77   129 |
  |----------------------------------|
  | bmi_cat                206     0 |
  |----------------------------------|
  | eth5                   206     0 |
  |----------------------------------|
  | diff_op_all_cat_2020   206     0 |
  |----------------------------------|
  | diff_op_all_cat_2021   206     0 |
  +----------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------------------------------+
  |                                                      Total               |
  |--------------------------------------------------------------------------|
  |                                                      N=206               |
  |--------------------------------------------------------------------------|
  | age_cat                18 - 40 years                 60 (36.6%)          |
  |                        41 - 60 years                 65 (39.6%)          |
  |                        61 - 80 years                 30 (18.3%)          |
  |                        >80 years                     9 ( 5.5%)           |
  |--------------------------------------------------------------------------|
  | male                   Female                        111 (53.9%)         |
  |                        Male                          95 (46.1%)          |
  |--------------------------------------------------------------------------|
  | Rural-Urban            Rural                         105 (51.0%)         |
  |                        Urban                         101 (49.0%)         |
  |--------------------------------------------------------------------------|
  | region                 East Midlands                 20 ( 9.7%)          |
  |                        East of England               23 (11.2%)          |
  |                        London                        49 (23.8%)          |
  |                        North East                    14 ( 6.8%)          |
  |                        North West                    29 (14.1%)          |
  |                        South East                    41 (19.9%)          |
  |                        West Midlands                 13 ( 6.3%)          |
  |                        Yorkshire and the Humber      17 ( 8.3%)          |
  |--------------------------------------------------------------------------|
  | imd                    0                             11 ( 5.3%)          |
  |                        1                             43 (20.9%)          |
  |                        2                             29 (14.1%)          |
  |                        3                             42 (20.4%)          |
  |                        4                             41 (19.9%)          |
  |                        5                             40 (19.4%)          |
  |--------------------------------------------------------------------------|
  | smoking                Never smoked                  24 (11.7%)          |
  |                        Current smoker                30 (14.6%)          |
  |                        Ex-smoker                     38 (18.4%)          |
  |                        Unknown                       114 (55.3%)         |
  |--------------------------------------------------------------------------|
  | time_ra                                              56.99793 (33.17112) |
  |--------------------------------------------------------------------------|
  | bmi_cat                Missing                       44 (21.4%)          |
  |                        Underweight                   27 (13.1%)          |
  |                        Healthy range                 37 (18.0%)          |
  |                        Overweight                    40 (19.4%)          |
  |                        Obese                         50 (24.3%)          |
  |                        Morbidly obese                8 ( 3.9%)           |
  |--------------------------------------------------------------------------|
  | eth5                   White                         35 (17.0%)          |
  |                        South Asian                   39 (18.9%)          |
  |                        Black                         50 (24.3%)          |
  |                        Mixed                         39 (18.9%)          |
  |                        Other                         43 (20.9%)          |
  |--------------------------------------------------------------------------|
  | diff_op_all_cat_2020   No appointments both years    2 ( 1.0%)           |
  |                        Fewer appointments            99 (48.1%)          |
  |                        Same number of appointments   20 ( 9.7%)          |
  |                        More appointments             85 (41.3%)          |
  |--------------------------------------------------------------------------|
  | diff_op_all_cat_2021   No appointments both years    2 ( 1.0%)           |
  |                        Fewer appointments            80 (38.8%)          |
  |                        Same number of appointments   24 (11.7%)          |
  |                        More appointments             100 (48.5%)         |
  +--------------------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.000005 saved
(4,995 observations deleted)

  +----------------------------------+
  | factor                 N_1   m_1 |
  |----------------------------------|
  | age_cat                  5     0 |
  |----------------------------------|
  | male                     5     0 |
  |----------------------------------|
  | Rural-Urban              5     0 |
  |----------------------------------|
  | region                   5     0 |
  |----------------------------------|
  | imd                      5     0 |
  |----------------------------------|
  | smoking                  5     0 |
  |----------------------------------|
  | time_ra                  0     5 |
  |----------------------------------|
  | bmi_cat                  5     0 |
  |----------------------------------|
  | eth5                     5     0 |
  |----------------------------------|
  | diff_op_all_cat_2020     5     0 |
  |----------------------------------|
  | diff_op_all_cat_2021     5     0 |
  +----------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +---------------------------------------------------------------+
  |                                                      Total    |
  |---------------------------------------------------------------|
  |                                                      N=5      |
  |---------------------------------------------------------------|
  | age_cat                18 - 40 years                 5 (100%) |
  |---------------------------------------------------------------|
  | male                   Female                        3 (60%)  |
  |                        Male                          2 (40%)  |
  |---------------------------------------------------------------|
  | Rural-Urban            Rural                         4 (80%)  |
  |                        Urban                         1 (20%)  |
  |---------------------------------------------------------------|
  | region                 East of England               1 (20%)  |
  |                        North East                    1 (20%)  |
  |                        South East                    2 (40%)  |
  |                        West Midlands                 1 (20%)  |
  |---------------------------------------------------------------|
  | imd                    1                             1 (20%)  |
  |                        4                             3 (60%)  |
  |                        5                             1 (20%)  |
  |---------------------------------------------------------------|
  | smoking                Never smoked                  1 (20%)  |
  |                        Current smoker                1 (20%)  |
  |                        Unknown                       3 (60%)  |
  |---------------------------------------------------------------|
  | time_ra                                                       |
  |---------------------------------------------------------------|
  | bmi_cat                Missing                       3 (60%)  |
  |                        Overweight                    1 (20%)  |
  |                        Obese                         1 (20%)  |
  |---------------------------------------------------------------|
  | eth5                   White                         1 (20%)  |
  |                        Black                         1 (20%)  |
  |                        Mixed                         2 (40%)  |
  |                        Other                         1 (20%)  |
  |---------------------------------------------------------------|
  | diff_op_all_cat_2020   Same number of appointments   1 (20%)  |
  |                        More appointments             4 (80%)  |
  |---------------------------------------------------------------|
  | diff_op_all_cat_2021   Fewer appointments            3 (60%)  |
  |                        More appointments             2 (40%)  |
  +---------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
(note: variable Total was str8, now str19 to accommodate using data's values)
file /tmp/St00015.000005 saved
(3,145 observations deleted)

  +--------------------------------------+
  | factor                   N_1     m_1 |
  |--------------------------------------|
  | age_cat                1,473     382 |
  |--------------------------------------|
  | male                   1,855       0 |
  |--------------------------------------|
  | Rural-Urban            1,855       0 |
  |--------------------------------------|
  | region                 1,855       0 |
  |--------------------------------------|
  | imd                    1,855       0 |
  |--------------------------------------|
  | smoking                1,855       0 |
  |--------------------------------------|
  | time_ra                  844   1,011 |
  |--------------------------------------|
  | bmi_cat                1,855       0 |
  |--------------------------------------|
  | eth5                   1,855       0 |
  |--------------------------------------|
  | diff_op_all_cat_2020   1,855       0 |
  |--------------------------------------|
  | diff_op_all_cat_2021   1,855       0 |
  +--------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------------------------------+
  |                                                      Total               |
  |--------------------------------------------------------------------------|
  |                                                      N=1,855             |
  |--------------------------------------------------------------------------|
  | age_cat                18 - 40 years                 538 (36.5%)         |
  |                        41 - 60 years                 486 (33.0%)         |
  |                        61 - 80 years                 373 (25.3%)         |
  |                        >80 years                     76 ( 5.2%)          |
  |--------------------------------------------------------------------------|
  | male                   Female                        990 (53.4%)         |
  |                        Male                          865 (46.6%)         |
  |--------------------------------------------------------------------------|
  | Rural-Urban            Rural                         918 (49.5%)         |
  |                        Urban                         937 (50.5%)         |
  |--------------------------------------------------------------------------|
  | region                 East Midlands                 188 (10.1%)         |
  |                        East of England               192 (10.4%)         |
  |                        London                        378 (20.4%)         |
  |                        North East                    179 ( 9.6%)         |
  |                        North West                    175 ( 9.4%)         |
  |                        South East                    362 (19.5%)         |
  |                        West Midlands                 180 ( 9.7%)         |
  |                        Yorkshire and the Humber      201 (10.8%)         |
  |--------------------------------------------------------------------------|
  | imd                    0                             86 ( 4.6%)          |
  |                        1                             366 (19.7%)         |
  |                        2                             349 (18.8%)         |
  |                        3                             334 (18.0%)         |
  |                        4                             357 (19.2%)         |
  |                        5                             363 (19.6%)         |
  |--------------------------------------------------------------------------|
  | smoking                Never smoked                  190 (10.2%)         |
  |                        Current smoker                347 (18.7%)         |
  |                        Ex-smoker                     273 (14.7%)         |
  |                        Unknown                       1,045 (56.3%)       |
  |--------------------------------------------------------------------------|
  | time_ra                                              54.01324 (32.91662) |
  |--------------------------------------------------------------------------|
  | bmi_cat                Missing                       378 (20.4%)         |
  |                        Underweight                   180 ( 9.7%)         |
  |                        Healthy range                 349 (18.8%)         |
  |                        Overweight                    362 (19.5%)         |
  |                        Obese                         497 (26.8%)         |
  |                        Morbidly obese                89 ( 4.8%)          |
  |--------------------------------------------------------------------------|
  | eth5                   White                         377 (20.3%)         |
  |                        South Asian                   387 (20.9%)         |
  |                        Black                         347 (18.7%)         |
  |                        Mixed                         347 (18.7%)         |
  |                        Other                         397 (21.4%)         |
  |--------------------------------------------------------------------------|
  | diff_op_all_cat_2020   No appointments both years    25 ( 1.3%)          |
  |                        Fewer appointments            829 (44.7%)         |
  |                        Same number of appointments   203 (10.9%)         |
  |                        More appointments             798 (43.0%)         |
  |--------------------------------------------------------------------------|
  | diff_op_all_cat_2021   No appointments both years    15 ( 0.8%)          |
  |                        Fewer appointments            812 (43.8%)         |
  |                        Same number of appointments   221 (11.9%)         |
  |                        More appointments             807 (43.5%)         |
  +--------------------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.000005 saved
file ./output/tables/characteristics_strata2021.csv saved

. 
. * Tabulate characteristics by categories of differences in rheumatology outpa
> tient appointments for each year
. drop if region=="missing"
(0 observations deleted)

. tempfile tempfile

. forvalues i=2020/2021 {
  2.     preserve
  3.     keep if diff_op_cat_`i'==0
  4.     table1_mc, vars(age_cat cate \ male cate \ urban_rural_bin cate \ regi
> on cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat cate) clear
  5.     save `tempfile', replace
  6.     restore
  7.     forvalues j=1/3 {
  8.         preserve
  9.         keep if diff_op_cat_`i'==`j'
 10.         table1_mc, vars(age_cat cate \ male cate \ urban_rural_bin cate \ 
> region cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat cate) clear
 11.         append using `tempfile'
 12.         save `tempfile', replace
 13.         if `j'==3 {
 14.             export delimited using ./output/tables/characteristics_diff_st
> rata`i'.csv
 15.             }
 16.         restore
 17.         }
 18.     * Multinomial logistic regression
.     mlogit diff_op_cat_`i' ib3.age_cat i.male i.urban_rural_bin i.imd i.smoki
> ng bmi time_ra, baseoutcome(2) rrr 
 19.     est sto m1
 20.     *coefplot, drop(_cons) keep(*:) omitted baselevels
.     *coefplot (m1, keep(More_appointments:*)) (m1,keep(Fewer_appointments:*))
>  (m1, keep(No_appointments_both_years:*)), drop(_cons) xline(1) eform 
.     parmest, label eform format(estimate p min95 max95) saving("./output/temp
> data/diff_rheum_`i'", replace) idstr("diff_rheum_`i'")
 21.     *graph export ./output/tables/coefplot_`i'.svg, as(svg) replace 
.     }
(4,966 observations deleted)

  +-------------------------+
  | factor        N_1   m_1 |
  |-------------------------|
  | age_cat        26     8 |
  |-------------------------|
  | male           34     0 |
  |-------------------------|
  | Rural-Urban    34     0 |
  |-------------------------|
  | region         34     0 |
  |-------------------------|
  | imd            34     0 |
  |-------------------------|
  | smoking        34     0 |
  |-------------------------|
  | time_ra        18    16 |
  |-------------------------|
  | bmi_cat        34     0 |
  +-------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------------------+
  |                                          Total               |
  |--------------------------------------------------------------|
  |                                          N=34                |
  |--------------------------------------------------------------|
  | age_cat       18 - 40 years              8 (31%)             |
  |               41 - 60 years              7 (27%)             |
  |               61 - 80 years              11 (42%)            |
  |--------------------------------------------------------------|
  | male          Female                     22 (65%)            |
  |               Male                       12 (35%)            |
  |--------------------------------------------------------------|
  | Rural-Urban   Rural                      16 (47%)            |
  |               Urban                      18 (53%)            |
  |--------------------------------------------------------------|
  | region        East Midlands              3 ( 9%)             |
  |               East of England            5 (15%)             |
  |               London                     3 ( 9%)             |
  |               North East                 4 (12%)             |
  |               North West                 4 (12%)             |
  |               South East                 11 (32%)            |
  |               West Midlands              1 ( 3%)             |
  |               Yorkshire and the Humber   3 ( 9%)             |
  |--------------------------------------------------------------|
  | imd           1                          10 (29%)            |
  |               2                          5 (15%)             |
  |               3                          7 (21%)             |
  |               4                          3 ( 9%)             |
  |               5                          9 (26%)             |
  |--------------------------------------------------------------|
  | smoking       Never smoked               6 (18%)             |
  |               Current smoker             9 (26%)             |
  |               Ex-smoker                  3 ( 9%)             |
  |               Unknown                    16 (47%)            |
  |--------------------------------------------------------------|
  | time_ra                                  63.39478 (34.92302) |
  |--------------------------------------------------------------|
  | bmi_cat       Missing                    6 (18%)             |
  |               Underweight                5 (15%)             |
  |               Healthy range              5 (15%)             |
  |               Overweight                 8 (24%)             |
  |               Obese                      7 (21%)             |
  |               Morbidly obese             3 ( 9%)             |
  +--------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
(note: file /tmp/St00015.00000f not found)
file /tmp/St00015.00000f saved
(3,512 observations deleted)

  +---------------------------+
  | factor          N_1   m_1 |
  |---------------------------|
  | age_cat       1,195   293 |
  |---------------------------|
  | male          1,488     0 |
  |---------------------------|
  | Rural-Urban   1,488     0 |
  |---------------------------|
  | region        1,488     0 |
  |---------------------------|
  | imd           1,488     0 |
  |---------------------------|
  | smoking       1,488     0 |
  |---------------------------|
  | time_ra         665   823 |
  |---------------------------|
  | bmi_cat       1,488     0 |
  +---------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------------------+
  |                                          Total               |
  |--------------------------------------------------------------|
  |                                          N=1,488             |
  |--------------------------------------------------------------|
  | age_cat       18 - 40 years              428 (35.8%)         |
  |               41 - 60 years              419 (35.1%)         |
  |               61 - 80 years              286 (23.9%)         |
  |               >80 years                  62 ( 5.2%)          |
  |--------------------------------------------------------------|
  | male          Female                     801 (53.8%)         |
  |               Male                       687 (46.2%)         |
  |--------------------------------------------------------------|
  | Rural-Urban   Rural                      710 (47.7%)         |
  |               Urban                      778 (52.3%)         |
  |--------------------------------------------------------------|
  | region        East Midlands              142 ( 9.5%)         |
  |               East of England            165 (11.1%)         |
  |               London                     320 (21.5%)         |
  |               North East                 149 (10.0%)         |
  |               North West                 159 (10.7%)         |
  |               South East                 282 (19.0%)         |
  |               West Midlands              135 ( 9.1%)         |
  |               Yorkshire and the Humber   136 ( 9.1%)         |
  |--------------------------------------------------------------|
  | imd           0                          71 ( 4.8%)          |
  |               1                          266 (17.9%)         |
  |               2                          281 (18.9%)         |
  |               3                          274 (18.4%)         |
  |               4                          302 (20.3%)         |
  |               5                          294 (19.8%)         |
  |--------------------------------------------------------------|
  | smoking       Never smoked               157 (10.6%)         |
  |               Current smoker             283 (19.0%)         |
  |               Ex-smoker                  208 (14.0%)         |
  |               Unknown                    840 (56.5%)         |
  |--------------------------------------------------------------|
  | time_ra                                  54.39684 (32.41229) |
  |--------------------------------------------------------------|
  | bmi_cat       Missing                    307 (20.6%)         |
  |               Underweight                140 ( 9.4%)         |
  |               Healthy range              273 (18.3%)         |
  |               Overweight                 299 (20.1%)         |
  |               Obese                      395 (26.5%)         |
  |               Morbidly obese             74 ( 5.0%)          |
  +--------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.00000f saved
(4,674 observations deleted)

  +-------------------------+
  | factor        N_1   m_1 |
  |-------------------------|
  | age_cat       251    75 |
  |-------------------------|
  | male          326     0 |
  |-------------------------|
  | Rural-Urban   326     0 |
  |-------------------------|
  | region        326     0 |
  |-------------------------|
  | imd           326     0 |
  |-------------------------|
  | smoking       326     0 |
  |-------------------------|
  | time_ra       141   185 |
  |-------------------------|
  | bmi_cat       326     0 |
  +-------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +-------------------------------------------------------------+
  |                                          Total              |
  |-------------------------------------------------------------|
  |                                          N=326              |
  |-------------------------------------------------------------|
  | age_cat       18 - 40 years              89 (35.5%)         |
  |               41 - 60 years              84 (33.5%)         |
  |               61 - 80 years              70 (27.9%)         |
  |               >80 years                  8 ( 3.2%)          |
  |-------------------------------------------------------------|
  | male          Female                     183 (56.1%)        |
  |               Male                       143 (43.9%)        |
  |-------------------------------------------------------------|
  | Rural-Urban   Rural                      167 (51.2%)        |
  |               Urban                      159 (48.8%)        |
  |-------------------------------------------------------------|
  | region        East Midlands              25 ( 7.7%)         |
  |               East of England            33 (10.1%)         |
  |               London                     62 (19.0%)         |
  |               North East                 37 (11.3%)         |
  |               North West                 36 (11.0%)         |
  |               South East                 70 (21.5%)         |
  |               West Midlands              30 ( 9.2%)         |
  |               Yorkshire and the Humber   33 (10.1%)         |
  |-------------------------------------------------------------|
  | imd           0                          12 ( 3.7%)         |
  |               1                          68 (20.9%)         |
  |               2                          53 (16.3%)         |
  |               3                          55 (16.9%)         |
  |               4                          72 (22.1%)         |
  |               5                          66 (20.2%)         |
  |-------------------------------------------------------------|
  | smoking       Never smoked               46 (14.1%)         |
  |               Current smoker             58 (17.8%)         |
  |               Ex-smoker                  46 (14.1%)         |
  |               Unknown                    176 (54.0%)        |
  |-------------------------------------------------------------|
  | time_ra                                  54.9088 (33.45539) |
  |-------------------------------------------------------------|
  | bmi_cat       Missing                    61 (18.7%)         |
  |               Underweight                30 ( 9.2%)         |
  |               Healthy range              63 (19.3%)         |
  |               Overweight                 62 (19.0%)         |
  |               Obese                      93 (28.5%)         |
  |               Morbidly obese             17 ( 5.2%)         |
  +-------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
(note: variable Total was str18, now str19 to accommodate using data's
       values)
file /tmp/St00015.00000f saved
(3,521 observations deleted)

  +---------------------------+
  | factor          N_1   m_1 |
  |---------------------------|
  | age_cat       1,155   324 |
  |---------------------------|
  | male          1,479     0 |
  |---------------------------|
  | Rural-Urban   1,479     0 |
  |---------------------------|
  | region        1,479     0 |
  |---------------------------|
  | imd           1,479     0 |
  |---------------------------|
  | smoking       1,479     0 |
  |---------------------------|
  | time_ra         671   808 |
  |---------------------------|
  | bmi_cat       1,479     0 |
  +---------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------------------+
  |                                          Total               |
  |--------------------------------------------------------------|
  |                                          N=1,479             |
  |--------------------------------------------------------------|
  | age_cat       18 - 40 years              457 (39.6%)         |
  |               41 - 60 years              359 (31.1%)         |
  |               61 - 80 years              271 (23.5%)         |
  |               >80 years                  68 ( 5.9%)          |
  |--------------------------------------------------------------|
  | male          Female                     755 (51.0%)         |
  |               Male                       724 (49.0%)         |
  |--------------------------------------------------------------|
  | Rural-Urban   Rural                      767 (51.9%)         |
  |               Urban                      712 (48.1%)         |
  |--------------------------------------------------------------|
  | region        East Midlands              154 (10.4%)         |
  |               East of England            152 (10.3%)         |
  |               London                     318 (21.5%)         |
  |               North East                 124 ( 8.4%)         |
  |               North West                 140 ( 9.5%)         |
  |               South East                 265 (17.9%)         |
  |               West Midlands              161 (10.9%)         |
  |               Yorkshire and the Humber   165 (11.2%)         |
  |--------------------------------------------------------------|
  | imd           0                          74 ( 5.0%)          |
  |               1                          317 (21.4%)         |
  |               2                          263 (17.8%)         |
  |               3                          272 (18.4%)         |
  |               4                          262 (17.7%)         |
  |               5                          291 (19.7%)         |
  |--------------------------------------------------------------|
  | smoking       Never smoked               143 ( 9.7%)         |
  |               Current smoker             272 (18.4%)         |
  |               Ex-smoker                  230 (15.6%)         |
  |               Unknown                    834 (56.4%)         |
  |--------------------------------------------------------------|
  | time_ra                                  55.26461 (32.52556) |
  |--------------------------------------------------------------|
  | bmi_cat       Missing                    297 (20.1%)         |
  |               Underweight                148 (10.0%)         |
  |               Healthy range              282 (19.1%)         |
  |               Overweight                 289 (19.5%)         |
  |               Obese                      386 (26.1%)         |
  |               Morbidly obese             77 ( 5.2%)          |
  +--------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.00000f saved
file ./output/tables/characteristics_diff_strata2020.csv saved

Iteration 0:   log likelihood = -1152.1333  
Iteration 1:   log likelihood = -1133.0835  
Iteration 2:   log likelihood = -1131.0521  
Iteration 3:   log likelihood = -1130.8949  
Iteration 4:   log likelihood = -1130.8556  
Iteration 5:   log likelihood = -1130.8475  
Iteration 6:   log likelihood = -1130.8464  
Iteration 7:   log likelihood = -1130.8463  
Iteration 8:   log likelihood = -1130.8463  

Multinomial logistic regression                 Number of obs     =      1,155
                                                LR chi2(45)       =      42.57
                                                Prob > chi2       =     0.5753
Log likelihood = -1130.8463                     Pseudo R2         =     0.0185

------------------------------------------------------------------------------
diff_op_ca~0 |        RRR   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
No_appoint~s |
     age_cat |
18 - 40 y..  |   56251.34   3.18e+07     0.02   0.985            0           .
41 - 60 y..  |   145643.6   8.24e+07     0.02   0.983            0           .
61 - 80 y..  |   290795.1   1.65e+08     0.02   0.982            0           .
             |
        male |
       Male  |   .5226107   .3141588    -1.08   0.280     .1608765    1.697712
             |
urban_rura~n |
      Urban  |   .5513182   .3295545    -1.00   0.319     .1708403    1.779157
             |
         imd |
          1  |   271275.3   1.48e+08     0.02   0.982            0           .
          2  |   162429.4   8.85e+07     0.02   0.982            0           .
          3  |   198273.1   1.08e+08     0.02   0.982            0           .
          4  |   165862.6   9.04e+07     0.02   0.982            0           .
          5  |   296849.2   1.62e+08     0.02   0.982            0           .
             |
     smoking |
Current s..  |      1.522   1.425864     0.45   0.654     .2426488     9.54665
  Ex-smoker  |   .6260134   .8072617    -0.36   0.716      .049996    7.838478
    Unknown  |   .9381861   .8065187    -0.07   0.941     .1739992    5.058605
             |
         bmi |   .9812656   .0201882    -0.92   0.358     .9424847    1.021642
     time_ra |   1.005506   .0090909     0.61   0.544     .9878452    1.023483
       _cons |   7.32e-12   5.75e-09    -0.03   0.974            0           .
-------------+----------------------------------------------------------------
Fewer_appo~s |
     age_cat |
18 - 40 y..  |   .7857094   .4467225    -0.42   0.671     .2578121    2.394532
41 - 60 y..  |   .6532451   .3719946    -0.75   0.455     .2139705    1.994336
61 - 80 y..  |     .68182   .3929488    -0.66   0.506     .2203446     2.10978
             |
        male |
       Male  |   .9051276   .1926193    -0.47   0.639     .5964396    1.373577
             |
urban_rura~n |
      Urban  |   1.173922   .2486492     0.76   0.449     .7750783    1.778004
             |
         imd |
          1  |   .5705294   .3048734    -1.05   0.294     .2001806    1.626051
          2  |   1.029659   .5646483     0.05   0.957     .3514861    3.016328
          3  |    .909065   .5061315    -0.17   0.864     .3052668    2.707138
          4  |   .8363091   .4533067    -0.33   0.742       .28906    2.419612
          5  |   .6869033   .3710988    -0.70   0.487      .238251    1.980416
             |
     smoking |
Current s..  |   1.269295   .4762411     0.64   0.525     .6084019    2.648101
  Ex-smoker  |   1.360313   .5663169     0.74   0.460     .6015506    3.076137
    Unknown  |   1.381674   .4532958     0.99   0.324     .7263495    2.628242
             |
         bmi |   .9918615   .0080558    -1.01   0.314     .9761975    1.007777
     time_ra |   .9999226   .0032391    -0.02   0.981     .9935942    1.006291
       _cons |   7.462474   6.202573     2.42   0.016     1.463494    38.05176
-------------+----------------------------------------------------------------
Same_numbe~s |  (base outcome)
-------------+----------------------------------------------------------------
More_appoi~s |
     age_cat |
18 - 40 y..  |   .6794717   .3815795    -0.69   0.491     .2260223    2.042638
41 - 60 y..  |   .5115858   .2880661    -1.19   0.234     .1696758    1.542471
61 - 80 y..  |   .5227187   .2981569    -1.14   0.255     .1709015    1.598786
             |
        male |
       Male  |   .9486693   .2022131    -0.25   0.805     .6247086    1.440629
             |
urban_rura~n |
      Urban  |   .9820563   .2083139    -0.09   0.932     .6480065     1.48831
             |
         imd |
          1  |   1.044474    .568012     0.08   0.936     .3597427    3.032516
          2  |   1.292065   .7246198     0.46   0.648     .4304383    3.878446
          3  |    1.21216   .6892725     0.34   0.735     .3976853    3.694707
          4  |   .8006094   .4463376    -0.40   0.690     .2684591    2.387609
          5  |   1.164419    .640699     0.28   0.782     .3960521     3.42347
             |
     smoking |
Current s..  |   1.265027     .48267     0.62   0.538     .5988587    2.672237
  Ex-smoker  |   1.789792   .7501965     1.39   0.165       .78708    4.069922
    Unknown  |   1.726144   .5740921     1.64   0.101     .8994535    3.312646
             |
         bmi |   .9952278   .0081189    -0.59   0.558     .9794416    1.011269
     time_ra |   .9991427   .0032423    -0.26   0.792     .9928081    1.005518
       _cons |   5.718557   4.783783     2.08   0.037      1.10975    29.46781
------------------------------------------------------------------------------
Note: _cons estimates baseline relative risk for each outcome.
(note: file ./output/tempdata/diff_rheum_2020.dta not found)
file ./output/tempdata/diff_rheum_2020.dta saved
(4,979 observations deleted)

  +-------------------------+
  | factor        N_1   m_1 |
  |-------------------------|
  | age_cat        16     5 |
  |-------------------------|
  | male           21     0 |
  |-------------------------|
  | Rural-Urban    21     0 |
  |-------------------------|
  | region         21     0 |
  |-------------------------|
  | imd            21     0 |
  |-------------------------|
  | smoking        21     0 |
  |-------------------------|
  | time_ra        14     7 |
  |-------------------------|
  | bmi_cat        21     0 |
  +-------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------------------+
  |                                          Total               |
  |--------------------------------------------------------------|
  |                                          N=21                |
  |--------------------------------------------------------------|
  | age_cat       18 - 40 years              5 (31%)             |
  |               41 - 60 years              8 (50%)             |
  |               61 - 80 years              3 (19%)             |
  |--------------------------------------------------------------|
  | male          Female                     10 (48%)            |
  |               Male                       11 (52%)            |
  |--------------------------------------------------------------|
  | Rural-Urban   Rural                      12 (57%)            |
  |               Urban                      9 (43%)             |
  |--------------------------------------------------------------|
  | region        East Midlands              3 (14%)             |
  |               East of England            4 (19%)             |
  |               London                     3 (14%)             |
  |               North East                 2 (10%)             |
  |               North West                 3 (14%)             |
  |               South East                 3 (14%)             |
  |               West Midlands              2 (10%)             |
  |               Yorkshire and the Humber   1 ( 5%)             |
  |--------------------------------------------------------------|
  | imd           1                          7 (33%)             |
  |               2                          6 (29%)             |
  |               3                          3 (14%)             |
  |               4                          2 (10%)             |
  |               5                          3 (14%)             |
  |--------------------------------------------------------------|
  | smoking       Never smoked               2 (10%)             |
  |               Current smoker             2 (10%)             |
  |               Ex-smoker                  4 (19%)             |
  |               Unknown                    13 (62%)            |
  |--------------------------------------------------------------|
  | time_ra                                  63.16515 (33.39494) |
  |--------------------------------------------------------------|
  | bmi_cat       Missing                    4 (19%)             |
  |               Underweight                1 ( 5%)             |
  |               Healthy range              1 ( 5%)             |
  |               Overweight                 6 (29%)             |
  |               Obese                      7 (33%)             |
  |               Morbidly obese             2 (10%)             |
  +--------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.00000f saved
(4,134 observations deleted)

  +-------------------------+
  | factor        N_1   m_1 |
  |-------------------------|
  | age_cat       690   176 |
  |-------------------------|
  | male          866     0 |
  |-------------------------|
  | Rural-Urban   866     0 |
  |-------------------------|
  | region        866     0 |
  |-------------------------|
  | imd           866     0 |
  |-------------------------|
  | smoking       866     0 |
  |-------------------------|
  | time_ra       375   491 |
  |-------------------------|
  | bmi_cat       866     0 |
  +-------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +-------------------------------------------------------------+
  |                                          Total              |
  |-------------------------------------------------------------|
  |                                          N=866              |
  |-------------------------------------------------------------|
  | age_cat       18 - 40 years              265 (38.4%)        |
  |               41 - 60 years              232 (33.6%)        |
  |               61 - 80 years              156 (22.6%)        |
  |               >80 years                  37 ( 5.4%)         |
  |-------------------------------------------------------------|
  | male          Female                     448 (51.7%)        |
  |               Male                       418 (48.3%)        |
  |-------------------------------------------------------------|
  | Rural-Urban   Rural                      440 (50.8%)        |
  |               Urban                      426 (49.2%)        |
  |-------------------------------------------------------------|
  | region        East Midlands              80 ( 9.2%)         |
  |               East of England            93 (10.7%)         |
  |               London                     179 (20.7%)        |
  |               North East                 82 ( 9.5%)         |
  |               North West                 75 ( 8.7%)         |
  |               South East                 174 (20.1%)        |
  |               West Midlands              80 ( 9.2%)         |
  |               Yorkshire and the Humber   103 (11.9%)        |
  |-------------------------------------------------------------|
  | imd           0                          41 ( 4.7%)         |
  |               1                          167 (19.3%)        |
  |               2                          149 (17.2%)        |
  |               3                          142 (16.4%)        |
  |               4                          184 (21.2%)        |
  |               5                          183 (21.1%)        |
  |-------------------------------------------------------------|
  | smoking       Never smoked               91 (10.5%)         |
  |               Current smoker             159 (18.4%)        |
  |               Ex-smoker                  138 (15.9%)        |
  |               Unknown                    478 (55.2%)        |
  |-------------------------------------------------------------|
  | time_ra                                  53.78195 (33.6349) |
  |-------------------------------------------------------------|
  | bmi_cat       Missing                    186 (21.5%)        |
  |               Underweight                95 (11.0%)         |
  |               Healthy range              157 (18.1%)        |
  |               Overweight                 169 (19.5%)        |
  |               Obese                      220 (25.4%)        |
  |               Morbidly obese             39 ( 4.5%)         |
  +-------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
(note: variable Total was str18, now str19 to accommodate using data's
       values)
file /tmp/St00015.00000f saved
(4,747 observations deleted)

  +-------------------------+
  | factor        N_1   m_1 |
  |-------------------------|
  | age_cat       200    53 |
  |-------------------------|
  | male          253     0 |
  |-------------------------|
  | Rural-Urban   253     0 |
  |-------------------------|
  | region        253     0 |
  |-------------------------|
  | imd           253     0 |
  |-------------------------|
  | smoking       253     0 |
  |-------------------------|
  | time_ra       111   142 |
  |-------------------------|
  | bmi_cat       253     0 |
  +-------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------------------+
  |                                          Total               |
  |--------------------------------------------------------------|
  |                                          N=253               |
  |--------------------------------------------------------------|
  | age_cat       18 - 40 years              76 (38.0%)          |
  |               41 - 60 years              62 (31.0%)          |
  |               61 - 80 years              51 (25.5%)          |
  |               >80 years                  11 ( 5.5%)          |
  |--------------------------------------------------------------|
  | male          Female                     150 (59.3%)         |
  |               Male                       103 (40.7%)         |
  |--------------------------------------------------------------|
  | Rural-Urban   Rural                      145 (57.3%)         |
  |               Urban                      108 (42.7%)         |
  |--------------------------------------------------------------|
  | region        East Midlands              23 ( 9.1%)          |
  |               East of England            27 (10.7%)          |
  |               London                     49 (19.4%)          |
  |               North East                 22 ( 8.7%)          |
  |               North West                 24 ( 9.5%)          |
  |               South East                 49 (19.4%)          |
  |               West Midlands              33 (13.0%)          |
  |               Yorkshire and the Humber   26 (10.3%)          |
  |--------------------------------------------------------------|
  | imd           0                          11 ( 4.3%)          |
  |               1                          57 (22.5%)          |
  |               2                          46 (18.2%)          |
  |               3                          58 (22.9%)          |
  |               4                          47 (18.6%)          |
  |               5                          34 (13.4%)          |
  |--------------------------------------------------------------|
  | smoking       Never smoked               27 (10.7%)          |
  |               Current smoker             48 (19.0%)          |
  |               Ex-smoker                  41 (16.2%)          |
  |               Unknown                    137 (54.2%)         |
  |--------------------------------------------------------------|
  | time_ra                                  58.20098 (32.50908) |
  |--------------------------------------------------------------|
  | bmi_cat       Missing                    51 (20.2%)          |
  |               Underweight                19 ( 7.5%)          |
  |               Healthy range              54 (21.3%)          |
  |               Overweight                 52 (20.6%)          |
  |               Obese                      65 (25.7%)          |
  |               Morbidly obese             12 ( 4.7%)          |
  +--------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.00000f saved
(4,074 observations deleted)

  +-------------------------+
  | factor        N_1   m_1 |
  |-------------------------|
  | age_cat       736   190 |
  |-------------------------|
  | male          926     0 |
  |-------------------------|
  | Rural-Urban   926     0 |
  |-------------------------|
  | region        926     0 |
  |-------------------------|
  | imd           926     0 |
  |-------------------------|
  | smoking       926     0 |
  |-------------------------|
  | time_ra       421   505 |
  |-------------------------|
  | bmi_cat       926     0 |
  +-------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------------------+
  |                                          Total               |
  |--------------------------------------------------------------|
  |                                          N=926               |
  |--------------------------------------------------------------|
  | age_cat       18 - 40 years              257 (34.9%)         |
  |               41 - 60 years              249 (33.8%)         |
  |               61 - 80 years              193 (26.2%)         |
  |               >80 years                  37 ( 5.0%)          |
  |--------------------------------------------------------------|
  | male          Female                     496 (53.6%)         |
  |               Male                       430 (46.4%)         |
  |--------------------------------------------------------------|
  | Rural-Urban   Rural                      430 (46.4%)         |
  |               Urban                      496 (53.6%)         |
  |--------------------------------------------------------------|
  | region        East Midlands              102 (11.0%)         |
  |               East of England            92 ( 9.9%)          |
  |               London                     196 (21.2%)         |
  |               North East                 88 ( 9.5%)          |
  |               North West                 102 (11.0%)         |
  |               South East                 179 (19.3%)         |
  |               West Midlands              79 ( 8.5%)          |
  |               Yorkshire and the Humber   88 ( 9.5%)          |
  |--------------------------------------------------------------|
  | imd           0                          45 ( 4.9%)          |
  |               1                          179 (19.3%)         |
  |               2                          177 (19.1%)         |
  |               3                          173 (18.7%)         |
  |               4                          168 (18.1%)         |
  |               5                          184 (19.9%)         |
  |--------------------------------------------------------------|
  | smoking       Never smoked               95 (10.3%)          |
  |               Current smoker             169 (18.3%)         |
  |               Ex-smoker                  128 (13.8%)         |
  |               Unknown                    534 (57.7%)         |
  |--------------------------------------------------------------|
  | time_ra                                  53.35669 (32.38623) |
  |--------------------------------------------------------------|
  | bmi_cat       Missing                    184 (19.9%)         |
  |               Underweight                92 ( 9.9%)          |
  |               Healthy range              174 (18.8%)         |
  |               Overweight                 176 (19.0%)         |
  |               Obese                      256 (27.6%)         |
  |               Morbidly obese             44 ( 4.8%)          |
  +--------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.00000f saved
file ./output/tables/characteristics_diff_strata2021.csv saved

Iteration 0:   log likelihood = -721.92396  
Iteration 1:   log likelihood = -704.14465  
Iteration 2:   log likelihood = -700.05938  
Iteration 3:   log likelihood = -699.67914  
Iteration 4:   log likelihood = -699.59013  
Iteration 5:   log likelihood = -699.57214  
Iteration 6:   log likelihood = -699.56807  
Iteration 7:   log likelihood = -699.56704  
Iteration 8:   log likelihood = -699.56685  
Iteration 9:   log likelihood = -699.56682  
Iteration 10:  log likelihood = -699.56681  

Multinomial logistic regression                 Number of obs     =        704
                                                LR chi2(45)       =      44.71
                                                Prob > chi2       =     0.4840
Log likelihood = -699.56681                     Pseudo R2         =     0.0310

------------------------------------------------------------------------------
diff_op_ca~1 |        RRR   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
No_appoint~s |
     age_cat |
18 - 40 y..  |   784830.5   1.53e+09     0.01   0.994            0           .
41 - 60 y..  |    1679800   3.28e+09     0.01   0.994            0           .
61 - 80 y..  |    1662526   3.24e+09     0.01   0.994            0           .
             |
        male |
       Male  |   .7010042   .5391109    -0.46   0.644     .1552743    3.164765
             |
urban_rura~n |
      Urban  |   .3118144   .2633519    -1.38   0.168     .0595647    1.632312
             |
         imd |
          1  |   802422.1   1.69e+09     0.01   0.995            0           .
          2  |    1355164   2.85e+09     0.01   0.995            0           .
          3  |   336840.5   7.08e+08     0.01   0.995            0           .
          4  |   456671.7   9.60e+08     0.01   0.995            0           .
          5  |    1175315   2.47e+09     0.01   0.995            0           .
             |
     smoking |
Current s..  |   2.70e-07   .0002891    -0.01   0.989            0           .
  Ex-smoker  |   1.209396   1.415932     0.16   0.871     .1218993    11.99873
    Unknown  |   .4372603   .4104486    -0.88   0.378     .0694596    2.752631
             |
         bmi |    1.05361   .0390845     1.41   0.159     .9797238    1.133067
     time_ra |   1.005678   .0112871     0.50   0.614      .983797    1.028045
       _cons |   6.94e-14   1.99e-10    -0.01   0.992            0           .
-------------+----------------------------------------------------------------
Fewer_appo~s |
     age_cat |
18 - 40 y..  |   .8044433    .545626    -0.32   0.748     .2128898    3.039736
41 - 60 y..  |   .7375194   .5050083    -0.44   0.657     .1927181    2.822438
61 - 80 y..  |   .7953475   .5523625    -0.33   0.742     .2038939    3.102484
             |
        male |
       Male  |   1.570584   .4118396     1.72   0.085     .9394173    2.625813
             |
urban_rura~n |
      Urban  |   1.065082   .2731176     0.25   0.806      .644333    1.760579
             |
         imd |
          1  |   .5878457   .4797828    -0.65   0.515     .1187236    2.910648
          2  |   .8287139   .6906296    -0.23   0.822     .1618208    4.243995
          3  |   .4727117   .3902372    -0.91   0.364     .0937356    2.383899
          4  |   .5074556   .4218656    -0.82   0.415     .0994865    2.588402
          5  |   .8764971   .7315524    -0.16   0.875     .1707303    4.499771
             |
     smoking |
Current s..  |   1.197516   .6104885     0.35   0.724     .4409027    3.252521
  Ex-smoker  |    1.20225   .6803531     0.33   0.745     .3965521    3.644933
    Unknown  |   .8459647   .3679868    -0.38   0.701     .3606512    1.984344
             |
         bmi |   .9820189   .0098828    -1.80   0.071     .9628388    1.001581
     time_ra |   .9949676   .0038605    -1.30   0.194     .9874298    1.002563
       _cons |   11.36828   13.08852     2.11   0.035     1.190391    108.5675
-------------+----------------------------------------------------------------
Same_numbe~s |  (base outcome)
-------------+----------------------------------------------------------------
More_appoi~s |
     age_cat |
18 - 40 y..  |   .4859438   .3191177    -1.10   0.272     .1341544    1.760221
41 - 60 y..  |   .5132303    .339736    -1.01   0.314     .1402343    1.878324
61 - 80 y..  |   .5337069   .3586517    -0.93   0.350     .1429862    1.992101
             |
        male |
       Male  |   1.507943   .3896166     1.59   0.112     .9087715    2.502161
             |
urban_rura~n |
      Urban  |   .9578814    .241873    -0.17   0.865     .5839508    1.571257
             |
         imd |
          1  |   .2697986   .2125425    -1.66   0.096     .0576074    1.263575
          2  |   .4561878   .3666498    -0.98   0.329     .0944085    2.204327
          3  |   .3007586   .2386406    -1.51   0.130      .063507    1.424342
          4  |    .410868   .3275422    -1.12   0.265     .0861248    1.960092
          5  |   .4524471   .3645821    -0.98   0.325     .0932544    2.195161
             |
     smoking |
Current s..  |   1.413976   .7205136     0.68   0.497     .5208334    3.838708
  Ex-smoker  |   1.775584   .9930731     1.03   0.305     .5932935    5.313895
    Unknown  |   1.033611   .4504269     0.08   0.940     .4399671    2.428251
             |
         bmi |   .9851447   .0097734    -1.51   0.131     .9661742    1.004488
     time_ra |   .9960747    .003808    -1.03   0.304      .988639    1.003566
       _cons |   26.12929   29.20883     2.92   0.004     2.921497    233.6952
------------------------------------------------------------------------------
Note: _cons estimates baseline relative risk for each outcome.
(note: file ./output/tempdata/diff_rheum_2021.dta not found)
file ./output/tempdata/diff_rheum_2021.dta saved

. * Put together 2020 and 2021 logistic regression results
. preserve 

. use "./output/tempdata/diff_rheum_2020", clear 

. append using "./output/tempdata/diff_rheum_2021"

. drop stderr z 

. export delimited using ./output/tables/logistic_diff_results.csv 
file ./output/tables/logistic_diff_results.csv saved

. restore

. 
. 
. * Tabulate characteristics by categories of differences in all outpatient app
> ointments for each year
. * When stratified there are small numbers with missing region therefore tabul
> ate only those without region missing
. drop if region=="missing"
(0 observations deleted)

. tempfile tempfile

. forvalues i=2020/2021 {
  2.     preserve
  3.     keep if diff_op_all_cat_`i'==0
  4.     table1_mc, vars(age_cat cate \ male cate \ urban_rural_bin cate \ regi
> on cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat cate) clear
  5.     save `tempfile', replace
  6.     restore
  7.     forvalues j=1/3 {
  8.         preserve
  9.         keep if diff_op_all_cat_`i'==`j'
 10.         table1_mc, vars(age_cat cate \ male cate \ urban_rural_bin cate \ 
> region cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat cate) clear
 11.         append using `tempfile'
 12.         save `tempfile', replace
 13.         if `j'==3 {
 14.             export delimited using ./output/tables/characteristics_diff_al
> l_strata`i'.csv
 15.             }
 16.         restore
 17.         }
 18.     }
(4,957 observations deleted)

  +-------------------------+
  | factor        N_1   m_1 |
  |-------------------------|
  | age_cat        33    10 |
  |-------------------------|
  | male           43     0 |
  |-------------------------|
  | Rural-Urban    43     0 |
  |-------------------------|
  | region         43     0 |
  |-------------------------|
  | imd            43     0 |
  |-------------------------|
  | smoking        43     0 |
  |-------------------------|
  | time_ra        16    27 |
  |-------------------------|
  | bmi_cat        43     0 |
  +-------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------------------+
  |                                          Total               |
  |--------------------------------------------------------------|
  |                                          N=43                |
  |--------------------------------------------------------------|
  | age_cat       18 - 40 years              16 (48%)            |
  |               41 - 60 years              12 (36%)            |
  |               61 - 80 years              5 (15%)             |
  |--------------------------------------------------------------|
  | male          Female                     26 (60%)            |
  |               Male                       17 (40%)            |
  |--------------------------------------------------------------|
  | Rural-Urban   Rural                      25 (58%)            |
  |               Urban                      18 (42%)            |
  |--------------------------------------------------------------|
  | region        East Midlands              3 ( 7%)             |
  |               East of England            4 ( 9%)             |
  |               London                     5 (12%)             |
  |               North East                 2 ( 5%)             |
  |               North West                 9 (21%)             |
  |               South East                 12 (28%)            |
  |               West Midlands              1 ( 2%)             |
  |               Yorkshire and the Humber   7 (16%)             |
  |--------------------------------------------------------------|
  | imd           0                          2 ( 5%)             |
  |               1                          6 (14%)             |
  |               2                          8 (19%)             |
  |               3                          7 (16%)             |
  |               4                          6 (14%)             |
  |               5                          14 (33%)            |
  |--------------------------------------------------------------|
  | smoking       Never smoked               6 (14%)             |
  |               Current smoker             8 (19%)             |
  |               Ex-smoker                  7 (16%)             |
  |               Unknown                    22 (51%)            |
  |--------------------------------------------------------------|
  | time_ra                                  52.30373 (30.23585) |
  |--------------------------------------------------------------|
  | bmi_cat       Missing                    13 (30%)            |
  |               Underweight                6 (14%)             |
  |               Healthy range              7 (16%)             |
  |               Overweight                 8 (19%)             |
  |               Obese                      9 (21%)             |
  +--------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
(note: file /tmp/St00015.00000p not found)
file /tmp/St00015.00000p saved
(3,509 observations deleted)

  +---------------------------+
  | factor          N_1   m_1 |
  |---------------------------|
  | age_cat       1,161   330 |
  |---------------------------|
  | male          1,491     0 |
  |---------------------------|
  | Rural-Urban   1,491     0 |
  |---------------------------|
  | region        1,491     0 |
  |---------------------------|
  | imd           1,491     0 |
  |---------------------------|
  | smoking       1,491     0 |
  |---------------------------|
  | time_ra         698   793 |
  |---------------------------|
  | bmi_cat       1,491     0 |
  +---------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +------------------------------------------------------------+
  |                                          Total             |
  |------------------------------------------------------------|
  |                                          N=1,491           |
  |------------------------------------------------------------|
  | age_cat       18 - 40 years              429 (37.0%)       |
  |               41 - 60 years              366 (31.5%)       |
  |               61 - 80 years              304 (26.2%)       |
  |               >80 years                  62 ( 5.3%)        |
  |------------------------------------------------------------|
  | male          Female                     805 (54.0%)       |
  |               Male                       686 (46.0%)       |
  |------------------------------------------------------------|
  | Rural-Urban   Rural                      752 (50.4%)       |
  |               Urban                      739 (49.6%)       |
  |------------------------------------------------------------|
  | region        East Midlands              144 ( 9.7%)       |
  |               East of England            167 (11.2%)       |
  |               London                     297 (19.9%)       |
  |               North East                 149 (10.0%)       |
  |               North West                 155 (10.4%)       |
  |               South East                 261 (17.5%)       |
  |               West Midlands              142 ( 9.5%)       |
  |               Yorkshire and the Humber   176 (11.8%)       |
  |------------------------------------------------------------|
  | imd           0                          72 ( 4.8%)        |
  |               1                          295 (19.8%)       |
  |               2                          287 (19.2%)       |
  |               3                          275 (18.4%)       |
  |               4                          276 (18.5%)       |
  |               5                          286 (19.2%)       |
  |------------------------------------------------------------|
  | smoking       Never smoked               156 (10.5%)       |
  |               Current smoker             276 (18.5%)       |
  |               Ex-smoker                  225 (15.1%)       |
  |               Unknown                    834 (55.9%)       |
  |------------------------------------------------------------|
  | time_ra                                  56.383 (32.88858) |
  |------------------------------------------------------------|
  | bmi_cat       Missing                    283 (19.0%)       |
  |               Underweight                151 (10.1%)       |
  |               Healthy range              260 (17.4%)       |
  |               Overweight                 305 (20.5%)       |
  |               Obese                      421 (28.2%)       |
  |               Morbidly obese             71 ( 4.8%)        |
  +------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
(note: variable Total was str17, now str19 to accommodate using data's
       values)
file /tmp/St00015.00000p saved
(4,635 observations deleted)

  +-------------------------+
  | factor        N_1   m_1 |
  |-------------------------|
  | age_cat       285    80 |
  |-------------------------|
  | male          365     0 |
  |-------------------------|
  | Rural-Urban   365     0 |
  |-------------------------|
  | region        365     0 |
  |-------------------------|
  | imd           365     0 |
  |-------------------------|
  | smoking       365     0 |
  |-------------------------|
  | time_ra       168   197 |
  |-------------------------|
  | bmi_cat       365     0 |
  +-------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------------------+
  |                                          Total               |
  |--------------------------------------------------------------|
  |                                          N=365               |
  |--------------------------------------------------------------|
  | age_cat       18 - 40 years              91 (31.9%)          |
  |               41 - 60 years              99 (34.7%)          |
  |               61 - 80 years              75 (26.3%)          |
  |               >80 years                  20 ( 7.0%)          |
  |--------------------------------------------------------------|
  | male          Female                     193 (52.9%)         |
  |               Male                       172 (47.1%)         |
  |--------------------------------------------------------------|
  | Rural-Urban   Rural                      174 (47.7%)         |
  |               Urban                      191 (52.3%)         |
  |--------------------------------------------------------------|
  | region        East Midlands              42 (11.5%)          |
  |               East of England            36 ( 9.9%)          |
  |               London                     80 (21.9%)          |
  |               North East                 36 ( 9.9%)          |
  |               North West                 28 ( 7.7%)          |
  |               South East                 74 (20.3%)          |
  |               West Midlands              39 (10.7%)          |
  |               Yorkshire and the Humber   30 ( 8.2%)          |
  |--------------------------------------------------------------|
  | imd           0                          23 ( 6.3%)          |
  |               1                          60 (16.4%)          |
  |               2                          64 (17.5%)          |
  |               3                          66 (18.1%)          |
  |               4                          74 (20.3%)          |
  |               5                          78 (21.4%)          |
  |--------------------------------------------------------------|
  | smoking       Never smoked               44 (12.1%)          |
  |               Current smoker             66 (18.1%)          |
  |               Ex-smoker                  44 (12.1%)          |
  |               Unknown                    211 (57.8%)         |
  |--------------------------------------------------------------|
  | time_ra                                  54.83875 (30.84088) |
  |--------------------------------------------------------------|
  | bmi_cat       Missing                    81 (22.2%)          |
  |               Underweight                38 (10.4%)          |
  |               Healthy range              68 (18.6%)          |
  |               Overweight                 66 (18.1%)          |
  |               Obese                      91 (24.9%)          |
  |               Morbidly obese             21 ( 5.8%)          |
  +--------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.00000p saved
(3,572 observations deleted)

  +---------------------------+
  | factor          N_1   m_1 |
  |---------------------------|
  | age_cat       1,148   280 |
  |---------------------------|
  | male          1,428     0 |
  |---------------------------|
  | Rural-Urban   1,428     0 |
  |---------------------------|
  | region        1,428     0 |
  |---------------------------|
  | imd           1,428     0 |
  |---------------------------|
  | smoking       1,428     0 |
  |---------------------------|
  | time_ra         613   815 |
  |---------------------------|
  | bmi_cat       1,428     0 |
  +---------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +-------------------------------------------------------------+
  |                                          Total              |
  |-------------------------------------------------------------|
  |                                          N=1,428            |
  |-------------------------------------------------------------|
  | age_cat       18 - 40 years              446 (38.9%)        |
  |               41 - 60 years              392 (34.1%)        |
  |               61 - 80 years              254 (22.1%)        |
  |               >80 years                  56 ( 4.9%)         |
  |-------------------------------------------------------------|
  | male          Female                     737 (51.6%)        |
  |               Male                       691 (48.4%)        |
  |-------------------------------------------------------------|
  | Rural-Urban   Rural                      709 (49.6%)        |
  |               Urban                      719 (50.4%)        |
  |-------------------------------------------------------------|
  | region        East Midlands              135 ( 9.5%)        |
  |               East of England            148 (10.4%)        |
  |               London                     321 (22.5%)        |
  |               North East                 127 ( 8.9%)        |
  |               North West                 147 (10.3%)        |
  |               South East                 281 (19.7%)        |
  |               West Midlands              145 (10.2%)        |
  |               Yorkshire and the Humber   124 ( 8.7%)        |
  |-------------------------------------------------------------|
  | imd           0                          60 ( 4.2%)         |
  |               1                          300 (21.0%)        |
  |               2                          243 (17.0%)        |
  |               3                          260 (18.2%)        |
  |               4                          283 (19.8%)        |
  |               5                          282 (19.7%)        |
  |-------------------------------------------------------------|
  | smoking       Never smoked               146 (10.2%)        |
  |               Current smoker             272 (19.0%)        |
  |               Ex-smoker                  211 (14.8%)        |
  |               Unknown                    799 (56.0%)        |
  |-------------------------------------------------------------|
  | time_ra                                  53.40065 (32.7364) |
  |-------------------------------------------------------------|
  | bmi_cat       Missing                    294 (20.6%)        |
  |               Underweight                128 ( 9.0%)        |
  |               Healthy range              288 (20.2%)        |
  |               Overweight                 279 (19.5%)        |
  |               Obese                      360 (25.2%)        |
  |               Morbidly obese             79 ( 5.5%)         |
  +-------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
(note: variable Total was str18, now str19 to accommodate using data's
       values)
file /tmp/St00015.00000p saved
file ./output/tables/characteristics_diff_all_strata2020.csv saved
(4,983 observations deleted)

  +-------------------------+
  | factor        N_1   m_1 |
  |-------------------------|
  | age_cat        13     4 |
  |-------------------------|
  | male           17     0 |
  |-------------------------|
  | Rural-Urban    17     0 |
  |-------------------------|
  | region         17     0 |
  |-------------------------|
  | imd            17     0 |
  |-------------------------|
  | smoking        17     0 |
  |-------------------------|
  | time_ra        12     5 |
  |-------------------------|
  | bmi_cat        17     0 |
  +-------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +-------------------------------------------------------------+
  |                                          Total              |
  |-------------------------------------------------------------|
  |                                          N=17               |
  |-------------------------------------------------------------|
  | age_cat       18 - 40 years              7 (54%)            |
  |               41 - 60 years              4 (31%)            |
  |               61 - 80 years              2 (15%)            |
  |-------------------------------------------------------------|
  | male          Female                     12 (71%)           |
  |               Male                       5 (29%)            |
  |-------------------------------------------------------------|
  | Rural-Urban   Rural                      11 (65%)           |
  |               Urban                      6 (35%)            |
  |-------------------------------------------------------------|
  | region        East Midlands              2 (12%)            |
  |               East of England            1 ( 6%)            |
  |               London                     5 (29%)            |
  |               North West                 5 (29%)            |
  |               Yorkshire and the Humber   4 (24%)            |
  |-------------------------------------------------------------|
  | imd           1                          8 (47%)            |
  |               2                          3 (18%)            |
  |               3                          2 (12%)            |
  |               4                          2 (12%)            |
  |               5                          2 (12%)            |
  |-------------------------------------------------------------|
  | smoking       Never smoked               3 (18%)            |
  |               Current smoker             2 (12%)            |
  |               Ex-smoker                  5 (29%)            |
  |               Unknown                    7 (41%)            |
  |-------------------------------------------------------------|
  | time_ra                                  40.68378 (30.6844) |
  |-------------------------------------------------------------|
  | bmi_cat       Missing                    3 (18%)            |
  |               Underweight                4 (24%)            |
  |               Healthy range              1 ( 6%)            |
  |               Overweight                 5 (29%)            |
  |               Obese                      4 (24%)            |
  +-------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.00000p saved
(4,105 observations deleted)

  +-------------------------+
  | factor        N_1   m_1 |
  |-------------------------|
  | age_cat       723   172 |
  |-------------------------|
  | male          895     0 |
  |-------------------------|
  | Rural-Urban   895     0 |
  |-------------------------|
  | region        895     0 |
  |-------------------------|
  | imd           895     0 |
  |-------------------------|
  | smoking       895     0 |
  |-------------------------|
  | time_ra       404   491 |
  |-------------------------|
  | bmi_cat       895     0 |
  +-------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +-------------------------------------------------------------+
  |                                          Total              |
  |-------------------------------------------------------------|
  |                                          N=895              |
  |-------------------------------------------------------------|
  | age_cat       18 - 40 years              265 (36.7%)        |
  |               41 - 60 years              257 (35.5%)        |
  |               61 - 80 years              160 (22.1%)        |
  |               >80 years                  41 ( 5.7%)         |
  |-------------------------------------------------------------|
  | male          Female                     477 (53.3%)        |
  |               Male                       418 (46.7%)        |
  |-------------------------------------------------------------|
  | Rural-Urban   Rural                      453 (50.6%)        |
  |               Urban                      442 (49.4%)        |
  |-------------------------------------------------------------|
  | region        East Midlands              79 ( 8.8%)         |
  |               East of England            94 (10.5%)         |
  |               London                     188 (21.0%)        |
  |               North East                 82 ( 9.2%)         |
  |               North West                 94 (10.5%)         |
  |               South East                 187 (20.9%)        |
  |               West Midlands              89 ( 9.9%)         |
  |               Yorkshire and the Humber   82 ( 9.2%)         |
  |-------------------------------------------------------------|
  | imd           0                          41 ( 4.6%)         |
  |               1                          168 (18.8%)        |
  |               2                          171 (19.1%)        |
  |               3                          163 (18.2%)        |
  |               4                          177 (19.8%)        |
  |               5                          175 (19.6%)        |
  |-------------------------------------------------------------|
  | smoking       Never smoked               101 (11.3%)        |
  |               Current smoker             161 (18.0%)        |
  |               Ex-smoker                  118 (13.2%)        |
  |               Unknown                    515 (57.5%)        |
  |-------------------------------------------------------------|
  | time_ra                                  54.8434 (32.08418) |
  |-------------------------------------------------------------|
  | bmi_cat       Missing                    194 (21.7%)        |
  |               Underweight                81 ( 9.1%)         |
  |               Healthy range              169 (18.9%)        |
  |               Overweight                 178 (19.9%)        |
  |               Obese                      232 (25.9%)        |
  |               Morbidly obese             41 ( 4.6%)         |
  +-------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.00000p saved
(4,755 observations deleted)

  +-------------------------+
  | factor        N_1   m_1 |
  |-------------------------|
  | age_cat       185    60 |
  |-------------------------|
  | male          245     0 |
  |-------------------------|
  | Rural-Urban   245     0 |
  |-------------------------|
  | region        245     0 |
  |-------------------------|
  | imd           245     0 |
  |-------------------------|
  | smoking       245     0 |
  |-------------------------|
  | time_ra        92   153 |
  |-------------------------|
  | bmi_cat       245     0 |
  +-------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------------------+
  |                                          Total               |
  |--------------------------------------------------------------|
  |                                          N=245               |
  |--------------------------------------------------------------|
  | age_cat       18 - 40 years              73 (39.5%)          |
  |               41 - 60 years              52 (28.1%)          |
  |               61 - 80 years              50 (27.0%)          |
  |               >80 years                  10 ( 5.4%)          |
  |--------------------------------------------------------------|
  | male          Female                     140 (57.1%)         |
  |               Male                       105 (42.9%)         |
  |--------------------------------------------------------------|
  | Rural-Urban   Rural                      111 (45.3%)         |
  |               Urban                      134 (54.7%)         |
  |--------------------------------------------------------------|
  | region        East Midlands              32 (13.1%)          |
  |               East of England            27 (11.0%)          |
  |               London                     49 (20.0%)          |
  |               North East                 24 ( 9.8%)          |
  |               North West                 20 ( 8.2%)          |
  |               South East                 44 (18.0%)          |
  |               West Midlands              21 ( 8.6%)          |
  |               Yorkshire and the Humber   28 (11.4%)          |
  |--------------------------------------------------------------|
  | imd           0                          15 ( 6.1%)          |
  |               1                          50 (20.4%)          |
  |               2                          43 (17.6%)          |
  |               3                          44 (18.0%)          |
  |               4                          51 (20.8%)          |
  |               5                          42 (17.1%)          |
  |--------------------------------------------------------------|
  | smoking       Never smoked               24 ( 9.8%)          |
  |               Current smoker             49 (20.0%)          |
  |               Ex-smoker                  39 (15.9%)          |
  |               Unknown                    133 (54.3%)         |
  |--------------------------------------------------------------|
  | time_ra                                  52.79478 (32.22766) |
  |--------------------------------------------------------------|
  | bmi_cat       Missing                    42 (17.1%)          |
  |               Underweight                27 (11.0%)          |
  |               Healthy range              42 (17.1%)          |
  |               Overweight                 54 (22.0%)          |
  |               Obese                      65 (26.5%)          |
  |               Morbidly obese             15 ( 6.1%)          |
  +--------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.00000p saved
(4,091 observations deleted)

  +-------------------------+
  | factor        N_1   m_1 |
  |-------------------------|
  | age_cat       721   188 |
  |-------------------------|
  | male          909     0 |
  |-------------------------|
  | Rural-Urban   909     0 |
  |-------------------------|
  | region        909     0 |
  |-------------------------|
  | imd           909     0 |
  |-------------------------|
  | smoking       909     0 |
  |-------------------------|
  | time_ra       413   496 |
  |-------------------------|
  | bmi_cat       909     0 |
  +-------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------------------+
  |                                          Total               |
  |--------------------------------------------------------------|
  |                                          N=909               |
  |--------------------------------------------------------------|
  | age_cat       18 - 40 years              258 (35.8%)         |
  |               41 - 60 years              238 (33.0%)         |
  |               61 - 80 years              191 (26.5%)         |
  |               >80 years                  34 ( 4.7%)          |
  |--------------------------------------------------------------|
  | male          Female                     475 (52.3%)         |
  |               Male                       434 (47.7%)         |
  |--------------------------------------------------------------|
  | Rural-Urban   Rural                      452 (49.7%)         |
  |               Urban                      457 (50.3%)         |
  |--------------------------------------------------------------|
  | region        East Midlands              95 (10.5%)          |
  |               East of England            94 (10.3%)          |
  |               London                     185 (20.4%)         |
  |               North East                 88 ( 9.7%)          |
  |               North West                 85 ( 9.4%)          |
  |               South East                 174 (19.1%)         |
  |               West Midlands              84 ( 9.2%)          |
  |               Yorkshire and the Humber   104 (11.4%)         |
  |--------------------------------------------------------------|
  | imd           0                          41 ( 4.5%)          |
  |               1                          184 (20.2%)         |
  |               2                          161 (17.7%)         |
  |               3                          167 (18.4%)         |
  |               4                          171 (18.8%)         |
  |               5                          185 (20.4%)         |
  |--------------------------------------------------------------|
  | smoking       Never smoked               87 ( 9.6%)          |
  |               Current smoker             166 (18.3%)         |
  |               Ex-smoker                  149 (16.4%)         |
  |               Unknown                    507 (55.8%)         |
  |--------------------------------------------------------------|
  | time_ra                                  54.41636 (33.96788) |
  |--------------------------------------------------------------|
  | bmi_cat       Missing                    186 (20.5%)         |
  |               Underweight                95 (10.5%)          |
  |               Healthy range              174 (19.1%)         |
  |               Overweight                 166 (18.3%)         |
  |               Obese                      247 (27.2%)         |
  |               Morbidly obese             41 ( 4.5%)          |
  +--------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.00000p saved
file ./output/tables/characteristics_diff_all_strata2021.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/outpatients.log
  log type:  text
 closed on:   6 Apr 2023, 13:49:14
-------------------------------------------------------------------------------
