
. 
. cap mkdir ./output/tables

. * Import data
. import delimited using ./output/input.csv
(39 vars, 1,000 obs)

. * Check data
. count if age==. 
  0

. count if age<18 
  214

. count if age>110 & age!=.
  0

. sum age, d

                             age
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            4              0
10%            8              0       Obs               1,000
25%           20              0       Sum of Wgt.       1,000

50%           41                      Mean             40.546
                        Largest       Std. Dev.      23.92179
75%           59             92
90%           74             92       Variance       572.2521
95%           80             93       Skewness       .1142457
99%           89             94       Kurtosis       2.007725

. count if sex==""
  0

. tab sex

        sex |      Freq.     Percent        Cum.
------------+-----------------------------------
          F |        487       48.70       48.70
          M |        505       50.50       99.20
          U |          8        0.80      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. sum household, d

                          household
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               1,000
25%            2              0       Sum of Wgt.       1,000

50%            3                      Mean              2.524
                        Largest       Std. Dev.      1.051918
75%            3              5
90%            4              5       Variance       1.106531
95%            4              5       Skewness       .0037821
99%            5              6       Kurtosis       2.859546

. tab care_home_type

care_home_t |
        ype |      Freq.     Percent        Cum.
------------+-----------------------------------
         PC |         50        5.09        5.09
         PN |         46        4.68        9.77
         PR |        845       85.96       95.73
         PS |         42        4.27      100.00
------------+-----------------------------------
      Total |        983      100.00

. * Checking RA algorithm variables
. tab has_dmards has_alt_dmard_diag, m

           |  has_alt_dmard_diag
has_dmards |         0          1 |     Total
-----------+----------------------+----------
         0 |       248        252 |       500 
         1 |       252        248 |       500 
-----------+----------------------+----------
     Total |       500        500 |     1,000 

. * Checking type of DMARD that meets inclusion
. foreach dmard in metho leflu sulfa hydrox azathioprine {
  2.     gen `dmard'_multi = (`dmard'_count>=2)
  3.     tab `dmard'_multi if has_dmards==1, m
  4. }

metho_multi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         79       15.80       15.80
          1 |        421       84.20      100.00
------------+-----------------------------------
      Total |        500      100.00

leflu_multi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         73       14.60       14.60
          1 |        427       85.40      100.00
------------+-----------------------------------
      Total |        500      100.00

sulfa_multi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         68       13.60       13.60
          1 |        432       86.40      100.00
------------+-----------------------------------
      Total |        500      100.00

hydrox_mult |
          i |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         71       14.20       14.20
          1 |        429       85.80      100.00
------------+-----------------------------------
      Total |        500      100.00

azathioprin |
    e_multi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         74       14.80       14.80
          1 |        426       85.20      100.00
------------+-----------------------------------
      Total |        500      100.00

. 
. sum number_ra_codes

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
number_ra_~s |      1,000       2.523    1.025926          0          6

. di "Number where no DMARDs but does have multiple RA codes and no alt diag"
Number where no DMARDs but does have multiple RA codes and no alt diag

. count if has_dmards==0 & number_ra_codes>=2 & alt_diag!=1
  229

. tab has_ra, m

     has_ra |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        500       50.00       50.00
          1 |        500       50.00      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. * Time since first RA code
. gen first_ra_codeA = date(first_ra_code, "YMD")
(551 missing values generated)

. format first_ra_codeA %dD/N/CY

. gen time_ra = (date("01Mar2018", "DMY") - first_ra_codeA)/365.25
(551 missing values generated)

. sum time_ra, d

                           time_ra
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .6187543       .1587953
 5%     6.707735       .3559206
10%     13.69473       .3613963       Obs                 449
25%     30.61739       .4900753       Sum of Wgt.         449

50%     56.02738                      Mean           56.83135
                        Largest       Std. Dev.       30.9557
75%     83.18412       108.1971
90%     100.2081       108.4107       Variance       958.2556
95%     104.3915       108.7721       Skewness      -.0465867
99%     108.0383        108.783       Kurtosis        1.86377

. sum number_ra_codes, d

                       number_ra_codes
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               1,000
25%            2              0       Sum of Wgt.       1,000

50%            3                      Mean              2.523
                        Largest       Std. Dev.      1.025926
75%            3              5
90%            4              5       Variance       1.052524
95%            4              5       Skewness       .0075927
99%            5              6       Kurtosis       2.886609

. sum metho_count, d

                         metho_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               1,000
25%            2              0       Sum of Wgt.       1,000

50%            3                      Mean              2.483
                        Largest       Std. Dev.      1.033818
75%            3              5
90%            4              5       Variance        1.06878
95%            4              5       Skewness       .0047207
99%            5              5       Kurtosis       2.921038

. sum sulfa_count, d 

                         sulfa_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               1,000
25%            2              0       Sum of Wgt.       1,000

50%            3                      Mean              2.522
                        Largest       Std. Dev.      1.041442
75%            3              5
90%            4              5       Variance       1.084601
95%            4              6       Skewness       .0185993
99%            5              6       Kurtosis        2.96975

. sum leflu_count, d 

                         leflu_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               1,000
25%            2              0       Sum of Wgt.       1,000

50%            3                      Mean              2.531
                        Largest       Std. Dev.      1.048875
75%            3              5
90%            4              6       Variance       1.100139
95%            4              6       Skewness      -.0169161
99%            5              6       Kurtosis       2.980063

. sum hydrox_count, d 

                        hydrox_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               1,000
25%            2              0       Sum of Wgt.       1,000

50%            3                      Mean              2.524
                        Largest       Std. Dev.      1.000212
75%            3              5
90%            4              5       Variance       1.000424
95%            4              5       Skewness       .0450666
99%            5              5       Kurtosis          2.845

. 
. sum outpatient*, d

                    outpatient_appt_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               1,000
25%            2              0       Sum of Wgt.       1,000

50%            2                      Mean              2.487
                        Largest       Std. Dev.      1.078422
75%            3              5
90%            4              5       Variance       1.162994
95%            4              5       Skewness       .0767087
99%            5              6       Kurtosis        2.71609

                    outpatient_appt_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               1,000
25%            2              0       Sum of Wgt.       1,000

50%            3                      Mean              2.566
                        Largest       Std. Dev.      1.032817
75%            3              5
90%            4              5       Variance       1.066711
95%            4              5       Skewness        .013831
99%            5              6       Kurtosis       2.867753

                    outpatient_appt_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               1,000
25%            2              0       Sum of Wgt.       1,000

50%            2                      Mean              2.456
                        Largest       Std. Dev.      1.033989
75%            3              5
90%            4              5       Variance       1.069133
95%            4              5       Skewness      -.0995914
99%            5              5       Kurtosis       2.833847

                   outpatient_medium_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs                 500
25%            2              1       Sum of Wgt.         500

50%            4                      Mean              13.09
                        Largest       Std. Dev.      28.11182
75%            7             98
90%            8             98       Variance       790.2744
95%           98             98       Skewness       2.670063
99%           98             98       Kurtosis       8.204018

                   outpatient_medium_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs                 500
25%            2              1       Sum of Wgt.         500

50%            5                      Mean             14.808
                        Largest       Std. Dev.       29.9556
75%            7             98
90%           98             98       Variance       897.3378
95%           98             98       Skewness       2.402643
99%           98             98       Kurtosis       6.827409

                   outpatient_medium_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs                 500
25%            2              1       Sum of Wgt.         500

50%            5                      Mean             12.264
                        Largest       Std. Dev.      26.42618
75%            7             98
90%            8             98       Variance        698.343
95%           98             98       Skewness       2.912715
99%           98             98       Kurtosis       9.578746

. 
. keep if has_ra
(500 observations deleted)

. 
. * How many people are not on DMARDs and have no RA appointments?
. 
. 
. * Format variables
. *re-order ethnicity
.  gen eth5=1 if ethnicity==1
(404 missing values generated)

.  replace eth5=2 if ethnicity==3
(119 real changes made)

.  replace eth5=3 if ethnicity==4
(101 real changes made)

.  replace eth5=4 if ethnicity==2
(89 real changes made)

.  replace eth5=5 if ethnicity==5
(95 real changes made)

.  replace eth5=. if ethnicity==.
(0 real changes made)

. 
.  label define eth5                      1 "White"                            
>            ///
>                                                         2 "South Asian"      
>                    ///                                             
>                                                         3 "Black"            
>                            ///
>                                                         4 "Mixed"            
>                            ///
>                                                         5 "Other"            
>                            

.                                         
. 
. label values eth5 eth5

. safetab eth5, m
5

       eth5 |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |         96       19.20       19.20
South Asian |        119       23.80       43.00
      Black |        101       20.20       63.20
      Mixed |         89       17.80       81.00
      Other |         95       19.00      100.00
------------+-----------------------------------
      Total |        500      100.00

. 
. * formatting gender
. gen male=(sex=="M")

. replace male = 0 if sex == "F"
(0 real changes made)

. label define male 0"Female" 1"Male"

. label values male male

. safetab male, miss
5

       male |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |        247       49.40       49.40
       Male |        253       50.60      100.00
------------+-----------------------------------
      Total |        500      100.00

. 
. * Make region numeric
. generate region2=.
(500 missing values generated)

. replace region2=0 if region=="East"
(0 real changes made)

. replace region2=1 if region=="East Midlands"
(38 real changes made)

. replace region2=2 if region=="London"
(102 real changes made)

. replace region2=3 if region=="North East"
(54 real changes made)

. replace region2=4 if region=="North West"
(63 real changes made)

. replace region2=5 if region=="South East"
(77 real changes made)

. replace region2=6 if region=="South West"
(0 real changes made)

. replace region2=7 if region=="West Midlands"
(66 real changes made)

. replace region2=8 if region=="Yorkshire and The Humber"
(0 real changes made)

. drop region

. rename region2 region

. label var region "region of England"

. label define region 0 "East" 1 "East Midlands"  2 "London" 3 "North East" 4 "
> North West" 5 "South East" 6 "South West" 7 "West Midlands" 8 "Yorkshire and 
> The Humber"

. label values region region

. safetab region, miss
7

       region of England |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
           East Midlands |         38        7.60        7.60
                  London |        102       20.40       28.00
              North East |         54       10.80       38.80
              North West |         63       12.60       51.40
              South East |         77       15.40       66.80
           West Midlands |         66       13.20       80.00
                       . |        100       20.00      100.00
-------------------------+-----------------------------------
                   Total |        500      100.00

. 
. *create a 4 category rural urban variable 
. generate urban_rural_5=.
(500 missing values generated)

. la var urban_rural_5 "Rural Urban in five categories"

. replace urban_rural_5=1 if urban_rural==1
(68 real changes made)

. replace urban_rural_5=2 if urban_rural==2
(59 real changes made)

. replace urban_rural_5=3 if urban_rural==3|urban_rural==4
(128 real changes made)

. replace urban_rural_5=4 if urban_rural==5|urban_rural==6
(118 real changes made)

. replace urban_rural_5=5 if urban_rural==7|urban_rural==8
(127 real changes made)

. label define urban_rural_5 1 "Urban major conurbation" 2 "Urban minor conurba
> tion" 3 "Urban city and town" 4 "Rural town and fringe" 5 "Rural village and 
> dispersed"

. label values urban_rural_5 urban_rural_5

. safetab urban_rural_5, miss
14

        Rural Urban in five |
                 categories |      Freq.     Percent        Cum.
----------------------------+-----------------------------------
    Urban major conurbation |         68       13.60       13.60
    Urban minor conurbation |         59       11.80       25.40
        Urban city and town |        128       25.60       51.00
      Rural town and fringe |        118       23.60       74.60
Rural village and dispersed |        127       25.40      100.00
----------------------------+-----------------------------------
                      Total |        500      100.00

. 
. *generate a binary rural urban (with missing assigned to urban)
. generate urban_rural_bin=.
(500 missing values generated)

. replace urban_rural_bin=1 if urban_rural<=4|urban_rural==.
(255 real changes made)

. replace urban_rural_bin=0 if urban_rural>4 & urban_rural!=.
(245 real changes made)

. label define urban_rural_bin 0 "Rural" 1 "Urban"

. label values urban_rural_bin urban_rural_bin

. safetab urban_rural_bin urban_rural, miss
28

urban_rura |                      urban_rural
     l_bin |         1          2          3          4          5 |     Total
-----------+-------------------------------------------------------+----------
     Rural |         0          0          0          0         55 |       245 
     Urban |        68         59         68         60          0 |       255 
-----------+-------------------------------------------------------+----------
     Total |        68         59         68         60         55 |       500 


urban_rura |           urban_rural
     l_bin |         6          7          8 |     Total
-----------+---------------------------------+----------
     Rural |        63         62         65 |       245 
     Urban |         0          0          0 |       255 
-----------+---------------------------------+----------
     Total |        63         62         65 |       500 

. label var urban_rural_bin "Rural-Urban"

. 
. * Define age categories
. * Create age categories
. egen age_cat = cut(age), at(18, 40, 60, 80, 120) icodes
(107 missing values generated)

. label define age 0 "18 - 40 years" 1 "41 - 60 years" 2 "61 - 80 years" 3 ">80
>  years"

. label values age_cat age

. safetab age_cat, miss
8

      age_cat |      Freq.     Percent        Cum.
--------------+-----------------------------------
18 - 40 years |        145       29.00       29.00
41 - 60 years |        131       26.20       55.20
61 - 80 years |         88       17.60       72.80
    >80 years |         29        5.80       78.60
            . |        107       21.40      100.00
--------------+-----------------------------------
        Total |        500      100.00

. 
. * Flag if in a care-home
.     gen care_home=care_home_type!="PR"

. 
. * Categorise number of outpatient appointments
. label define appt 0 "No appointments" 1 "1-2 per year" 2 "3-6 per year" 3 "7-
> 12 per year" 4 "More than 12 per year"

. forvalues i=2019/2021 {
  2.     egen op_appt_`i'_cat = cut(outpatient_appt_`i'), at(0, 1, 3, 7, 13, 10
> 00) icodes
  3.     label values op_appt_`i'_cat appt
  4.     }

. preserve

. * Tabulate number of appointments per year
. table1_mc, vars(op_appt_2019_cat cate \ op_appt_2020_cat cate \ op_appt_2021_
> cat cate) clear

  +------------------------------+
  | factor             N_1   m_1 |
  |------------------------------|
  | op_appt_2019_cat   500     0 |
  |------------------------------|
  | op_appt_2020_cat   500     0 |
  |------------------------------|
  | op_appt_2021_cat   500     0 |
  +------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------+
  |                                      Total       |
  |--------------------------------------------------|
  |                                      N=500       |
  |--------------------------------------------------|
  | op_appt_2019_cat   No appointments   11 ( 2.2%)  |
  |                    1-2 per year      254 (50.8%) |
  |                    3-6 per year      235 (47.0%) |
  |--------------------------------------------------|
  | op_appt_2020_cat   No appointments   9 ( 1.8%)   |
  |                    1-2 per year      228 (45.6%) |
  |                    3-6 per year      263 (52.6%) |
  |--------------------------------------------------|
  | op_appt_2021_cat   No appointments   16 ( 3.2%)  |
  |                    1-2 per year      233 (46.6%) |
  |                    3-6 per year      251 (50.2%) |
  +--------------------------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/op_appt_yrs.csv
file ./output/tables/op_appt_yrs.csv saved

. restore 

. * Tabulate overall characteristics 
. preserve

. table1_mc, vars(age_cat cate \ male cate \ region cate \ urban_rural_5 cate \
>  prescribed_biologics cate \ imd cate \ care_home cate) clear

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                          393   107 |
  |--------------------------------------------|
  | male                             500     0 |
  |--------------------------------------------|
  | region of England                400   100 |
  |--------------------------------------------|
  | Rural Urban in five categories   500     0 |
  |--------------------------------------------|
  | prescribed_biologics             500     0 |
  |--------------------------------------------|
  | imd                              500     0 |
  |--------------------------------------------|
  | care_home                        500     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> +
  |                                                                Total       
> |
  |----------------------------------------------------------------------------
> |
  |                                                                N=500       
> |
  |----------------------------------------------------------------------------
> |
  | age_cat                          18 - 40 years                 145 (36.9%) 
> |
  |                                  41 - 60 years                 131 (33.3%) 
> |
  |                                  61 - 80 years                 88 (22.4%)  
> |
  |                                  >80 years                     29 ( 7.4%)  
> |
  |----------------------------------------------------------------------------
> |
  | male                             Female                        247 (49.4%) 
> |
  |                                  Male                          253 (50.6%) 
> |
  |----------------------------------------------------------------------------
> |
  | region of England                East Midlands                 38 ( 9.5%)  
> |
  |                                  London                        102 (25.5%) 
> |
  |                                  North East                    54 (13.5%)  
> |
  |                                  North West                    63 (15.8%)  
> |
  |                                  South East                    77 (19.2%)  
> |
  |                                  West Midlands                 66 (16.5%)  
> |
  |----------------------------------------------------------------------------
> |
  | Rural Urban in five categories   Urban major conurbation       68 (13.6%)  
> |
  |                                  Urban minor conurbation       59 (11.8%)  
> |
  |                                  Urban city and town           128 (25.6%) 
> |
  |                                  Rural town and fringe         118 (23.6%) 
> |
  |                                  Rural village and dispersed   127 (25.4%) 
> |
  |----------------------------------------------------------------------------
> |
  | prescribed_biologics             0                             245 (49.0%) 
> |
  |                                  1                             255 (51.0%) 
> |
  |----------------------------------------------------------------------------
> |
  | imd                              0                             31 ( 6.2%)  
> |
  |                                  1                             93 (18.6%)  
> |
  |                                  2                             87 (17.4%)  
> |
  |                                  3                             104 (20.8%) 
> |
  |                                  4                             90 (18.0%)  
> |
  |                                  5                             95 (19.0%)  
> |
  |----------------------------------------------------------------------------
> |
  | care_home                        0                             416 (83.2%) 
> |
  |                                  1                             84 (16.8%)  
> |
  +----------------------------------------------------------------------------
> +
Data are presented as n (%).
 

. export delimited using ./output/tables/op_chars.csv
file ./output/tables/op_chars.csv saved

. restore

. * Tabulate characteristics by category of outpatient appointments 2019
.  tempfile tempfile

.  forvalues i=2019/2021 {
  2.     preserve
  3.     keep if op_appt_`i'_cat==1
  4.     table1_mc, vars(age_cat cate \ male cate \ region cate \ urban_rural_5
>  cate \ prescribed_biologics cate \ imd cate \ care_home cate) clear
  5.     save `tempfile', replace
  6.     restore
  7.     forvalues j=2/4 {
  8.       preserve
  9.       keep if op_appt_`i'_cat==`j'
 10.       table1_mc, vars(age_cat cate \ male cate \ region cate \ urban_rural
> _5 cate \ prescribed_biologics cate \ imd cate \ care_home cate) clear
 11.       append using `tempfile'
 12.       save `tempfile', replace
 13.       restore
 14.       }
 15.     use `tempfile', clear
 16.     export delimited using ./output/tables/characteristics_strata`i'.csv
 17.     }
(246 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                          203    51 |
  |--------------------------------------------|
  | male                             254     0 |
  |--------------------------------------------|
  | region of England                205    49 |
  |--------------------------------------------|
  | Rural Urban in five categories   254     0 |
  |--------------------------------------------|
  | prescribed_biologics             254     0 |
  |--------------------------------------------|
  | imd                              254     0 |
  |--------------------------------------------|
  | care_home                        254     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> +
  |                                                                Total       
> |
  |----------------------------------------------------------------------------
> |
  |                                                                N=254       
> |
  |----------------------------------------------------------------------------
> |
  | age_cat                          18 - 40 years                 70 (34.5%)  
> |
  |                                  41 - 60 years                 73 (36.0%)  
> |
  |                                  61 - 80 years                 44 (21.7%)  
> |
  |                                  >80 years                     16 ( 7.9%)  
> |
  |----------------------------------------------------------------------------
> |
  | male                             Female                        125 (49.2%) 
> |
  |                                  Male                          129 (50.8%) 
> |
  |----------------------------------------------------------------------------
> |
  | region of England                East Midlands                 19 ( 9.3%)  
> |
  |                                  London                        55 (26.8%)  
> |
  |                                  North East                    26 (12.7%)  
> |
  |                                  North West                    33 (16.1%)  
> |
  |                                  South East                    41 (20.0%)  
> |
  |                                  West Midlands                 31 (15.1%)  
> |
  |----------------------------------------------------------------------------
> |
  | Rural Urban in five categories   Urban major conurbation       40 (15.7%)  
> |
  |                                  Urban minor conurbation       25 ( 9.8%)  
> |
  |                                  Urban city and town           69 (27.2%)  
> |
  |                                  Rural town and fringe         57 (22.4%)  
> |
  |                                  Rural village and dispersed   63 (24.8%)  
> |
  |----------------------------------------------------------------------------
> |
  | prescribed_biologics             0                             121 (47.6%) 
> |
  |                                  1                             133 (52.4%) 
> |
  |----------------------------------------------------------------------------
> |
  | imd                              0                             14 ( 5.5%)  
> |
  |                                  1                             43 (16.9%)  
> |
  |                                  2                             50 (19.7%)  
> |
  |                                  3                             53 (20.9%)  
> |
  |                                  4                             47 (18.5%)  
> |
  |                                  5                             47 (18.5%)  
> |
  |----------------------------------------------------------------------------
> |
  | care_home                        0                             207 (81.5%) 
> |
  |                                  1                             47 (18.5%)  
> |
  +----------------------------------------------------------------------------
> +
Data are presented as n (%).
 
(note: file /tmp/St00011.000003 not found)
file /tmp/St00011.000003 saved
(265 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                          182    53 |
  |--------------------------------------------|
  | male                             235     0 |
  |--------------------------------------------|
  | region of England                187    48 |
  |--------------------------------------------|
  | Rural Urban in five categories   235     0 |
  |--------------------------------------------|
  | prescribed_biologics             235     0 |
  |--------------------------------------------|
  | imd                              235     0 |
  |--------------------------------------------|
  | care_home                        235     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> +
  |                                                                Total       
> |
  |----------------------------------------------------------------------------
> |
  |                                                                N=235       
> |
  |----------------------------------------------------------------------------
> |
  | age_cat                          18 - 40 years                 73 (40.1%)  
> |
  |                                  41 - 60 years                 55 (30.2%)  
> |
  |                                  61 - 80 years                 41 (22.5%)  
> |
  |                                  >80 years                     13 ( 7.1%)  
> |
  |----------------------------------------------------------------------------
> |
  | male                             Female                        116 (49.4%) 
> |
  |                                  Male                          119 (50.6%) 
> |
  |----------------------------------------------------------------------------
> |
  | region of England                East Midlands                 19 (10.2%)  
> |
  |                                  London                        44 (23.5%)  
> |
  |                                  North East                    26 (13.9%)  
> |
  |                                  North West                    29 (15.5%)  
> |
  |                                  South East                    35 (18.7%)  
> |
  |                                  West Midlands                 34 (18.2%)  
> |
  |----------------------------------------------------------------------------
> |
  | Rural Urban in five categories   Urban major conurbation       28 (11.9%)  
> |
  |                                  Urban minor conurbation       32 (13.6%)  
> |
  |                                  Urban city and town           57 (24.3%)  
> |
  |                                  Rural town and fringe         58 (24.7%)  
> |
  |                                  Rural village and dispersed   60 (25.5%)  
> |
  |----------------------------------------------------------------------------
> |
  | prescribed_biologics             0                             119 (50.6%) 
> |
  |                                  1                             116 (49.4%) 
> |
  |----------------------------------------------------------------------------
> |
  | imd                              0                             17 ( 7.2%)  
> |
  |                                  1                             48 (20.4%)  
> |
  |                                  2                             35 (14.9%)  
> |
  |                                  3                             48 (20.4%)  
> |
  |                                  4                             42 (17.9%)  
> |
  |                                  5                             45 (19.1%)  
> |
  |----------------------------------------------------------------------------
> |
  | care_home                        0                             199 (84.7%) 
> |
  |                                  1                             36 (15.3%)  
> |
  +----------------------------------------------------------------------------
> +
Data are presented as n (%).
 
file /tmp/St00011.000003 saved
(500 observations deleted)
<0 invalid name
r(198);

end of do-file
r(198);

end of do-file

r(198);


