
. 
. cap mkdir ./output/tables/

. cap mkdir ./output/tempdata

. 
. * Import data
. import delimited using ./output/input.csv
(51 vars, 10,000 obs)

. * Check data
. count if age==. 
  0

. count if age<18 
  2,097

. count if age>110 & age!=.
  0

. sum age, d

                             age
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            4              0
10%            8              0       Obs              10,000
25%           21              0       Sum of Wgt.      10,000

50%           39                      Mean            40.5135
                        Largest       Std. Dev.      23.73978
75%           59            101
90%           73            103       Variance       563.5774
95%           80            105       Skewness        .144018
99%           89            107       Kurtosis       2.057714

. count if sex==""
  0

. tab sex

        sex |      Freq.     Percent        Cum.
------------+-----------------------------------
          F |      4,990       49.90       49.90
          M |      4,915       49.15       99.05
          U |         95        0.95      100.00
------------+-----------------------------------
      Total |     10,000      100.00

. * Checking RA algorithm variables
. * Checking type of DMARD that meets inclusion
. foreach dmard in metho leflu sulfa hydrox {
  2.     gen `dmard'_multi = (`dmard'_count>=2)
  3.     tab `dmard'_multi if has_dmards==1, m
  4. }

metho_multi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        770       15.40       15.40
          1 |      4,230       84.60      100.00
------------+-----------------------------------
      Total |      5,000      100.00

leflu_multi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        779       15.58       15.58
          1 |      4,221       84.42      100.00
------------+-----------------------------------
      Total |      5,000      100.00

sulfa_multi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        818       16.36       16.36
          1 |      4,182       83.64      100.00
------------+-----------------------------------
      Total |      5,000      100.00

hydrox_mult |
          i |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        767       15.34       15.34
          1 |      4,233       84.66      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. gen dmard_multi = (metho_multi==1 | leflu_multi==1 | sulfa_multi==1 | hydrox_
> multi==1)

. tab dmard_multi has_alt_dmard_diag

dmard_mult |  has_alt_dmard_diag
         i |         0          1 |     Total
-----------+----------------------+----------
         0 |         2          4 |         6 
         1 |     4,998      4,996 |     9,994 
-----------+----------------------+----------
     Total |     5,000      5,000 |    10,000 

. sum number_ra_codes

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
number_ra_~s |     10,000      2.4924    1.040889          0          7

. di "Number where no DMARDs but does have multiple RA codes and no alt diag"
Number where no DMARDs but does have multiple RA codes and no alt diag

. count if has_dmards==0 & number_ra_codes>=2 & alt_diag!=1
  2,116

. tab has_ra, m

     has_ra |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,000       50.00       50.00
          1 |      5,000       50.00      100.00
------------+-----------------------------------
      Total |     10,000      100.00

. keep if has_ra
(5,000 observations deleted)

. * Time since first RA code
. gen first_ra_codeA = date(first_ra_code, "YMD")
(2,785 missing values generated)

. format first_ra_codeA %dD/N/CY

. gen time_ra = (date("01Mar2019", "DMY") - first_ra_codeA)/365.25
(2,785 missing values generated)

. sum time_ra, d

                           time_ra
-------------------------------------------------------------
      Percentiles      Smallest
 1%       1.1718      -.0465435
 5%      5.24846       .0711841
10%     10.37098       .1368925       Obs               2,215
25%     29.19644       .2464066       Sum of Wgt.       2,215

50%      55.4141                      Mean           55.85648
                        Largest       Std. Dev.       32.0693
75%      83.9781       109.8344
90%     100.5777       109.8754       Variance        1028.44
95%     105.0048       109.8809       Skewness      -.0254381
99%     109.0376        109.922       Kurtosis       1.804476

. sum number_ra_codes, d

                       number_ra_codes
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            3                      Mean              2.505
                        Largest       Std. Dev.      1.034693
75%            3              6
90%            4              6       Variance       1.070589
95%            4              6       Skewness       .0153461
99%            5              7       Kurtosis       3.042499

. sum metho_count, d

                         metho_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            2                      Mean             2.4854
                        Largest       Std. Dev.      1.032667
75%            3              6
90%            4              6       Variance         1.0664
95%            4              6       Skewness        .029841
99%            5              6       Kurtosis       2.915014

. sum sulfa_count, d 

                         sulfa_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            2                      Mean             2.4916
                        Largest       Std. Dev.        1.0393
75%            3              6
90%            4              6       Variance       1.080145
95%            4              6       Skewness       .0934854
99%            5              6       Kurtosis       2.897299

. sum leflu_count, d 

                         leflu_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            2                      Mean             2.5092
                        Largest       Std. Dev.      1.028459
75%            3              6
90%            4              6       Variance       1.057727
95%            4              6       Skewness       .0541717
99%            5              6       Kurtosis       2.871755

. sum hydrox_count, d 

                        hydrox_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            3                      Mean              2.515
                        Largest       Std. Dev.      1.033822
75%            3              6
90%            4              6       Variance       1.068789
95%            4              6       Skewness       .0494844
99%            5              6       Kurtosis       2.831169

. 
. sum outpatient*, d

                    outpatient_appt_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            2              0       Obs               5,000
25%            6              0       Sum of Wgt.       5,000

50%            7                      Mean              6.803
                        Largest       Std. Dev.      2.943454
75%            9             14
90%           10             14       Variance       8.663924
95%           11             14       Skewness      -.8782071
99%           12             15       Kurtosis       3.543095

                    outpatient_appt_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               5,000
25%            6              0       Sum of Wgt.       5,000

50%            7                      Mean             6.7112
                        Largest       Std. Dev.      2.971794
75%            9             13
90%           10             14       Variance       8.831561
95%           11             15       Skewness      -.8840932
99%           12             15       Kurtosis        3.43807

                    outpatient_appt_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               5,000
25%            6              0       Sum of Wgt.       5,000

50%            7                      Mean             6.7752
                        Largest       Std. Dev.      3.008933
75%            9             14
90%           10             14       Variance       9.053676
95%           11             15       Skewness      -.8475836
99%           12             16       Kurtosis       3.413833

                   outpatient_medium_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               2,509
25%            2              1       Sum of Wgt.       2,509

50%            4                      Mean           13.34675
                        Largest       Std. Dev.      28.07333
75%            7             98
90%            8             98       Variance       788.1118
95%           98             98       Skewness       2.662133
99%           98             98       Kurtosis       8.160886

                   outpatient_medium_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               2,521
25%            2              1       Sum of Wgt.       2,521

50%            4                      Mean           12.34193
                        Largest       Std. Dev.      26.72206
75%            7             98
90%            8             98       Variance       714.0688
95%           98             98       Skewness       2.868444
99%           98             98       Kurtosis       9.317609

                   outpatient_medium_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               2,490
25%            2              1       Sum of Wgt.       2,490

50%            5                      Mean           13.96145
                        Largest       Std. Dev.      28.79337
75%            7             98
90%           98             98       Variance       829.0584
95%           98             98       Skewness       2.555962
99%           98             98       Kurtosis        7.59989

                  outpatient_appt_all_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               5,000
25%            6              0       Sum of Wgt.       5,000

50%            7                      Mean             6.7184
                        Largest       Std. Dev.      2.958522
75%            9             14
90%           10             14       Variance       8.752852
95%           11             14       Skewness      -.8698922
99%           12             16       Kurtosis       3.453114

                  outpatient_appt_all_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            3              0       Obs               5,000
25%            6              0       Sum of Wgt.       5,000

50%            7                      Mean             6.8048
                        Largest       Std. Dev.      2.912524
75%            9             14
90%           10             14       Variance       8.482794
95%           11             14       Skewness      -.8556175
99%           12             17       Kurtosis       3.577359

                  outpatient_appt_all_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            2              0       Obs               5,000
25%            6              0       Sum of Wgt.       5,000

50%            7                      Mean             6.7662
                        Largest       Std. Dev.      2.958258
75%            9             14
90%           10             15       Variance       8.751288
95%           11             15       Skewness      -.8237495
99%           12             16       Kurtosis       3.490289

. 
. forvalues i=2019/2021 {
  2.     sum ra_hosp_beddays_`i' if ra_hosp_`i'>0, d 
  3. }

                    ra_hosp_beddays_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -1
 5%            1             -1
10%            1              0       Obs               4,874
25%            2              0       Sum of Wgt.       4,874

50%            3                      Mean           2.504309
                        Largest       Std. Dev.      1.046077
75%            3              6
90%            4              6       Variance       1.094277
95%            4              6       Skewness       .0396814
99%            5              6       Kurtosis       3.023898

                    ra_hosp_beddays_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               4,887
25%            2              0       Sum of Wgt.       4,887

50%            3                      Mean           2.524657
                        Largest       Std. Dev.      1.047655
75%            3              6
90%            4              6       Variance       1.097581
95%            4              6       Skewness       .0522196
99%            5              6       Kurtosis       2.962328

                    ra_hosp_beddays_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -1
 5%            1              0
10%            1              0       Obs               4,868
25%            2              0       Sum of Wgt.       4,868

50%            3                      Mean           2.513558
                        Largest       Std. Dev.      1.054319
75%            3              6
90%            4              6       Variance       1.111589
95%            4              6       Skewness       .0132269
99%            5              6       Kurtosis       2.814631

. 
. 
. * How many people are not on DMARDs and have no RA appointments?
. 
. * Format variables
. *re-order ethnicity
.  gen eth5=1 if ethnicity==1
(4,051 missing values generated)

.  replace eth5=2 if ethnicity==3
(1,027 real changes made)

.  replace eth5=3 if ethnicity==4
(1,028 real changes made)

.  replace eth5=4 if ethnicity==2
(1,007 real changes made)

.  replace eth5=5 if ethnicity==5
(989 real changes made)

.  replace eth5=6 if ethnicity==0
(0 real changes made)

. 
.  label define eth5                      1 "White"                            
>            ///
>                                                         2 "South Asian"      
>                    ///                                             
>                                                         3 "Black"            
>                            ///
>                                                         4 "Mixed"            
>                            ///
>                                                         5 "Other"            
>        ///
>                             6 "Missing"                                 

.                                         
. 
. label values eth5 eth5

. safetab eth5, m
5

       eth5 |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |        949       18.98       18.98
South Asian |      1,027       20.54       39.52
      Black |      1,028       20.56       60.08
      Mixed |      1,007       20.14       80.22
      Other |        989       19.78      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. 
. * formatting gender
. gen male=(sex=="M")

. replace male = 0 if sex == "F"
(0 real changes made)

. label define male 0"Female" 1"Male"

. label values male male

. safetab male, miss
5

       male |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |      2,537       50.74       50.74
       Male |      2,463       49.26      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. 
. *create a 4 category rural urban variable 
. generate urban_rural_5=.
(5,000 missing values generated)

. la var urban_rural_5 "Rural Urban in five categories"

. replace urban_rural_5=1 if urban_rural==1
(582 real changes made)

. replace urban_rural_5=2 if urban_rural==2
(634 real changes made)

. replace urban_rural_5=3 if urban_rural==3|urban_rural==4
(1,262 real changes made)

. replace urban_rural_5=4 if urban_rural==5|urban_rural==6
(1,204 real changes made)

. replace urban_rural_5=5 if urban_rural==7|urban_rural==8
(1,318 real changes made)

. label define urban_rural_5 1 "Urban major conurbation" 2 "Urban minor conurba
> tion" 3 "Urban city and town" 4 "Rural town and fringe" 5 "Rural village and 
> dispersed"

. label values urban_rural_5 urban_rural_5

. safetab urban_rural_5, miss
14

        Rural Urban in five |
                 categories |      Freq.     Percent        Cum.
----------------------------+-----------------------------------
    Urban major conurbation |        582       11.64       11.64
    Urban minor conurbation |        634       12.68       24.32
        Urban city and town |      1,262       25.24       49.56
      Rural town and fringe |      1,204       24.08       73.64
Rural village and dispersed |      1,318       26.36      100.00
----------------------------+-----------------------------------
                      Total |      5,000      100.00

. 
. *generate a binary rural urban (with missing assigned to urban)
. generate urban_rural_bin=.
(5,000 missing values generated)

. replace urban_rural_bin=1 if urban_rural<=4|urban_rural==.
(2,478 real changes made)

. replace urban_rural_bin=0 if urban_rural>4 & urban_rural!=.
(2,522 real changes made)

. label define urban_rural_bin 0 "Rural" 1 "Urban"

. label values urban_rural_bin urban_rural_bin

. safetab urban_rural_bin urban_rural, miss
28

urban_rura |                      urban_rural
     l_bin |         1          2          3          4          5 |     Total
-----------+-------------------------------------------------------+----------
     Rural |         0          0          0          0        600 |     2,522 
     Urban |       582        634        654        608          0 |     2,478 
-----------+-------------------------------------------------------+----------
     Total |       582        634        654        608        600 |     5,000 


urban_rura |           urban_rural
     l_bin |         6          7          8 |     Total
-----------+---------------------------------+----------
     Rural |       604        677        641 |     2,522 
     Urban |         0          0          0 |     2,478 
-----------+---------------------------------+----------
     Total |       604        677        641 |     5,000 

. label var urban_rural_bin "Rural-Urban"

. 
. * Make missing category for region
. replace region = "missing" if region==""
(0 real changes made)

. * Make numeric region variable 
. gen region_n = 1 if region=="East Midlands"
(4,503 missing values generated)

. replace region_n = 2 if region=="East of England"
(502 real changes made)

. replace region_n = 3 if region=="London"
(971 real changes made)

. replace region_n = 4 if region=="North East"
(529 real changes made)

. replace region_n = 5 if region=="North West"
(489 real changes made)

. replace region_n = 6 if region=="South East"
(1,003 real changes made)

. replace region_n = 7 if region=="South West"
(0 real changes made)

. replace region_n = 8 if region=="West Midlands"
(469 real changes made)

. replace region_n = 9 if region=="Yorkshire and the Humber"
(540 real changes made)

. tab region*, m 

                      |                  region_n
               region |         1          2          3          4 |     Total
----------------------+--------------------------------------------+----------
        East Midlands |       497          0          0          0 |       497 
      East of England |         0        502          0          0 |       502 
               London |         0          0        971          0 |       971 
           North East |         0          0          0        529 |       529 
           North West |         0          0          0          0 |       489 
           South East |         0          0          0          0 |     1,003 
        West Midlands |         0          0          0          0 |       469 
Yorkshire and the H.. |         0          0          0          0 |       540 
----------------------+--------------------------------------------+----------
                Total |       497        502        971        529 |     5,000 


                      |                  region_n
               region |         5          6          8          9 |     Total
----------------------+--------------------------------------------+----------
        East Midlands |         0          0          0          0 |       497 
      East of England |         0          0          0          0 |       502 
               London |         0          0          0          0 |       971 
           North East |         0          0          0          0 |       529 
           North West |       489          0          0          0 |       489 
           South East |         0      1,003          0          0 |     1,003 
        West Midlands |         0          0        469          0 |       469 
Yorkshire and the H.. |         0          0          0        540 |       540 
----------------------+--------------------------------------------+----------
                Total |       489      1,003        469        540 |     5,000 

. 
. * Define age categories
. * Create age categories
. egen age_cat = cut(age), at(18, 40, 60, 80, 120) icodes
(1042 missing values generated)

. label define age 0 "18 - 40 years" 1 "41 - 60 years" 2 "61 - 80 years" 3 ">80
>  years"

. label values age_cat age

. safetab age_cat, miss
8

      age_cat |      Freq.     Percent        Cum.
--------------+-----------------------------------
18 - 40 years |      1,495       29.90       29.90
41 - 60 years |      1,242       24.84       54.74
61 - 80 years |        951       19.02       73.76
    >80 years |        270        5.40       79.16
            . |      1,042       20.84      100.00
--------------+-----------------------------------
        Total |      5,000      100.00

. 
. * Smoking status
. gen smoking = 0 if smoking_status=="N"
(4,536 missing values generated)

. replace smoking = 1 if smoking_status=="S"
(1,003 real changes made)

. replace smoking = 2 if smoking_status=="E"
(750 real changes made)

. replace smoking = 3 if smoking==.
(2,783 real changes made)

. 
. label define smok 1 "Current smoker" 2 "Ex-smoker" 0 "Never smoked" 3 "Unknow
> n"

. label values smoking smok

. 
. * BMI categories
. egen bmi_cat = cut(bmi), at(0, 1, 18.5, 24.9, 29.9, 39.9, 100) icodes
(1 missing value generated)

. bys bmi_cat: sum bmi

-------------------------------------------------------------------------------
-> bmi_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        978    .0006041    .0188915          0   .5907922

-------------------------------------------------------------------------------
-> bmi_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        468    14.48673    3.237252   2.318642   18.46871

-------------------------------------------------------------------------------
-> bmi_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        933    22.00676    1.836244   18.50977   24.87638

-------------------------------------------------------------------------------
-> bmi_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |      1,007    27.42038    1.403229   24.90053   29.89179

-------------------------------------------------------------------------------
-> bmi_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |      1,346    34.11094    2.713756   29.90325   39.85356

-------------------------------------------------------------------------------
-> bmi_cat = 5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        267    43.67529    3.212526   39.90829   59.52556

-------------------------------------------------------------------------------
-> bmi_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |          1   -1.145826           .  -1.145826  -1.145826


. * add missing . to zero category
. replace bmi_cat = 0 if bmi_cat==. 
(1 real change made)

. label define bmi 0 "Missing" 1 "Underweight" 2 "Healthy range" 3 "Overweight"
>  4 "Obese" 5 "Morbidly obese"

. label values bmi_cat bmi

. 
. * Determine if still in follow-up for each year
. * Format dates
. gen died_fuA = date(died_fu, "YMD")
(2,527 missing values generated)

. gen dereg_dateA = date(dereg_date, "YMD")
(2,499 missing values generated)

. gen end_fu = date("`j'-03-31", "YMD")
(5,000 missing values generated)

. gen end_date = min(died_fuA, dereg_dateA, end_fu)
(1,275 missing values generated)

. drop end_fu

. sum end_date

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    end_date |      3,725    22449.11    300.5794      21976      23034

. di "Number where end date prior to follow-up start"
Number where end date prior to follow-up start

. count if end_date<date("2019-04-01", "YMD")
  0

. * determine range of dates for outpatient appointments to determine which sho
> uld be dropped
. gen end_2020 = end_date<date("2020-03-31", "YMD")

. gen end_2021 = end_date<date("2021-03-31", "YMD") 

. gen end_2022 = end_date<date("2022-03-31", "YMD") 

. tab end_2020

   end_2020 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,862       97.24       97.24
          1 |        138        2.76      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. tab end_2021

   end_2021 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,367       67.34       67.34
          1 |      1,633       32.66      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. tab end_2022

   end_2022 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,093       41.86       41.86
          1 |      2,907       58.14      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. 
. * Set outpatient appointment count to missing if end prior to the end of the 
> year 
. forvalues i=2019/2021 {
  2.     local j=`i'+1
  3.     di `j'
  4.     gen op_appt_`i'_orig = outpatient_appt_`i'
  5.     replace outpatient_appt_`i'=. if end_`j'
  6.     gen op_medium_`i'_orig = outpatient_medium_`i'
  7.     replace outpatient_medium_`i'=. if end_`j'
  8.     gen op_appt_all_`i'_orig = outpatient_appt_all_`i'
  9.     replace outpatient_appt_all_`i'=. if end_`j'
 10. }
2020
(138 real changes made, 138 to missing)
(2,491 missing values generated)
(78 real changes made, 78 to missing)
(138 real changes made, 138 to missing)
2021
(1,633 real changes made, 1,633 to missing)
(2,479 missing values generated)
(814 real changes made, 814 to missing)
(1,633 real changes made, 1,633 to missing)
2022
(2,907 real changes made, 2,907 to missing)
(2,510 missing values generated)
(1,427 real changes made, 1,427 to missing)
(2,907 real changes made, 2,907 to missing)

. 
. * Categorise number of outpatient appointments
. label define appt 0 "No appointments" 1 "1-2 per year" 2 "3 or more per year"
>  

. forvalues i=2019/2021 {
  2.     * Rheumatology outpatient appointments
.     egen op_appt_`i'_cat = cut(outpatient_appt_`i'), at(0, 1, 3, 1000) icodes
  3.     * Check all categorised
.     bys op_appt_`i'_cat: sum outpatient_appt_`i'
  4.     label values op_appt_`i'_cat appt
  5.     * Same for orginal variables
.     egen op_appt_`i'_orig_cat = cut(op_appt_`i'_orig), at(0, 1, 3, 1000) icod
> es
  6.     * Check all categorised
.     bys op_appt_`i'_orig_cat: sum op_appt_`i'_orig
  7.     label values op_appt_`i'_orig_cat appt
  8.     }
(138 missing values generated)

-------------------------------------------------------------------------------
-> op_appt_2019_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2019 |        476           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_2019_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2019 |         27    1.703704    .4653216          1          2

-------------------------------------------------------------------------------
-> op_appt_2019_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2019 |      4,359    7.571691    1.966058          3         15

-------------------------------------------------------------------------------
-> op_appt_2019_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2019 |          0


-------------------------------------------------------------------------------
-> op_appt_2019_orig_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2019_orig |        488           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_2019_orig_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2019_orig |         28    1.678571    .4755949          1          2

-------------------------------------------------------------------------------
-> op_appt_2019_orig_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2019_orig |      4,484    7.575379     1.96498          3         15

(1633 missing values generated)

-------------------------------------------------------------------------------
-> op_appt_2020_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2020 |        357           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_2020_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2020 |         19    1.842105    .3746343          1          2

-------------------------------------------------------------------------------
-> op_appt_2020_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2020 |      2,991    7.512872    1.953408          3         13

-------------------------------------------------------------------------------
-> op_appt_2020_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2020 |          0


-------------------------------------------------------------------------------
-> op_appt_2020_orig_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2020_orig |        528           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_2020_orig_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2020_orig |         25         1.8    .4082483          1          2

-------------------------------------------------------------------------------
-> op_appt_2020_orig_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2020_orig |      4,447    7.535642    1.940298          3         15

(2907 missing values generated)

-------------------------------------------------------------------------------
-> op_appt_2021_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2021 |        211           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_2021_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2021 |         15    1.866667    .3518658          1          2

-------------------------------------------------------------------------------
-> op_appt_2021_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2021 |      1,867    7.674344    2.005886          3         16

-------------------------------------------------------------------------------
-> op_appt_2021_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~t_2021 |          0


-------------------------------------------------------------------------------
-> op_appt_2021_orig_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2021_orig |        519           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_2021_orig_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2021_orig |         30    1.833333     .379049          1          2

-------------------------------------------------------------------------------
-> op_appt_2021_orig_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~t_2021_orig |      4,451    7.598517    1.993334          3         16


. 
. * Calculate difference in rheumatology appointments compared to 2019
. gen diff_op_2020 = outpatient_appt_2020 - outpatient_appt_2019
(1,633 missing values generated)

. gen diff_op_2021 = outpatient_appt_2021 - outpatient_appt_2019
(2,907 missing values generated)

. sum diff_op_2020 diff_op_2021, d

                        diff_op_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%          -10            -13
 5%           -8            -13
10%           -6            -13       Obs               3,367
25%           -2            -13       Sum of Wgt.       3,367

50%            0                      Mean          -.1300861
                        Largest       Std. Dev.      4.221758
75%            2             12
90%            5             12       Variance       17.82324
95%            8             12       Skewness       .0167834
99%           10             13       Kurtosis       3.320351

                        diff_op_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%          -10            -13
 5%           -8            -12
10%           -6            -12       Obs               2,093
25%           -2            -11       Sum of Wgt.       2,093

50%            0                      Mean           .1227903
                        Largest       Std. Dev.       4.28822
75%            2             12
90%            6             12       Variance       18.38884
95%            8             12       Skewness      -.0092641
99%           10             13       Kurtosis       3.183128

. 
. * Identify people with no appointments in either year flag them and set diffe
> rence to missing
. forvalues i=2020/2021 {
  2.     gen no_appts_`i' = diff_op_`i'==0 & op_appt_`i'_cat==0
  3.     tab no_appts_`i' op_appt_`i'_cat
  4.     replace diff_op_`i'=. if no_appts_`i'==1
  5. }

no_appts_2 |         op_appt_2020_cat
       020 | No appoin  1-2 per y  3 or more |     Total
-----------+---------------------------------+----------
         0 |       331         19      2,991 |     3,341 
         1 |        26          0          0 |        26 
-----------+---------------------------------+----------
     Total |       357         19      2,991 |     3,367 
(26 real changes made, 26 to missing)

no_appts_2 |         op_appt_2021_cat
       021 | No appoin  1-2 per y  3 or more |     Total
-----------+---------------------------------+----------
         0 |       190         15      1,867 |     2,072 
         1 |        21          0          0 |        21 
-----------+---------------------------------+----------
     Total |       211         15      1,867 |     2,093 
(21 real changes made, 21 to missing)

. 
. * Identify of people with appointments whether they had fewer appointments 
. forvalues i=2020/2021 {
  2.     gen fewer_appts_`i' = (diff_op_`i' < 0) if diff_op_`i'!=.
  3. }
(1,659 missing values generated)
(2,928 missing values generated)

. 
. * Categorise number of outpatient appointments (all specialties)
. label define appt_all 0 "No appointments" 1 "1-2 per year" 2 "3-5 per year" 3
>  "6 or more per year"

. forvalues i=2019/2021 {
  2.     sum outpatient_appt_all_`i', d
  3.     egen op_appt_all_`i'_cat = cut(outpatient_appt_all_`i'), at(0, 1, 3, 6
> , 1000) icodes
  4.     * Check all categorised
.     bys op_appt_all_`i'_cat: sum outpatient_appt_all_`i'
  5.     label values op_appt_all_`i'_cat appt_all
  6.     * Same for orginal variables
.     egen op_appt_all_`i'_orig_cat = cut(op_appt_all_`i'_orig), at(0, 1, 3, 6,
>  1000) icodes
  7.     * Check all categorised
.     bys op_appt_all_`i'_orig_cat: sum op_appt_all_`i'_orig
  8.     label values op_appt_all_`i'_orig_cat appt_all
  9.     }

                  outpatient_appt_all_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               4,862
25%            6              0       Sum of Wgt.       4,862

50%            7                      Mean           6.716578
                        Largest       Std. Dev.      2.963102
75%            9             14
90%           10             14       Variance       8.779972
95%           11             14       Skewness      -.8701298
99%           12             16       Kurtosis       3.448829
(138 missing values generated)

-------------------------------------------------------------------------------
-> op_appt_all_2019_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2019 |        501           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_all_2019_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2019 |         25        1.76    .4358899          1          2

-------------------------------------------------------------------------------
-> op_appt_all_2019_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2019 |        664    4.480422    .7052331          3          5

-------------------------------------------------------------------------------
-> op_appt_all_2019_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2019 |      3,672    8.071078    1.572063          6         16

-------------------------------------------------------------------------------
-> op_appt_all_2019_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2019 |          0


-------------------------------------------------------------------------------
-> op_appt_all_2019_orig_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2019_orig |        511           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_all_2019_orig_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2019_orig |         28        1.75    .4409586          1          2

-------------------------------------------------------------------------------
-> op_appt_all_2019_orig_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2019_orig |        684     4.47807    .7083181          3          5

-------------------------------------------------------------------------------
-> op_appt_all_2019_orig_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2019_orig |      3,777    8.069897    1.571019          6         16


                  outpatient_appt_all_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            3              0       Obs               3,367
25%            6              0       Sum of Wgt.       3,367

50%            7                      Mean           6.814078
                        Largest       Std. Dev.       2.90397
75%            9             13
90%           10             13       Variance        8.43304
95%           11             14       Skewness      -.8558956
99%           12             14       Kurtosis        3.58805
(1633 missing values generated)

-------------------------------------------------------------------------------
-> op_appt_all_2020_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2020 |        312           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_all_2020_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2020 |         15    1.733333    .4577377          1          2

-------------------------------------------------------------------------------
-> op_appt_all_2020_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2020 |        467    4.522484    .6624734          3          5

-------------------------------------------------------------------------------
-> op_appt_all_2020_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2020 |      2,573    8.085892    1.612791          6         14

-------------------------------------------------------------------------------
-> op_appt_all_2020_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2020 |          0


-------------------------------------------------------------------------------
-> op_appt_all_2020_orig_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2020_orig |        468           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_all_2020_orig_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2020_orig |         22    1.772727     .428932          1          2

-------------------------------------------------------------------------------
-> op_appt_all_2020_orig_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2020_orig |        696    4.482759    .6740761          3          5

-------------------------------------------------------------------------------
-> op_appt_all_2020_orig_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2020_orig |      3,814    8.092554     1.60156          6         17


                  outpatient_appt_all_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            1              0       Obs               2,093
25%            6              0       Sum of Wgt.       2,093

50%            7                      Mean           6.754897
                        Largest       Std. Dev.      2.980759
75%            9             13
90%           10             13       Variance       8.884925
95%           11             14       Skewness      -.8295732
99%           12             15       Kurtosis       3.393393
(2907 missing values generated)

-------------------------------------------------------------------------------
-> op_appt_all_2021_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2021 |        209           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_all_2021_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2021 |         12    1.833333    .3892495          1          2

-------------------------------------------------------------------------------
-> op_appt_all_2021_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2021 |        298    4.446309    .7050585          3          5

-------------------------------------------------------------------------------
-> op_appt_all_2021_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2021 |      1,574    8.126429     1.60693          6         15

-------------------------------------------------------------------------------
-> op_appt_all_2021_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outpa~l_2021 |          0


-------------------------------------------------------------------------------
-> op_appt_all_2021_orig_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2021_orig |        491           0           0          0          0

-------------------------------------------------------------------------------
-> op_appt_all_2021_orig_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2021_orig |         30    1.833333     .379049          1          2

-------------------------------------------------------------------------------
-> op_appt_all_2021_orig_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2021_orig |        696    4.511494    .6784536          3          5

-------------------------------------------------------------------------------
-> op_appt_all_2021_orig_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~l_2021_orig |      3,783    8.098335    1.623093          6         16


. 
. * Calculate difference in all outpatient appointments compared to 2019
. gen diff_op_all_2020 = outpatient_appt_all_2020 - outpatient_appt_all_2019
(1,633 missing values generated)

. gen diff_op_all_2021 = outpatient_appt_all_2021 - outpatient_appt_all_2019
(2,907 missing values generated)

. sum diff_op_all_2020 diff_op_all_2021, d

                      diff_op_all_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%          -10            -12
 5%           -7            -12
10%           -5            -12       Obs               3,367
25%           -2            -12       Sum of Wgt.       3,367

50%            0                      Mean           .1268191
                        Largest       Std. Dev.       4.16272
75%            3             12
90%            6             13       Variance       17.32824
95%            7             13       Skewness       .0323413
99%           10             13       Kurtosis       3.196113

                      diff_op_all_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%          -10            -12
 5%           -7            -12
10%           -5            -12       Obs               2,093
25%           -2            -11       Sum of Wgt.       2,093

50%            0                      Mean            .079312
                        Largest       Std. Dev.      4.179003
75%            3             12
90%            5             12       Variance       17.46407
95%            7             12       Skewness      -.0098399
99%           10             12       Kurtosis       3.146503

. 
. * Identify people with no appointments in either year flag them and set diffe
> rence to missing
. forvalues i=2020/2021 {
  2.     gen no_appts_all_`i' = diff_op_all_`i'==0 & op_appt_all_`i'_cat==0
  3.     tab no_appts_all_`i' op_appt_all_`i'_cat
  4.     replace diff_op_all_`i'=. if no_appts_all_`i'==1
  5.     }

no_appts_a |            op_appt_all_2020_cat
   ll_2020 | No appoin  1-2 per y  3-5 per y  6 or more |     Total
-----------+--------------------------------------------+----------
         0 |       284         15        467      2,573 |     3,339 
         1 |        28          0          0          0 |        28 
-----------+--------------------------------------------+----------
     Total |       312         15        467      2,573 |     3,367 
(28 real changes made, 28 to missing)

no_appts_a |            op_appt_all_2021_cat
   ll_2021 | No appoin  1-2 per y  3-5 per y  6 or more |     Total
-----------+--------------------------------------------+----------
         0 |       187         12        298      1,574 |     2,071 
         1 |        22          0          0          0 |        22 
-----------+--------------------------------------------+----------
     Total |       209         12        298      1,574 |     2,093 
(22 real changes made, 22 to missing)

. 
. * Identify of people with appointments whether they had fewer appointments 
. forvalues i=2020/2021 {
  2.     gen fewer_appts_all_`i' = (diff_op_all_`i' < 0) if diff_op_all_`i'!=.
  3. }
(1,661 missing values generated)
(2,929 missing values generated)

. 
. preserve

. * Tabulate number of rheumatology appointments per year of those with whole y
> ear available
. table1_mc, vars(op_appt_2019_cat cate \ op_appt_2020_cat cate \ op_appt_2021_
> cat cate \ no_appts_2020 cate \ no_appts_2021 cate \ fewer_appts_2020 cate \ 
> fewer_appts_2021 cate) clear

  +----------------------------------+
  | factor               N_1     m_1 |
  |----------------------------------|
  | op_appt_2019_cat   4,862     138 |
  |----------------------------------|
  | op_appt_2020_cat   3,367   1,633 |
  |----------------------------------|
  | op_appt_2021_cat   2,093   2,907 |
  |----------------------------------|
  | no_appts_2020      5,000       0 |
  |----------------------------------|
  | no_appts_2021      5,000       0 |
  |----------------------------------|
  | fewer_appts_2020   3,341   1,659 |
  |----------------------------------|
  | fewer_appts_2021   2,072   2,928 |
  +----------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +-------------------------------------------------------+
  |                                         Total         |
  |-------------------------------------------------------|
  |                                         N=5,000       |
  |-------------------------------------------------------|
  | op_appt_2019_cat   No appointments      476 ( 9.8%)   |
  |                    1-2 per year         27 ( 0.6%)    |
  |                    3 or more per year   4,359 (89.7%) |
  |-------------------------------------------------------|
  | op_appt_2020_cat   No appointments      357 (10.6%)   |
  |                    1-2 per year         19 ( 0.6%)    |
  |                    3 or more per year   2,991 (88.8%) |
  |-------------------------------------------------------|
  | op_appt_2021_cat   No appointments      211 (10.1%)   |
  |                    1-2 per year         15 ( 0.7%)    |
  |                    3 or more per year   1,867 (89.2%) |
  |-------------------------------------------------------|
  | no_appts_2020      0                    4,974 (99.5%) |
  |                    1                    26 ( 0.5%)    |
  |-------------------------------------------------------|
  | no_appts_2021      0                    4,979 (99.6%) |
  |                    1                    21 ( 0.4%)    |
  |-------------------------------------------------------|
  | fewer_appts_2020   0                    1,814 (54.3%) |
  |                    1                    1,527 (45.7%) |
  |-------------------------------------------------------|
  | fewer_appts_2021   0                    1,198 (57.8%) |
  |                    1                    874 (42.2%)   |
  +-------------------------------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/op_appt_yrs.csv
file ./output/tables/op_appt_yrs.csv saved

. restore 

. preserve

. * Tabulate number of rheumatology appointments per year (includes people who 
> end follow-up during year)
. table1_mc, vars(op_appt_2019_orig_cat cate \ op_appt_2020_orig_cat cate \ op_
> appt_2021_orig_cat cate) clear

  +-------------------------------------+
  | factor                    N_1   m_1 |
  |-------------------------------------|
  | op_appt_2019_orig_cat   5,000     0 |
  |-------------------------------------|
  | op_appt_2020_orig_cat   5,000     0 |
  |-------------------------------------|
  | op_appt_2021_orig_cat   5,000     0 |
  +-------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +------------------------------------------------------------+
  |                                              Total         |
  |------------------------------------------------------------|
  |                                              N=5,000       |
  |------------------------------------------------------------|
  | op_appt_2019_orig_cat   No appointments      488 ( 9.8%)   |
  |                         1-2 per year         28 ( 0.6%)    |
  |                         3 or more per year   4,484 (89.7%) |
  |------------------------------------------------------------|
  | op_appt_2020_orig_cat   No appointments      528 (10.6%)   |
  |                         1-2 per year         25 ( 0.5%)    |
  |                         3 or more per year   4,447 (88.9%) |
  |------------------------------------------------------------|
  | op_appt_2021_orig_cat   No appointments      519 (10.4%)   |
  |                         1-2 per year         30 ( 0.6%)    |
  |                         3 or more per year   4,451 (89.0%) |
  +------------------------------------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/op_appt_orig_yrs.csv
file ./output/tables/op_appt_orig_yrs.csv saved

. restore 

. preserve

. * Tabulate number of all outpatient appointments per year of those with whole
>  year available
. table1_mc, vars(op_appt_all_2019_cat cate \ op_appt_all_2020_cat cate \ op_ap
> pt_all_2021_cat cate \ no_appts_all_2020 cate \ no_appts_all_2021 cate \ fewe
> r_appts_all_2020 cate \ fewer_appts_all_2021 cate) clear

  +--------------------------------------+
  | factor                   N_1     m_1 |
  |--------------------------------------|
  | op_appt_all_2019_cat   4,862     138 |
  |--------------------------------------|
  | op_appt_all_2020_cat   3,367   1,633 |
  |--------------------------------------|
  | op_appt_all_2021_cat   2,093   2,907 |
  |--------------------------------------|
  | no_appts_all_2020      5,000       0 |
  |--------------------------------------|
  | no_appts_all_2021      5,000       0 |
  |--------------------------------------|
  | fewer_appts_all_2020   3,339   1,661 |
  |--------------------------------------|
  | fewer_appts_all_2021   2,071   2,929 |
  +--------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +-----------------------------------------------------------+
  |                                             Total         |
  |-----------------------------------------------------------|
  |                                             N=5,000       |
  |-----------------------------------------------------------|
  | op_appt_all_2019_cat   No appointments      501 (10.3%)   |
  |                        1-2 per year         25 ( 0.5%)    |
  |                        3-5 per year         664 (13.7%)   |
  |                        6 or more per year   3,672 (75.5%) |
  |-----------------------------------------------------------|
  | op_appt_all_2020_cat   No appointments      312 ( 9.3%)   |
  |                        1-2 per year         15 ( 0.4%)    |
  |                        3-5 per year         467 (13.9%)   |
  |                        6 or more per year   2,573 (76.4%) |
  |-----------------------------------------------------------|
  | op_appt_all_2021_cat   No appointments      209 (10.0%)   |
  |                        1-2 per year         12 ( 0.6%)    |
  |                        3-5 per year         298 (14.2%)   |
  |                        6 or more per year   1,574 (75.2%) |
  |-----------------------------------------------------------|
  | no_appts_all_2020      0                    4,972 (99.4%) |
  |                        1                    28 ( 0.6%)    |
  |-----------------------------------------------------------|
  | no_appts_all_2021      0                    4,978 (99.6%) |
  |                        1                    22 ( 0.4%)    |
  |-----------------------------------------------------------|
  | fewer_appts_all_2020   0                    1,891 (56.6%) |
  |                        1                    1,448 (43.4%) |
  |-----------------------------------------------------------|
  | fewer_appts_all_2021   0                    1,169 (56.4%) |
  |                        1                    902 (43.6%)   |
  +-----------------------------------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/op_appt_all_yrs.csv
file ./output/tables/op_appt_all_yrs.csv saved

. restore 

. * Tabulate overall characteristics 
. preserve

. table1_mc, vars(age_cat cate \ male cate \ urban_rural_bin cate \ region cate
>  \ imd cate \  smoking cate \ time_ra contn \ bmi_cat cate \ eth5 cate) clear

  +-----------------------------+
  | factor          N_1     m_1 |
  |-----------------------------|
  | age_cat       3,958   1,042 |
  |-----------------------------|
  | male          5,000       0 |
  |-----------------------------|
  | Rural-Urban   5,000       0 |
  |-----------------------------|
  | region        5,000       0 |
  |-----------------------------|
  | imd           5,000       0 |
  |-----------------------------|
  | smoking       5,000       0 |
  |-----------------------------|
  | time_ra       2,215   2,785 |
  |-----------------------------|
  | bmi_cat       5,000       0 |
  |-----------------------------|
  | eth5          5,000       0 |
  +-----------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +-------------------------------------------------------------+
  |                                          Total              |
  |-------------------------------------------------------------|
  |                                          N=5,000            |
  |-------------------------------------------------------------|
  | age_cat       18 - 40 years              1,495 (37.8%)      |
  |               41 - 60 years              1,242 (31.4%)      |
  |               61 - 80 years              951 (24.0%)        |
  |               >80 years                  270 ( 6.8%)        |
  |-------------------------------------------------------------|
  | male          Female                     2,537 (50.7%)      |
  |               Male                       2,463 (49.3%)      |
  |-------------------------------------------------------------|
  | Rural-Urban   Rural                      2,522 (50.4%)      |
  |               Urban                      2,478 (49.6%)      |
  |-------------------------------------------------------------|
  | region        East Midlands              497 ( 9.9%)        |
  |               East of England            502 (10.0%)        |
  |               London                     971 (19.4%)        |
  |               North East                 529 (10.6%)        |
  |               North West                 489 ( 9.8%)        |
  |               South East                 1,003 (20.1%)      |
  |               West Midlands              469 ( 9.4%)        |
  |               Yorkshire and the Humber   540 (10.8%)        |
  |-------------------------------------------------------------|
  | imd           0                          218 ( 4.4%)        |
  |               1                          1,011 (20.2%)      |
  |               2                          986 (19.7%)        |
  |               3                          964 (19.3%)        |
  |               4                          914 (18.3%)        |
  |               5                          907 (18.1%)        |
  |-------------------------------------------------------------|
  | smoking       Never smoked               464 ( 9.3%)        |
  |               Current smoker             1,003 (20.1%)      |
  |               Ex-smoker                  750 (15.0%)        |
  |               Unknown                    2,783 (55.7%)      |
  |-------------------------------------------------------------|
  | time_ra                                  55.85648 (32.0693) |
  |-------------------------------------------------------------|
  | bmi_cat       Missing                    979 (19.6%)        |
  |               Underweight                468 ( 9.4%)        |
  |               Healthy range              933 (18.7%)        |
  |               Overweight                 1,007 (20.1%)      |
  |               Obese                      1,346 (26.9%)      |
  |               Morbidly obese             267 ( 5.3%)        |
  |-------------------------------------------------------------|
  | eth5          White                      949 (19.0%)        |
  |               South Asian                1,027 (20.5%)      |
  |               Black                      1,028 (20.6%)      |
  |               Mixed                      1,007 (20.1%)      |
  |               Other                      989 (19.8%)        |
  +-------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 

. export delimited using ./output/tables/op_chars.csv
file ./output/tables/op_chars.csv saved

. restore

. * Tabulate characteristics by category of outpatient appointments for each ye
> ar
. tempfile tempfile

. forvalues i=2019/2021 {
  2.     preserve
  3.     keep if op_appt_`i'_cat==0
  4.     table1_mc, vars(age_cat cate \ male cate \ urban_rural_bin cate \ regi
> on cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat cate \ eth5 cate)
>  clear
  5.     save `tempfile', replace
  6.     restore
  7.     forvalues j=1/2 {
  8.         preserve
  9.         keep if op_appt_`i'_cat==`j'
 10.         table1_mc, vars(age_cat cate \ male cate \ urban_rural_bin cate \ 
> region cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat cate \ eth5 c
> ate) clear
 11.         append using `tempfile'
 12.         save `tempfile', replace
 13.         if `j'==2 {
 14.             export delimited using ./output/tables/characteristics_strata`
> i'.csv
 15.         }
 16.         restore
 17.     }
 18.    
.     /* Tabulate characteristics by whether hospitalised with RA for each year
>     preserve
>     keep if ra_hosp_`i'==0
>     table1_mc, vars(age_cat cate \ male cate \ urban_rural_5 cate \ prescribe
> d_biologics cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat cate) cl
> ear
>     save `tempfile', replace
>     restore
>     preserve
>     keep if ra_hosp_`i'==1
>     table1_mc, vars(age_cat cate \ male cate \ urban_rural_5 cate \ prescribe
> d_biologics cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat cate) cl
> ear
>     append using `tempfile'
>     save `tempfile', replace
>     export delimited using ./output/tables/characteristics_ra_hosp_`i'.csv
>     restore*/
.     }
(4,524 observations deleted)

  +-------------------------+
  | factor        N_1   m_1 |
  |-------------------------|
  | age_cat       377    99 |
  |-------------------------|
  | male          476     0 |
  |-------------------------|
  | Rural-Urban   476     0 |
  |-------------------------|
  | region        476     0 |
  |-------------------------|
  | imd           476     0 |
  |-------------------------|
  | smoking       476     0 |
  |-------------------------|
  | time_ra       235   241 |
  |-------------------------|
  | bmi_cat       476     0 |
  |-------------------------|
  | eth5          476     0 |
  +-------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------------------+
  |                                          Total               |
  |--------------------------------------------------------------|
  |                                          N=476               |
  |--------------------------------------------------------------|
  | age_cat       18 - 40 years              139 (36.9%)         |
  |               41 - 60 years              117 (31.0%)         |
  |               61 - 80 years              85 (22.5%)          |
  |               >80 years                  36 ( 9.5%)          |
  |--------------------------------------------------------------|
  | male          Female                     258 (54.2%)         |
  |               Male                       218 (45.8%)         |
  |--------------------------------------------------------------|
  | Rural-Urban   Rural                      239 (50.2%)         |
  |               Urban                      237 (49.8%)         |
  |--------------------------------------------------------------|
  | region        East Midlands              46 ( 9.7%)          |
  |               East of England            47 ( 9.9%)          |
  |               London                     80 (16.8%)          |
  |               North East                 50 (10.5%)          |
  |               North West                 34 ( 7.1%)          |
  |               South East                 98 (20.6%)          |
  |               West Midlands              53 (11.1%)          |
  |               Yorkshire and the Humber   68 (14.3%)          |
  |--------------------------------------------------------------|
  | imd           0                          16 ( 3.4%)          |
  |               1                          87 (18.3%)          |
  |               2                          97 (20.4%)          |
  |               3                          102 (21.4%)         |
  |               4                          84 (17.6%)          |
  |               5                          90 (18.9%)          |
  |--------------------------------------------------------------|
  | smoking       Never smoked               42 ( 8.8%)          |
  |               Current smoker             96 (20.2%)          |
  |               Ex-smoker                  62 (13.0%)          |
  |               Unknown                    276 (58.0%)         |
  |--------------------------------------------------------------|
  | time_ra                                  56.11014 (30.26809) |
  |--------------------------------------------------------------|
  | bmi_cat       Missing                    101 (21.2%)         |
  |               Underweight                43 ( 9.0%)          |
  |               Healthy range              86 (18.1%)          |
  |               Overweight                 91 (19.1%)          |
  |               Obese                      124 (26.1%)         |
  |               Morbidly obese             31 ( 6.5%)          |
  |--------------------------------------------------------------|
  | eth5          White                      85 (17.9%)          |
  |               South Asian                105 (22.1%)         |
  |               Black                      88 (18.5%)          |
  |               Mixed                      95 (20.0%)          |
  |               Other                      103 (21.6%)         |
  +--------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
(note: file /tmp/St00015.000005 not found)
file /tmp/St00015.000005 saved
(4,973 observations deleted)

  +-------------------------+
  | factor        N_1   m_1 |
  |-------------------------|
  | age_cat        19     8 |
  |-------------------------|
  | male           27     0 |
  |-------------------------|
  | Rural-Urban    27     0 |
  |-------------------------|
  | region         27     0 |
  |-------------------------|
  | imd            27     0 |
  |-------------------------|
  | smoking        27     0 |
  |-------------------------|
  | time_ra        15    12 |
  |-------------------------|
  | bmi_cat        27     0 |
  |-------------------------|
  | eth5           27     0 |
  +-------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------------------+
  |                                          Total               |
  |--------------------------------------------------------------|
  |                                          N=27                |
  |--------------------------------------------------------------|
  | age_cat       18 - 40 years              10 (53%)            |
  |               41 - 60 years              3 (16%)             |
  |               61 - 80 years              4 (21%)             |
  |               >80 years                  2 (11%)             |
  |--------------------------------------------------------------|
  | male          Female                     19 (70%)            |
  |               Male                       8 (30%)             |
  |--------------------------------------------------------------|
  | Rural-Urban   Rural                      20 (74%)            |
  |               Urban                      7 (26%)             |
  |--------------------------------------------------------------|
  | region        East Midlands              1 ( 4%)             |
  |               East of England            2 ( 7%)             |
  |               London                     6 (22%)             |
  |               North East                 4 (15%)             |
  |               North West                 4 (15%)             |
  |               South East                 4 (15%)             |
  |               West Midlands              1 ( 4%)             |
  |               Yorkshire and the Humber   5 (19%)             |
  |--------------------------------------------------------------|
  | imd           1                          5 (19%)             |
  |               2                          5 (19%)             |
  |               3                          7 (26%)             |
  |               4                          6 (22%)             |
  |               5                          4 (15%)             |
  |--------------------------------------------------------------|
  | smoking       Current smoker             3 (11%)             |
  |               Ex-smoker                  6 (22%)             |
  |               Unknown                    18 (67%)            |
  |--------------------------------------------------------------|
  | time_ra                                  44.90185 (35.42404) |
  |--------------------------------------------------------------|
  | bmi_cat       Missing                    8 (30%)             |
  |               Underweight                1 ( 4%)             |
  |               Healthy range              3 (11%)             |
  |               Overweight                 3 (11%)             |
  |               Obese                      8 (30%)             |
  |               Morbidly obese             4 (15%)             |
  |--------------------------------------------------------------|
  | eth5          White                      2 ( 7%)             |
  |               South Asian                5 (19%)             |
  |               Black                      5 (19%)             |
  |               Mixed                      10 (37%)            |
  |               Other                      5 (19%)             |
  +--------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.000005 saved
(641 observations deleted)

  +-----------------------------+
  | factor          N_1     m_1 |
  |-----------------------------|
  | age_cat       3,457     902 |
  |-----------------------------|
  | male          4,359       0 |
  |-----------------------------|
  | Rural-Urban   4,359       0 |
  |-----------------------------|
  | region        4,359       0 |
  |-----------------------------|
  | imd           4,359       0 |
  |-----------------------------|
  | smoking       4,359       0 |
  |-----------------------------|
  | time_ra       1,899   2,460 |
  |-----------------------------|
  | bmi_cat       4,359       0 |
  |-----------------------------|
  | eth5          4,359       0 |
  +-----------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------------------+
  |                                          Total               |
  |--------------------------------------------------------------|
  |                                          N=4,359             |
  |--------------------------------------------------------------|
  | age_cat       18 - 40 years              1,301 (37.6%)       |
  |               41 - 60 years              1,090 (31.5%)       |
  |               61 - 80 years              839 (24.3%)         |
  |               >80 years                  227 ( 6.6%)         |
  |--------------------------------------------------------------|
  | male          Female                     2,195 (50.4%)       |
  |               Male                       2,164 (49.6%)       |
  |--------------------------------------------------------------|
  | Rural-Urban   Rural                      2,185 (50.1%)       |
  |               Urban                      2,174 (49.9%)       |
  |--------------------------------------------------------------|
  | region        East Midlands              434 (10.0%)         |
  |               East of England            436 (10.0%)         |
  |               London                     857 (19.7%)         |
  |               North East                 458 (10.5%)         |
  |               North West                 442 (10.1%)         |
  |               South East                 878 (20.1%)         |
  |               West Midlands              404 ( 9.3%)         |
  |               Yorkshire and the Humber   450 (10.3%)         |
  |--------------------------------------------------------------|
  | imd           0                          195 ( 4.5%)         |
  |               1                          897 (20.6%)         |
  |               2                          862 (19.8%)         |
  |               3                          825 (18.9%)         |
  |               4                          797 (18.3%)         |
  |               5                          783 (18.0%)         |
  |--------------------------------------------------------------|
  | smoking       Never smoked               406 ( 9.3%)         |
  |               Current smoker             870 (20.0%)         |
  |               Ex-smoker                  662 (15.2%)         |
  |               Unknown                    2,421 (55.5%)       |
  |--------------------------------------------------------------|
  | time_ra                                  56.01497 (32.11183) |
  |--------------------------------------------------------------|
  | bmi_cat       Missing                    848 (19.5%)         |
  |               Underweight                409 ( 9.4%)         |
  |               Healthy range              821 (18.8%)         |
  |               Overweight                 887 (20.3%)         |
  |               Obese                      1,170 (26.8%)       |
  |               Morbidly obese             224 ( 5.1%)         |
  |--------------------------------------------------------------|
  | eth5          White                      837 (19.2%)         |
  |               South Asian                896 (20.6%)         |
  |               Black                      894 (20.5%)         |
  |               Mixed                      878 (20.1%)         |
  |               Other                      854 (19.6%)         |
  +--------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.000005 saved
file ./output/tables/characteristics_strata2019.csv saved
(4,643 observations deleted)

  +-------------------------+
  | factor        N_1   m_1 |
  |-------------------------|
  | age_cat       289    68 |
  |-------------------------|
  | male          357     0 |
  |-------------------------|
  | Rural-Urban   357     0 |
  |-------------------------|
  | region        357     0 |
  |-------------------------|
  | imd           357     0 |
  |-------------------------|
  | smoking       357     0 |
  |-------------------------|
  | time_ra       160   197 |
  |-------------------------|
  | bmi_cat       357     0 |
  |-------------------------|
  | eth5          357     0 |
  +-------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +-------------------------------------------------------------+
  |                                          Total              |
  |-------------------------------------------------------------|
  |                                          N=357              |
  |-------------------------------------------------------------|
  | age_cat       18 - 40 years              110 (38.1%)        |
  |               41 - 60 years              97 (33.6%)         |
  |               61 - 80 years              70 (24.2%)         |
  |               >80 years                  12 ( 4.2%)         |
  |-------------------------------------------------------------|
  | male          Female                     192 (53.8%)        |
  |               Male                       165 (46.2%)        |
  |-------------------------------------------------------------|
  | Rural-Urban   Rural                      188 (52.7%)        |
  |               Urban                      169 (47.3%)        |
  |-------------------------------------------------------------|
  | region        East Midlands              32 ( 9.0%)         |
  |               East of England            31 ( 8.7%)         |
  |               London                     62 (17.4%)         |
  |               North East                 39 (10.9%)         |
  |               North West                 27 ( 7.6%)         |
  |               South East                 83 (23.2%)         |
  |               West Midlands              31 ( 8.7%)         |
  |               Yorkshire and the Humber   52 (14.6%)         |
  |-------------------------------------------------------------|
  | imd           0                          14 ( 3.9%)         |
  |               1                          69 (19.3%)         |
  |               2                          69 (19.3%)         |
  |               3                          80 (22.4%)         |
  |               4                          62 (17.4%)         |
  |               5                          63 (17.6%)         |
  |-------------------------------------------------------------|
  | smoking       Never smoked               33 ( 9.2%)         |
  |               Current smoker             73 (20.4%)         |
  |               Ex-smoker                  54 (15.1%)         |
  |               Unknown                    197 (55.2%)        |
  |-------------------------------------------------------------|
  | time_ra                                  56.7191 (34.38653) |
  |-------------------------------------------------------------|
  | bmi_cat       Missing                    72 (20.2%)         |
  |               Underweight                25 ( 7.0%)         |
  |               Healthy range              73 (20.4%)         |
  |               Overweight                 72 (20.2%)         |
  |               Obese                      95 (26.6%)         |
  |               Morbidly obese             20 ( 5.6%)         |
  |-------------------------------------------------------------|
  | eth5          White                      66 (18.5%)         |
  |               South Asian                70 (19.6%)         |
  |               Black                      77 (21.6%)         |
  |               Mixed                      70 (19.6%)         |
  |               Other                      74 (20.7%)         |
  +-------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.000005 saved
(4,981 observations deleted)

  +-------------------------+
  | factor        N_1   m_1 |
  |-------------------------|
  | age_cat        18     1 |
  |-------------------------|
  | male           19     0 |
  |-------------------------|
  | Rural-Urban    19     0 |
  |-------------------------|
  | region         19     0 |
  |-------------------------|
  | imd            19     0 |
  |-------------------------|
  | smoking        19     0 |
  |-------------------------|
  | time_ra         9    10 |
  |-------------------------|
  | bmi_cat        19     0 |
  |-------------------------|
  | eth5           19     0 |
  +-------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +-------------------------------------------------------------+
  |                                          Total              |
  |-------------------------------------------------------------|
  |                                          N=19               |
  |-------------------------------------------------------------|
  | age_cat       18 - 40 years              4 (22%)            |
  |               41 - 60 years              8 (44%)            |
  |               61 - 80 years              5 (28%)            |
  |               >80 years                  1 ( 6%)            |
  |-------------------------------------------------------------|
  | male          Female                     8 (42%)            |
  |               Male                       11 (58%)           |
  |-------------------------------------------------------------|
  | Rural-Urban   Rural                      7 (37%)            |
  |               Urban                      12 (63%)           |
  |-------------------------------------------------------------|
  | region        East Midlands              4 (21%)            |
  |               East of England            5 (26%)            |
  |               London                     2 (11%)            |
  |               North East                 4 (21%)            |
  |               South East                 2 (11%)            |
  |               West Midlands              1 ( 5%)            |
  |               Yorkshire and the Humber   1 ( 5%)            |
  |-------------------------------------------------------------|
  | imd           0                          2 (11%)            |
  |               1                          1 ( 5%)            |
  |               2                          5 (26%)            |
  |               3                          2 (11%)            |
  |               4                          3 (16%)            |
  |               5                          6 (32%)            |
  |-------------------------------------------------------------|
  | smoking       Current smoker             3 (16%)            |
  |               Ex-smoker                  3 (16%)            |
  |               Unknown                    13 (68%)           |
  |-------------------------------------------------------------|
  | time_ra                                  51.16404 (33.2038) |
  |-------------------------------------------------------------|
  | bmi_cat       Missing                    6 (32%)            |
  |               Underweight                2 (11%)            |
  |               Healthy range              2 (11%)            |
  |               Overweight                 5 (26%)            |
  |               Obese                      4 (21%)            |
  |-------------------------------------------------------------|
  | eth5          White                      4 (21%)            |
  |               South Asian                4 (21%)            |
  |               Black                      4 (21%)            |
  |               Mixed                      2 (11%)            |
  |               Other                      5 (26%)            |
  +-------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.000005 saved
(2,009 observations deleted)

  +-----------------------------+
  | factor          N_1     m_1 |
  |-----------------------------|
  | age_cat       2,345     646 |
  |-----------------------------|
  | male          2,991       0 |
  |-----------------------------|
  | Rural-Urban   2,991       0 |
  |-----------------------------|
  | region        2,991       0 |
  |-----------------------------|
  | imd           2,991       0 |
  |-----------------------------|
  | smoking       2,991       0 |
  |-----------------------------|
  | time_ra       1,306   1,685 |
  |-----------------------------|
  | bmi_cat       2,991       0 |
  |-----------------------------|
  | eth5          2,991       0 |
  +-----------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------------------+
  |                                          Total               |
  |--------------------------------------------------------------|
  |                                          N=2,991             |
  |--------------------------------------------------------------|
  | age_cat       18 - 40 years              887 (37.8%)         |
  |               41 - 60 years              724 (30.9%)         |
  |               61 - 80 years              568 (24.2%)         |
  |               >80 years                  166 ( 7.1%)         |
  |--------------------------------------------------------------|
  | male          Female                     1,489 (49.8%)       |
  |               Male                       1,502 (50.2%)       |
  |--------------------------------------------------------------|
  | Rural-Urban   Rural                      1,517 (50.7%)       |
  |               Urban                      1,474 (49.3%)       |
  |--------------------------------------------------------------|
  | region        East Midlands              301 (10.1%)         |
  |               East of England            293 ( 9.8%)         |
  |               London                     584 (19.5%)         |
  |               North East                 316 (10.6%)         |
  |               North West                 303 (10.1%)         |
  |               South East                 598 (20.0%)         |
  |               West Midlands              280 ( 9.4%)         |
  |               Yorkshire and the Humber   316 (10.6%)         |
  |--------------------------------------------------------------|
  | imd           0                          139 ( 4.6%)         |
  |               1                          603 (20.2%)         |
  |               2                          583 (19.5%)         |
  |               3                          565 (18.9%)         |
  |               4                          566 (18.9%)         |
  |               5                          535 (17.9%)         |
  |--------------------------------------------------------------|
  | smoking       Never smoked               269 ( 9.0%)         |
  |               Current smoker             596 (19.9%)         |
  |               Ex-smoker                  455 (15.2%)         |
  |               Unknown                    1,671 (55.9%)       |
  |--------------------------------------------------------------|
  | time_ra                                  55.92079 (31.71688) |
  |--------------------------------------------------------------|
  | bmi_cat       Missing                    582 (19.5%)         |
  |               Underweight                295 ( 9.9%)         |
  |               Healthy range              559 (18.7%)         |
  |               Overweight                 601 (20.1%)         |
  |               Obese                      800 (26.7%)         |
  |               Morbidly obese             154 ( 5.1%)         |
  |--------------------------------------------------------------|
  | eth5          White                      560 (18.7%)         |
  |               South Asian                627 (21.0%)         |
  |               Black                      596 (19.9%)         |
  |               Mixed                      618 (20.7%)         |
  |               Other                      590 (19.7%)         |
  +--------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.000005 saved
file ./output/tables/characteristics_strata2020.csv saved
(4,789 observations deleted)

  +-------------------------+
  | factor        N_1   m_1 |
  |-------------------------|
  | age_cat       172    39 |
  |-------------------------|
  | male          211     0 |
  |-------------------------|
  | Rural-Urban   211     0 |
  |-------------------------|
  | region        211     0 |
  |-------------------------|
  | imd           211     0 |
  |-------------------------|
  | smoking       211     0 |
  |-------------------------|
  | time_ra        94   117 |
  |-------------------------|
  | bmi_cat       211     0 |
  |-------------------------|
  | eth5          211     0 |
  +-------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------------------+
  |                                          Total               |
  |--------------------------------------------------------------|
  |                                          N=211               |
  |--------------------------------------------------------------|
  | age_cat       18 - 40 years              73 (42.4%)          |
  |               41 - 60 years              54 (31.4%)          |
  |               61 - 80 years              35 (20.3%)          |
  |               >80 years                  10 ( 5.8%)          |
  |--------------------------------------------------------------|
  | male          Female                     105 (49.8%)         |
  |               Male                       106 (50.2%)         |
  |--------------------------------------------------------------|
  | Rural-Urban   Rural                      101 (47.9%)         |
  |               Urban                      110 (52.1%)         |
  |--------------------------------------------------------------|
  | region        East Midlands              19 ( 9.0%)          |
  |               East of England            24 (11.4%)          |
  |               London                     35 (16.6%)          |
  |               North East                 28 (13.3%)          |
  |               North West                 22 (10.4%)          |
  |               South East                 39 (18.5%)          |
  |               West Midlands              23 (10.9%)          |
  |               Yorkshire and the Humber   21 (10.0%)          |
  |--------------------------------------------------------------|
  | imd           0                          9 ( 4.3%)           |
  |               1                          39 (18.5%)          |
  |               2                          34 (16.1%)          |
  |               3                          51 (24.2%)          |
  |               4                          47 (22.3%)          |
  |               5                          31 (14.7%)          |
  |--------------------------------------------------------------|
  | smoking       Never smoked               16 ( 7.6%)          |
  |               Current smoker             46 (21.8%)          |
  |               Ex-smoker                  34 (16.1%)          |
  |               Unknown                    115 (54.5%)         |
  |--------------------------------------------------------------|
  | time_ra                                  51.44658 (31.66433) |
  |--------------------------------------------------------------|
  | bmi_cat       Missing                    40 (19.0%)          |
  |               Underweight                26 (12.3%)          |
  |               Healthy range              35 (16.6%)          |
  |               Overweight                 41 (19.4%)          |
  |               Obese                      59 (28.0%)          |
  |               Morbidly obese             10 ( 4.7%)          |
  |--------------------------------------------------------------|
  | eth5          White                      38 (18.0%)          |
  |               South Asian                40 (19.0%)          |
  |               Black                      43 (20.4%)          |
  |               Mixed                      54 (25.6%)          |
  |               Other                      36 (17.1%)          |
  +--------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.000005 saved
(4,985 observations deleted)

  +-------------------------+
  | factor        N_1   m_1 |
  |-------------------------|
  | age_cat        11     4 |
  |-------------------------|
  | male           15     0 |
  |-------------------------|
  | Rural-Urban    15     0 |
  |-------------------------|
  | region         15     0 |
  |-------------------------|
  | imd            15     0 |
  |-------------------------|
  | smoking        15     0 |
  |-------------------------|
  | time_ra         9     6 |
  |-------------------------|
  | bmi_cat        15     0 |
  |-------------------------|
  | eth5           15     0 |
  +-------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------------------+
  |                                          Total               |
  |--------------------------------------------------------------|
  |                                          N=15                |
  |--------------------------------------------------------------|
  | age_cat       18 - 40 years              4 (36%)             |
  |               41 - 60 years              3 (27%)             |
  |               61 - 80 years              3 (27%)             |
  |               >80 years                  1 ( 9%)             |
  |--------------------------------------------------------------|
  | male          Female                     7 (47%)             |
  |               Male                       8 (53%)             |
  |--------------------------------------------------------------|
  | Rural-Urban   Rural                      10 (67%)            |
  |               Urban                      5 (33%)             |
  |--------------------------------------------------------------|
  | region        East Midlands              1 ( 7%)             |
  |               East of England            1 ( 7%)             |
  |               London                     3 (20%)             |
  |               North West                 4 (27%)             |
  |               South East                 3 (20%)             |
  |               West Midlands              2 (13%)             |
  |               Yorkshire and the Humber   1 ( 7%)             |
  |--------------------------------------------------------------|
  | imd           1                          2 (13%)             |
  |               2                          2 (13%)             |
  |               3                          6 (40%)             |
  |               4                          1 ( 7%)             |
  |               5                          4 (27%)             |
  |--------------------------------------------------------------|
  | smoking       Never smoked               1 ( 7%)             |
  |               Current smoker             1 ( 7%)             |
  |               Ex-smoker                  3 (20%)             |
  |               Unknown                    10 (67%)            |
  |--------------------------------------------------------------|
  | time_ra                                  75.38611 (26.32957) |
  |--------------------------------------------------------------|
  | bmi_cat       Missing                    3 (20%)             |
  |               Underweight                1 ( 7%)             |
  |               Healthy range              5 (33%)             |
  |               Overweight                 1 ( 7%)             |
  |               Obese                      3 (20%)             |
  |               Morbidly obese             2 (13%)             |
  |--------------------------------------------------------------|
  | eth5          White                      3 (20%)             |
  |               South Asian                2 (13%)             |
  |               Black                      4 (27%)             |
  |               Mixed                      2 (13%)             |
  |               Other                      4 (27%)             |
  +--------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.000005 saved
(3,133 observations deleted)

  +-----------------------------+
  | factor          N_1     m_1 |
  |-----------------------------|
  | age_cat       1,465     402 |
  |-----------------------------|
  | male          1,867       0 |
  |-----------------------------|
  | Rural-Urban   1,867       0 |
  |-----------------------------|
  | region        1,867       0 |
  |-----------------------------|
  | imd           1,867       0 |
  |-----------------------------|
  | smoking       1,867       0 |
  |-----------------------------|
  | time_ra         819   1,048 |
  |-----------------------------|
  | bmi_cat       1,867       0 |
  |-----------------------------|
  | eth5          1,867       0 |
  +-----------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------------------+
  |                                          Total               |
  |--------------------------------------------------------------|
  |                                          N=1,867             |
  |--------------------------------------------------------------|
  | age_cat       18 - 40 years              557 (38.0%)         |
  |               41 - 60 years              449 (30.6%)         |
  |               61 - 80 years              362 (24.7%)         |
  |               >80 years                  97 ( 6.6%)          |
  |--------------------------------------------------------------|
  | male          Female                     941 (50.4%)         |
  |               Male                       926 (49.6%)         |
  |--------------------------------------------------------------|
  | Rural-Urban   Rural                      942 (50.5%)         |
  |               Urban                      925 (49.5%)         |
  |--------------------------------------------------------------|
  | region        East Midlands              191 (10.2%)         |
  |               East of England            178 ( 9.5%)         |
  |               London                     365 (19.6%)         |
  |               North East                 190 (10.2%)         |
  |               North West                 169 ( 9.1%)         |
  |               South East                 391 (20.9%)         |
  |               West Midlands              172 ( 9.2%)         |
  |               Yorkshire and the Humber   211 (11.3%)         |
  |--------------------------------------------------------------|
  | imd           0                          88 ( 4.7%)          |
  |               1                          365 (19.6%)         |
  |               2                          377 (20.2%)         |
  |               3                          349 (18.7%)         |
  |               4                          343 (18.4%)         |
  |               5                          345 (18.5%)         |
  |--------------------------------------------------------------|
  | smoking       Never smoked               173 ( 9.3%)         |
  |               Current smoker             379 (20.3%)         |
  |               Ex-smoker                  292 (15.6%)         |
  |               Unknown                    1,023 (54.8%)       |
  |--------------------------------------------------------------|
  | time_ra                                  55.22933 (31.89348) |
  |--------------------------------------------------------------|
  | bmi_cat       Missing                    371 (19.9%)         |
  |               Underweight                188 (10.1%)         |
  |               Healthy range              339 (18.2%)         |
  |               Overweight                 354 (19.0%)         |
  |               Obese                      514 (27.5%)         |
  |               Morbidly obese             101 ( 5.4%)         |
  |--------------------------------------------------------------|
  | eth5          White                      334 (17.9%)         |
  |               South Asian                407 (21.8%)         |
  |               Black                      362 (19.4%)         |
  |               Mixed                      377 (20.2%)         |
  |               Other                      387 (20.7%)         |
  +--------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.000005 saved
file ./output/tables/characteristics_strata2021.csv saved

. 
. * Tabulate characteristics by categories of differences in rheumatology outpa
> tient appointments for each year
. drop if region=="missing"
(0 observations deleted)

. tempfile tempfile

. forvalues i=2020/2021 {
  2.     * Same number or more appointments 
.     preserve
  3.     keep if fewer_appts_`i'==0
  4.     table1_mc, vars(age_cat cate \ male cate \ urban_rural_bin cate \ regi
> on cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat cate \ eth5 cate)
>  clear
  5.     save `tempfile', replace
  6.     restore
  7.     * Fewer appointments 
.     preserve
  8.     keep if fewer_appts_`i'==1
  9.     table1_mc, vars(age_cat cate \ male cate \ urban_rural_bin cate \ regi
> on cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat cate \ eth5 cate)
>  clear
 10.     append using `tempfile'
 11.     save `tempfile', replace
 12.     restore 
 13.     * No appointments
.     preserve 
 14.     keep if no_appts_`i' ==1
 15.     table1_mc, vars(age_cat cate \ male cate \ urban_rural_bin cate \ regi
> on cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat cate \ eth5 cate)
>  clear
 16.     append using `tempfile'
 17.     save `tempfile', replace
 18.     export delimited using ./output/tables/characteristics_diff_strata`i'.
> csv    
 19.     restore
 20.     * Logistic regression 
.     foreach var in urban_rural_bin i.imd i.region_n i.eth5 {
 21.         logit fewer_appts_`i' ib1.age_cat male `var', or 
 22.         est sto m1 
 23.         parmest, label eform format(estimate p min95 max95) saving("./outp
> ut/tempdata/`var'_diff_rheum_`i'", replace) idstr("`var'_rheum_`i'")
 24.         }
 25.     logit fewer_appts_`i' ib1.age_cat male urban_rural_bin i.imd i.region_
> n i.eth5, or 
 26.     est sto m1
 27.     parmest, label eform format(estimate p min95 max95) saving("./output/t
> empdata/multi_diff_rheum_`i'", replace) idstr("multi_rheum_`i'")
 28.     }
(3,186 observations deleted)

  +-----------------------------+
  | factor          N_1     m_1 |
  |-----------------------------|
  | age_cat       1,445     369 |
  |-----------------------------|
  | male          1,814       0 |
  |-----------------------------|
  | Rural-Urban   1,814       0 |
  |-----------------------------|
  | region        1,814       0 |
  |-----------------------------|
  | imd           1,814       0 |
  |-----------------------------|
  | smoking       1,814       0 |
  |-----------------------------|
  | time_ra         795   1,019 |
  |-----------------------------|
  | bmi_cat       1,814       0 |
  |-----------------------------|
  | eth5          1,814       0 |
  +-----------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------------------+
  |                                          Total               |
  |--------------------------------------------------------------|
  |                                          N=1,814             |
  |--------------------------------------------------------------|
  | age_cat       18 - 40 years              542 (37.5%)         |
  |               41 - 60 years              460 (31.8%)         |
  |               61 - 80 years              340 (23.5%)         |
  |               >80 years                  103 ( 7.1%)         |
  |--------------------------------------------------------------|
  | male          Female                     904 (49.8%)         |
  |               Male                       910 (50.2%)         |
  |--------------------------------------------------------------|
  | Rural-Urban   Rural                      933 (51.4%)         |
  |               Urban                      881 (48.6%)         |
  |--------------------------------------------------------------|
  | region        East Midlands              185 (10.2%)         |
  |               East of England            178 ( 9.8%)         |
  |               London                     336 (18.5%)         |
  |               North East                 189 (10.4%)         |
  |               North West                 190 (10.5%)         |
  |               South East                 362 (20.0%)         |
  |               West Midlands              168 ( 9.3%)         |
  |               Yorkshire and the Humber   206 (11.4%)         |
  |--------------------------------------------------------------|
  | imd           0                          85 ( 4.7%)          |
  |               1                          365 (20.1%)         |
  |               2                          345 (19.0%)         |
  |               3                          332 (18.3%)         |
  |               4                          353 (19.5%)         |
  |               5                          334 (18.4%)         |
  |--------------------------------------------------------------|
  | smoking       Never smoked               167 ( 9.2%)         |
  |               Current smoker             349 (19.2%)         |
  |               Ex-smoker                  265 (14.6%)         |
  |               Unknown                    1,033 (56.9%)       |
  |--------------------------------------------------------------|
  | time_ra                                  54.49985 (31.55906) |
  |--------------------------------------------------------------|
  | bmi_cat       Missing                    359 (19.8%)         |
  |               Underweight                186 (10.3%)         |
  |               Healthy range              341 (18.8%)         |
  |               Overweight                 361 (19.9%)         |
  |               Obese                      470 (25.9%)         |
  |               Morbidly obese             97 ( 5.3%)          |
  |--------------------------------------------------------------|
  | eth5          White                      336 (18.5%)         |
  |               South Asian                376 (20.7%)         |
  |               Black                      354 (19.5%)         |
  |               Mixed                      378 (20.8%)         |
  |               Other                      370 (20.4%)         |
  +--------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
(note: file /tmp/St00015.00000f not found)
file /tmp/St00015.00000f saved
(3,473 observations deleted)

  +---------------------------+
  | factor          N_1   m_1 |
  |---------------------------|
  | age_cat       1,185   342 |
  |---------------------------|
  | male          1,527     0 |
  |---------------------------|
  | Rural-Urban   1,527     0 |
  |---------------------------|
  | region        1,527     0 |
  |---------------------------|
  | imd           1,527     0 |
  |---------------------------|
  | smoking       1,527     0 |
  |---------------------------|
  | time_ra         665   862 |
  |---------------------------|
  | bmi_cat       1,527     0 |
  |---------------------------|
  | eth5          1,527     0 |
  +---------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------------------+
  |                                          Total               |
  |--------------------------------------------------------------|
  |                                          N=1,527             |
  |--------------------------------------------------------------|
  | age_cat       18 - 40 years              450 (38.0%)         |
  |               41 - 60 years              363 (30.6%)         |
  |               61 - 80 years              296 (25.0%)         |
  |               >80 years                  76 ( 6.4%)          |
  |--------------------------------------------------------------|
  | male          Female                     769 (50.4%)         |
  |               Male                       758 (49.6%)         |
  |--------------------------------------------------------------|
  | Rural-Urban   Rural                      765 (50.1%)         |
  |               Urban                      762 (49.9%)         |
  |--------------------------------------------------------------|
  | region        East Midlands              151 ( 9.9%)         |
  |               East of England            151 ( 9.9%)         |
  |               London                     309 (20.2%)         |
  |               North East                 166 (10.9%)         |
  |               North West                 136 ( 8.9%)         |
  |               South East                 315 (20.6%)         |
  |               West Midlands              140 ( 9.2%)         |
  |               Yorkshire and the Humber   159 (10.4%)         |
  |--------------------------------------------------------------|
  | imd           0                          69 ( 4.5%)          |
  |               1                          303 (19.8%)         |
  |               2                          308 (20.2%)         |
  |               3                          308 (20.2%)         |
  |               4                          273 (17.9%)         |
  |               5                          266 (17.4%)         |
  |--------------------------------------------------------------|
  | smoking       Never smoked               132 ( 8.6%)         |
  |               Current smoker             318 (20.8%)         |
  |               Ex-smoker                  245 (16.0%)         |
  |               Unknown                    832 (54.5%)         |
  |--------------------------------------------------------------|
  | time_ra                                  57.69925 (32.49508) |
  |--------------------------------------------------------------|
  | bmi_cat       Missing                    296 (19.4%)         |
  |               Underweight                136 ( 8.9%)         |
  |               Healthy range              287 (18.8%)         |
  |               Overweight                 312 (20.4%)         |
  |               Obese                      422 (27.6%)         |
  |               Morbidly obese             74 ( 4.8%)          |
  |--------------------------------------------------------------|
  | eth5          White                      290 (19.0%)         |
  |               South Asian                322 (21.1%)         |
  |               Black                      316 (20.7%)         |
  |               Mixed                      308 (20.2%)         |
  |               Other                      291 (19.1%)         |
  +--------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.00000f saved
(4,974 observations deleted)

  +-------------------------+
  | factor        N_1   m_1 |
  |-------------------------|
  | age_cat        22     4 |
  |-------------------------|
  | male           26     0 |
  |-------------------------|
  | Rural-Urban    26     0 |
  |-------------------------|
  | region         26     0 |
  |-------------------------|
  | imd            26     0 |
  |-------------------------|
  | smoking        26     0 |
  |-------------------------|
  | time_ra        15    11 |
  |-------------------------|
  | bmi_cat        26     0 |
  |-------------------------|
  | eth5           26     0 |
  +-------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +------------------------------------------------------------+
  |                                          Total             |
  |------------------------------------------------------------|
  |                                          N=26              |
  |------------------------------------------------------------|
  | age_cat       18 - 40 years              9 (41%)           |
  |               41 - 60 years              6 (27%)           |
  |               61 - 80 years              7 (32%)           |
  |------------------------------------------------------------|
  | male          Female                     16 (62%)          |
  |               Male                       10 (38%)          |
  |------------------------------------------------------------|
  | Rural-Urban   Rural                      14 (54%)          |
  |               Urban                      12 (46%)          |
  |------------------------------------------------------------|
  | region        East Midlands              1 ( 4%)           |
  |               London                     3 (12%)           |
  |               North East                 4 (15%)           |
  |               North West                 4 (15%)           |
  |               South East                 6 (23%)           |
  |               West Midlands              4 (15%)           |
  |               Yorkshire and the Humber   4 (15%)           |
  |------------------------------------------------------------|
  | imd           0                          1 ( 4%)           |
  |               1                          5 (19%)           |
  |               2                          4 (15%)           |
  |               3                          7 (27%)           |
  |               4                          5 (19%)           |
  |               5                          4 (15%)           |
  |------------------------------------------------------------|
  | smoking       Never smoked               3 (12%)           |
  |               Current smoker             5 (19%)           |
  |               Ex-smoker                  2 ( 8%)           |
  |               Unknown                    16 (62%)          |
  |------------------------------------------------------------|
  | time_ra                                  58.047 (31.84009) |
  |------------------------------------------------------------|
  | bmi_cat       Missing                    5 (19%)           |
  |               Healthy range              6 (23%)           |
  |               Overweight                 5 (19%)           |
  |               Obese                      7 (27%)           |
  |               Morbidly obese             3 (12%)           |
  |------------------------------------------------------------|
  | eth5          White                      4 (15%)           |
  |               South Asian                3 (12%)           |
  |               Black                      7 (27%)           |
  |               Mixed                      4 (15%)           |
  |               Other                      8 (31%)           |
  +------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
(note: variable Total was str17, now str19 to accommodate using data's
       values)
file /tmp/St00015.00000f saved
file ./output/tables/characteristics_diff_strata2020.csv saved

Iteration 0:   log likelihood = -1810.1044  
Iteration 1:   log likelihood = -1809.3837  
Iteration 2:   log likelihood = -1809.3837  

Logistic regression                             Number of obs     =      2,630
                                                LR chi2(5)        =       1.44
                                                Prob > chi2       =     0.9197
Log likelihood = -1809.3837                     Pseudo R2         =     0.0004

------------------------------------------------------------------------------
fewer~s_2020 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     age_cat |
18 - 40 y..  |    1.05261   .0998674     0.54   0.589     .8739951    1.267728
61 - 80 y..  |   1.104181   .1172051     0.93   0.350      .896784    1.359541
  >80 years  |   .9354558    .155992    -0.40   0.689      .674654    1.297076
             |
        male |    1.01409   .0795825     0.18   0.858      .869515    1.182704
urban_rura~n |   1.009687   .0792754     0.12   0.902      .865675    1.177657
       _cons |   .7795294    .070239    -2.76   0.006     .6533345    .9300995
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/urban_rural_bin_diff_rheum_2020.dta not found)
file ./output/tempdata/urban_rural_bin_diff_rheum_2020.dta saved

Iteration 0:   log likelihood = -1810.1044  
Iteration 1:   log likelihood = -1807.6111  
Iteration 2:   log likelihood =  -1807.611  

Logistic regression                             Number of obs     =      2,630
                                                LR chi2(9)        =       4.99
                                                Prob > chi2       =     0.8355
Log likelihood =  -1807.611                     Pseudo R2         =     0.0014

------------------------------------------------------------------------------
fewer~s_2020 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     age_cat |
18 - 40 y..  |   1.049498   .0998274     0.51   0.612     .8709962    1.264583
61 - 80 y..  |   1.101418   .1171566     0.91   0.364     .8941508     1.35673
  >80 years  |   .9243118   .1544195    -0.47   0.638      .666213    1.282401
             |
        male |   1.009282   .0794468     0.12   0.907     .8649865    1.177649
             |
         imd |
          1  |   1.108273   .2218118     0.51   0.607     .7486619    1.640619
          2  |     1.1441   .2292125     0.67   0.502     .7725592    1.694324
          3  |   1.119944   .2253257     0.56   0.573     .7549879    1.661318
          4  |   .9576831   .1935403    -0.21   0.831     .6444669    1.423125
          5  |   .9735472   .1966368    -0.13   0.894      .655287     1.44638
             |
       _cons |   .7446342    .144542    -1.52   0.129     .5089968    1.089359
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/i.imd_diff_rheum_2020 not found)
file ./output/tempdata/i.imd_diff_rheum_2020 saved

Iteration 0:   log likelihood = -1810.1044  
Iteration 1:   log likelihood = -1807.2198  
Iteration 2:   log likelihood = -1807.2197  

Logistic regression                             Number of obs     =      2,630
                                                LR chi2(11)       =       5.77
                                                Prob > chi2       =     0.8883
Log likelihood = -1807.2197                     Pseudo R2         =     0.0016

------------------------------------------------------------------------------
fewer~s_2020 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     age_cat |
18 - 40 y..  |   1.059299   .1007425     0.61   0.545     .8791572    1.276351
61 - 80 y..  |   1.108604   .1178792     0.97   0.332     .9000509    1.365481
  >80 years  |    .933541   .1559594    -0.41   0.681     .6728679      1.2952
             |
        male |   1.011614   .0794697     0.15   0.883     .8672544    1.180002
             |
    region_n |
          2  |   .9636514   .1676557    -0.21   0.831     .6852172    1.355226
          3  |   1.016698   .1536305     0.11   0.913     .7560824    1.367145
          4  |   .9137141   .1566643    -0.53   0.599     .6529267    1.278663
          5  |   .7852887   .1397597    -1.36   0.174     .5540372    1.113063
          6  |   .8952667   .1349581    -0.73   0.463     .6662497    1.203006
          8  |   .9018234   .1593434    -0.58   0.559     .6378558     1.27503
          9  |   .8249819   .1406402    -1.13   0.259     .5906557    1.152271
             |
       _cons |   .8513878   .1203983    -1.14   0.255     .6452908    1.123309
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/i.region_n_diff_rheum_2020 not found)
file ./output/tempdata/i.region_n_diff_rheum_2020 saved

Iteration 0:   log likelihood = -1810.1044  
Iteration 1:   log likelihood = -1808.4119  
Iteration 2:   log likelihood = -1808.4118  

Logistic regression                             Number of obs     =      2,630
                                                LR chi2(8)        =       3.39
                                                Prob > chi2       =     0.9079
Log likelihood = -1808.4118                     Pseudo R2         =     0.0009

------------------------------------------------------------------------------
fewer~s_2020 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     age_cat |
18 - 40 y..  |   1.051814   .0998421     0.53   0.595     .8732519    1.266887
61 - 80 y..  |   1.098865   .1166757     0.89   0.375     .8924117     1.35308
  >80 years  |   .9341854   .1559091    -0.41   0.683     .6735556    1.295665
             |
        male |   1.013773   .0796269     0.17   0.862     .8691261    1.182492
             |
        eth5 |
South Asian  |   1.028615   .1283474     0.23   0.821     .8054577    1.313601
      Black  |   1.107438   .1385354     0.82   0.415      .866639    1.415145
      Mixed  |   .9842652   .1236004    -0.13   0.899     .7695227    1.258934
      Other  |    .938749   .1180972    -0.50   0.615     .7336113    1.201249
             |
       _cons |   .7762199   .0883538    -2.23   0.026     .6210065    .9702271
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/i.eth5_diff_rheum_2020 not found)
file ./output/tempdata/i.eth5_diff_rheum_2020 saved

Iteration 0:   log likelihood = -1810.1044  
Iteration 1:   log likelihood = -1804.4398  
Iteration 2:   log likelihood = -1804.4394  
Iteration 3:   log likelihood = -1804.4394  

Logistic regression                             Number of obs     =      2,630
                                                LR chi2(21)       =      11.33
                                                Prob > chi2       =     0.9560
Log likelihood = -1804.4394                     Pseudo R2         =     0.0031

------------------------------------------------------------------------------
fewer~s_2020 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     age_cat |
18 - 40 y..  |   1.056178   .1008305     0.57   0.567     .8759412      1.2735
61 - 80 y..  |   1.102141   .1176644     0.91   0.362      .894053    1.358662
  >80 years  |   .9207206    .154256    -0.49   0.622     .6630083    1.278606
             |
        male |   1.005521   .0794258     0.07   0.944     .8613008     1.17389
urban_rura~n |   1.013983   .0800647     0.18   0.860     .8685988    1.183701
             |
         imd |
          1  |   1.117568   .2242421     0.55   0.580     .7541863    1.656034
          2  |     1.1507   .2313023     0.70   0.485     .7760003    1.706326
          3  |   1.121276   .2262131     0.57   0.570     .7550679    1.665096
          4  |   .9646405   .1954958    -0.18   0.859     .6484245    1.435065
          5  |   .9778097   .1979904    -0.11   0.912     .6575065    1.454148
             |
    region_n |
          2  |   .9682342   .1687749    -0.19   0.853     .6880274    1.362558
          3  |   1.018271   .1541731     0.12   0.905     .7568082    1.370065
          4  |   .9225178   .1585326    -0.47   0.639     .6587152    1.291968
          5  |   .7879471   .1404767    -1.34   0.181     .5555757    1.117508
          6  |   .8943843   .1351562    -0.74   0.460     .6651102    1.202693
          8  |   .8936898   .1583298    -0.63   0.526     .6315161    1.264705
          9  |   .8207363   .1403493    -1.16   0.248     .5870088    1.147526
             |
        eth5 |
South Asian  |   1.027471   .1285206     0.22   0.828     .8040767     1.31293
      Black  |   1.112151   .1396253     0.85   0.397     .8695601    1.422421
      Mixed  |   .9857423   .1241917    -0.11   0.909     .7700557    1.261841
      Other  |   .9439734   .1191543    -0.46   0.648     .7370818    1.208937
             |
       _cons |   .7904845   .1906135    -0.98   0.330     .4927638    1.268084
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/multi_diff_rheum_2020.dta not found)
file ./output/tempdata/multi_diff_rheum_2020.dta saved
(3,802 observations deleted)

  +---------------------------+
  | factor          N_1   m_1 |
  |---------------------------|
  | age_cat         940   258 |
  |---------------------------|
  | male          1,198     0 |
  |---------------------------|
  | Rural-Urban   1,198     0 |
  |---------------------------|
  | region        1,198     0 |
  |---------------------------|
  | imd           1,198     0 |
  |---------------------------|
  | smoking       1,198     0 |
  |---------------------------|
  | time_ra         528   670 |
  |---------------------------|
  | bmi_cat       1,198     0 |
  |---------------------------|
  | eth5          1,198     0 |
  +---------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------------------+
  |                                          Total               |
  |--------------------------------------------------------------|
  |                                          N=1,198             |
  |--------------------------------------------------------------|
  | age_cat       18 - 40 years              366 (38.9%)         |
  |               41 - 60 years              297 (31.6%)         |
  |               61 - 80 years              216 (23.0%)         |
  |               >80 years                  61 ( 6.5%)          |
  |--------------------------------------------------------------|
  | male          Female                     606 (50.6%)         |
  |               Male                       592 (49.4%)         |
  |--------------------------------------------------------------|
  | Rural-Urban   Rural                      605 (50.5%)         |
  |               Urban                      593 (49.5%)         |
  |--------------------------------------------------------------|
  | region        East Midlands              132 (11.0%)         |
  |               East of England            109 ( 9.1%)         |
  |               London                     218 (18.2%)         |
  |               North East                 121 (10.1%)         |
  |               North West                 113 ( 9.4%)         |
  |               South East                 251 (21.0%)         |
  |               West Midlands              110 ( 9.2%)         |
  |               Yorkshire and the Humber   144 (12.0%)         |
  |--------------------------------------------------------------|
  | imd           0                          60 ( 5.0%)          |
  |               1                          219 (18.3%)         |
  |               2                          255 (21.3%)         |
  |               3                          217 (18.1%)         |
  |               4                          220 (18.4%)         |
  |               5                          227 (18.9%)         |
  |--------------------------------------------------------------|
  | smoking       Never smoked               115 ( 9.6%)         |
  |               Current smoker             234 (19.5%)         |
  |               Ex-smoker                  188 (15.7%)         |
  |               Unknown                    661 (55.2%)         |
  |--------------------------------------------------------------|
  | time_ra                                  54.55974 (32.07949) |
  |--------------------------------------------------------------|
  | bmi_cat       Missing                    249 (20.8%)         |
  |               Underweight                115 ( 9.6%)         |
  |               Healthy range              205 (17.1%)         |
  |               Overweight                 221 (18.4%)         |
  |               Obese                      339 (28.3%)         |
  |               Morbidly obese             69 ( 5.8%)          |
  |--------------------------------------------------------------|
  | eth5          White                      210 (17.5%)         |
  |               South Asian                258 (21.5%)         |
  |               Black                      232 (19.4%)         |
  |               Mixed                      244 (20.4%)         |
  |               Other                      254 (21.2%)         |
  +--------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.00000f saved
(4,126 observations deleted)

  +-------------------------+
  | factor        N_1   m_1 |
  |-------------------------|
  | age_cat       690   184 |
  |-------------------------|
  | male          874     0 |
  |-------------------------|
  | Rural-Urban   874     0 |
  |-------------------------|
  | region        874     0 |
  |-------------------------|
  | imd           874     0 |
  |-------------------------|
  | smoking       874     0 |
  |-------------------------|
  | time_ra       381   493 |
  |-------------------------|
  | bmi_cat       874     0 |
  |-------------------------|
  | eth5          874     0 |
  +-------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------------------+
  |                                          Total               |
  |--------------------------------------------------------------|
  |                                          N=874               |
  |--------------------------------------------------------------|
  | age_cat       18 - 40 years              256 (37.1%)         |
  |               41 - 60 years              205 (29.7%)         |
  |               61 - 80 years              182 (26.4%)         |
  |               >80 years                  47 ( 6.8%)          |
  |--------------------------------------------------------------|
  | male          Female                     438 (50.1%)         |
  |               Male                       436 (49.9%)         |
  |--------------------------------------------------------------|
  | Rural-Urban   Rural                      435 (49.8%)         |
  |               Urban                      439 (50.2%)         |
  |--------------------------------------------------------------|
  | region        East Midlands              77 ( 8.8%)          |
  |               East of England            92 (10.5%)          |
  |               London                     184 (21.1%)         |
  |               North East                 95 (10.9%)          |
  |               North West                 77 ( 8.8%)          |
  |               South East                 177 (20.3%)         |
  |               West Midlands              83 ( 9.5%)          |
  |               Yorkshire and the Humber   89 (10.2%)          |
  |--------------------------------------------------------------|
  | imd           0                          36 ( 4.1%)          |
  |               1                          182 (20.8%)         |
  |               2                          153 (17.5%)         |
  |               3                          184 (21.1%)         |
  |               4                          168 (19.2%)         |
  |               5                          151 (17.3%)         |
  |--------------------------------------------------------------|
  | smoking       Never smoked               74 ( 8.5%)          |
  |               Current smoker             187 (21.4%)         |
  |               Ex-smoker                  137 (15.7%)         |
  |               Unknown                    476 (54.5%)         |
  |--------------------------------------------------------------|
  | time_ra                                  56.02818 (31.60952) |
  |--------------------------------------------------------------|
  | bmi_cat       Missing                    162 (18.5%)         |
  |               Underweight                97 (11.1%)          |
  |               Healthy range              171 (19.6%)         |
  |               Overweight                 169 (19.3%)         |
  |               Obese                      232 (26.5%)         |
  |               Morbidly obese             43 ( 4.9%)          |
  |--------------------------------------------------------------|
  | eth5          White                      161 (18.4%)         |
  |               South Asian                186 (21.3%)         |
  |               Black                      173 (19.8%)         |
  |               Mixed                      186 (21.3%)         |
  |               Other                      168 (19.2%)         |
  +--------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.00000f saved
(4,979 observations deleted)

  +-------------------------+
  | factor        N_1   m_1 |
  |-------------------------|
  | age_cat        18     3 |
  |-------------------------|
  | male           21     0 |
  |-------------------------|
  | Rural-Urban    21     0 |
  |-------------------------|
  | region         21     0 |
  |-------------------------|
  | imd            21     0 |
  |-------------------------|
  | smoking        21     0 |
  |-------------------------|
  | time_ra        13     8 |
  |-------------------------|
  | bmi_cat        21     0 |
  |-------------------------|
  | eth5           21     0 |
  +-------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------+
  |                                 Total              |
  |----------------------------------------------------|
  |                                 N=21               |
  |----------------------------------------------------|
  | age_cat       18 - 40 years     12 (67%)           |
  |               41 - 60 years     4 (22%)            |
  |               61 - 80 years     2 (11%)            |
  |----------------------------------------------------|
  | male          Female            9 (43%)            |
  |               Male              12 (57%)           |
  |----------------------------------------------------|
  | Rural-Urban   Rural             13 (62%)           |
  |               Urban             8 (38%)            |
  |----------------------------------------------------|
  | region        East Midlands     2 (10%)            |
  |               East of England   2 (10%)            |
  |               London            1 ( 5%)            |
  |               North East        2 (10%)            |
  |               North West        5 (24%)            |
  |               South East        5 (24%)            |
  |               West Midlands     4 (19%)            |
  |----------------------------------------------------|
  | imd           0                 1 ( 5%)            |
  |               1                 5 (24%)            |
  |               2                 5 (24%)            |
  |               3                 5 (24%)            |
  |               4                 3 (14%)            |
  |               5                 2 (10%)            |
  |----------------------------------------------------|
  | smoking       Never smoked      1 ( 5%)            |
  |               Current smoker    5 (24%)            |
  |               Ex-smoker         4 (19%)            |
  |               Unknown           11 (52%)           |
  |----------------------------------------------------|
  | time_ra                         45.61512 (31.8354) |
  |----------------------------------------------------|
  | bmi_cat       Missing           3 (14%)            |
  |               Underweight       3 (14%)            |
  |               Healthy range     3 (14%)            |
  |               Overweight        6 (29%)            |
  |               Obese             5 (24%)            |
  |               Morbidly obese    1 ( 5%)            |
  |----------------------------------------------------|
  | eth5          White             4 (19%)            |
  |               South Asian       5 (24%)            |
  |               Black             4 (19%)            |
  |               Mixed             3 (14%)            |
  |               Other             5 (24%)            |
  +----------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
(note: variable level was str15, now str24 to accommodate using data's
       values)
(note: variable Total was str18, now str19 to accommodate using data's
       values)
file /tmp/St00015.00000f saved
file ./output/tables/characteristics_diff_strata2021.csv saved

Iteration 0:   log likelihood = -1110.5822  
Iteration 1:   log likelihood =  -1109.044  
Iteration 2:   log likelihood = -1109.0439  

Logistic regression                             Number of obs     =      1,630
                                                LR chi2(5)        =       3.08
                                                Prob > chi2       =     0.6882
Log likelihood = -1109.0439                     Pseudo R2         =     0.0014

------------------------------------------------------------------------------
fewer~s_2021 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     age_cat |
18 - 40 y..  |   1.013127    .123621     0.11   0.915     .7976294    1.286847
61 - 80 y..  |   1.221008    .165508     1.47   0.141     .9361333    1.592572
  >80 years  |   1.112307   .2387336     0.50   0.620     .7303515    1.694016
             |
        male |   1.053593   .1058084     0.52   0.603     .8653457    1.282791
urban_rura~n |   1.023338   .1029522     0.23   0.819     .8402031    1.246389
       _cons |   .6648642   .0758706    -3.58   0.000     .5316166    .8315098
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/urban_rural_bin_diff_rheum_2021.dta not found)
file ./output/tempdata/urban_rural_bin_diff_rheum_2021.dta saved

Iteration 0:   log likelihood = -1110.5822  
Iteration 1:   log likelihood = -1103.0612  
Iteration 2:   log likelihood =  -1103.059  
Iteration 3:   log likelihood =  -1103.059  

Logistic regression                             Number of obs     =      1,630
                                                LR chi2(9)        =      15.05
                                                Prob > chi2       =     0.0897
Log likelihood =  -1103.059                     Pseudo R2         =     0.0068

------------------------------------------------------------------------------
fewer~s_2021 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     age_cat |
18 - 40 y..  |    1.00549   .1234068     0.04   0.964     .7905095    1.278934
61 - 80 y..  |   1.204465   .1642659     1.36   0.173     .9219488    1.573555
  >80 years  |   1.113103   .2395841     0.50   0.619     .7300001    1.697258
             |
        male |   1.050481   .1061704     0.49   0.626     .8617048    1.280612
             |
         imd |
          1  |   1.474776   .3816861     1.50   0.133     .8880282    2.449205
          2  |   .9601401   .2491201    -0.16   0.875     .5774042    1.596575
          3  |   1.418708   .3672797     1.35   0.177     .8541443    2.356431
          4  |   1.287734    .335475     0.97   0.332     .7728138    2.145742
          5  |   1.025985   .2676131     0.10   0.922     .6153437    1.710663
             |
       _cons |   .5624465   .1406369    -2.30   0.021     .3445423    .9181632
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/i.imd_diff_rheum_2021 not found)
file ./output/tempdata/i.imd_diff_rheum_2021 saved

Iteration 0:   log likelihood = -1110.5822  
Iteration 1:   log likelihood = -1105.7826  
Iteration 2:   log likelihood =  -1105.781  
Iteration 3:   log likelihood =  -1105.781  

Logistic regression                             Number of obs     =      1,630
                                                LR chi2(11)       =       9.60
                                                Prob > chi2       =     0.5665
Log likelihood =  -1105.781                     Pseudo R2         =     0.0043

------------------------------------------------------------------------------
fewer~s_2021 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     age_cat |
18 - 40 y..  |   1.016468   .1244742     0.13   0.894     .7995719      1.2922
61 - 80 y..  |   1.236611   .1682634     1.56   0.119     .9471347    1.614562
  >80 years  |   1.123401   .2416465     0.54   0.589     .7369517      1.7125
             |
        male |   1.054591   .1062914     0.53   0.598     .8655504     1.28492
             |
    region_n |
          2  |   1.561031   .3517199     1.98   0.048     1.003749    2.427716
          3  |   1.542185    .304394     2.19   0.028     1.047437    2.270624
          4  |   1.327459   .2967824     1.27   0.205     .8564783    2.057433
          5  |   1.258101   .2964968     0.97   0.330     .7927073    1.996725
          6  |   1.281814   .2525703     1.26   0.208     .8711704    1.886022
          8  |    1.34181   .3056732     1.29   0.197      .858582    2.097009
          9  |   1.202845   .2655504     0.84   0.403      .780353    1.854079
             |
       _cons |    .505951   .0945008    -3.65   0.000     .3508506    .7296166
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/i.region_n_diff_rheum_2021 not found)
file ./output/tempdata/i.region_n_diff_rheum_2021 saved

Iteration 0:   log likelihood = -1110.5822  
Iteration 1:   log likelihood = -1107.7699  
Iteration 2:   log likelihood = -1107.7696  
Iteration 3:   log likelihood = -1107.7696  

Logistic regression                             Number of obs     =      1,630
                                                LR chi2(8)        =       5.63
                                                Prob > chi2       =     0.6891
Log likelihood = -1107.7696                     Pseudo R2         =     0.0025

------------------------------------------------------------------------------
fewer~s_2021 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     age_cat |
18 - 40 y..  |   1.011805   .1237028     0.10   0.924     .7962128    1.285773
61 - 80 y..  |   1.213729   .1647528     1.43   0.154     .9302053     1.58367
  >80 years  |    1.11955    .240176     0.53   0.599     .7352518    1.704712
             |
        male |   1.050839   .1056025     0.49   0.622     .8629702    1.279606
             |
        eth5 |
South Asian  |    .870888   .1390235    -0.87   0.386     .6369149    1.190812
      Black  |   .9011028   .1461637    -0.64   0.521     .6556995    1.238351
      Mixed  |   .9615866   .1550296    -0.24   0.808     .7010603    1.318929
      Other  |   .7903334   .1280698    -1.45   0.146     .5752771    1.085784
             |
       _cons |   .7495066   .1117893    -1.93   0.053     .5595234    1.003997
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/i.eth5_diff_rheum_2021 not found)
file ./output/tempdata/i.eth5_diff_rheum_2021 saved

Iteration 0:   log likelihood = -1110.5822  
Iteration 1:   log likelihood = -1097.9421  
Iteration 2:   log likelihood = -1097.9338  
Iteration 3:   log likelihood = -1097.9338  

Logistic regression                             Number of obs     =      1,630
                                                LR chi2(21)       =      25.30
                                                Prob > chi2       =     0.2345
Log likelihood = -1097.9338                     Pseudo R2         =     0.0114

------------------------------------------------------------------------------
fewer~s_2021 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     age_cat |
18 - 40 y..  |   1.006869   .1243287     0.06   0.956     .7904352    1.282566
61 - 80 y..  |   1.213481   .1664461     1.41   0.158     .9274251    1.587769
  >80 years  |   1.119303   .2426399     0.52   0.603     .7318565    1.711863
             |
        male |   1.043773    .106182     0.42   0.674      .855095    1.274084
urban_rura~n |   1.047123   .1066258     0.45   0.651     .8576735    1.278419
             |
         imd |
          1  |   1.463006   .3814962     1.46   0.145     .8775765    2.438973
          2  |   .9323534   .2436439    -0.27   0.789     .5586545    1.556029
          3  |   1.403926    .365866     1.30   0.193     .8424022    2.339748
          4  |   1.265583   .3318317     0.90   0.369     .7570218    2.115791
          5  |   1.004661   .2637511     0.02   0.986      .600559    1.680673
             |
    region_n |
          2  |   1.618889    .367177     2.12   0.034     1.037905    2.525087
          3  |   1.575552   .3129509     2.29   0.022     1.067479    2.325447
          4  |   1.341562   .3017867     1.31   0.191     .8632402    2.084923
          5  |   1.268951   .3008079     1.00   0.315     .7973799    2.019408
          6  |   1.293748   .2566738     1.30   0.194     .8769504    1.908641
          8  |   1.383646   .3175979     1.41   0.157     .8823534    2.169737
          9  |   1.208152   .2685273     0.85   0.395     .7815039    1.867721
             |
        eth5 |
South Asian  |   .8648168   .1394295    -0.90   0.368     .6305067    1.186202
      Black  |   .9020099   .1478595    -0.63   0.529     .6541546    1.243776
      Mixed  |   .9662874   .1573608    -0.21   0.833     .7022429    1.329613
      Other  |   .7807095   .1276778    -1.51   0.130     .5666089    1.075711
             |
       _cons |   .4643203    .148902    -2.39   0.017     .2476552    .8705385
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/multi_diff_rheum_2021.dta not found)
file ./output/tempdata/multi_diff_rheum_2021.dta saved

. * Put together 2020 and 2021 logistic regression results
. preserve 

. use "./output/tempdata/urban_rural_bin_diff_rheum_2020", clear 

. append using "./output/tempdata/i.imd_diff_rheum_2020"

. append using "./output/tempdata/i.region_n_diff_rheum_2020"

. append using "./output/tempdata/i.eth5_diff_rheum_2020"

. append using "./output/tempdata/multi_diff_rheum_2020"

. append using "./output/tempdata/urban_rural_bin_diff_rheum_2021"

. append using "./output/tempdata/i.imd_diff_rheum_2021"

. append using "./output/tempdata/i.region_n_diff_rheum_2021"

. append using "./output/tempdata/i.eth5_diff_rheum_2021"

. append using "./output/tempdata/multi_diff_rheum_2021"

. drop stderr z 

. export delimited using ./output/tables/logistic_diff_results.csv 
file ./output/tables/logistic_diff_results.csv saved

. restore

. 
. 
. * Tabulate characteristics by categories of differences in all outpatient app
> ointments for each year
. * When stratified there are small numbers with missing region therefore tabul
> ate only those without region missing
. drop if region=="missing"
(0 observations deleted)

. tempfile tempfile

. forvalues i=2020/2021 {
  2.     preserve
  3.     keep if fewer_appts_all_`i'==0
  4.     table1_mc, vars(age_cat cate \ male cate \ urban_rural_bin cate \ regi
> on cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat cate \ eth5 cate)
>  clear
  5.     save `tempfile', replace
  6.     restore
  7.     preserve
  8.     keep if fewer_appts_all_`i'==1
  9.     table1_mc, vars(age_cat cate \ male cate \ urban_rural_bin cate \ regi
> on cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat cate \ eth5 cate)
>  clear
 10.     append using `tempfile'
 11.     save `tempfile', replace
 12.     restore 
 13.     * No appointments 
.     preserve
 14.     keep if no_appts_all_`i' ==1
 15.     table1_mc, vars(age_cat cate \ male cate \ urban_rural_bin cate \ regi
> on cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat cate \ eth5 cate)
>  clear
 16.     append using `tempfile'
 17.     save `tempfile', replace
 18.     export delimited using ./output/tables/characteristics_diff_all_strata
> `i'.csv    
 19.     restore
 20.     * Logistic regression 
.     foreach var in urban_rural_bin i.imd i.region_n i.eth5 {
 21.         logit fewer_appts_all_`i' ib1.age_cat male `var', or 
 22.         est sto m2
 23.         parmest, label eform format(estimate p min95 max95) saving("./outp
> ut/tempdata/`var'_diff_all_`i'", replace) idstr("`var'_all_`i'")
 24.         }
 25.     logit fewer_appts_all_`i' ib1.age_cat male urban_rural_bin i.imd i.reg
> ion_n i.eth5, or 
 26.     est sto m2
 27.     parmest, label eform format(estimate p min95 max95) saving("./output/t
> empdata/multi_diff_all_`i'", replace) idstr("multi_all_`i'")
 28.     }
(3,109 observations deleted)

  +-----------------------------+
  | factor          N_1     m_1 |
  |-----------------------------|
  | age_cat       1,481     410 |
  |-----------------------------|
  | male          1,891       0 |
  |-----------------------------|
  | Rural-Urban   1,891       0 |
  |-----------------------------|
  | region        1,891       0 |
  |-----------------------------|
  | imd           1,891       0 |
  |-----------------------------|
  | smoking       1,891       0 |
  |-----------------------------|
  | time_ra         816   1,075 |
  |-----------------------------|
  | bmi_cat       1,891       0 |
  |-----------------------------|
  | eth5          1,891       0 |
  +-----------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +-------------------------------------------------------------+
  |                                          Total              |
  |-------------------------------------------------------------|
  |                                          N=1,891            |
  |-------------------------------------------------------------|
  | age_cat       18 - 40 years              554 (37.4%)        |
  |               41 - 60 years              477 (32.2%)        |
  |               61 - 80 years              354 (23.9%)        |
  |               >80 years                  96 ( 6.5%)         |
  |-------------------------------------------------------------|
  | male          Female                     960 (50.8%)        |
  |               Male                       931 (49.2%)        |
  |-------------------------------------------------------------|
  | Rural-Urban   Rural                      956 (50.6%)        |
  |               Urban                      935 (49.4%)        |
  |-------------------------------------------------------------|
  | region        East Midlands              183 ( 9.7%)        |
  |               East of England            192 (10.2%)        |
  |               London                     364 (19.2%)        |
  |               North East                 214 (11.3%)        |
  |               North West                 184 ( 9.7%)        |
  |               South East                 381 (20.1%)        |
  |               West Midlands              161 ( 8.5%)        |
  |               Yorkshire and the Humber   212 (11.2%)        |
  |-------------------------------------------------------------|
  | imd           0                          85 ( 4.5%)         |
  |               1                          377 (19.9%)        |
  |               2                          368 (19.5%)        |
  |               3                          360 (19.0%)        |
  |               4                          363 (19.2%)        |
  |               5                          338 (17.9%)        |
  |-------------------------------------------------------------|
  | smoking       Never smoked               168 ( 8.9%)        |
  |               Current smoker             385 (20.4%)        |
  |               Ex-smoker                  286 (15.1%)        |
  |               Unknown                    1,052 (55.6%)      |
  |-------------------------------------------------------------|
  | time_ra                                  55.46774 (31.7708) |
  |-------------------------------------------------------------|
  | bmi_cat       Missing                    367 (19.4%)        |
  |               Underweight                184 ( 9.7%)        |
  |               Healthy range              358 (18.9%)        |
  |               Overweight                 375 (19.8%)        |
  |               Obese                      505 (26.7%)        |
  |               Morbidly obese             102 ( 5.4%)        |
  |-------------------------------------------------------------|
  | eth5          White                      360 (19.0%)        |
  |               South Asian                395 (20.9%)        |
  |               Black                      378 (20.0%)        |
  |               Mixed                      385 (20.4%)        |
  |               Other                      373 (19.7%)        |
  +-------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
(note: file /tmp/St00015.00000n not found)
file /tmp/St00015.00000n saved
(3,552 observations deleted)

  +---------------------------+
  | factor          N_1   m_1 |
  |---------------------------|
  | age_cat       1,149   299 |
  |---------------------------|
  | male          1,448     0 |
  |---------------------------|
  | Rural-Urban   1,448     0 |
  |---------------------------|
  | region        1,448     0 |
  |---------------------------|
  | imd           1,448     0 |
  |---------------------------|
  | smoking       1,448     0 |
  |---------------------------|
  | time_ra         646   802 |
  |---------------------------|
  | bmi_cat       1,448     0 |
  |---------------------------|
  | eth5          1,448     0 |
  +---------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------------------+
  |                                          Total               |
  |--------------------------------------------------------------|
  |                                          N=1,448             |
  |--------------------------------------------------------------|
  | age_cat       18 - 40 years              437 (38.0%)         |
  |               41 - 60 years              347 (30.2%)         |
  |               61 - 80 years              282 (24.5%)         |
  |               >80 years                  83 ( 7.2%)          |
  |--------------------------------------------------------------|
  | male          Female                     713 (49.2%)         |
  |               Male                       735 (50.8%)         |
  |--------------------------------------------------------------|
  | Rural-Urban   Rural                      743 (51.3%)         |
  |               Urban                      705 (48.7%)         |
  |--------------------------------------------------------------|
  | region        East Midlands              153 (10.6%)         |
  |               East of England            135 ( 9.3%)         |
  |               London                     279 (19.3%)         |
  |               North East                 144 ( 9.9%)         |
  |               North West                 144 ( 9.9%)         |
  |               South East                 295 (20.4%)         |
  |               West Midlands              147 (10.2%)         |
  |               Yorkshire and the Humber   151 (10.4%)         |
  |--------------------------------------------------------------|
  | imd           0                          70 ( 4.8%)          |
  |               1                          287 (19.8%)         |
  |               2                          281 (19.4%)         |
  |               3                          282 (19.5%)         |
  |               4                          266 (18.4%)         |
  |               5                          262 (18.1%)         |
  |--------------------------------------------------------------|
  | smoking       Never smoked               132 ( 9.1%)         |
  |               Current smoker             280 (19.3%)         |
  |               Ex-smoker                  219 (15.1%)         |
  |               Unknown                    817 (56.4%)         |
  |--------------------------------------------------------------|
  | time_ra                                  56.48791 (32.38467) |
  |--------------------------------------------------------------|
  | bmi_cat       Missing                    289 (20.0%)         |
  |               Underweight                136 ( 9.4%)         |
  |               Healthy range              270 (18.6%)         |
  |               Overweight                 297 (20.5%)         |
  |               Obese                      387 (26.7%)         |
  |               Morbidly obese             69 ( 4.8%)          |
  |--------------------------------------------------------------|
  | eth5          White                      267 (18.4%)         |
  |               South Asian                303 (20.9%)         |
  |               Black                      293 (20.2%)         |
  |               Mixed                      296 (20.4%)         |
  |               Other                      289 (20.0%)         |
  +--------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.00000n saved
(4,972 observations deleted)

  +-------------------------+
  | factor        N_1   m_1 |
  |-------------------------|
  | age_cat        22     6 |
  |-------------------------|
  | male           28     0 |
  |-------------------------|
  | Rural-Urban    28     0 |
  |-------------------------|
  | region         28     0 |
  |-------------------------|
  | imd            28     0 |
  |-------------------------|
  | smoking        28     0 |
  |-------------------------|
  | time_ra        13    15 |
  |-------------------------|
  | bmi_cat        28     0 |
  |-------------------------|
  | eth5           28     0 |
  +-------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------------------+
  |                                          Total               |
  |--------------------------------------------------------------|
  |                                          N=28                |
  |--------------------------------------------------------------|
  | age_cat       18 - 40 years              10 (45%)            |
  |               41 - 60 years              5 (23%)             |
  |               61 - 80 years              7 (32%)             |
  |--------------------------------------------------------------|
  | male          Female                     16 (57%)            |
  |               Male                       12 (43%)            |
  |--------------------------------------------------------------|
  | Rural-Urban   Rural                      13 (46%)            |
  |               Urban                      15 (54%)            |
  |--------------------------------------------------------------|
  | region        East Midlands              1 ( 4%)             |
  |               East of England            2 ( 7%)             |
  |               London                     5 (18%)             |
  |               North East                 1 ( 4%)             |
  |               North West                 2 ( 7%)             |
  |               South East                 7 (25%)             |
  |               West Midlands              4 (14%)             |
  |               Yorkshire and the Humber   6 (21%)             |
  |--------------------------------------------------------------|
  | imd           1                          9 (32%)             |
  |               2                          8 (29%)             |
  |               3                          5 (18%)             |
  |               4                          2 ( 7%)             |
  |               5                          4 (14%)             |
  |--------------------------------------------------------------|
  | smoking       Never smoked               2 ( 7%)             |
  |               Current smoker             7 (25%)             |
  |               Ex-smoker                  7 (25%)             |
  |               Unknown                    12 (43%)            |
  |--------------------------------------------------------------|
  | time_ra                                  62.70942 (28.62689) |
  |--------------------------------------------------------------|
  | bmi_cat       Missing                    4 (14%)             |
  |               Underweight                2 ( 7%)             |
  |               Healthy range              6 (21%)             |
  |               Overweight                 6 (21%)             |
  |               Obese                      7 (25%)             |
  |               Morbidly obese             3 (11%)             |
  |--------------------------------------------------------------|
  | eth5          White                      3 (11%)             |
  |               South Asian                3 (11%)             |
  |               Black                      6 (21%)             |
  |               Mixed                      9 (32%)             |
  |               Other                      7 (25%)             |
  +--------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.00000n saved
file ./output/tables/characteristics_diff_all_strata2020.csv saved

Iteration 0:   log likelihood = -1801.9659  
Iteration 1:   log likelihood = -1801.0064  
Iteration 2:   log likelihood = -1801.0064  

Logistic regression                             Number of obs     =      2,630
                                                LR chi2(5)        =       1.92
                                                Prob > chi2       =     0.8602
Log likelihood = -1801.0064                     Pseudo R2         =     0.0005

------------------------------------------------------------------------------
fewer~l_2020 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     age_cat |
18 - 40 y..  |   1.082702    .103165     0.83   0.404     .8982609    1.305015
61 - 80 y..  |    1.09241   .1164668     0.83   0.407     .8864112    1.346282
  >80 years  |   1.188666   .1969692     1.04   0.297      .859034    1.644785
             |
        male |   .9878838   .0777805    -0.15   0.877      .846617    1.152722
urban_rura~n |   .9541173   .0751682    -0.60   0.551     .8176013    1.113428
       _cons |   .7498825   .0676974    -3.19   0.001     .6282739    .8950297
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/urban_rural_bin_diff_all_2020.dta not found)
file ./output/tempdata/urban_rural_bin_diff_all_2020.dta saved

Iteration 0:   log likelihood = -1801.9659  
Iteration 1:   log likelihood = -1800.0767  
Iteration 2:   log likelihood = -1800.0767  

Logistic regression                             Number of obs     =      2,630
                                                LR chi2(9)        =       3.78
                                                Prob > chi2       =     0.9254
Log likelihood = -1800.0767                     Pseudo R2         =     0.0010

------------------------------------------------------------------------------
fewer~l_2020 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     age_cat |
18 - 40 y..  |   1.085031   .1036351     0.85   0.393     .8997893    1.308408
61 - 80 y..  |   1.096508   .1171402     0.86   0.388     .8893604    1.351904
  >80 years  |   1.186804   .1969797     1.03   0.302     .8572369    1.643074
             |
        male |   .9834134   .0776254    -0.21   0.832     .8424551    1.147957
             |
         imd |
          1  |   .8111683   .1613913    -1.05   0.293     .5492304    1.198029
          2  |   .9045008   .1799248    -0.50   0.614     .6124724    1.335769
          3  |   .8963818   .1788767    -0.55   0.584     .6062227    1.325421
          4  |   .8043568   .1612555    -1.09   0.277     .5430026    1.191504
          5  |   .8658652   .1733799    -0.72   0.472     .5847989    1.282018
             |
       _cons |   .8504912   .1636151    -0.84   0.400     .5833351        1.24
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/i.imd_diff_all_2020 not found)
file ./output/tempdata/i.imd_diff_all_2020 saved

Iteration 0:   log likelihood = -1801.9659  
Iteration 1:   log likelihood = -1797.9284  
Iteration 2:   log likelihood =  -1797.928  
Iteration 3:   log likelihood =  -1797.928  

Logistic regression                             Number of obs     =      2,630
                                                LR chi2(11)       =       8.08
                                                Prob > chi2       =     0.7065
Log likelihood =  -1797.928                     Pseudo R2         =     0.0022

------------------------------------------------------------------------------
fewer~l_2020 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     age_cat |
18 - 40 y..  |    1.09083   .1042064     0.91   0.363     .9045698    1.315442
61 - 80 y..  |   1.100051   .1175072     0.89   0.372     .8922525    1.356245
  >80 years  |   1.182647   .1964065     1.01   0.312     .8540689    1.637636
             |
        male |   .9846618    .077615    -0.20   0.845     .8437076    1.149164
             |
    region_n |
          2  |   .8508072   .1491746    -0.92   0.357     .6033751    1.199706
          3  |   .9388023   .1422278    -0.42   0.677     .6976182     1.26337
          4  |   .7670948   .1324813    -1.54   0.125     .5468171    1.076108
          5  |   .8858617   .1571167    -0.68   0.494     .6257438    1.254109
          6  |   .8883643   .1341803    -0.78   0.433     .6607299    1.194423
          8  |   1.129908   .1989735     0.69   0.488     .8001092    1.595649
          9  |   .8359299   .1430232    -1.05   0.295     .5977695    1.168977
             |
       _cons |   .8070731   .1143747    -1.51   0.130     .6113424     1.06547
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/i.region_n_diff_all_2020 not found)
file ./output/tempdata/i.region_n_diff_all_2020 saved

Iteration 0:   log likelihood = -1801.9659  
Iteration 1:   log likelihood = -1800.9289  
Iteration 2:   log likelihood = -1800.9289  

Logistic regression                             Number of obs     =      2,630
                                                LR chi2(8)        =       2.07
                                                Prob > chi2       =     0.9787
Log likelihood = -1800.9289                     Pseudo R2         =     0.0006

------------------------------------------------------------------------------
fewer~l_2020 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     age_cat |
18 - 40 y..  |   1.083032   .1032035     0.84   0.403     .8985232     1.30543
61 - 80 y..  |   1.096109   .1168849     0.86   0.389     .8893749    1.350898
  >80 years  |   1.186508    .196707     1.03   0.302     .8573399    1.642058
             |
        male |   .9848408   .0775765    -0.19   0.846     .8439493    1.149253
             |
        eth5 |
South Asian  |   1.057612   .1324321     0.45   0.655     .8274475    1.351799
      Black  |   1.007083   .1266336     0.06   0.955      .787105     1.28854
      Mixed  |   1.074001   .1353469     0.57   0.571     .8389488     1.37491
      Other  |   1.051958   .1325562     0.40   0.688      .821749    1.346658
             |
       _cons |   .7063944   .0806857    -3.04   0.002     .5647047    .8836353
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/i.eth5_diff_all_2020 not found)
file ./output/tempdata/i.eth5_diff_all_2020 saved

Iteration 0:   log likelihood = -1801.9659  
Iteration 1:   log likelihood = -1796.5002  
Iteration 2:   log likelihood = -1796.4996  
Iteration 3:   log likelihood = -1796.4996  

Logistic regression                             Number of obs     =      2,630
                                                LR chi2(21)       =      10.93
                                                Prob > chi2       =     0.9641
Log likelihood = -1796.4996                     Pseudo R2         =     0.0030

------------------------------------------------------------------------------
fewer~l_2020 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     age_cat |
18 - 40 y..  |   1.089425   .1044371     0.89   0.372     .9028124    1.314611
61 - 80 y..  |   1.101719   .1181471     0.90   0.366     .8928712    1.359417
  >80 years  |   1.181635   .1966683     1.00   0.316     .8527303    1.637402
             |
        male |   .9824382   .0778347    -0.22   0.823     .8411392    1.147473
urban_rura~n |   .9572227   .0757881    -0.55   0.581     .8196324     1.11791
             |
         imd |
          1  |   .8140483   .1623717    -1.03   0.302     .5506401    1.203462
          2  |   .9032376   .1802847    -0.51   0.610     .6108065    1.335674
          3  |   .8912232   .1783412    -0.58   0.565     .6020797    1.319225
          4  |    .808927   .1626296    -1.05   0.292     .5454824    1.199604
          5  |   .8695428   .1745538    -0.70   0.486     .5867039    1.288733
             |
    region_n |
          2  |   .8517087   .1495424    -0.91   0.361      .603723    1.201557
          3  |   .9375411   .1422656    -0.43   0.671     .6963478    1.262276
          4  |   .7723095   .1336358    -1.49   0.135     .5501797    1.084122
          5  |   .8883034   .1577604    -0.67   0.505      .627177     1.25815
          6  |   .8884045   .1344426    -0.78   0.434     .6603863    1.195153
          8  |   1.126169   .1987494     0.67   0.501     .7968586    1.591571
          9  |   .8350126    .143213    -1.05   0.293     .5966278    1.168645
             |
        eth5 |
South Asian  |   1.055363   .1325094     0.43   0.668     .8251379    1.349824
      Black  |   .9954737   .1256521    -0.04   0.971     .7772991    1.274886
      Mixed  |   1.073132   .1357284     0.56   0.577     .8375182     1.37503
      Other  |   1.057114     .13365     0.44   0.660      .825097    1.354373
             |
       _cons |   .9228434   .2214012    -0.33   0.738      .576653    1.476867
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/multi_diff_all_2020.dta not found)
file ./output/tempdata/multi_diff_all_2020.dta saved
(3,831 observations deleted)

  +---------------------------+
  | factor          N_1   m_1 |
  |---------------------------|
  | age_cat         920   249 |
  |---------------------------|
  | male          1,169     0 |
  |---------------------------|
  | Rural-Urban   1,169     0 |
  |---------------------------|
  | region        1,169     0 |
  |---------------------------|
  | imd           1,169     0 |
  |---------------------------|
  | smoking       1,169     0 |
  |---------------------------|
  | time_ra         509   660 |
  |---------------------------|
  | bmi_cat       1,169     0 |
  |---------------------------|
  | eth5          1,169     0 |
  +---------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------------------+
  |                                          Total               |
  |--------------------------------------------------------------|
  |                                          N=1,169             |
  |--------------------------------------------------------------|
  | age_cat       18 - 40 years              362 (39.3%)         |
  |               41 - 60 years              282 (30.7%)         |
  |               61 - 80 years              213 (23.2%)         |
  |               >80 years                  63 ( 6.8%)          |
  |--------------------------------------------------------------|
  | male          Female                     583 (49.9%)         |
  |               Male                       586 (50.1%)         |
  |--------------------------------------------------------------|
  | Rural-Urban   Rural                      594 (50.8%)         |
  |               Urban                      575 (49.2%)         |
  |--------------------------------------------------------------|
  | region        East Midlands              120 (10.3%)         |
  |               East of England            114 ( 9.8%)         |
  |               London                     221 (18.9%)         |
  |               North East                 129 (11.0%)         |
  |               North West                 111 ( 9.5%)         |
  |               South East                 245 (21.0%)         |
  |               West Midlands              109 ( 9.3%)         |
  |               Yorkshire and the Humber   120 (10.3%)         |
  |--------------------------------------------------------------|
  | imd           0                          54 ( 4.6%)          |
  |               1                          229 (19.6%)         |
  |               2                          229 (19.6%)         |
  |               3                          236 (20.2%)         |
  |               4                          213 (18.2%)         |
  |               5                          208 (17.8%)         |
  |--------------------------------------------------------------|
  | smoking       Never smoked               103 ( 8.8%)         |
  |               Current smoker             249 (21.3%)         |
  |               Ex-smoker                  197 (16.9%)         |
  |               Unknown                    620 (53.0%)         |
  |--------------------------------------------------------------|
  | time_ra                                  54.38248 (31.68502) |
  |--------------------------------------------------------------|
  | bmi_cat       Missing                    219 (18.7%)         |
  |               Underweight                118 (10.1%)         |
  |               Healthy range              219 (18.7%)         |
  |               Overweight                 212 (18.1%)         |
  |               Obese                      337 (28.8%)         |
  |               Morbidly obese             64 ( 5.5%)          |
  |--------------------------------------------------------------|
  | eth5          White                      203 (17.4%)         |
  |               South Asian                261 (22.3%)         |
  |               Black                      226 (19.3%)         |
  |               Mixed                      261 (22.3%)         |
  |               Other                      218 (18.6%)         |
  +--------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.00000n saved
(4,098 observations deleted)

  +-------------------------+
  | factor        N_1   m_1 |
  |-------------------------|
  | age_cat       712   190 |
  |-------------------------|
  | male          902     0 |
  |-------------------------|
  | Rural-Urban   902     0 |
  |-------------------------|
  | region        902     0 |
  |-------------------------|
  | imd           902     0 |
  |-------------------------|
  | smoking       902     0 |
  |-------------------------|
  | time_ra       400   502 |
  |-------------------------|
  | bmi_cat       902     0 |
  |-------------------------|
  | eth5          902     0 |
  +-------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------------------+
  |                                          Total               |
  |--------------------------------------------------------------|
  |                                          N=902               |
  |--------------------------------------------------------------|
  | age_cat       18 - 40 years              264 (37.1%)         |
  |               41 - 60 years              222 (31.2%)         |
  |               61 - 80 years              182 (25.6%)         |
  |               >80 years                  44 ( 6.2%)          |
  |--------------------------------------------------------------|
  | male          Female                     460 (51.0%)         |
  |               Male                       442 (49.0%)         |
  |--------------------------------------------------------------|
  | Rural-Urban   Rural                      450 (49.9%)         |
  |               Urban                      452 (50.1%)         |
  |--------------------------------------------------------------|
  | region        East Midlands              89 ( 9.9%)          |
  |               East of England            88 ( 9.8%)          |
  |               London                     178 (19.7%)         |
  |               North East                 87 ( 9.6%)          |
  |               North West                 82 ( 9.1%)          |
  |               South East                 184 (20.4%)         |
  |               West Midlands              84 ( 9.3%)          |
  |               Yorkshire and the Humber   110 (12.2%)         |
  |--------------------------------------------------------------|
  | imd           0                          41 ( 4.5%)          |
  |               1                          172 (19.1%)         |
  |               2                          178 (19.7%)         |
  |               3                          167 (18.5%)         |
  |               4                          176 (19.5%)         |
  |               5                          168 (18.6%)         |
  |--------------------------------------------------------------|
  | smoking       Never smoked               85 ( 9.4%)          |
  |               Current smoker             172 (19.1%)         |
  |               Ex-smoker                  128 (14.2%)         |
  |               Unknown                    517 (57.3%)         |
  |--------------------------------------------------------------|
  | time_ra                                  56.05133 (31.92016) |
  |--------------------------------------------------------------|
  | bmi_cat       Missing                    193 (21.4%)         |
  |               Underweight                96 (10.6%)          |
  |               Healthy range              153 (17.0%)         |
  |               Overweight                 181 (20.1%)         |
  |               Obese                      232 (25.7%)         |
  |               Morbidly obese             47 ( 5.2%)          |
  |--------------------------------------------------------------|
  | eth5          White                      169 (18.7%)         |
  |               South Asian                184 (20.4%)         |
  |               Black                      177 (19.6%)         |
  |               Mixed                      166 (18.4%)         |
  |               Other                      206 (22.8%)         |
  +--------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.00000n saved
(4,978 observations deleted)

  +-------------------------+
  | factor        N_1   m_1 |
  |-------------------------|
  | age_cat        16     6 |
  |-------------------------|
  | male           22     0 |
  |-------------------------|
  | Rural-Urban    22     0 |
  |-------------------------|
  | region         22     0 |
  |-------------------------|
  | imd            22     0 |
  |-------------------------|
  | smoking        22     0 |
  |-------------------------|
  | time_ra        13     9 |
  |-------------------------|
  | bmi_cat        22     0 |
  |-------------------------|
  | eth5           22     0 |
  +-------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------------------+
  |                                          Total               |
  |--------------------------------------------------------------|
  |                                          N=22                |
  |--------------------------------------------------------------|
  | age_cat       18 - 40 years              8 (50%)             |
  |               41 - 60 years              2 (12%)             |
  |               61 - 80 years              5 (31%)             |
  |               >80 years                  1 ( 6%)             |
  |--------------------------------------------------------------|
  | male          Female                     10 (45%)            |
  |               Male                       12 (55%)            |
  |--------------------------------------------------------------|
  | Rural-Urban   Rural                      9 (41%)             |
  |               Urban                      13 (59%)            |
  |--------------------------------------------------------------|
  | region        East Midlands              2 ( 9%)             |
  |               East of England            1 ( 5%)             |
  |               London                     4 (18%)             |
  |               North East                 2 ( 9%)             |
  |               North West                 2 ( 9%)             |
  |               South East                 4 (18%)             |
  |               West Midlands              4 (18%)             |
  |               Yorkshire and the Humber   3 (14%)             |
  |--------------------------------------------------------------|
  | imd           0                          2 ( 9%)             |
  |               1                          5 (23%)             |
  |               2                          6 (27%)             |
  |               3                          3 (14%)             |
  |               4                          2 ( 9%)             |
  |               5                          4 (18%)             |
  |--------------------------------------------------------------|
  | smoking       Never smoked               2 ( 9%)             |
  |               Current smoker             5 (23%)             |
  |               Ex-smoker                  4 (18%)             |
  |               Unknown                    11 (50%)            |
  |--------------------------------------------------------------|
  | time_ra                                  49.69726 (39.03248) |
  |--------------------------------------------------------------|
  | bmi_cat       Missing                    2 ( 9%)             |
  |               Underweight                1 ( 5%)             |
  |               Healthy range              7 (32%)             |
  |               Overweight                 3 (14%)             |
  |               Obese                      7 (32%)             |
  |               Morbidly obese             2 ( 9%)             |
  |--------------------------------------------------------------|
  | eth5          White                      3 (14%)             |
  |               South Asian                4 (18%)             |
  |               Black                      6 (27%)             |
  |               Mixed                      6 (27%)             |
  |               Other                      3 (14%)             |
  +--------------------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00015.00000n saved
file ./output/tables/characteristics_diff_all_strata2021.csv saved

Iteration 0:   log likelihood = -1117.9252  
Iteration 1:   log likelihood = -1116.6903  
Iteration 2:   log likelihood = -1116.6903  

Logistic regression                             Number of obs     =      1,632
                                                LR chi2(5)        =       2.47
                                                Prob > chi2       =     0.7810
Log likelihood = -1116.6903                     Pseudo R2         =     0.0011

------------------------------------------------------------------------------
fewer~l_2021 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     age_cat |
18 - 40 y..  |   .9262481   .1119477    -0.63   0.526     .7308864    1.173829
61 - 80 y..  |   1.085767   .1466761     0.61   0.542     .8331978    1.414899
  >80 years  |   .8835253    .191128    -0.57   0.567      .578207    1.350065
             |
        male |   .9334105   .0932984    -0.69   0.491     .7673464    1.135413
urban_rura~n |    1.04608   .1047379     0.45   0.653     .8596845     1.27289
       _cons |   .7971024   .0900571    -2.01   0.045     .6387706    .9946799
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/urban_rural_bin_diff_all_2021.dta not found)
file ./output/tempdata/urban_rural_bin_diff_all_2021.dta saved

Iteration 0:   log likelihood = -1117.9252  
Iteration 1:   log likelihood = -1115.7055  
Iteration 2:   log likelihood = -1115.7054  
Iteration 3:   log likelihood = -1115.7054  

Logistic regression                             Number of obs     =      1,632
                                                LR chi2(9)        =       4.44
                                                Prob > chi2       =     0.8802
Log likelihood = -1115.7054                     Pseudo R2         =     0.0020

------------------------------------------------------------------------------
fewer~l_2021 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     age_cat |
18 - 40 y..  |    .931559    .112958    -0.58   0.559     .7345075    1.181475
61 - 80 y..  |   1.094375   .1483305     0.67   0.506      .839064    1.427372
  >80 years  |   .8866094   .1917628    -0.56   0.578     .5802668     1.35468
             |
        male |   .9373469   .0940443    -0.64   0.519     .7700147    1.141042
             |
         imd |
          1  |   .9499084   .2417132    -0.20   0.840     .5768799    1.564149
          2  |   .9455321   .2397007    -0.22   0.825     .5752931    1.554044
          3  |   .8575972   .2184385    -0.60   0.546     .5205637    1.412839
          4  |   1.016273   .2597795     0.06   0.950     .6157813    1.677237
          5  |   1.072518   .2734551     0.27   0.784     .6506952    1.767794
             |
       _cons |   .8381439   .2051941    -0.72   0.471     .5187137    1.354283
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/i.imd_diff_all_2021 not found)
file ./output/tempdata/i.imd_diff_all_2021 saved

Iteration 0:   log likelihood = -1117.9252  
Iteration 1:   log likelihood = -1116.1779  
Iteration 2:   log likelihood = -1116.1778  

Logistic regression                             Number of obs     =      1,632
                                                LR chi2(11)       =       3.49
                                                Prob > chi2       =     0.9824
Log likelihood = -1116.1778                     Pseudo R2         =     0.0016

------------------------------------------------------------------------------
fewer~l_2021 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     age_cat |
18 - 40 y..  |   .9249764   .1120455    -0.64   0.520     .7294939    1.172842
61 - 80 y..  |    1.08426   .1467733     0.60   0.550     .8315887    1.413703
  >80 years  |    .879976   .1905139    -0.59   0.555     .5756873    1.345102
             |
        male |    .936283   .0937852    -0.66   0.511      .769386    1.139384
             |
    region_n |
          2  |   .9955727   .2207307    -0.02   0.984     .6446903    1.537428
          3  |   .9725861    .188393    -0.14   0.886     .6653461    1.421702
          4  |   .8981944   .1975182    -0.49   0.625     .5836953    1.382148
          5  |   1.109586   .2547356     0.45   0.651     .7075291    1.740113
          6  |   .9846293   .1892462    -0.08   0.936     .6755717    1.435073
          8  |    1.07787   .2399613     0.34   0.736     .6967343    1.667498
          9  |   1.037103   .2242296     0.17   0.866     .6788683    1.584376
             |
       _cons |   .8143011   .1475685    -1.13   0.257     .5708597    1.161557
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/i.region_n_diff_all_2021 not found)
file ./output/tempdata/i.region_n_diff_all_2021 saved

Iteration 0:   log likelihood = -1117.9252  
Iteration 1:   log likelihood =  -1112.294  
Iteration 2:   log likelihood = -1112.2929  
Iteration 3:   log likelihood = -1112.2929  

Logistic regression                             Number of obs     =      1,632
                                                LR chi2(8)        =      11.26
                                                Prob > chi2       =     0.1872
Log likelihood = -1112.2929                     Pseudo R2         =     0.0050

------------------------------------------------------------------------------
fewer~l_2021 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     age_cat |
18 - 40 y..  |     .92847   .1126738    -0.61   0.541     .7319324    1.177782
61 - 80 y..  |   1.090798   .1478335     0.64   0.521     .8363399    1.422676
  >80 years  |   .8887273    .192561    -0.54   0.586     .5812169    1.358935
             |
        male |   .9404543   .0942739    -0.61   0.540     .7726997    1.144629
             |
        eth5 |
South Asian  |   .7471662   .1195772    -1.82   0.069     .5459967    1.022455
      Black  |   .9050973   .1463734    -0.62   0.538     .6592315    1.242661
      Mixed  |   .8519188   .1376251    -0.99   0.321     .6207103     1.16925
      Other  |   1.157113   .1846164     0.91   0.360     .8463832    1.581919
             |
       _cons |   .8797154   .1304041    -0.86   0.387     .6579075    1.176304
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/i.eth5_diff_all_2021 not found)
file ./output/tempdata/i.eth5_diff_all_2021 saved

Iteration 0:   log likelihood = -1117.9252  
Iteration 1:   log likelihood = -1110.4631  
Iteration 2:   log likelihood = -1110.4612  
Iteration 3:   log likelihood = -1110.4612  

Logistic regression                             Number of obs     =      1,632
                                                LR chi2(21)       =      14.93
                                                Prob > chi2       =     0.8265
Log likelihood = -1110.4612                     Pseudo R2         =     0.0067

------------------------------------------------------------------------------
fewer~l_2021 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     age_cat |
18 - 40 y..  |   .9329066   .1138846    -0.57   0.569     .7343916    1.185083
61 - 80 y..  |   1.100602        .15     0.70   0.482     .8425984    1.437605
  >80 years  |   .8732888   .1902244    -0.62   0.534     .5698291    1.338354
             |
        male |   .9430136   .0952327    -0.58   0.561     .7736724     1.14942
urban_rura~n |   1.048468   .1058732     0.47   0.639     .8602049    1.277935
             |
         imd |
          1  |    .916445    .235188    -0.34   0.734     .5541941    1.515483
          2  |   .9186834   .2348538    -0.33   0.740     .5566257    1.516242
          3  |   .8432327   .2164428    -0.66   0.507     .5098697    1.394555
          4  |   .9987494   .2573255    -0.00   0.996     .6027627    1.654881
          5  |    1.03922     .26696     0.15   0.881     .6281262    1.719367
             |
    region_n |
          2  |   .9907418   .2207526    -0.04   0.967     .6401764     1.53328
          3  |   .9721481   .1892736    -0.15   0.885     .6637533     1.42383
          4  |   .8838125   .1954021    -0.56   0.576     .5730177    1.363177
          5  |   1.104674   .2547721     0.43   0.666      .702944    1.735991
          6  |   .9809315   .1895403    -0.10   0.921     .6716847    1.432557
          8  |   1.093011   .2447066     0.40   0.691     .7047819    1.695095
          9  |   1.041687   .2265367     0.19   0.851     .6801832    1.595324
             |
        eth5 |
South Asian  |   .7491338   .1204956    -1.80   0.073     .5465709    1.026768
      Black  |   .9067903   .1475934    -0.60   0.548     .6591151    1.247534
      Mixed  |   .8428224    .136852    -1.05   0.292     .6130889     1.15864
      Other  |   1.157423   .1854189     0.91   0.361     .8455313    1.584362
             |
       _cons |   .9100332   .2852684    -0.30   0.764     .4923011    1.682223
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/tempdata/multi_diff_all_2021.dta not found)
file ./output/tempdata/multi_diff_all_2021.dta saved

. * Put together 2020 and 2021 logistic regression results
. use "./output/tempdata/urban_rural_bin_diff_all_2020", clear 

. append using "./output/tempdata/i.imd_diff_all_2020"

. append using "./output/tempdata/i.region_n_diff_all_2020"

. append using "./output/tempdata/i.eth5_diff_all_2020"

. append using "./output/tempdata/multi_diff_all_2020"

. append using "./output/tempdata/urban_rural_bin_diff_all_2021"

. append using "./output/tempdata/i.imd_diff_all_2021"

. append using "./output/tempdata/i.region_n_diff_all_2021"

. append using "./output/tempdata/i.eth5_diff_all_2021"

. append using "./output/tempdata/multi_diff_all_2021"

. drop stderr z 

. export delimited using ./output/tables/logistic_diff_all_results.csv
file ./output/tables/logistic_diff_all_results.csv saved

. 
.     
. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/outpatients.log
  log type:  text
 closed on:  27 Apr 2023, 16:17:54
-------------------------------------------------------------------------------
