
. 
. cap mkdir ./output/tables

. * Import data
. import delimited using ./output/input.csv
(44 vars, 10,000 obs)

. * Check data
. count if age==. 
  0

. count if age<18 
  2,144

. count if age>110 & age!=.
  0

. sum age, d

                             age
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            4              0
10%            8              0       Obs              10,000
25%           20              0       Sum of Wgt.      10,000

50%           39                      Mean            40.0565
                        Largest       Std. Dev.      23.74763
75%           59             98
90%           73             98       Variance       563.9497
95%           79             99       Skewness       .1411382
99%           89            107       Kurtosis       2.027736

. count if sex==""
  0

. tab sex

        sex |      Freq.     Percent        Cum.
------------+-----------------------------------
          F |      4,977       49.77       49.77
          M |      4,932       49.32       99.09
          U |         91        0.91      100.00
------------+-----------------------------------
      Total |     10,000      100.00

. sum household, d

                          household
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs              10,000
25%            2              0       Sum of Wgt.      10,000

50%            3                      Mean             2.5022
                        Largest       Std. Dev.      1.045708
75%            3              6
90%            4              6       Variance       1.093505
95%            4              6       Skewness       .0086009
99%            5              7       Kurtosis       2.907941

. tab care_home_type

care_home_t |
        ype |      Freq.     Percent        Cum.
------------+-----------------------------------
         PC |        476        4.82        4.82
         PN |        481        4.87        9.68
         PR |      8,475       85.74       95.43
         PS |        452        4.57      100.00
------------+-----------------------------------
      Total |      9,884      100.00

. * Checking RA algorithm variables
. * Checking type of DMARD that meets inclusion
. foreach dmard in metho leflu sulfa hydrox {
  2.     gen `dmard'_multi = (`dmard'_count>=2)
  3.     tab `dmard'_multi if has_dmards==1, m
  4. }

metho_multi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        807       16.14       16.14
          1 |      4,193       83.86      100.00
------------+-----------------------------------
      Total |      5,000      100.00

leflu_multi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        750       15.00       15.00
          1 |      4,250       85.00      100.00
------------+-----------------------------------
      Total |      5,000      100.00

sulfa_multi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        814       16.28       16.28
          1 |      4,186       83.72      100.00
------------+-----------------------------------
      Total |      5,000      100.00

hydrox_mult |
          i |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        838       16.76       16.76
          1 |      4,162       83.24      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. gen dmard_multi = (metho_multi==1 | leflu_multi==1 | sulfa_multi==1 | hydrox_
> multi==1)

. tab dmard_multi has_alt_dmard_diag

dmard_mult |  has_alt_dmard_diag
         i |         0          1 |     Total
-----------+----------------------+----------
         0 |         2          3 |         5 
         1 |     4,998      4,997 |     9,995 
-----------+----------------------+----------
     Total |     5,000      5,000 |    10,000 

. sum number_ra_codes

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
number_ra_~s |     10,000      2.5102    1.038847          0          6

. di "Number where no DMARDs but does have multiple RA codes and no alt diag"
Number where no DMARDs but does have multiple RA codes and no alt diag

. count if has_dmards==0 & number_ra_codes>=2 & alt_diag!=1
  2,095

. tab has_ra, m

     has_ra |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,000       50.00       50.00
          1 |      5,000       50.00      100.00
------------+-----------------------------------
      Total |     10,000      100.00

. * Time since first RA code
. gen first_ra_codeA = date(first_ra_code, "YMD")
(5,598 missing values generated)

. format first_ra_codeA %dD/N/CY

. gen time_ra = (date("01Mar2018", "DMY") - first_ra_codeA)/365.25
(5,598 missing values generated)

. sum time_ra, d

                           time_ra
-------------------------------------------------------------
      Percentiles      Smallest
 1%      .881588       .0082136
 5%     4.788501       .0301164
10%     10.04517       .0301164       Obs               4,402
25%     25.38261       .0465435       Sum of Wgt.       4,402

50%     52.92676                      Mean           53.69955
                        Largest       Std. Dev.      31.97833
75%     82.27515        108.835
90%     97.81519       108.9418       Variance       1022.614
95%     103.0993       108.9446       Skewness       .0228581
99%     107.9836       108.9911       Kurtosis       1.749037

. sum number_ra_codes, d

                       number_ra_codes
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs              10,000
25%            2              0       Sum of Wgt.      10,000

50%            2                      Mean             2.5102
                        Largest       Std. Dev.      1.038847
75%            3              6
90%            4              6       Variance       1.079204
95%            4              6       Skewness       .0771915
99%            5              6       Kurtosis       2.893814

. sum metho_count, d

                         metho_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs              10,000
25%            2              0       Sum of Wgt.      10,000

50%            2                      Mean             2.5057
                        Largest       Std. Dev.      1.048464
75%            3              6
90%            4              6       Variance       1.099277
95%            4              6       Skewness       .0739591
99%            5              7       Kurtosis        2.92355

. sum sulfa_count, d 

                         sulfa_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -1
 5%            1              0
10%            1              0       Obs              10,000
25%            2              0       Sum of Wgt.      10,000

50%            3                      Mean             2.5114
                        Largest       Std. Dev.       1.05479
75%            3              6
90%            4              7       Variance       1.112581
95%            4              7       Skewness       .0265067
99%            5              7       Kurtosis       2.970221

. sum leflu_count, d 

                         leflu_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs              10,000
25%            2              0       Sum of Wgt.      10,000

50%            3                      Mean             2.5136
                        Largest       Std. Dev.       1.03524
75%            3              6
90%            4              6       Variance       1.071722
95%            4              6       Skewness       .0093531
99%            5              7       Kurtosis       2.916202

. sum hydrox_count, d 

                        hydrox_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -1
 5%            1              0
10%            1              0       Obs              10,000
25%            2              0       Sum of Wgt.      10,000

50%            3                      Mean             2.5045
                        Largest       Std. Dev.      1.050757
75%            3              6
90%            4              6       Variance        1.10409
95%            4              6       Skewness       .0139843
99%            5              6       Kurtosis       2.818801

. 
. sum outpatient*, d

                    outpatient_appt_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              10,000
25%            6              0       Sum of Wgt.      10,000

50%            7                      Mean             6.7483
                        Largest       Std. Dev.      2.951138
75%            9             14
90%           10             15       Variance       8.709218
95%           11             15       Skewness      -.8674318
99%           12             17       Kurtosis       3.482911

                    outpatient_appt_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%           .5              0       Obs              10,000
25%            6              0       Sum of Wgt.      10,000

50%            7                      Mean             6.7506
                        Largest       Std. Dev.      2.947892
75%            9             14
90%           10             14       Variance       8.690069
95%           11             15       Skewness      -.8690804
99%           12             15       Kurtosis        3.48927

                    outpatient_appt_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%           .5              0       Obs              10,000
25%            6              0       Sum of Wgt.      10,000

50%            7                      Mean             6.7757
                        Largest       Std. Dev.      2.960349
75%            9             14
90%           10             14       Variance       8.763666
95%           11             16       Skewness      -.8485605
99%           12             17       Kurtosis       3.519724

                   outpatient_medium_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               5,000
25%            2              1       Sum of Wgt.       5,000

50%            5                      Mean             13.493
                        Largest       Std. Dev.      28.17236
75%            7             98
90%            8             98       Variance       793.6819
95%           98             98       Skewness       2.644367
99%           98             98       Kurtosis       8.066002

                   outpatient_medium_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               5,000
25%            2              1       Sum of Wgt.       5,000

50%            5                      Mean             13.958
                        Largest       Std. Dev.      28.87944
75%            7             98
90%           98             98       Variance       834.0218
95%           98             98       Skewness       2.546502
99%           98             98       Kurtosis       7.549955

                   outpatient_medium_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               5,000
25%            2              1       Sum of Wgt.       5,000

50%            4                      Mean             13.025
                        Largest       Std. Dev.      27.62991
75%            7             98
90%            8             98       Variance       763.4119
95%           98             98       Skewness       2.727259
99%           98             98       Kurtosis        8.51658

. 
. keep if has_ra
(5,000 observations deleted)

. 
. * How many people are not on DMARDs and have no RA appointments?
. 
. 
. * Format variables
. *re-order ethnicity
.  gen eth5=1 if ethnicity==1
(3,982 missing values generated)

.  replace eth5=2 if ethnicity==3
(993 real changes made)

.  replace eth5=3 if ethnicity==4
(1,003 real changes made)

.  replace eth5=4 if ethnicity==2
(1,012 real changes made)

.  replace eth5=5 if ethnicity==5
(974 real changes made)

.  replace eth5=. if ethnicity==.
(0 real changes made)

. 
.  label define eth5                      1 "White"                            
>            ///
>                                                         2 "South Asian"      
>                    ///                                             
>                                                         3 "Black"            
>                            ///
>                                                         4 "Mixed"            
>                            ///
>                                                         5 "Other"            
>                            

.                                         
. 
. label values eth5 eth5

. safetab eth5, m
5

       eth5 |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |      1,018       20.36       20.36
South Asian |        993       19.86       40.22
      Black |      1,003       20.06       60.28
      Mixed |      1,012       20.24       80.52
      Other |        974       19.48      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. 
. * formatting gender
. gen male=(sex=="M")

. replace male = 0 if sex == "F"
(0 real changes made)

. label define male 0"Female" 1"Male"

. label values male male

. safetab male, miss
5

       male |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |      2,537       50.74       50.74
       Male |      2,463       49.26      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. 
. * Make region numeric
. generate region2=.
(5,000 missing values generated)

. replace region2=0 if region=="East"
(0 real changes made)

. replace region2=1 if region=="East Midlands"
(509 real changes made)

. replace region2=2 if region=="London"
(1,008 real changes made)

. replace region2=3 if region=="North East"
(516 real changes made)

. replace region2=4 if region=="North West"
(497 real changes made)

. replace region2=5 if region=="South East"
(1,025 real changes made)

. replace region2=6 if region=="South West"
(0 real changes made)

. replace region2=7 if region=="West Midlands"
(490 real changes made)

. replace region2=8 if region=="Yorkshire and The Humber"
(0 real changes made)

. drop region

. rename region2 region

. label var region "region of England"

. label define region 0 "East" 1 "East Midlands"  2 "London" 3 "North East" 4 "
> North West" 5 "South East" 6 "South West" 7 "West Midlands" 8 "Yorkshire and 
> The Humber"

. label values region region

. safetab region, miss
7

       region of England |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
           East Midlands |        509       10.18       10.18
                  London |      1,008       20.16       30.34
              North East |        516       10.32       40.66
              North West |        497        9.94       50.60
              South East |      1,025       20.50       71.10
           West Midlands |        490        9.80       80.90
                       . |        955       19.10      100.00
-------------------------+-----------------------------------
                   Total |      5,000      100.00

. 
. *create a 4 category rural urban variable 
. generate urban_rural_5=.
(5,000 missing values generated)

. la var urban_rural_5 "Rural Urban in five categories"

. replace urban_rural_5=1 if urban_rural==1
(566 real changes made)

. replace urban_rural_5=2 if urban_rural==2
(654 real changes made)

. replace urban_rural_5=3 if urban_rural==3|urban_rural==4
(1,232 real changes made)

. replace urban_rural_5=4 if urban_rural==5|urban_rural==6
(1,279 real changes made)

. replace urban_rural_5=5 if urban_rural==7|urban_rural==8
(1,269 real changes made)

. label define urban_rural_5 1 "Urban major conurbation" 2 "Urban minor conurba
> tion" 3 "Urban city and town" 4 "Rural town and fringe" 5 "Rural village and 
> dispersed"

. label values urban_rural_5 urban_rural_5

. safetab urban_rural_5, miss
14

        Rural Urban in five |
                 categories |      Freq.     Percent        Cum.
----------------------------+-----------------------------------
    Urban major conurbation |        566       11.32       11.32
    Urban minor conurbation |        654       13.08       24.40
        Urban city and town |      1,232       24.64       49.04
      Rural town and fringe |      1,279       25.58       74.62
Rural village and dispersed |      1,269       25.38      100.00
----------------------------+-----------------------------------
                      Total |      5,000      100.00

. 
. *generate a binary rural urban (with missing assigned to urban)
. generate urban_rural_bin=.
(5,000 missing values generated)

. replace urban_rural_bin=1 if urban_rural<=4|urban_rural==.
(2,452 real changes made)

. replace urban_rural_bin=0 if urban_rural>4 & urban_rural!=.
(2,548 real changes made)

. label define urban_rural_bin 0 "Rural" 1 "Urban"

. label values urban_rural_bin urban_rural_bin

. safetab urban_rural_bin urban_rural, miss
28

urban_rura |                      urban_rural
     l_bin |         1          2          3          4          5 |     Total
-----------+-------------------------------------------------------+----------
     Rural |         0          0          0          0        642 |     2,548 
     Urban |       566        654        651        581          0 |     2,452 
-----------+-------------------------------------------------------+----------
     Total |       566        654        651        581        642 |     5,000 


urban_rura |           urban_rural
     l_bin |         6          7          8 |     Total
-----------+---------------------------------+----------
     Rural |       637        633        636 |     2,548 
     Urban |         0          0          0 |     2,452 
-----------+---------------------------------+----------
     Total |       637        633        636 |     5,000 

. label var urban_rural_bin "Rural-Urban"

. 
. * Define age categories
. * Create age categories
. egen age_cat = cut(age), at(18, 40, 60, 80, 120) icodes
(1099 missing values generated)

. label define age 0 "18 - 40 years" 1 "41 - 60 years" 2 "61 - 80 years" 3 ">80
>  years"

. label values age_cat age

. safetab age_cat, miss
8

      age_cat |      Freq.     Percent        Cum.
--------------+-----------------------------------
18 - 40 years |      1,435       28.70       28.70
41 - 60 years |      1,233       24.66       53.36
61 - 80 years |        968       19.36       72.72
    >80 years |        265        5.30       78.02
            . |      1,099       21.98      100.00
--------------+-----------------------------------
        Total |      5,000      100.00

. 
. * Flag if in a care-home
.     gen care_home=care_home_type!="PR"

. 
. * Smoking status
. gen smoking = 0 if smoking_status=="N"
(4,494 missing values generated)

. replace smoking = 1 if smoking_status=="S"
(1,032 real changes made)

. replace smoking = 2 if smoking_status=="E"
(739 real changes made)

. replace smoking = 3 if smoking==.
(2,723 real changes made)

. 
. label define smok 1 "Current smoker" 2 "Ex-smoker" 0 "Never smoked" 3 "Unknow
> n"

. label values smoking smok

. 
. * BMI categories
. egen bmi_cat = cut(bmi), at(0, 1, 18.5, 24.9, 29.9, 39.9, 100) icodes

. bys bmi_cat: sum bmi

-------------------------------------------------------------------------------
-> bmi_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        997           0           0          0          0

-------------------------------------------------------------------------------
-> bmi_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        471    14.95999    3.046804   3.154498   18.49268

-------------------------------------------------------------------------------
-> bmi_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        881    22.03118    1.840483   18.50547    24.8999

-------------------------------------------------------------------------------
-> bmi_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |      1,011    27.40307    1.414162   24.91258   29.89925

-------------------------------------------------------------------------------
-> bmi_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |      1,371    34.08469    2.746455   29.90307   39.89558

-------------------------------------------------------------------------------
-> bmi_cat = 5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        269    43.25455    2.987457   39.90205   55.05476


. label define bmi 0 "Missing" 1 "Underweight" 2 "Healthy range" 3 "Overweight"
>  4 "Obese" 5 "Morbidly obese"

. label values bmi_cat bmi

. 
. * Categorise number of outpatient appointments
. label define appt 0 "No appointments" 1 "1-2 per year" 2 "3 or more per year"
>  

. forvalues i=2019/2021 {
  2.     egen op_appt_`i'_cat = cut(outpatient_appt_`i'), at(0, 1, 3, 1000) ico
> des
  3.     label values op_appt_`i'_cat appt
  4.     }

. 
. * Calculate difference compared to 2019
. gen diff_op_2020 = outpatient_appt_2020 - outpatient_appt_2019

. gen diff_op_2021 = outpatient_appt_2021 - outpatient_appt_2019

. sum diff_op_2020 diff_op_2021, d

                        diff_op_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%          -10            -13
 5%           -7            -12
10%           -5            -12       Obs               5,000
25%           -2            -12       Sum of Wgt.       5,000

50%            0                      Mean              .0062
                        Largest       Std. Dev.       4.17881
75%            2             12
90%            6             12       Variance       17.46245
95%            8             13       Skewness       .0475647
99%           10             14       Kurtosis       3.180061

                        diff_op_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%          -10            -14
 5%           -7            -13
10%           -5            -13       Obs               5,000
25%           -2            -12       Sum of Wgt.       5,000

50%            0                      Mean              .0424
                        Largest       Std. Dev.       4.18446
75%            2             13
90%            6             13       Variance        17.5097
95%            7             14       Skewness       -.003627
99%           10             14       Kurtosis         3.2337

. 
. egen diff_op_cat_2020 = cut(diff_op_2020), at(-100, 0, 1, 100) icodes

. egen diff_op_cat_2021 = cut(diff_op_2021), at(-100, 0, 1, 100) icodes

. label define op_cat 0 "Fewer appointments" 1 "Same number of appointments" 2 
> "More appointments"

. label values diff_op_cat_2020 op_cat

. label values diff_op_cat_2021 op_cat

. tab diff_op_cat_2020

           diff_op_cat_2020 |      Freq.     Percent        Cum.
----------------------------+-----------------------------------
         Fewer appointments |      2,216       44.32       44.32
Same number of appointments |        656       13.12       57.44
          More appointments |      2,128       42.56      100.00
----------------------------+-----------------------------------
                      Total |      5,000      100.00

. tab diff_op_cat_2021

           diff_op_cat_2021 |      Freq.     Percent        Cum.
----------------------------+-----------------------------------
         Fewer appointments |      2,168       43.36       43.36
Same number of appointments |        613       12.26       55.62
          More appointments |      2,219       44.38      100.00
----------------------------+-----------------------------------
                      Total |      5,000      100.00

. bys diff_op_cat_2020: sum diff_op_2020

-------------------------------------------------------------------------------
-> diff_op_cat_2020 = Fewer appointments

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
diff_op_2020 |      2,216   -3.569495    2.563619        -13         -1

-------------------------------------------------------------------------------
-> diff_op_cat_2020 = Same number of appointments

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
diff_op_2020 |        656           0           0          0          0

-------------------------------------------------------------------------------
-> diff_op_cat_2020 = More appointments

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
diff_op_2020 |      2,128    3.731673    2.644044          1         14


. 
. preserve

. * Tabulate number of appointments per year
. table1_mc, vars(op_appt_2019_cat cate \ op_appt_2020_cat cate \ op_appt_2021_
> cat cate \ diff_op_2020 conts \ diff_op_2021 conts \ diff_op_cat_2020 cate \ 
> diff_op_cat_2021 cate) clear

  +--------------------------------+
  | factor               N_1   m_1 |
  |--------------------------------|
  | op_appt_2019_cat   5,000     0 |
  |--------------------------------|
  | op_appt_2020_cat   5,000     0 |
  |--------------------------------|
  | op_appt_2021_cat   5,000     0 |
  |--------------------------------|
  | diff_op_2020       5,000     0 |
  |--------------------------------|
  | diff_op_2021       5,000     0 |
  |--------------------------------|
  | diff_op_cat_2020   5,000     0 |
  |--------------------------------|
  | diff_op_cat_2021   5,000     0 |
  +--------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------+
  |                                                  Total         |
  |----------------------------------------------------------------|
  |                                                  N=5,000       |
  |----------------------------------------------------------------|
  | op_appt_2019_cat   No appointments               518 (10.4%)   |
  |                    1-2 per year                  21 ( 0.4%)    |
  |                    3 or more per year            4,461 (89.2%) |
  |----------------------------------------------------------------|
  | op_appt_2020_cat   No appointments               500 (10.0%)   |
  |                    1-2 per year                  26 ( 0.5%)    |
  |                    3 or more per year            4,474 (89.5%) |
  |----------------------------------------------------------------|
  | op_appt_2021_cat   No appointments               515 (10.3%)   |
  |                    1-2 per year                  18 ( 0.4%)    |
  |                    3 or more per year            4,467 (89.3%) |
  |----------------------------------------------------------------|
  | diff_op_2020                                     0 (-2-2)      |
  |----------------------------------------------------------------|
  | diff_op_2021                                     0 (-2-2)      |
  |----------------------------------------------------------------|
  | diff_op_cat_2020   Fewer appointments            2,216 (44.3%) |
  |                    Same number of appointments   656 (13.1%)   |
  |                    More appointments             2,128 (42.6%) |
  |----------------------------------------------------------------|
  | diff_op_cat_2021   Fewer appointments            2,168 (43.4%) |
  |                    Same number of appointments   613 (12.3%)   |
  |                    More appointments             2,219 (44.4%) |
  +----------------------------------------------------------------+
Data are presented as median (IQR) for continuous measures, and n (%) for categ
> orical measures.
 

. export delimited using ./output/tables/op_appt_yrs.csv
file ./output/tables/op_appt_yrs.csv saved

. restore 

. * Tabulate overall characteristics 
. preserve

. table1_mc, vars(age_cat cate \ male cate \ region cate \ urban_rural_5 cate \
>  prescribed_biologics cate \ imd cate \ care_home cate \ smoking cate \ time_
> ra contn \ bmi_cat cate) clear

  +------------------------------------------------+
  | factor                             N_1     m_1 |
  |------------------------------------------------|
  | age_cat                          3,901   1,099 |
  |------------------------------------------------|
  | male                             5,000       0 |
  |------------------------------------------------|
  | region of England                4,045     955 |
  |------------------------------------------------|
  | Rural Urban in five categories   5,000       0 |
  |------------------------------------------------|
  | prescribed_biologics             5,000       0 |
  |------------------------------------------------|
  | imd                              5,000       0 |
  |------------------------------------------------|
  | care_home                        5,000       0 |
  |------------------------------------------------|
  | smoking                          5,000       0 |
  |------------------------------------------------|
  | time_ra                          2,283   2,717 |
  |------------------------------------------------|
  | bmi_cat                          5,000       0 |
  +------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=5,000     
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 1,435 (36.8%
> )       |
  |                                  41 - 60 years                 1,233 (31.6%
> )       |
  |                                  61 - 80 years                 968 (24.8%) 
>         |
  |                                  >80 years                     265 ( 6.8%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        2,537 (50.7%
> )       |
  |                                  Male                          2,463 (49.3%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | region of England                East Midlands                 509 (12.6%) 
>         |
  |                                  London                        1,008 (24.9%
> )       |
  |                                  North East                    516 (12.8%) 
>         |
  |                                  North West                    497 (12.3%) 
>         |
  |                                  South East                    1,025 (25.3%
> )       |
  |                                  West Midlands                 490 (12.1%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       566 (11.3%) 
>         |
  |                                  Urban minor conurbation       654 (13.1%) 
>         |
  |                                  Urban city and town           1,232 (24.6%
> )       |
  |                                  Rural town and fringe         1,279 (25.6%
> )       |
  |                                  Rural village and dispersed   1,269 (25.4%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             2,490 (49.8%
> )       |
  |                                  1                             2,510 (50.2%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             261 ( 5.2%) 
>         |
  |                                  1                             946 (18.9%) 
>         |
  |                                  2                             954 (19.1%) 
>         |
  |                                  3                             907 (18.1%) 
>         |
  |                                  4                             959 (19.2%) 
>         |
  |                                  5                             973 (19.5%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | care_home                        0                             4,246 (84.9%
> )       |
  |                                  1                             754 (15.1%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  506 (10.1%) 
>         |
  |                                  Current smoker                1,032 (20.6%
> )       |
  |                                  Ex-smoker                     739 (14.8%) 
>         |
  |                                  Unknown                       2,723 (54.5%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        53.99797 (31
> .76796) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       997 (19.9%) 
>         |
  |                                  Underweight                   471 ( 9.4%) 
>         |
  |                                  Healthy range                 881 (17.6%) 
>         |
  |                                  Overweight                    1,011 (20.2%
> )       |
  |                                  Obese                         1,371 (27.4%
> )       |
  |                                  Morbidly obese                269 ( 5.4%) 
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 

. export delimited using ./output/tables/op_chars.csv
file ./output/tables/op_chars.csv saved

. restore

. * Tabulate characteristics by category of outpatient appointments for each ye
> ar
. tempfile tempfile

. forvalues i=2020/2021 {
  2.     preserve
  3.     keep if diff_op_cat_`i'==0
  4.     table1_mc, vars(age_cat cate \ male cate \ region cate \ urban_rural_5
>  cate \ prescribed_biologics cate \ imd cate \ care_home cate \ smoking cate 
> \ time_ra contn \ bmi_cat cate) clear
  5.     save `tempfile', replace
  6.     restore
  7.     forvalues j=1/2 {
  8.         preserve
  9.         keep if diff_op_cat_`i'==`j'
 10.         table1_mc, vars(age_cat cate \ male cate \ region cate \ urban_rur
> al_5 cate \ prescribed_biologics cate \ imd cate \ care_home cate \ smoking c
> ate \ time_ra contn \ bmi_cat cate) clear
 11.         append using `tempfile'
 12.         save `tempfile', replace
 13.         if `j'==2 {
 14.             export delimited using ./output/tables/characteristics_strata`
> i'.csv
 15.         }
 16.         restore
 17.         }
 18.     }
(2,784 observations deleted)

  +------------------------------------------------+
  | factor                             N_1     m_1 |
  |------------------------------------------------|
  | age_cat                          1,708     508 |
  |------------------------------------------------|
  | male                             2,216       0 |
  |------------------------------------------------|
  | region of England                1,790     426 |
  |------------------------------------------------|
  | Rural Urban in five categories   2,216       0 |
  |------------------------------------------------|
  | prescribed_biologics             2,216       0 |
  |------------------------------------------------|
  | imd                              2,216       0 |
  |------------------------------------------------|
  | care_home                        2,216       0 |
  |------------------------------------------------|
  | smoking                          2,216       0 |
  |------------------------------------------------|
  | time_ra                          1,024   1,192 |
  |------------------------------------------------|
  | bmi_cat                          2,216       0 |
  +------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=2,216     
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 634 (37.1%) 
>         |
  |                                  41 - 60 years                 529 (31.0%) 
>         |
  |                                  61 - 80 years                 433 (25.4%) 
>         |
  |                                  >80 years                     112 ( 6.6%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        1,124 (50.7%
> )       |
  |                                  Male                          1,092 (49.3%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | region of England                East Midlands                 237 (13.2%) 
>         |
  |                                  London                        450 (25.1%) 
>         |
  |                                  North East                    234 (13.1%) 
>         |
  |                                  North West                    221 (12.3%) 
>         |
  |                                  South East                    420 (23.5%) 
>         |
  |                                  West Midlands                 228 (12.7%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       264 (11.9%) 
>         |
  |                                  Urban minor conurbation       297 (13.4%) 
>         |
  |                                  Urban city and town           541 (24.4%) 
>         |
  |                                  Rural town and fringe         549 (24.8%) 
>         |
  |                                  Rural village and dispersed   565 (25.5%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             1,092 (49.3%
> )       |
  |                                  1                             1,124 (50.7%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             121 ( 5.5%) 
>         |
  |                                  1                             426 (19.2%) 
>         |
  |                                  2                             408 (18.4%) 
>         |
  |                                  3                             403 (18.2%) 
>         |
  |                                  4                             429 (19.4%) 
>         |
  |                                  5                             429 (19.4%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | care_home                        0                             1,881 (84.9%
> )       |
  |                                  1                             335 (15.1%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  226 (10.2%) 
>         |
  |                                  Current smoker                455 (20.5%) 
>         |
  |                                  Ex-smoker                     342 (15.4%) 
>         |
  |                                  Unknown                       1,193 (53.8%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        54.61808 (31
> .97365) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       440 (19.9%) 
>         |
  |                                  Underweight                   200 ( 9.0%) 
>         |
  |                                  Healthy range                 395 (17.8%) 
>         |
  |                                  Overweight                    474 (21.4%) 
>         |
  |                                  Obese                         588 (26.5%) 
>         |
  |                                  Morbidly obese                119 ( 5.4%) 
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
(note: file /tmp/St00011.000003 not found)
file /tmp/St00011.000003 saved
(4,344 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                          523   133 |
  |--------------------------------------------|
  | male                             656     0 |
  |--------------------------------------------|
  | region of England                546   110 |
  |--------------------------------------------|
  | Rural Urban in five categories   656     0 |
  |--------------------------------------------|
  | prescribed_biologics             656     0 |
  |--------------------------------------------|
  | imd                              656     0 |
  |--------------------------------------------|
  | care_home                        656     0 |
  |--------------------------------------------|
  | smoking                          656     0 |
  |--------------------------------------------|
  | time_ra                          310   346 |
  |--------------------------------------------|
  | bmi_cat                          656     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> -------+
  |                                                                Total       
>        |
  |----------------------------------------------------------------------------
> -------|
  |                                                                N=656       
>        |
  |----------------------------------------------------------------------------
> -------|
  | age_cat                          18 - 40 years                 193 (36.9%) 
>        |
  |                                  41 - 60 years                 184 (35.2%) 
>        |
  |                                  61 - 80 years                 122 (23.3%) 
>        |
  |                                  >80 years                     24 ( 4.6%)  
>        |
  |----------------------------------------------------------------------------
> -------|
  | male                             Female                        336 (51.2%) 
>        |
  |                                  Male                          320 (48.8%) 
>        |
  |----------------------------------------------------------------------------
> -------|
  | region of England                East Midlands                 73 (13.4%)  
>        |
  |                                  London                        127 (23.3%) 
>        |
  |                                  North East                    71 (13.0%)  
>        |
  |                                  North West                    64 (11.7%)  
>        |
  |                                  South East                    147 (26.9%) 
>        |
  |                                  West Midlands                 64 (11.7%)  
>        |
  |----------------------------------------------------------------------------
> -------|
  | Rural Urban in five categories   Urban major conurbation       82 (12.5%)  
>        |
  |                                  Urban minor conurbation       70 (10.7%)  
>        |
  |                                  Urban city and town           164 (25.0%) 
>        |
  |                                  Rural town and fringe         169 (25.8%) 
>        |
  |                                  Rural village and dispersed   171 (26.1%) 
>        |
  |----------------------------------------------------------------------------
> -------|
  | prescribed_biologics             0                             352 (53.7%) 
>        |
  |                                  1                             304 (46.3%) 
>        |
  |----------------------------------------------------------------------------
> -------|
  | imd                              0                             28 ( 4.3%)  
>        |
  |                                  1                             109 (16.6%) 
>        |
  |                                  2                             125 (19.1%) 
>        |
  |                                  3                             109 (16.6%) 
>        |
  |                                  4                             147 (22.4%) 
>        |
  |                                  5                             138 (21.0%) 
>        |
  |----------------------------------------------------------------------------
> -------|
  | care_home                        0                             556 (84.8%) 
>        |
  |                                  1                             100 (15.2%) 
>        |
  |----------------------------------------------------------------------------
> -------|
  | smoking                          Never smoked                  77 (11.7%)  
>        |
  |                                  Current smoker                134 (20.4%) 
>        |
  |                                  Ex-smoker                     86 (13.1%)  
>        |
  |                                  Unknown                       359 (54.7%) 
>        |
  |----------------------------------------------------------------------------
> -------|
  | time_ra                                                        53.38382 (31
> .4506) |
  |----------------------------------------------------------------------------
> -------|
  | bmi_cat                          Missing                       143 (21.8%) 
>        |
  |                                  Underweight                   54 ( 8.2%)  
>        |
  |                                  Healthy range                 121 (18.4%) 
>        |
  |                                  Overweight                    127 (19.4%) 
>        |
  |                                  Obese                         178 (27.1%) 
>        |
  |                                  Morbidly obese                33 ( 5.0%)  
>        |
  +----------------------------------------------------------------------------
> -------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
(note: variable Total was str18, now str19 to accommodate using data's
       values)
file /tmp/St00011.000003 saved
(2,872 observations deleted)

  +------------------------------------------------+
  | factor                             N_1     m_1 |
  |------------------------------------------------|
  | age_cat                          1,670     458 |
  |------------------------------------------------|
  | male                             2,128       0 |
  |------------------------------------------------|
  | region of England                1,709     419 |
  |------------------------------------------------|
  | Rural Urban in five categories   2,128       0 |
  |------------------------------------------------|
  | prescribed_biologics             2,128       0 |
  |------------------------------------------------|
  | imd                              2,128       0 |
  |------------------------------------------------|
  | care_home                        2,128       0 |
  |------------------------------------------------|
  | smoking                          2,128       0 |
  |------------------------------------------------|
  | time_ra                            949   1,179 |
  |------------------------------------------------|
  | bmi_cat                          2,128       0 |
  +------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=2,128     
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 608 (36.4%) 
>         |
  |                                  41 - 60 years                 520 (31.1%) 
>         |
  |                                  61 - 80 years                 413 (24.7%) 
>         |
  |                                  >80 years                     129 ( 7.7%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        1,077 (50.6%
> )       |
  |                                  Male                          1,051 (49.4%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | region of England                East Midlands                 199 (11.6%) 
>         |
  |                                  London                        431 (25.2%) 
>         |
  |                                  North East                    211 (12.3%) 
>         |
  |                                  North West                    212 (12.4%) 
>         |
  |                                  South East                    458 (26.8%) 
>         |
  |                                  West Midlands                 198 (11.6%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       220 (10.3%) 
>         |
  |                                  Urban minor conurbation       287 (13.5%) 
>         |
  |                                  Urban city and town           527 (24.8%) 
>         |
  |                                  Rural town and fringe         561 (26.4%) 
>         |
  |                                  Rural village and dispersed   533 (25.0%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             1,046 (49.2%
> )       |
  |                                  1                             1,082 (50.8%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             112 ( 5.3%) 
>         |
  |                                  1                             411 (19.3%) 
>         |
  |                                  2                             421 (19.8%) 
>         |
  |                                  3                             395 (18.6%) 
>         |
  |                                  4                             383 (18.0%) 
>         |
  |                                  5                             406 (19.1%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | care_home                        0                             1,809 (85.0%
> )       |
  |                                  1                             319 (15.0%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  203 ( 9.5%) 
>         |
  |                                  Current smoker                443 (20.8%) 
>         |
  |                                  Ex-smoker                     311 (14.6%) 
>         |
  |                                  Unknown                       1,171 (55.0%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        53.52948 (31
> .66962) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       414 (19.5%) 
>         |
  |                                  Underweight                   217 (10.2%) 
>         |
  |                                  Healthy range                 365 (17.2%) 
>         |
  |                                  Overweight                    410 (19.3%) 
>         |
  |                                  Obese                         605 (28.4%) 
>         |
  |                                  Morbidly obese                117 ( 5.5%) 
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000003 saved
file ./output/tables/characteristics_strata2020.csv saved
(2,832 observations deleted)

  +------------------------------------------------+
  | factor                             N_1     m_1 |
  |------------------------------------------------|
  | age_cat                          1,695     473 |
  |------------------------------------------------|
  | male                             2,168       0 |
  |------------------------------------------------|
  | region of England                1,727     441 |
  |------------------------------------------------|
  | Rural Urban in five categories   2,168       0 |
  |------------------------------------------------|
  | prescribed_biologics             2,168       0 |
  |------------------------------------------------|
  | imd                              2,168       0 |
  |------------------------------------------------|
  | care_home                        2,168       0 |
  |------------------------------------------------|
  | smoking                          2,168       0 |
  |------------------------------------------------|
  | time_ra                            955   1,213 |
  |------------------------------------------------|
  | bmi_cat                          2,168       0 |
  +------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=2,168     
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 614 (36.2%) 
>         |
  |                                  41 - 60 years                 534 (31.5%) 
>         |
  |                                  61 - 80 years                 427 (25.2%) 
>         |
  |                                  >80 years                     120 ( 7.1%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        1,097 (50.6%
> )       |
  |                                  Male                          1,071 (49.4%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | region of England                East Midlands                 207 (12.0%) 
>         |
  |                                  London                        433 (25.1%) 
>         |
  |                                  North East                    222 (12.9%) 
>         |
  |                                  North West                    195 (11.3%) 
>         |
  |                                  South East                    441 (25.5%) 
>         |
  |                                  West Midlands                 229 (13.3%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       263 (12.1%) 
>         |
  |                                  Urban minor conurbation       286 (13.2%) 
>         |
  |                                  Urban city and town           549 (25.3%) 
>         |
  |                                  Rural town and fringe         533 (24.6%) 
>         |
  |                                  Rural village and dispersed   537 (24.8%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             1,075 (49.6%
> )       |
  |                                  1                             1,093 (50.4%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             110 ( 5.1%) 
>         |
  |                                  1                             421 (19.4%) 
>         |
  |                                  2                             431 (19.9%) 
>         |
  |                                  3                             381 (17.6%) 
>         |
  |                                  4                             394 (18.2%) 
>         |
  |                                  5                             431 (19.9%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | care_home                        0                             1,842 (85.0%
> )       |
  |                                  1                             326 (15.0%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  244 (11.3%) 
>         |
  |                                  Current smoker                437 (20.2%) 
>         |
  |                                  Ex-smoker                     329 (15.2%) 
>         |
  |                                  Unknown                       1,158 (53.4%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        55.22458 (31
> .92091) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       415 (19.1%) 
>         |
  |                                  Underweight                   189 ( 8.7%) 
>         |
  |                                  Healthy range                 389 (17.9%) 
>         |
  |                                  Overweight                    465 (21.4%) 
>         |
  |                                  Obese                         595 (27.4%) 
>         |
  |                                  Morbidly obese                115 ( 5.3%) 
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000003 saved
(4,387 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                          479   134 |
  |--------------------------------------------|
  | male                             613     0 |
  |--------------------------------------------|
  | region of England                512   101 |
  |--------------------------------------------|
  | Rural Urban in five categories   613     0 |
  |--------------------------------------------|
  | prescribed_biologics             613     0 |
  |--------------------------------------------|
  | imd                              613     0 |
  |--------------------------------------------|
  | care_home                        613     0 |
  |--------------------------------------------|
  | smoking                          613     0 |
  |--------------------------------------------|
  | time_ra                          307   306 |
  |--------------------------------------------|
  | bmi_cat                          613     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> ------+
  |                                                                Total       
>       |
  |----------------------------------------------------------------------------
> ------|
  |                                                                N=613       
>       |
  |----------------------------------------------------------------------------
> ------|
  | age_cat                          18 - 40 years                 180 (37.6%) 
>       |
  |                                  41 - 60 years                 146 (30.5%) 
>       |
  |                                  61 - 80 years                 127 (26.5%) 
>       |
  |                                  >80 years                     26 ( 5.4%)  
>       |
  |----------------------------------------------------------------------------
> ------|
  | male                             Female                        309 (50.4%) 
>       |
  |                                  Male                          304 (49.6%) 
>       |
  |----------------------------------------------------------------------------
> ------|
  | region of England                East Midlands                 75 (14.6%)  
>       |
  |                                  London                        124 (24.2%) 
>       |
  |                                  North East                    67 (13.1%)  
>       |
  |                                  North West                    63 (12.3%)  
>       |
  |                                  South East                    124 (24.2%) 
>       |
  |                                  West Midlands                 59 (11.5%)  
>       |
  |----------------------------------------------------------------------------
> ------|
  | Rural Urban in five categories   Urban major conurbation       71 (11.6%)  
>       |
  |                                  Urban minor conurbation       79 (12.9%)  
>       |
  |                                  Urban city and town           140 (22.8%) 
>       |
  |                                  Rural town and fringe         172 (28.1%) 
>       |
  |                                  Rural village and dispersed   151 (24.6%) 
>       |
  |----------------------------------------------------------------------------
> ------|
  | prescribed_biologics             0                             322 (52.5%) 
>       |
  |                                  1                             291 (47.5%) 
>       |
  |----------------------------------------------------------------------------
> ------|
  | imd                              0                             29 ( 4.7%)  
>       |
  |                                  1                             110 (17.9%) 
>       |
  |                                  2                             107 (17.5%) 
>       |
  |                                  3                             101 (16.5%) 
>       |
  |                                  4                             138 (22.5%) 
>       |
  |                                  5                             128 (20.9%) 
>       |
  |----------------------------------------------------------------------------
> ------|
  | care_home                        0                             522 (85.2%) 
>       |
  |                                  1                             91 (14.8%)  
>       |
  |----------------------------------------------------------------------------
> ------|
  | smoking                          Never smoked                  43 ( 7.0%)  
>       |
  |                                  Current smoker                114 (18.6%) 
>       |
  |                                  Ex-smoker                     98 (16.0%)  
>       |
  |                                  Unknown                       358 (58.4%) 
>       |
  |----------------------------------------------------------------------------
> ------|
  | time_ra                                                        52.016 (31.9
> 3781) |
  |----------------------------------------------------------------------------
> ------|
  | bmi_cat                          Missing                       126 (20.6%) 
>       |
  |                                  Underweight                   54 ( 8.8%)  
>       |
  |                                  Healthy range                 100 (16.3%) 
>       |
  |                                  Overweight                    121 (19.7%) 
>       |
  |                                  Obese                         168 (27.4%) 
>       |
  |                                  Morbidly obese                44 ( 7.2%)  
>       |
  +----------------------------------------------------------------------------
> ------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
(note: variable Total was str17, now str19 to accommodate using data's
       values)
file /tmp/St00011.000003 saved
(2,781 observations deleted)

  +------------------------------------------------+
  | factor                             N_1     m_1 |
  |------------------------------------------------|
  | age_cat                          1,727     492 |
  |------------------------------------------------|
  | male                             2,219       0 |
  |------------------------------------------------|
  | region of England                1,806     413 |
  |------------------------------------------------|
  | Rural Urban in five categories   2,219       0 |
  |------------------------------------------------|
  | prescribed_biologics             2,219       0 |
  |------------------------------------------------|
  | imd                              2,219       0 |
  |------------------------------------------------|
  | care_home                        2,219       0 |
  |------------------------------------------------|
  | smoking                          2,219       0 |
  |------------------------------------------------|
  | time_ra                          1,021   1,198 |
  |------------------------------------------------|
  | bmi_cat                          2,219       0 |
  +------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=2,219     
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 641 (37.1%) 
>         |
  |                                  41 - 60 years                 553 (32.0%) 
>         |
  |                                  61 - 80 years                 414 (24.0%) 
>         |
  |                                  >80 years                     119 ( 6.9%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        1,131 (51.0%
> )       |
  |                                  Male                          1,088 (49.0%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | region of England                East Midlands                 227 (12.6%) 
>         |
  |                                  London                        451 (25.0%) 
>         |
  |                                  North East                    227 (12.6%) 
>         |
  |                                  North West                    239 (13.2%) 
>         |
  |                                  South East                    460 (25.5%) 
>         |
  |                                  West Midlands                 202 (11.2%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       232 (10.5%) 
>         |
  |                                  Urban minor conurbation       289 (13.0%) 
>         |
  |                                  Urban city and town           543 (24.5%) 
>         |
  |                                  Rural town and fringe         574 (25.9%) 
>         |
  |                                  Rural village and dispersed   581 (26.2%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             1,093 (49.3%
> )       |
  |                                  1                             1,126 (50.7%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             122 ( 5.5%) 
>         |
  |                                  1                             415 (18.7%) 
>         |
  |                                  2                             416 (18.7%) 
>         |
  |                                  3                             425 (19.2%) 
>         |
  |                                  4                             427 (19.2%) 
>         |
  |                                  5                             414 (18.7%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | care_home                        0                             1,882 (84.8%
> )       |
  |                                  1                             337 (15.2%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  219 ( 9.9%) 
>         |
  |                                  Current smoker                481 (21.7%) 
>         |
  |                                  Ex-smoker                     312 (14.1%) 
>         |
  |                                  Unknown                       1,207 (54.4%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        53.44661 (31
> .55835) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       456 (20.5%) 
>         |
  |                                  Underweight                   228 (10.3%) 
>         |
  |                                  Healthy range                 392 (17.7%) 
>         |
  |                                  Overweight                    425 (19.2%) 
>         |
  |                                  Obese                         608 (27.4%) 
>         |
  |                                  Morbidly obese                110 ( 5.0%) 
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000003 saved
file ./output/tables/characteristics_strata2021.csv saved

.     /* Tabulate characteristics by whether hospitalised with RA for each year
>     preserve
>     keep if ra_hosp_`i'==1
>     table1_mc, vars(age_cat cate \ male cate \ region cate \ urban_rural_5 ca
> te \ prescribed_biologics cate \ imd cate \ care_home cate \ smoking cate \ t
> ime_ra contn \ bmi_cat cate) clear
>     export delimited using ./output/tables/characteristics_ra_hosp_`i'.csv
>     restore
>     }
> preserve
>     keep if ra_hosp_2018==1
>     table1_mc, vars(age_cat cate \ male cate \ region cate \ urban_rural_5 ca
> te \ prescribed_biologics cate \ imd cate \ care_home cate \ smoking cate \ t
> ime_ra contn \ bmi_cat cate) clear
>     export delimited using ./output/tables/characteristics_ra_hosp_2018.csv
>     restore
>     */
. log close
      name:  <unnamed>
       log:  /workspace/logs/outpatients.log
  log type:  text
 closed on:  31 Oct 2022, 10:13:57
-------------------------------------------------------------------------------
