
. 
. cap mkdir ./output/tables

. * Import data
. import delimited using ./output/input.csv
(40 vars, 10,000 obs)

. * Check data
. count if age==. 
  0

. count if age<18 
  2,249

. count if age>110 & age!=.
  0

. sum age, d

                             age
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            4              0
10%            7              0       Obs              10,000
25%           20              0       Sum of Wgt.      10,000

50%           40                      Mean            40.2258
                        Largest       Std. Dev.      24.05681
75%           59            104
90%           73            107       Variance       578.7303
95%           80            108       Skewness       .1326583
99%           90            109       Kurtosis       2.030231

. count if sex==""
  0

. tab sex

        sex |      Freq.     Percent        Cum.
------------+-----------------------------------
          F |      5,028       50.28       50.28
          M |      4,876       48.76       99.04
          U |         96        0.96      100.00
------------+-----------------------------------
      Total |     10,000      100.00

. * Checking RA algorithm variables
. * Checking type of DMARD that meets inclusion
. foreach dmard in metho leflu sulfa hydrox {
  2.     gen `dmard'_multi = (`dmard'_count>=2)
  3.     tab `dmard'_multi if has_dmards==1, m
  4. }

metho_multi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        742       14.84       14.84
          1 |      4,258       85.16      100.00
------------+-----------------------------------
      Total |      5,000      100.00

leflu_multi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        817       16.34       16.34
          1 |      4,183       83.66      100.00
------------+-----------------------------------
      Total |      5,000      100.00

sulfa_multi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        782       15.64       15.64
          1 |      4,218       84.36      100.00
------------+-----------------------------------
      Total |      5,000      100.00

hydrox_mult |
          i |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        810       16.20       16.20
          1 |      4,190       83.80      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. gen dmard_multi = (metho_multi==1 | leflu_multi==1 | sulfa_multi==1 | hydrox_
> multi==1)

. tab dmard_multi has_alt_dmard_diag

dmard_mult |  has_alt_dmard_diag
         i |         0          1 |     Total
-----------+----------------------+----------
         0 |         5          3 |         8 
         1 |     4,995      4,997 |     9,992 
-----------+----------------------+----------
     Total |     5,000      5,000 |    10,000 

. sum number_ra_codes

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
number_ra_~s |     10,000      2.5127    1.030604          0          6

. di "Number where no DMARDs but does have multiple RA codes and no alt diag"
Number where no DMARDs but does have multiple RA codes and no alt diag

. count if has_dmards==0 & number_ra_codes>=2 & alt_diag!=1
  2,159

. tab has_ra, m

     has_ra |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,000       50.00       50.00
          1 |      5,000       50.00      100.00
------------+-----------------------------------
      Total |     10,000      100.00

. keep if has_ra
(5,000 observations deleted)

. * Time since first RA code
. gen first_ra_codeA = date(first_ra_code, "YMD")
(2,795 missing values generated)

. format first_ra_codeA %dD/N/CY

. gen time_ra = (date("01Mar2018", "DMY") - first_ra_codeA)/365.25
(2,795 missing values generated)

. sum time_ra, d

                           time_ra
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.0766598      -1.075975
 5%     4.145106      -1.073238
10%     9.806981      -1.051335       Obs               2,205
25%     25.57426      -1.043121       Sum of Wgt.       2,205

50%     53.54141                      Mean           53.81515
                        Largest       Std. Dev.      32.03926
75%     81.64271       108.8241
90%     98.95688       108.8378       Variance       1026.514
95%     104.3066       108.8405       Skewness       .0179096
99%      107.885       108.8679       Kurtosis       1.793651

. sum number_ra_codes, d

                       number_ra_codes
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            3                      Mean             2.5078
                        Largest       Std. Dev.      1.030607
75%            3              6
90%            4              6       Variance       1.062152
95%            4              6       Skewness       .0064881
99%            5              6       Kurtosis        2.93185

. sum metho_count, d

                         metho_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            3                      Mean             2.5026
                        Largest       Std. Dev.      1.017743
75%            3              6
90%            4              6       Variance         1.0358
95%            4              6       Skewness       .0316667
99%            5              6       Kurtosis       2.923121

. sum sulfa_count, d 

                         sulfa_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -1
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            3                      Mean             2.4986
                        Largest       Std. Dev.      1.041833
75%            3              6
90%            4              6       Variance       1.085415
95%            4              6       Skewness      -.0111388
99%            5              6       Kurtosis       2.938736

. sum leflu_count, d 

                         leflu_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            3                      Mean              2.512
                        Largest       Std. Dev.      1.018854
75%            3              6
90%            4              6       Variance       1.038064
95%            4              6       Skewness      -.0109376
99%            5              6       Kurtosis       2.898178

. sum hydrox_count, d 

                        hydrox_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -1
 5%            1              0
10%            1              0       Obs               5,000
25%            2              0       Sum of Wgt.       5,000

50%            2                      Mean              2.485
                        Largest       Std. Dev.      1.033242
75%            3              6
90%            4              6       Variance       1.067589
95%            4              6       Skewness      -.0120742
99%            5              7       Kurtosis       2.946626

. 
. sum outpatient*, d

                    outpatient_appt_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               5,000
25%            6              0       Sum of Wgt.       5,000

50%            7                      Mean             6.7318
                        Largest       Std. Dev.      2.969989
75%            9             14
90%           10             14       Variance       8.820833
95%           11             14       Skewness      -.8668636
99%           12             15       Kurtosis       3.464388

                    outpatient_appt_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               5,000
25%            6              0       Sum of Wgt.       5,000

50%            7                      Mean             6.7836
                        Largest       Std. Dev.      2.965827
75%            9             14
90%           10             15       Variance        8.79613
95%           11             15       Skewness      -.8568475
99%           12             16       Kurtosis       3.522925

                    outpatient_appt_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               5,000
25%            6              0       Sum of Wgt.       5,000

50%            7                      Mean             6.7502
                        Largest       Std. Dev.      2.972468
75%            9             14
90%           10             14       Variance       8.835567
95%           11             15       Skewness       -.843774
99%           12             16       Kurtosis       3.425086

                   outpatient_medium_2019
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               2,533
25%            2              1       Sum of Wgt.       2,533

50%            4                      Mean            12.0079
                        Largest       Std. Dev.      26.16269
75%            7             98
90%            8             98       Variance       684.4865
95%           98             98       Skewness       2.955572
99%           98             98       Kurtosis       9.833616

                   outpatient_medium_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               2,496
25%            2              1       Sum of Wgt.       2,496

50%            4                      Mean           12.76002
                        Largest       Std. Dev.      27.32385
75%            7             98
90%            8             98       Variance       746.5929
95%           98             98       Skewness       2.775579
99%           98             98       Kurtosis       8.786019

                   outpatient_medium_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               2,492
25%            2              1       Sum of Wgt.       2,492

50%            5                      Mean           13.49599
                        Largest       Std. Dev.      28.25605
75%            7             98
90%            8             98       Variance       798.4042
95%           98             98       Skewness       2.634739
99%           98             98       Kurtosis       8.014876

. 
. * How many people are not on DMARDs and have no RA appointments?
. 
. 
. * Format variables
. *re-order ethnicity
.  gen eth5=1 if ethnicity==1
(4,011 missing values generated)

.  replace eth5=2 if ethnicity==3
(979 real changes made)

.  replace eth5=3 if ethnicity==4
(971 real changes made)

.  replace eth5=4 if ethnicity==2
(1,063 real changes made)

.  replace eth5=5 if ethnicity==5
(998 real changes made)

.  replace eth5=. if ethnicity==.
(0 real changes made)

. 
.  label define eth5                      1 "White"                            
>            ///
>                                                         2 "South Asian"      
>                    ///                                             
>                                                         3 "Black"            
>                            ///
>                                                         4 "Mixed"            
>                            ///
>                                                         5 "Other"            
>                            

.                                         
. 
. label values eth5 eth5

. safetab eth5, m
5

       eth5 |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |        989       19.78       19.78
South Asian |        979       19.58       39.36
      Black |        971       19.42       58.78
      Mixed |      1,063       21.26       80.04
      Other |        998       19.96      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. 
. * formatting gender
. gen male=(sex=="M")

. replace male = 0 if sex == "F"
(0 real changes made)

. label define male 0"Female" 1"Male"

. label values male male

. safetab male, miss
5

       male |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |      2,606       52.12       52.12
       Male |      2,394       47.88      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. 
. *create a 4 category rural urban variable 
. generate urban_rural_5=.
(5,000 missing values generated)

. la var urban_rural_5 "Rural Urban in five categories"

. replace urban_rural_5=1 if urban_rural==1
(588 real changes made)

. replace urban_rural_5=2 if urban_rural==2
(669 real changes made)

. replace urban_rural_5=3 if urban_rural==3|urban_rural==4
(1,283 real changes made)

. replace urban_rural_5=4 if urban_rural==5|urban_rural==6
(1,201 real changes made)

. replace urban_rural_5=5 if urban_rural==7|urban_rural==8
(1,259 real changes made)

. label define urban_rural_5 1 "Urban major conurbation" 2 "Urban minor conurba
> tion" 3 "Urban city and town" 4 "Rural town and fringe" 5 "Rural village and 
> dispersed"

. label values urban_rural_5 urban_rural_5

. safetab urban_rural_5, miss
14

        Rural Urban in five |
                 categories |      Freq.     Percent        Cum.
----------------------------+-----------------------------------
    Urban major conurbation |        588       11.76       11.76
    Urban minor conurbation |        669       13.38       25.14
        Urban city and town |      1,283       25.66       50.80
      Rural town and fringe |      1,201       24.02       74.82
Rural village and dispersed |      1,259       25.18      100.00
----------------------------+-----------------------------------
                      Total |      5,000      100.00

. 
. *generate a binary rural urban (with missing assigned to urban)
. generate urban_rural_bin=.
(5,000 missing values generated)

. replace urban_rural_bin=1 if urban_rural<=4|urban_rural==.
(2,540 real changes made)

. replace urban_rural_bin=0 if urban_rural>4 & urban_rural!=.
(2,460 real changes made)

. label define urban_rural_bin 0 "Rural" 1 "Urban"

. label values urban_rural_bin urban_rural_bin

. safetab urban_rural_bin urban_rural, miss
28

urban_rura |                      urban_rural
     l_bin |         1          2          3          4          5 |     Total
-----------+-------------------------------------------------------+----------
     Rural |         0          0          0          0        597 |     2,460 
     Urban |       588        669        633        650          0 |     2,540 
-----------+-------------------------------------------------------+----------
     Total |       588        669        633        650        597 |     5,000 


urban_rura |           urban_rural
     l_bin |         6          7          8 |     Total
-----------+---------------------------------+----------
     Rural |       604        588        671 |     2,460 
     Urban |         0          0          0 |     2,540 
-----------+---------------------------------+----------
     Total |       604        588        671 |     5,000 

. label var urban_rural_bin "Rural-Urban"

. 
. * Define age categories
. * Create age categories
. egen age_cat = cut(age), at(18, 40, 60, 80, 120) icodes
(1110 missing values generated)

. label define age 0 "18 - 40 years" 1 "41 - 60 years" 2 "61 - 80 years" 3 ">80
>  years"

. label values age_cat age

. safetab age_cat, miss
8

      age_cat |      Freq.     Percent        Cum.
--------------+-----------------------------------
18 - 40 years |      1,345       26.90       26.90
41 - 60 years |      1,339       26.78       53.68
61 - 80 years |        943       18.86       72.54
    >80 years |        263        5.26       77.80
            . |      1,110       22.20      100.00
--------------+-----------------------------------
        Total |      5,000      100.00

. 
. * Smoking status
. gen smoking = 0 if smoking_status=="N"
(4,511 missing values generated)

. replace smoking = 1 if smoking_status=="S"
(996 real changes made)

. replace smoking = 2 if smoking_status=="E"
(757 real changes made)

. replace smoking = 3 if smoking==.
(2,758 real changes made)

. 
. label define smok 1 "Current smoker" 2 "Ex-smoker" 0 "Never smoked" 3 "Unknow
> n"

. label values smoking smok

. 
. * BMI categories
. egen bmi_cat = cut(bmi), at(0, 1, 18.5, 24.9, 29.9, 39.9, 100) icodes
(1 missing value generated)

. bys bmi_cat: sum bmi

-------------------------------------------------------------------------------
-> bmi_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |      1,006           0           0          0          0

-------------------------------------------------------------------------------
-> bmi_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        455    14.77948    3.291597   1.425326   18.48147

-------------------------------------------------------------------------------
-> bmi_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        944    21.99828    1.814495   18.50451   24.88732

-------------------------------------------------------------------------------
-> bmi_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        950     27.3291    1.424963   24.90407   29.89659

-------------------------------------------------------------------------------
-> bmi_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |      1,369    34.26963    2.797981    29.9121   39.89536

-------------------------------------------------------------------------------
-> bmi_cat = 5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        275    43.57137    3.108125   39.91558    56.0363

-------------------------------------------------------------------------------
-> bmi_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |          1    -.609341           .   -.609341   -.609341


. label define bmi 0 "Missing" 1 "Underweight" 2 "Healthy range" 3 "Overweight"
>  4 "Obese" 5 "Morbidly obese"

. label values bmi_cat bmi

. 
. * Determine if still in follow-up for each year
. * Format dates
. gen died_fuA = date(died_fu, "YMD")
(2,494 missing values generated)

. gen dereg_dateA = date(dereg_date, "YMD")
(2,470 missing values generated)

. gen end_fu = date("`j'-03-31", "YMD")
(5,000 missing values generated)

. gen end_date = min(died_fuA, dereg_dateA, end_fu)
(1,233 missing values generated)

. drop end_fu

. sum end_date

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    end_date |      3,767    22425.62    286.8605      21976      22987

. di "Number where end date prior to follow-up start"
Number where end date prior to follow-up start

. count if end_date<date("2019-04-01", "YMD")
  0

. * determine range of dates for outpatient appointments to determine which sho
> uld be dropped
. gen end_2020 = end_date<date("2020-03-31", "YMD")

. gen end_2021 = end_date<date("2021-03-31", "YMD")

. gen end_2022 = end_date<date("2022-03-31", "YMD")

. tab end_2020

   end_2020 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,857       97.14       97.14
          1 |        143        2.86      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. tab end_2021

   end_2021 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,226       64.52       64.52
          1 |      1,774       35.48      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. tab end_2022

   end_2022 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,922       38.44       38.44
          1 |      3,078       61.56      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. * Set outpatient appointment count to missing if end prior to the end of the 
> year 
. forvalues i=2019/2021 {
  2.     local j=`i'+1
  3.     di `j'
  4.     replace outpatient_appt_`i'=. if end_`j'
  5.     replace outpatient_medium_`i'=. if end_`j'
  6. }
2020
(143 real changes made, 143 to missing)
(65 real changes made, 65 to missing)
2021
(1,774 real changes made, 1,774 to missing)
(898 real changes made, 898 to missing)
2022
(3,078 real changes made, 3,078 to missing)
(1,544 real changes made, 1,544 to missing)

. 
. * Categorise number of outpatient appointments
. label define appt 0 "No appointments" 1 "1-2 per year" 2 "3 or more per year"
>  

. forvalues i=2019/2021 {
  2.     egen op_appt_`i'_cat = cut(outpatient_appt_`i'), at(0, 1, 3, 1000) ico
> des
  3.     label values op_appt_`i'_cat appt
  4.     }
(143 missing values generated)
(1774 missing values generated)
(3078 missing values generated)

. 
. * Calculate difference compared to 2019
. gen diff_op_2020 = outpatient_appt_2020 - outpatient_appt_2019
(1,774 missing values generated)

. gen diff_op_2021 = outpatient_appt_2021 - outpatient_appt_2020
(3,078 missing values generated)

. sum diff_op_2020 diff_op_2021, d

                        diff_op_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%          -10            -14
 5%           -7            -13
10%           -5            -12       Obs               3,226
25%           -2            -12       Sum of Wgt.       3,226

50%            0                      Mean          -.0024799
                        Largest       Std. Dev.      4.165788
75%            2             12
90%            5             12       Variance       17.35379
95%            7             12       Skewness       .0311461
99%           10             13       Kurtosis        3.36546

                        diff_op_2021
-------------------------------------------------------------
      Percentiles      Smallest
 1%          -10            -14
 5%           -8            -13
10%           -5            -12       Obs               1,922
25%           -2            -11       Sum of Wgt.       1,922

50%            0                      Mean           .0577523
                        Largest       Std. Dev.      4.228297
75%            3             11
90%            6             12       Variance        17.8785
95%            7             12       Skewness       -.003608
99%           10             13       Kurtosis       3.154233

. 
. egen diff_op_cat_2020 = cut(diff_op_2020), at(-100, 0, 1, 100) icodes
(1774 missing values generated)

. egen diff_op_cat_2021 = cut(diff_op_2021), at(-100, 0, 1, 100) icodes
(3078 missing values generated)

. label define op_cat 0 "Fewer appointments" 1 "Same number of appointments" 2 
> "More appointments"

. label values diff_op_cat_2020 op_cat

. label values diff_op_cat_2021 op_cat

. tab diff_op_cat_2020 op_appt_2020_cat

                      |         op_appt_2020_cat
     diff_op_cat_2020 | No appoin  1-2 per y  3 or more |     Total
----------------------+---------------------------------+----------
   Fewer appointments |       286         15      1,103 |     1,404 
Same number of appoin |        33          0        391 |       424 
    More appointments |         0          2      1,396 |     1,398 
----------------------+---------------------------------+----------
                Total |       319         17      2,890 |     3,226 

. tab diff_op_cat_2021 op_appt_2021_cat

                      |         op_appt_2021_cat
     diff_op_cat_2021 | No appoin  1-2 per y  3 or more |     Total
----------------------+---------------------------------+----------
   Fewer appointments |       161          8        678 |       847 
Same number of appoin |        18          0        228 |       246 
    More appointments |         0          2        827 |       829 
----------------------+---------------------------------+----------
                Total |       179         10      1,733 |     1,922 

. bys diff_op_cat_2020: sum diff_op_2020

-------------------------------------------------------------------------------
-> diff_op_cat_2020 = Fewer appointments

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
diff_op_2020 |      1,404   -3.599715    2.610227        -14         -1

-------------------------------------------------------------------------------
-> diff_op_cat_2020 = Same number of appointments

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
diff_op_2020 |        424           0           0          0          0

-------------------------------------------------------------------------------
-> diff_op_cat_2020 = More appointments

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
diff_op_2020 |      1,398    3.609442    2.675582          1         13

-------------------------------------------------------------------------------
-> diff_op_cat_2020 = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
diff_op_2020 |          0


. 
. preserve

. * Tabulate number of appointments per year
. table1_mc, vars(op_appt_2019_cat cate \ op_appt_2020_cat cate \ op_appt_2021_
> cat cate \ diff_op_2020 conts \ diff_op_2021 conts \ diff_op_cat_2020 cate \ 
> diff_op_cat_2021 cate) clear

  +----------------------------------+
  | factor               N_1     m_1 |
  |----------------------------------|
  | op_appt_2019_cat   4,857     143 |
  |----------------------------------|
  | op_appt_2020_cat   3,226   1,774 |
  |----------------------------------|
  | op_appt_2021_cat   1,922   3,078 |
  |----------------------------------|
  | diff_op_2020       3,226   1,774 |
  |----------------------------------|
  | diff_op_2021       1,922   3,078 |
  |----------------------------------|
  | diff_op_cat_2020   3,226   1,774 |
  |----------------------------------|
  | diff_op_cat_2021   1,922   3,078 |
  +----------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------+
  |                                                  Total         |
  |----------------------------------------------------------------|
  |                                                  N=5,000       |
  |----------------------------------------------------------------|
  | op_appt_2019_cat   No appointments               505 (10.4%)   |
  |                    1-2 per year                  27 ( 0.6%)    |
  |                    3 or more per year            4,325 (89.0%) |
  |----------------------------------------------------------------|
  | op_appt_2020_cat   No appointments               319 ( 9.9%)   |
  |                    1-2 per year                  17 ( 0.5%)    |
  |                    3 or more per year            2,890 (89.6%) |
  |----------------------------------------------------------------|
  | op_appt_2021_cat   No appointments               179 ( 9.3%)   |
  |                    1-2 per year                  10 ( 0.5%)    |
  |                    3 or more per year            1,733 (90.2%) |
  |----------------------------------------------------------------|
  | diff_op_2020                                     0 (-2-2)      |
  |----------------------------------------------------------------|
  | diff_op_2021                                     0 (-2-3)      |
  |----------------------------------------------------------------|
  | diff_op_cat_2020   Fewer appointments            1,404 (43.5%) |
  |                    Same number of appointments   424 (13.1%)   |
  |                    More appointments             1,398 (43.3%) |
  |----------------------------------------------------------------|
  | diff_op_cat_2021   Fewer appointments            847 (44.1%)   |
  |                    Same number of appointments   246 (12.8%)   |
  |                    More appointments             829 (43.1%)   |
  +----------------------------------------------------------------+
Data are presented as median (IQR) for continuous measures, and n (%) for categ
> orical measures.
 

. export delimited using ./output/tables/op_appt_yrs.csv
file ./output/tables/op_appt_yrs.csv saved

. restore 

. * Tabulate overall characteristics 
. preserve

. table1_mc, vars(age_cat cate \ male cate \ urban_rural_5 cate \ prescribed_bi
> ologics cate \ imd cate \  smoking cate \ time_ra contn \ bmi_cat cate) clear

  +------------------------------------------------+
  | factor                             N_1     m_1 |
  |------------------------------------------------|
  | age_cat                          3,890   1,110 |
  |------------------------------------------------|
  | male                             5,000       0 |
  |------------------------------------------------|
  | Rural Urban in five categories   5,000       0 |
  |------------------------------------------------|
  | prescribed_biologics             5,000       0 |
  |------------------------------------------------|
  | imd                              5,000       0 |
  |------------------------------------------------|
  | smoking                          5,000       0 |
  |------------------------------------------------|
  | time_ra                          2,205   2,795 |
  |------------------------------------------------|
  | bmi_cat                          4,999       1 |
  +------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=5,000     
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 1,345 (34.6%
> )       |
  |                                  41 - 60 years                 1,339 (34.4%
> )       |
  |                                  61 - 80 years                 943 (24.2%) 
>         |
  |                                  >80 years                     263 ( 6.8%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        2,606 (52.1%
> )       |
  |                                  Male                          2,394 (47.9%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       588 (11.8%) 
>         |
  |                                  Urban minor conurbation       669 (13.4%) 
>         |
  |                                  Urban city and town           1,283 (25.7%
> )       |
  |                                  Rural town and fringe         1,201 (24.0%
> )       |
  |                                  Rural village and dispersed   1,259 (25.2%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             2,485 (49.7%
> )       |
  |                                  1                             2,515 (50.3%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             243 ( 4.9%) 
>         |
  |                                  1                             909 (18.2%) 
>         |
  |                                  2                             1,001 (20.0%
> )       |
  |                                  3                             951 (19.0%) 
>         |
  |                                  4                             976 (19.5%) 
>         |
  |                                  5                             920 (18.4%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  489 ( 9.8%) 
>         |
  |                                  Current smoker                996 (19.9%) 
>         |
  |                                  Ex-smoker                     757 (15.1%) 
>         |
  |                                  Unknown                       2,758 (55.2%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        53.81515 (32
> .03926) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       1,006 (20.1%
> )       |
  |                                  Underweight                   455 ( 9.1%) 
>         |
  |                                  Healthy range                 944 (18.9%) 
>         |
  |                                  Overweight                    950 (19.0%) 
>         |
  |                                  Obese                         1,369 (27.4%
> )       |
  |                                  Morbidly obese                275 ( 5.5%) 
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 

. export delimited using ./output/tables/op_chars.csv
file ./output/tables/op_chars.csv saved

. restore

. * Tabulate characteristics by category of outpatient appointments for each ye
> ar
. tempfile tempfile

. forvalues i=2019/2021 {
  2.     preserve
  3.     keep if op_appt_`i'_cat==0
  4.     table1_mc, vars(age_cat cate \ male cate \ urban_rural_5 cate \ prescr
> ibed_biologics cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat cate)
>  clear
  5.     save `tempfile', replace
  6.     restore
  7.     forvalues j=1/2 {
  8.         preserve
  9.         keep if op_appt_`i'_cat==`j'
 10.         table1_mc, vars(age_cat cate \ male cate \ urban_rural_5 cate \ pr
> escribed_biologics cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat c
> ate) clear
 11.         append using `tempfile'
 12.         save `tempfile', replace
 13.         if `j'==2 {
 14.             export delimited using ./output/tables/characteristics_strata`
> i'.csv
 15.         }
 16.         restore
 17.         }
 18.     }
(4,495 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                          404   101 |
  |--------------------------------------------|
  | male                             505     0 |
  |--------------------------------------------|
  | Rural Urban in five categories   505     0 |
  |--------------------------------------------|
  | prescribed_biologics             505     0 |
  |--------------------------------------------|
  | imd                              505     0 |
  |--------------------------------------------|
  | smoking                          505     0 |
  |--------------------------------------------|
  | time_ra                          209   296 |
  |--------------------------------------------|
  | bmi_cat                          505     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=505       
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 127 (31.4%) 
>         |
  |                                  41 - 60 years                 147 (36.4%) 
>         |
  |                                  61 - 80 years                 100 (24.8%) 
>         |
  |                                  >80 years                     30 ( 7.4%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        276 (54.7%) 
>         |
  |                                  Male                          229 (45.3%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       50 ( 9.9%)  
>         |
  |                                  Urban minor conurbation       72 (14.3%)  
>         |
  |                                  Urban city and town           127 (25.1%) 
>         |
  |                                  Rural town and fringe         136 (26.9%) 
>         |
  |                                  Rural village and dispersed   120 (23.8%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             243 (48.1%) 
>         |
  |                                  1                             262 (51.9%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             21 ( 4.2%)  
>         |
  |                                  1                             80 (15.8%)  
>         |
  |                                  2                             103 (20.4%) 
>         |
  |                                  3                             95 (18.8%)  
>         |
  |                                  4                             101 (20.0%) 
>         |
  |                                  5                             105 (20.8%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  57 (11.3%)  
>         |
  |                                  Current smoker                104 (20.6%) 
>         |
  |                                  Ex-smoker                     79 (15.6%)  
>         |
  |                                  Unknown                       265 (52.5%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        52.56253 (32
> .24387) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       119 (23.6%) 
>         |
  |                                  Underweight                   46 ( 9.1%)  
>         |
  |                                  Healthy range                 75 (14.9%)  
>         |
  |                                  Overweight                    101 (20.0%) 
>         |
  |                                  Obese                         131 (25.9%) 
>         |
  |                                  Morbidly obese                33 ( 6.5%)  
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
(note: file /tmp/St00011.000003 not found)
file /tmp/St00011.000003 saved
(4,973 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                           25     2 |
  |--------------------------------------------|
  | male                              27     0 |
  |--------------------------------------------|
  | Rural Urban in five categories    27     0 |
  |--------------------------------------------|
  | prescribed_biologics              27     0 |
  |--------------------------------------------|
  | imd                               27     0 |
  |--------------------------------------------|
  | smoking                           27     0 |
  |--------------------------------------------|
  | time_ra                           12    15 |
  |--------------------------------------------|
  | bmi_cat                           27     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=27        
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 5 (20%)     
>         |
  |                                  41 - 60 years                 14 (56%)    
>         |
  |                                  61 - 80 years                 5 (20%)     
>         |
  |                                  >80 years                     1 ( 4%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        16 (59%)    
>         |
  |                                  Male                          11 (41%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       2 ( 7%)     
>         |
  |                                  Urban minor conurbation       2 ( 7%)     
>         |
  |                                  Urban city and town           6 (22%)     
>         |
  |                                  Rural town and fringe         10 (37%)    
>         |
  |                                  Rural village and dispersed   7 (26%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             14 (52%)    
>         |
  |                                  1                             13 (48%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              1                             3 (11%)     
>         |
  |                                  2                             10 (37%)    
>         |
  |                                  3                             8 (30%)     
>         |
  |                                  4                             5 (19%)     
>         |
  |                                  5                             1 ( 4%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  3 (11%)     
>         |
  |                                  Current smoker                3 (11%)     
>         |
  |                                  Ex-smoker                     4 (15%)     
>         |
  |                                  Unknown                       17 (63%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        61.61237 (33
> .01248) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       4 (15%)     
>         |
  |                                  Underweight                   5 (19%)     
>         |
  |                                  Healthy range                 4 (15%)     
>         |
  |                                  Overweight                    8 (30%)     
>         |
  |                                  Obese                         6 (22%)     
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000003 saved
(675 observations deleted)

  +------------------------------------------------+
  | factor                             N_1     m_1 |
  |------------------------------------------------|
  | age_cat                          3,348     977 |
  |------------------------------------------------|
  | male                             4,325       0 |
  |------------------------------------------------|
  | Rural Urban in five categories   4,325       0 |
  |------------------------------------------------|
  | prescribed_biologics             4,325       0 |
  |------------------------------------------------|
  | imd                              4,325       0 |
  |------------------------------------------------|
  | smoking                          4,325       0 |
  |------------------------------------------------|
  | time_ra                          1,919   2,406 |
  |------------------------------------------------|
  | bmi_cat                          4,324       1 |
  +------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=4,325     
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 1,169 (34.9%
> )       |
  |                                  41 - 60 years                 1,144 (34.2%
> )       |
  |                                  61 - 80 years                 808 (24.1%) 
>         |
  |                                  >80 years                     227 ( 6.8%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        2,248 (52.0%
> )       |
  |                                  Male                          2,077 (48.0%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       521 (12.0%) 
>         |
  |                                  Urban minor conurbation       576 (13.3%) 
>         |
  |                                  Urban city and town           1,115 (25.8%
> )       |
  |                                  Rural town and fringe         1,018 (23.5%
> )       |
  |                                  Rural village and dispersed   1,095 (25.3%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             2,154 (49.8%
> )       |
  |                                  1                             2,171 (50.2%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             214 ( 4.9%) 
>         |
  |                                  1                             800 (18.5%) 
>         |
  |                                  2                             865 (20.0%) 
>         |
  |                                  3                             823 (19.0%) 
>         |
  |                                  4                             834 (19.3%) 
>         |
  |                                  5                             789 (18.2%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  414 ( 9.6%) 
>         |
  |                                  Current smoker                866 (20.0%) 
>         |
  |                                  Ex-smoker                     655 (15.1%) 
>         |
  |                                  Unknown                       2,390 (55.3%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        53.82906 (32
> .09182) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       855 (19.8%) 
>         |
  |                                  Underweight                   392 ( 9.1%) 
>         |
  |                                  Healthy range                 841 (19.4%) 
>         |
  |                                  Overweight                    820 (19.0%) 
>         |
  |                                  Obese                         1,186 (27.4%
> )       |
  |                                  Morbidly obese                230 ( 5.3%) 
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000003 saved
file ./output/tables/characteristics_strata2019.csv saved
(4,681 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                          246    73 |
  |--------------------------------------------|
  | male                             319     0 |
  |--------------------------------------------|
  | Rural Urban in five categories   319     0 |
  |--------------------------------------------|
  | prescribed_biologics             319     0 |
  |--------------------------------------------|
  | imd                              319     0 |
  |--------------------------------------------|
  | smoking                          319     0 |
  |--------------------------------------------|
  | time_ra                          131   188 |
  |--------------------------------------------|
  | bmi_cat                          319     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=319       
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 87 (35.4%)  
>         |
  |                                  41 - 60 years                 83 (33.7%)  
>         |
  |                                  61 - 80 years                 61 (24.8%)  
>         |
  |                                  >80 years                     15 ( 6.1%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        162 (50.8%) 
>         |
  |                                  Male                          157 (49.2%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       42 (13.2%)  
>         |
  |                                  Urban minor conurbation       42 (13.2%)  
>         |
  |                                  Urban city and town           78 (24.5%)  
>         |
  |                                  Rural town and fringe         75 (23.5%)  
>         |
  |                                  Rural village and dispersed   82 (25.7%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             157 (49.2%) 
>         |
  |                                  1                             162 (50.8%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             16 ( 5.0%)  
>         |
  |                                  1                             65 (20.4%)  
>         |
  |                                  2                             54 (16.9%)  
>         |
  |                                  3                             65 (20.4%)  
>         |
  |                                  4                             56 (17.6%)  
>         |
  |                                  5                             63 (19.7%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  26 ( 8.2%)  
>         |
  |                                  Current smoker                74 (23.2%)  
>         |
  |                                  Ex-smoker                     40 (12.5%)  
>         |
  |                                  Unknown                       179 (56.1%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        55.44154 (32
> .58146) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       59 (18.5%)  
>         |
  |                                  Underweight                   30 ( 9.4%)  
>         |
  |                                  Healthy range                 62 (19.4%)  
>         |
  |                                  Overweight                    59 (18.5%)  
>         |
  |                                  Obese                         92 (28.8%)  
>         |
  |                                  Morbidly obese                17 ( 5.3%)  
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000003 saved
(4,983 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                           16     1 |
  |--------------------------------------------|
  | male                              17     0 |
  |--------------------------------------------|
  | Rural Urban in five categories    17     0 |
  |--------------------------------------------|
  | prescribed_biologics              17     0 |
  |--------------------------------------------|
  | imd                               17     0 |
  |--------------------------------------------|
  | smoking                           17     0 |
  |--------------------------------------------|
  | time_ra                            6    11 |
  |--------------------------------------------|
  | bmi_cat                           17     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=17        
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 7 (44%)     
>         |
  |                                  41 - 60 years                 5 (31%)     
>         |
  |                                  61 - 80 years                 3 (19%)     
>         |
  |                                  >80 years                     1 ( 6%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        7 (41%)     
>         |
  |                                  Male                          10 (59%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       1 ( 6%)     
>         |
  |                                  Urban minor conurbation       3 (18%)     
>         |
  |                                  Urban city and town           3 (18%)     
>         |
  |                                  Rural town and fringe         3 (18%)     
>         |
  |                                  Rural village and dispersed   7 (41%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             7 (41%)     
>         |
  |                                  1                             10 (59%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              1                             3 (18%)     
>         |
  |                                  2                             3 (18%)     
>         |
  |                                  3                             6 (35%)     
>         |
  |                                  4                             1 ( 6%)     
>         |
  |                                  5                             4 (24%)     
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Current smoker                3 (18%)     
>         |
  |                                  Ex-smoker                     3 (18%)     
>         |
  |                                  Unknown                       11 (65%)    
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        56.56765 (21
> .93948) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       3 (18%)     
>         |
  |                                  Underweight                   2 (12%)     
>         |
  |                                  Healthy range                 4 (24%)     
>         |
  |                                  Overweight                    3 (18%)     
>         |
  |                                  Obese                         2 (12%)     
>         |
  |                                  Morbidly obese                3 (18%)     
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000003 saved
(2,110 observations deleted)

  +------------------------------------------------+
  | factor                             N_1     m_1 |
  |------------------------------------------------|
  | age_cat                          2,236     654 |
  |------------------------------------------------|
  | male                             2,890       0 |
  |------------------------------------------------|
  | Rural Urban in five categories   2,890       0 |
  |------------------------------------------------|
  | prescribed_biologics             2,890       0 |
  |------------------------------------------------|
  | imd                              2,890       0 |
  |------------------------------------------------|
  | smoking                          2,890       0 |
  |------------------------------------------------|
  | time_ra                          1,303   1,587 |
  |------------------------------------------------|
  | bmi_cat                          2,889       1 |
  +------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=2,890     
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 745 (33.3%) 
>         |
  |                                  41 - 60 years                 781 (34.9%) 
>         |
  |                                  61 - 80 years                 551 (24.6%) 
>         |
  |                                  >80 years                     159 ( 7.1%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        1,510 (52.2%
> )       |
  |                                  Male                          1,380 (47.8%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       329 (11.4%) 
>         |
  |                                  Urban minor conurbation       404 (14.0%) 
>         |
  |                                  Urban city and town           737 (25.5%) 
>         |
  |                                  Rural town and fringe         681 (23.6%) 
>         |
  |                                  Rural village and dispersed   739 (25.6%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             1,442 (49.9%
> )       |
  |                                  1                             1,448 (50.1%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             128 ( 4.4%) 
>         |
  |                                  1                             524 (18.1%) 
>         |
  |                                  2                             605 (20.9%) 
>         |
  |                                  3                             555 (19.2%) 
>         |
  |                                  4                             557 (19.3%) 
>         |
  |                                  5                             521 (18.0%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  278 ( 9.6%) 
>         |
  |                                  Current smoker                565 (19.6%) 
>         |
  |                                  Ex-smoker                     431 (14.9%) 
>         |
  |                                  Unknown                       1,616 (55.9%
> )       |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        53.84351 (32
> .38185) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       584 (20.2%) 
>         |
  |                                  Underweight                   272 ( 9.4%) 
>         |
  |                                  Healthy range                 540 (18.7%) 
>         |
  |                                  Overweight                    557 (19.3%) 
>         |
  |                                  Obese                         783 (27.1%) 
>         |
  |                                  Morbidly obese                153 ( 5.3%) 
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000003 saved
file ./output/tables/characteristics_strata2020.csv saved
(4,821 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                          131    48 |
  |--------------------------------------------|
  | male                             179     0 |
  |--------------------------------------------|
  | Rural Urban in five categories   179     0 |
  |--------------------------------------------|
  | prescribed_biologics             179     0 |
  |--------------------------------------------|
  | imd                              179     0 |
  |--------------------------------------------|
  | smoking                          179     0 |
  |--------------------------------------------|
  | time_ra                           77   102 |
  |--------------------------------------------|
  | bmi_cat                          179     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> -------+
  |                                                                Total       
>        |
  |----------------------------------------------------------------------------
> -------|
  |                                                                N=179       
>        |
  |----------------------------------------------------------------------------
> -------|
  | age_cat                          18 - 40 years                 38 (29.0%)  
>        |
  |                                  41 - 60 years                 50 (38.2%)  
>        |
  |                                  61 - 80 years                 36 (27.5%)  
>        |
  |                                  >80 years                     7 ( 5.3%)   
>        |
  |----------------------------------------------------------------------------
> -------|
  | male                             Female                        89 (49.7%)  
>        |
  |                                  Male                          90 (50.3%)  
>        |
  |----------------------------------------------------------------------------
> -------|
  | Rural Urban in five categories   Urban major conurbation       20 (11.2%)  
>        |
  |                                  Urban minor conurbation       22 (12.3%)  
>        |
  |                                  Urban city and town           45 (25.1%)  
>        |
  |                                  Rural town and fringe         40 (22.3%)  
>        |
  |                                  Rural village and dispersed   52 (29.1%)  
>        |
  |----------------------------------------------------------------------------
> -------|
  | prescribed_biologics             0                             89 (49.7%)  
>        |
  |                                  1                             90 (50.3%)  
>        |
  |----------------------------------------------------------------------------
> -------|
  | imd                              0                             9 ( 5.0%)   
>        |
  |                                  1                             37 (20.7%)  
>        |
  |                                  2                             44 (24.6%)  
>        |
  |                                  3                             35 (19.6%)  
>        |
  |                                  4                             22 (12.3%)  
>        |
  |                                  5                             32 (17.9%)  
>        |
  |----------------------------------------------------------------------------
> -------|
  | smoking                          Never smoked                  22 (12.3%)  
>        |
  |                                  Current smoker                34 (19.0%)  
>        |
  |                                  Ex-smoker                     20 (11.2%)  
>        |
  |                                  Unknown                       103 (57.5%) 
>        |
  |----------------------------------------------------------------------------
> -------|
  | time_ra                                                        54.67118 (31
> .2279) |
  |----------------------------------------------------------------------------
> -------|
  | bmi_cat                          Missing                       33 (18.4%)  
>        |
  |                                  Underweight                   9 ( 5.0%)   
>        |
  |                                  Healthy range                 28 (15.6%)  
>        |
  |                                  Overweight                    43 (24.0%)  
>        |
  |                                  Obese                         52 (29.1%)  
>        |
  |                                  Morbidly obese                14 ( 7.8%)  
>        |
  +----------------------------------------------------------------------------
> -------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000003 saved
(4,990 observations deleted)

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | age_cat                            7     3 |
  |--------------------------------------------|
  | male                              10     0 |
  |--------------------------------------------|
  | Rural Urban in five categories    10     0 |
  |--------------------------------------------|
  | prescribed_biologics              10     0 |
  |--------------------------------------------|
  | imd                               10     0 |
  |--------------------------------------------|
  | smoking                           10     0 |
  |--------------------------------------------|
  | time_ra                            5     5 |
  |--------------------------------------------|
  | bmi_cat                           10     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> ------+
  |                                                                Total       
>       |
  |----------------------------------------------------------------------------
> ------|
  |                                                                N=10        
>       |
  |----------------------------------------------------------------------------
> ------|
  | age_cat                          18 - 40 years                 2 (29%)     
>       |
  |                                  41 - 60 years                 3 (43%)     
>       |
  |                                  61 - 80 years                 1 (14%)     
>       |
  |                                  >80 years                     1 (14%)     
>       |
  |----------------------------------------------------------------------------
> ------|
  | male                             Female                        4 (40%)     
>       |
  |                                  Male                          6 (60%)     
>       |
  |----------------------------------------------------------------------------
> ------|
  | Rural Urban in five categories   Urban major conurbation       2 (20%)     
>       |
  |                                  Urban minor conurbation       1 (10%)     
>       |
  |                                  Urban city and town           1 (10%)     
>       |
  |                                  Rural town and fringe         1 (10%)     
>       |
  |                                  Rural village and dispersed   5 (50%)     
>       |
  |----------------------------------------------------------------------------
> ------|
  | prescribed_biologics             0                             3 (30%)     
>       |
  |                                  1                             7 (70%)     
>       |
  |----------------------------------------------------------------------------
> ------|
  | imd                              1                             2 (20%)     
>       |
  |                                  2                             2 (20%)     
>       |
  |                                  3                             2 (20%)     
>       |
  |                                  4                             2 (20%)     
>       |
  |                                  5                             2 (20%)     
>       |
  |----------------------------------------------------------------------------
> ------|
  | smoking                          Never smoked                  1 (10%)     
>       |
  |                                  Current smoker                2 (20%)     
>       |
  |                                  Ex-smoker                     4 (40%)     
>       |
  |                                  Unknown                       3 (30%)     
>       |
  |----------------------------------------------------------------------------
> ------|
  | time_ra                                                        49.38809 (24
> .252) |
  |----------------------------------------------------------------------------
> ------|
  | bmi_cat                          Underweight                   1 (10%)     
>       |
  |                                  Overweight                    4 (40%)     
>       |
  |                                  Obese                         5 (50%)     
>       |
  +----------------------------------------------------------------------------
> ------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
(note: variable Total was str17, now str18 to accommodate using data's
       values)
file /tmp/St00011.000003 saved
(3,267 observations deleted)

  +----------------------------------------------+
  | factor                             N_1   m_1 |
  |----------------------------------------------|
  | age_cat                          1,346   387 |
  |----------------------------------------------|
  | male                             1,733     0 |
  |----------------------------------------------|
  | Rural Urban in five categories   1,733     0 |
  |----------------------------------------------|
  | prescribed_biologics             1,733     0 |
  |----------------------------------------------|
  | imd                              1,733     0 |
  |----------------------------------------------|
  | smoking                          1,733     0 |
  |----------------------------------------------|
  | time_ra                            758   975 |
  |----------------------------------------------|
  | bmi_cat                          1,732     1 |
  +----------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------+
  |                                                                Total       
>         |
  |----------------------------------------------------------------------------
> --------|
  |                                                                N=1,733     
>         |
  |----------------------------------------------------------------------------
> --------|
  | age_cat                          18 - 40 years                 429 (31.9%) 
>         |
  |                                  41 - 60 years                 493 (36.6%) 
>         |
  |                                  61 - 80 years                 326 (24.2%) 
>         |
  |                                  >80 years                     98 ( 7.3%)  
>         |
  |----------------------------------------------------------------------------
> --------|
  | male                             Female                        916 (52.9%) 
>         |
  |                                  Male                          817 (47.1%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | Rural Urban in five categories   Urban major conurbation       198 (11.4%) 
>         |
  |                                  Urban minor conurbation       248 (14.3%) 
>         |
  |                                  Urban city and town           447 (25.8%) 
>         |
  |                                  Rural town and fringe         425 (24.5%) 
>         |
  |                                  Rural village and dispersed   415 (23.9%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | prescribed_biologics             0                             858 (49.5%) 
>         |
  |                                  1                             875 (50.5%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | imd                              0                             81 ( 4.7%)  
>         |
  |                                  1                             307 (17.7%) 
>         |
  |                                  2                             357 (20.6%) 
>         |
  |                                  3                             334 (19.3%) 
>         |
  |                                  4                             341 (19.7%) 
>         |
  |                                  5                             313 (18.1%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | smoking                          Never smoked                  156 ( 9.0%) 
>         |
  |                                  Current smoker                350 (20.2%) 
>         |
  |                                  Ex-smoker                     245 (14.1%) 
>         |
  |                                  Unknown                       982 (56.7%) 
>         |
  |----------------------------------------------------------------------------
> --------|
  | time_ra                                                        54.41402 (32
> .45798) |
  |----------------------------------------------------------------------------
> --------|
  | bmi_cat                          Missing                       339 (19.6%) 
>         |
  |                                  Underweight                   162 ( 9.4%) 
>         |
  |                                  Healthy range                 336 (19.4%) 
>         |
  |                                  Overweight                    323 (18.6%) 
>         |
  |                                  Obese                         475 (27.4%) 
>         |
  |                                  Morbidly obese                97 ( 5.6%)  
>         |
  +----------------------------------------------------------------------------
> --------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 
file /tmp/St00011.000003 saved
file ./output/tables/characteristics_strata2021.csv saved

.     /* Tabulate characteristics by whether hospitalised with RA for each year
>     preserve
>     keep if ra_hosp_`i'==1
>     table1_mc, vars(age_cat cate \ male cate \ urban_rural_5 cate \ prescribe
> d_biologics cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat cate) cl
> ear
>     export delimited using ./output/tables/characteristics_ra_hosp_`i'.csv
>     restore
>     }
> preserve
>     keep if ra_hosp_2018==1
>     table1_mc, vars(age_cat cate \ male cate \ urban_rural_5 cate \ prescribe
> d_biologics cate \ imd cate \ smoking cate \ time_ra contn \ bmi_cat cate) cl
> ear
>     export delimited using ./output/tables/characteristics_ra_hosp_2018.csv
>     restore
>     */
. log close
      name:  <unnamed>
       log:  /workspace/logs/outpatients.log
  log type:  text
 closed on:   8 Dec 2022, 17:08:59
-------------------------------------------------------------------------------
